
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если РегламентированнаяОтчетность.КонтекстЭДОЛокальный() <> Неопределено Тогда
		РегламентированнаяОтчетность.КонтекстЭДОЛокальный().ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, , , Замещение);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если РегламентированнаяОтчетность.КонтекстЭДОЛокальный() <> Неопределено Тогда
		РегламентированнаяОтчетность.КонтекстЭДОЛокальный().ПриЗаписиОбъекта(ЭтотОбъект, Отказ, Замещение);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры
