
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаДанных Из ЭтотОбъект Цикл
		Если (СтрокаДанных.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогАкт Или СтрокаДанных.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.НалогСам)
			И СтрокаДанных.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			// месяц не меняем
		Иначе	
			СтрокаДанных.МесяцРасчетногоПериода = НачалоГода(СтрокаДанных.МесяцРасчетногоПериода);
		КонецЕсли;
		Если СтрокаДанных.ПФРСПревышения <> 0 Тогда
			СтрокаДанных.ПФРПоСуммарномуТарифу = СтрокаДанных.ПФРПоСуммарномуТарифу + СтрокаДанных.ПФРСПревышения;
			СтрокаДанных.ПФРСПревышения = 0;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
