
Процедура ОформитьСтрокиСписка(Элемент, ОформленияСтрок, мДатаНачалаРеформыСоцСтрахования) Экспорт

	Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
		
		ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
		
		ОформлениеСтроки.Ячейки.ПодпадаетПодЕНВД.ТолькоПросмотр = НЕ ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете);
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете) Тогда
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучете.Текст = "<способом отражения по умолчанию>";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСтроки.Период) и ДанныеСтроки.Период < мДатаНачалаРеформыСоцСтрахования Тогда
			Если Не ЗначениеЗаполнено(ДанныеСтроки.СпособОтраженияВБухучете) Тогда
				ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.Текст = "<способом отражения по умолчанию>";
			КонецЕсли;	
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.ТолькоПросмотр = Ложь;
		Иначе
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.Текст = "<не используется с 2011 года>";
			ОформлениеСтроки.Ячейки.СпособОтраженияВБухучетеБольничногоЗаСчетРаботодателя.ТолькоПросмотр = Истина;
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры
