////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы 

#Если ТолстыйКлиентОбычноеПриложение Тогда
	
Процедура ОткрытьФормуОтбора(Форма, ОбработкаОбъект) Экспорт
	
	ПроцедурыУправленияПерсоналом.ОткрытьФормуОтбораСпискаРаботников(Форма, ОбщегоНазначенияЗК.ПолучитьРабочуюДату(), "Работники");
	
КонецПроцедуры
	
Процедура ПриОткрытииФормыДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

#КонецЕсли