Перем ОшибкаЗаполнения Экспорт;

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

Процедура ОбработкаЗаполнения(СообщениеОснование)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если КонтекстЭДО <> Неопределено Тогда
		КонтекстЭДО.ОбработкаЗаполненияОбъекта(ЭтотОбъект, СообщениеОснование);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если КонтекстЭДО <> Неопределено Тогда
		КонтекстЭДО.ПриЗаписиОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если КонтекстЭДО <> Неопределено Тогда
		
		ЭлементыОтбора = Новый Структура;
		ЭлементыОтбора.Вставить("ОснованиеСсылка", ОбъектКопирования.Требование);	
			
		КонтекстЭДО.ОбработкаЗаполненияОбъекта(ЭтотОбъект, ЭлементыОтбора);
		
	КонецЕсли;
	#КонецЕсли

КонецПроцедуры

#КонецЕсли


