Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю
Перем ДатаНачалаНП, ДатаКонцаНП;
Перем  УчитыватьОбособленноеПодразделение Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	ЗначениеПанелипользователя = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ЭтотОбъект);
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если ЗначениеПараметра <> Неопределено Тогда
		ДатаНачалаНП =  Дата(ЗначениеПараметра.Значение);
	КонецЕсли;
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если ЗначениеПараметра <> Неопределено Тогда
		ДатаКонцаНП = Дата(ЗначениеПараметра.Значение);
	КонецЕсли;
	
	Если ДатаНачалаНП = '00010101'  тогда
		ДатаНачалаНП = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если ДатаКонцаНП = '00010101' тогда
		ДатаКонцаНП = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
	Если ЗначениеПанелипользователя <> Неопределено тогда
		УчитыватьОбособленноеПодразделение = ЗначениеПанелипользователя.ГруппироватьПоОрганизации;
	КонецЕсли;
	
	Группировка = ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроек, "");
	Группировка.ПоляГруппировки.Элементы.Очистить();
	
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "Организация");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ГоловнаяОрганизация");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ФизЛицо");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка 
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		
		ТаблицаЗначений =  Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда 
			Вопрос("Отчет не сформирован!" + Символы.ПС + ТиповыеОтчеты.ПолучитьОписаниеРодительскойПричиныИнформацииОбОшибке(ИнформацияОбОшибке()), РежимДиалогаВопрос.ОК);
		#КонецЕсли
		Возврат Результат;
	КонецПопытки;
	
	СформироватьМакет(Результат, ТаблицаЗначений);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	Возврат Результат;
	
КонецФункции

// Заполняет табличный документ
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//
Процедура СформироватьМакет(ДокументРезультат, ФизЛицаОрганизаций) Экспорт
	
	ДокументРезультат.Очистить();
	
	// Расчет вычисляемых параметров
	
	// Создание запроса и установка всех необходимых параметров
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	
	РасчетСтраховыхВзносов.ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("ТаблицаФизЛицОрганизаций", ФизЛицаОрганизаций);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ДатаНачалаНП));
	Запрос.УстановитьПараметр("КонецПериода", КонецГода(ДатаКонцаНП));
	Запрос.УстановитьПараметр("ДатаСтрахованияВременноПребывающих", ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов());
	Запрос.УстановитьПараметр("ДатаСтрахованияВсехВременноПребывающих", РасчетСтраховыхВзносов.ДатаСтрахованияВсехВременноПребывающих());
	Запрос.УстановитьПараметр("ДатаВыделенияВзносовНаОПСсСуммПревышения", РасчетСтраховыхВзносов.ДатаВыделенияВзносовНаОПСсСуммПревышенияПредельнойВеличины());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизЛиц.ФизЛицо КАК ФизЛицо,
	|	ТаблицаФизЛиц.Организация КАК ОбособленноеПодразделение,
	|	ТаблицаФизЛиц.ГоловнаяОрганизация КАК Организация
	|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
	|ИЗ
	|	&ТаблицаФизЛицОрганизаций КАК ТаблицаФизЛиц
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Организация";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних.РазмерФСС / 1000 КАК ПревышениеФСС,
	|	ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних.РазмерПФР / 1000 КАК ПревышениеОПС
	|ИЗ
	|	РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.СрезПоследних(&КонецПериода, ) КАК ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних";
	ВыборкаПревышения = Запрос.Выполнить().Выбрать();
	ВыборкаПревышения.Следующий();
	
	Если НачалоГода(ДатаНачалаНП) < РасчетСтраховыхВзносов.ДатаПередачиАдминистрированияВзносовФНС() И Год(ДатаНачалаНП) >= РасчетСтраховыхВзносов.ГодРазделенияПредельныхОблагаемыхБаз() Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизЛицаОрганизаций.ФизЛицо,
		|	ФизЛицаОрганизаций.Организация,
		|	ФизЛицаОрганизаций.ОбособленноеПодразделение,
		|	""Трудовой"" КАК ВидДоговора,
		|	СотрудникиОрганизаций.НомерДоговора,
		|	СотрудникиОрганизаций.ДатаДоговора,
		|	СотрудникиОрганизаций.ДатаПриемаНаРаботу,
		|	СотрудникиОрганизаций.ДатаУвольнения,
		|	СотрудникиОрганизаций.Ссылка КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций
		|		ПО СотрудникиОрганизаций.Физлицо = ФизЛицаОрганизаций.ФизЛицо
		|			И СотрудникиОрганизаций.Организация = ФизЛицаОрганизаций.Организация
		|ГДЕ
		|	СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
		|	И СотрудникиОрганизаций.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
		|	И СотрудникиОрганизаций.ДатаПриемаНаРаботу <= &КонецПериода
		|	И (СотрудникиОрганизаций.ДатаУвольнения >= &НачалоПериода
		|			ИЛИ СотрудникиОрганизаций.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаботникиОрганизацииСрезПоследних.Сотрудник,
		|	ВЫБОР
		|		КОГДА &НачалоПериода >= РаботникиОрганизацииСрезПоследних.ПериодЗавершения
		|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
		|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
		|	КОНЕЦ КАК Организация,
		|	&НачалоПериода КАК ДатаС
		|ПОМЕСТИТЬ ВТДатыДвижений
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&НачалоПериода,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					Сотрудники.Сотрудник
		|				ИЗ
		|					ВТСотрудники КАК Сотрудники)) КАК РаботникиОрганизацииСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РаботникиОрганизации.Сотрудник,
		|	РаботникиОрганизации.ОбособленноеПодразделение,
		|	РаботникиОрганизации.Период
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
		|ГДЕ
		|	РаботникиОрганизации.Сотрудник В
		|			(ВЫБРАТЬ
		|				Сотрудники.Сотрудник
		|			ИЗ
		|				ВТСотрудники КАК Сотрудники)
		|	И РаботникиОрганизации.Период > &НачалоПериода
		|	И РаботникиОрганизации.Период < &КонецПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Работники.Сотрудник,
		|	Работники.ОбособленноеПодразделениеЗавершения,
		|	Работники.ПериодЗавершения
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций КАК Работники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
		|		ПО Работники.Период >= ПериодыПерекрытия.ПериодЗавершения
		|			И Работники.Период < ПериодыПерекрытия.Период
		|			И Работники.Сотрудник = ПериодыПерекрытия.Сотрудник
		|ГДЕ
		|	Работники.Сотрудник В
		|			(ВЫБРАТЬ
		|				Сотрудники.Сотрудник
		|			ИЗ
		|				ВТСотрудники КАК Сотрудники)
		|	И Работники.ПериодЗавершения > &НачалоПериода
		|	И Работники.ПериодЗавершения < &КонецПериода
		|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыДвижений.Сотрудник,
		|	ДатыДвижений.Организация,
		|	ДатыДвижений.ДатаС,
		|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(ДатыЗавершения.ДатаС), ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаПо
		|ПОМЕСТИТЬ ВТПериодыРаботы
		|ИЗ
		|	ВТДатыДвижений КАК ДатыДвижений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыДвижений КАК ДатыЗавершения
		|		ПО ДатыДвижений.Сотрудник = ДатыЗавершения.Сотрудник
		|			И ДатыДвижений.ДатаС < ДатыЗавершения.ДатаС
		|
		|СГРУППИРОВАТЬ ПО
		|	ДатыДвижений.Сотрудник,
		|	ДатыДвижений.ДатаС,
		|	ДатыДвижений.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыРаботы.Сотрудник
		|ПОМЕСТИТЬ ВТПеремещавшиесяСотрудники
		|ИЗ
		|	ВТПериодыРаботы КАК ПериодыРаботы
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыРаботы.Сотрудник
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПериодыРаботы.Организация) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизаций.ФизЛицо,
		|	СотрудникиОрганизаций.Организация КАК ГоловнаяОрганизация,
		|	СотрудникиОрганизаций.ВидДоговора,
		|	СотрудникиОрганизаций.НомерДоговора,
		|	СотрудникиОрганизаций.ДатаДоговора КАК ДатаЗаключенияДоговора,
		|	СотрудникиОрганизаций.ДатаПриемаНаРаботу КАК ПериодС,
		|	СотрудникиОрганизаций.ДатаУвольнения КАК ПериодПо,
		|	СотрудникиОрганизаций.ОбособленноеПодразделение КАК Организация
		|ПОМЕСТИТЬ ВТДоговоры
		|ИЗ
		|	ВТСотрудники КАК СотрудникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПеремещавшиесяСотрудники КАК ПеремещавшиесяСотрудники
		|		ПО СотрудникиОрганизаций.Сотрудник = ПеремещавшиесяСотрудники.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботы КАК ПериодыРаботы
		|		ПО СотрудникиОрганизаций.Сотрудник = ПериодыРаботы.Сотрудник
		|			И СотрудникиОрганизаций.ОбособленноеПодразделение = ПериодыРаботы.Организация
		|ГДЕ
		|	ПеремещавшиесяСотрудники.Сотрудник ЕСТЬ NULL 
		|	И ПериодыРаботы.Сотрудник ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СотрудникиОрганизаций.ФизЛицо,
		|	СотрудникиОрганизаций.Организация,
		|	СотрудникиОрганизаций.ВидДоговора,
		|	СотрудникиОрганизаций.НомерДоговора,
		|	СотрудникиОрганизаций.ДатаДоговора,
		|	ПериодыРаботы.ДатаС,
		|	ПериодыРаботы.ДатаПо,
		|	СотрудникиОрганизаций.ОбособленноеПодразделение
		|ИЗ
		|	ВТСотрудники КАК СотрудникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПеремещавшиесяСотрудники КАК ПеремещавшиесяСотрудники
		|		ПО СотрудникиОрганизаций.Сотрудник = ПеремещавшиесяСотрудники.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботы КАК ПериодыРаботы
		|		ПО СотрудникиОрганизаций.Сотрудник = ПериодыРаботы.Сотрудник
		|			И СотрудникиОрганизаций.ОбособленноеПодразделение = ПериодыРаботы.Организация
		|ГДЕ
		|	ПеремещавшиесяСотрудники.Сотрудник ЕСТЬ НЕ NULL 
		|	И ПериодыРаботы.Сотрудник ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизЛицаОрганизаций.ФизЛицо,
		|	ФизЛицаОрганизаций.Организация,
		|	ВЫБОР
		|		КОГДА ДоговорНаВыполнениеРаботСФизЛицом.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.Авторский)
		|			ТОГДА ""Авторский""
		|		ИНАЧЕ ""Гражданско-правовой""
		|	КОНЕЦ,
		|	ДоговорНаВыполнениеРаботСФизЛицом.Номер,
		|	ДоговорНаВыполнениеРаботСФизЛицом.Дата,
		|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала,
		|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания,
		|	ФизЛицаОрганизаций.ОбособленноеПодразделение
		|ИЗ
		|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛицаОрганизаций КАК ФизЛицаОрганизаций
		|		ПО ДоговорНаВыполнениеРаботСФизЛицом.Организация = ФизЛицаОрганизаций.ОбособленноеПодразделение
		|			И ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо = ФизЛицаОрганизаций.ФизЛицо
		|ГДЕ
		|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &КонецПериода
		|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &НачалоПериода
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизаций.ФизЛицо,
		|	СотрудникиОрганизаций.Организация,
		|	СотрудникиОрганизаций.ВидДоговора,
		|	СотрудникиОрганизаций.НомерДоговора,
		|	СотрудникиОрганизаций.ДатаДоговора,
		|	СотрудникиОрганизаций.ДатаПриемаНаРаботу,
		|	СотрудникиОрганизаций.ДатаУвольнения,
		|	СотрудникиОрганизаций.ОбособленноеПодразделение
		|ИЗ
		|	ВТСотрудники КАК СотрудникиОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботы КАК ПериодыРаботы
		|		ПО СотрудникиОрганизаций.Сотрудник = ПериодыРаботы.Сотрудник
		|			И СотрудникиОрганизаций.ОбособленноеПодразделение = ПериодыРаботы.Организация
		|ГДЕ
		|	ПериодыРаботы.Сотрудник ЕСТЬ NULL ";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизЛицо,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ПустаяСсылка) КАК ВидДоговора,
		|	"""" КАК НомерДоговора,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаЗаключенияДоговора,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодС,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодПо,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация
		|ПОМЕСТИТЬ ВТДоговоры";
	КонецЕсли;
	Запрос.Выполнить();
	
	//-----------------------------------------------------------------------------
	// ВЫБОРКА СВЕДЕНИЙ О ФИЗЛИЦЕ 
	// 	
	
	// ДанныеОПравеНаПенсию
	// Таблица Таблица Данные о праве на пенсию: - таблица это список иностранцев и периодов
	// Поля:
	//		Физлицо, 
	//		Месяц - месяц налогового периода
	// 
	// Описание:
	//	Выбираем Из Списка периодов
	//	Внутреннее соединение с ГражданствоФизЛиц.СрезПоследних
	//  по равенству периодов
	//  условие: что физлицо - не имеет права на пенсию
	//
	
	// УчетнаяПолитикаНалоговыйУчет
	// Таблица УчетнаяПолитикаНалоговыйУчетУСН - это список периодов, когда организация переходила на УСН
	// поля:
	//		УСН, 
	//		Месяц - месяц налогового периода
	
	// ДоходыПоМесяцамКодамТекст
	// Таблица доходов ЕСН по Месяцам налогового периода и кодам дохода
	// Поля:
	//		Месяц
	//		ФизЛицо
	//		КодДоходаЕСН
	//		Результат
	//		Скидка
	// Описание:
	// 	Выбираем зарегистрированные доходы из ЕСНСведенияОДоходах 	
	//  Запрос выполняется для списка обособленных подразделений.
	
	// ПоказателиДоходовПоМесяцам
	// Описание:
	//  Вычисляет показатели отчета, основанные на сведениях о доходах
	
	// ПоказателиДоходовНарастающимИтогом
	// Описание:
	//  Вычисляет показатели отчета, основанные на сведениях о доходах - нарастающим итогом
	
	// ПоказателиНалогПоМесяцам
	// Описание:
	//	Вычисляет показатели отчета, основанные на сведениях о налогах.
	//  Из по ЕСН автоматически отнимается налог, приходящийся  на налоговую льготу инвалидов.
	
	// ПоказателиНалоговНарастающимИтогом
	// Описание:
	//  Вычисляет показатели отчета, основанные на сведениях о налогах - нарастающим итогом
	
	//ДанныеРасчетаТекст
	// Описание: объединяет показатели доходов и налогов и рассчитывает колонку 29						   
	
	ДтНачМесяца = НачалоМесяца(ДатаНачалаНП);
	ТекстПериодов = "ВЫБРАТЬ
	|	ДАТАВРЕМЯ("+Формат(ДтНачМесяца, "ДФ=yyyy")+", "+Месяц(ДтНачМесяца)+", 1) КАК Период
	|ПОМЕСТИТЬ ВТПериоды";
	ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	
	Пока ДтНачМесяца <= ДатаКонцаНП Цикл
		ТекстПериодов =  ТекстПериодов + "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ("+Формат(ДтНачМесяца, "ДФ=yyyy")+", "+Месяц(ДтНачМесяца)+", 1) КАК Период
		|";
		ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	КонецЦИкла;
	ТекстПериодов = ТекстПериодов + ";";
	
	ДанныеРасчетаТекст = ТекстПериодов + 
    "ВЫБРАТЬ
    |	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
    |	ФИОФизЛицСрезПоследних.Фамилия,
    |	ФИОФизЛицСрезПоследних.Имя,
    |	ФИОФизЛицСрезПоследних.Отчество
    |ПОМЕСТИТЬ ВТФИОФизлиц
    |ИЗ
    |	РегистрСведений.ФИОФизЛиц.СрезПоследних(
    |			&КонецПериода,
    |			ФизЛицо В
    |				(ВЫБРАТЬ
    |					Организации.ФизЛицо
    |				ИЗ
    |					ВТФизЛицаОрганизаций КАК Организации)) КАК ФИОФизЛицСрезПоследних
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СрезПоследнихДат.ПериодРегистрации КАК ПериодРегистрации,
    |	СрезПоследнихДат.Физлицо КАК Физлицо,
    |	СведенияОбИнвалидностиФизлиц.Инвалидность,
    |	СведенияОбИнвалидностиФизлиц.ДатаВыдачи,
    |	СведенияОбИнвалидностиФизлиц.СрокДействияСправки
    |ПОМЕСТИТЬ ВТИнвалиды
    |ИЗ
    |	(ВЫБРАТЬ
    |		ВТПериоды.Период КАК ПериодРегистрации,
    |		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
    |		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
    |	ИЗ
    |		ВТПериоды КАК ВТПериоды
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
    |			ПО (КОНЕЦПЕРИОДА(ВТПериоды.Период, МЕСЯЦ) >= СведенияОбИнвалидностиФизлиц.Период)
    |	ГДЕ
    |		СведенияОбИнвалидностиФизлиц.Физлицо В
    |				(ВЫБРАТЬ
    |					Организации.ФизЛицо
    |				ИЗ
    |					ВТФизЛицаОрганизаций КАК Организации)
    |	
    |	СГРУППИРОВАТЬ ПО
    |		СведенияОбИнвалидностиФизлиц.Физлицо,
    |		ВТПериоды.Период) КАК СрезПоследнихДат
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
    |		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
    |			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Физлицо,
    |	ПериодРегистрации
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Инвалиды.Физлицо КАК Физлицо,
    |	Инвалиды.Инвалидность,
    |	ГОД(Инвалиды.ПериодРегистрации) КАК РасчетныйПериод,
    |	МАКСИМУМ(Инвалиды.ДатаВыдачи) КАК ДатаВыдачи,
    |	МАКСИМУМ(Инвалиды.СрокДействияСправки) КАК СрокДействияСправки
    |ПОМЕСТИТЬ ВТСправкиОбИнвалидности
    |ИЗ
    |	ВТИнвалиды КАК Инвалиды
    |ГДЕ
    |	Инвалиды.Инвалидность
    |
    |СГРУППИРОВАТЬ ПО
    |	Инвалиды.Физлицо,
    |	Инвалиды.Инвалидность,
    |	ГОД(Инвалиды.ПериодРегистрации)
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Физлицо,
    |	РасчетныйПериод
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Периоды.Период КАК ПериодРегистрации,
    |	Периоды.Физлицо КАК Физлицо,
    |	Периоды.Организация,
    |	ЕСТЬNULL(ВЫБОР
    |			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
    |					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
    |				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
    |			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
    |		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
    |ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
    |ИЗ
    |	(ВЫБРАТЬ
    |		Периоды.Период КАК Период,
    |		СписокСотрудников.ФизЛицо КАК Физлицо,
    |		СписокСотрудников.Организация КАК Организация,
    |		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
    |	ИЗ
    |		ВТПериоды КАК Периоды
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаОрганизаций КАК СписокСотрудников
    |			ПО (ИСТИНА)
    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
    |			ПО Периоды.Период >= ВременноПребывающие.Период
    |				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
    |				И (СписокСотрудников.Организация = ВременноПребывающие.Организация)
    |	ГДЕ
    |		Периоды.Период МЕЖДУ &ДатаСтрахованияВременноПребывающих И &ДатаСтрахованияВсехВременноПребывающих
    |	
    |	СГРУППИРОВАТЬ ПО
    |		Периоды.Период,
    |		СписокСотрудников.ФизЛицо,
    |		СписокСотрудников.Организация) КАК Периоды
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
    |		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
    |			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
    |			И Периоды.Организация = ВременноПребывающие.Организация
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Физлицо
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СрезПоследнихДат.ПериодРегистрации КАК ПериодРегистрации,
    |	СрезПоследнихДат.Физлицо КАК Физлицо,
    |	ГражданствоФизЛиц.Страна,
    |	ВЫБОР
    |		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК НеИмеетПравоНаСтрахованиеФОМС,
    |	ВЫБОР
    |		КОГДА СрезПоследнихДат.ПериодРегистрации < &ДатаСтрахованияВсехВременноПребывающих
    |			ТОГДА ГражданствоФизЛиц.НеИмеетПравоНаПенсию
    |		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК НеИмеетПравоНаСтрахованиеПФР,
    |	ВЫБОР
    |		КОГДА СрезПоследнихДат.ПериодРегистрации < &ДатаСтрахованияВсехВременноПребывающих
    |			ТОГДА ГражданствоФизЛиц.НеИмеетПравоНаПенсию
    |		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК НеИмеетПравоНаСтрахованиеФСС,
    |	ГражданствоФизЛиц.ВидЗастрахованногоЛица
    |ПОМЕСТИТЬ ВТГражданство
    |ИЗ
    |	(ВЫБРАТЬ
    |		ВТПериоды.Период КАК ПериодРегистрации,
    |		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
    |		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
    |	ИЗ
    |		ВТПериоды КАК ВТПериоды
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
    |			ПО (КОНЕЦПЕРИОДА(ВТПериоды.Период, МЕСЯЦ) >= ГражданствоФизЛиц.Период)
    |	ГДЕ
    |		ГражданствоФизЛиц.ФизЛицо В
    |				(ВЫБРАТЬ
    |					Организации.ФизЛицо
    |				ИЗ
    |					ВТФизЛицаОрганизаций КАК Организации)
    |	
    |	СГРУППИРОВАТЬ ПО
    |		ГражданствоФизЛиц.ФизЛицо,
    |		ВТПериоды.Период) КАК СрезПоследнихДат
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
    |		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
    |			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Физлицо,
    |	ПериодРегистрации
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
    |	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница КАК Организация
    |ПОМЕСТИТЬ ВТОтветственные
    |ИЗ
    |	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
    |			&КонецПериода,
    |			ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
    |				И СтруктурнаяЕдиница В
    |					(ВЫБРАТЬ
    |						Организации.Организация
    |					ИЗ
    |						ВТФизЛицаОрганизаций КАК Организации)) КАК ОтветственныеЛицаОрганизацийСрезПоследних
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Организация
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
    |	"""" + ВЫБОР
    |		КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
    |			ТОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
    |		ИНАЧЕ """"
    |	КОНЕЦ + ВЫБОР
    |		КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
    |			ТОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "". ""
    |		ИНАЧЕ """"
    |	КОНЕЦ + ФИОФизЛицСрезПоследних.Фамилия КАК ФИО
    |ПОМЕСТИТЬ ВТФИООтветственных
    |ИЗ
    |	РегистрСведений.ФИОФизЛиц.СрезПоследних(
    |			&КонецПериода,
    |			ФизЛицо В
    |				(ВЫБРАТЬ
    |					Ответственные.ФизическоеЛицо
    |				ИЗ
    |					ВТОтветственные КАК Ответственные)) КАК ФИОФизЛицСрезПоследних
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
    |	СтраховыеВзносыСведенияОДоходах.Организация,
    |	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
    |	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
    |	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
    |	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
    |	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
    |	СтраховыеВзносыСведенияОДоходах.Результат,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
    |	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда
    |ПОМЕСТИТЬ ВТОблагаемыеВзносамиПособия
    |ИЗ
    |	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
    |ГДЕ
    |	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &КонецПериода
    |	И (СтраховыеВзносыСведенияОДоходах.ФизЛицо, СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение) В
    |			(ВЫБРАТЬ
    |				Организации.ФизЛицо,
    |				Организации.ОбособленноеПодразделение
    |			ИЗ
    |				ВТФизЛицаОрганизаций КАК Организации)
    |	И СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом)
    |	И СтраховыеВзносыСведенияОДоходах.ВидРасчета.ВидПособияСоциальногоСтрахования <> ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПустаяСсылка)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
    |	СтраховыеВзносыСведенияОДоходах.Организация,
    |	СтраховыеВзносыСведенияОДоходах.ВидДохода,
    |	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
    |	СтраховыеВзносыСведенияОДоходах.Период,
    |	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
    |	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
    |	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
    |	СУММА(СтраховыеВзносыСведенияОДоходах.РезультатОборот) КАК РезультатОборот,
    |	СУММА(СтраховыеВзносыСведенияОДоходах.СкидкаОборот) КАК СкидкаОборот,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
    |	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
    |	СтраховыеВзносыСведенияОДоходах.СтрокиРегистра
    |ПОМЕСТИТЬ ВТСведенияОДоходах
    |ИЗ
    |	(ВЫБРАТЬ
    |		СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |		СтраховыеВзносыСведенияОДоходах.Организация КАК Организация,
    |		СтраховыеВзносыСведенияОДоходах.ВидДохода КАК ВидДохода,
    |		СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
    |		НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
    |		СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
    |		СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
    |		СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ КАК ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
    |		СтраховыеВзносыСведенияОДоходах.Результат КАК РезультатОборот,
    |		СтраховыеВзносыСведенияОДоходах.Скидка КАК СкидкаОборот,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам КАК ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу КАК ОблагаетсяПоДополнительномуТарифу,
    |		СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
    |		ИСТИНА КАК СтрокиРегистра
    |	ИЗ
    |		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
    |	ГДЕ
    |		СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &КонецПериода
    |		И (СтраховыеВзносыСведенияОДоходах.ФизЛицо, СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение) В
    |				(ВЫБРАТЬ
    |					Организации.ФизЛицо,
    |					Организации.ОбособленноеПодразделение
    |				ИЗ
    |					ВТФизЛицаОрганизаций КАК Организации)
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		СтраховыеВзносыСведенияОДоходах.ФизЛицо,
    |		СтраховыеВзносыСведенияОДоходах.Организация,
    |		ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС),
    |		СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
    |		СтраховыеВзносыСведенияОДоходах.Период,
    |		СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
    |		СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
    |		СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
    |		СтраховыеВзносыСведенияОДоходах.Результат,
    |		0,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
    |		СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
    |		ЛОЖЬ
    |	ИЗ
    |		ВТОблагаемыеВзносамиПособия КАК СтраховыеВзносыСведенияОДоходах
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		СтраховыеВзносыСведенияОДоходах.ФизЛицо,
    |		СтраховыеВзносыСведенияОДоходах.Организация,
    |		ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом),
    |		СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
    |		СтраховыеВзносыСведенияОДоходах.Период,
    |		СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
    |		СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
    |		СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
    |		-СтраховыеВзносыСведенияОДоходах.Результат,
    |		0,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
    |		СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
    |		СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
    |		ЛОЖЬ
    |	ИЗ
    |		ВТОблагаемыеВзносамиПособия КАК СтраховыеВзносыСведенияОДоходах) КАК СтраховыеВзносыСведенияОДоходах
    |
    |СГРУППИРОВАТЬ ПО
    |	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
    |	СтраховыеВзносыСведенияОДоходах.Организация,
    |	СтраховыеВзносыСведенияОДоходах.ВидДохода,
    |	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
    |	СтраховыеВзносыСведенияОДоходах.Период,
    |	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
    |	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
    |	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
    |	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
    |	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
    |	СтраховыеВзносыСведенияОДоходах.СтрокиРегистра
    |
    |ИМЕЮЩИЕ
    |	(СУММА(СтраховыеВзносыСведенияОДоходах.РезультатОборот) <> 0
    |		ИЛИ СУММА(СтраховыеВзносыСведенияОДоходах.СкидкаОборот) <> 0)
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	СтраховыеВзносыСведенияОДоходах.Период,
    |	СтраховыеВзносыСведенияОДоходах.ФизЛицо
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВЫБОР
    |		КОГДА СУММА(ВЫБОР
    |						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ) > 0
    |				И СУММА(ВЫБОР
    |						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ) = 0
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ТолькоЕНВД,
    |	СведенияОДоходах.Период КАК Период,
    |	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение
    |ПОМЕСТИТЬ ВТВидыДеятельности
    |ИЗ
    |	ВТСведенияОДоходах КАК СведенияОДоходах
    |ГДЕ
    |	СведенияОДоходах.СтрокиРегистра
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.Период,
    |	СведенияОДоходах.ОбособленноеПодразделение
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Период,
    |	ОбособленноеПодразделение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Организации.ОбособленноеПодразделение,
    |	Периоды.Период КАК Период,
    |	ВЫБОР
    |		КОГДА ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
    |				И ВидыДеятельности.ТолькоЕНВД
    |				И ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
    |		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
    |	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
    |ИЗ
    |	ВТФизЛицаОрганизаций КАК Организации
    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
    |			Периоды.Период КАК Период,
    |			Организации.Организация КАК Организация,
    |			МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
    |		ИЗ
    |			ВТПериоды КАК Периоды
    |				ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаОрганизаций КАК Организации
    |				ПО (ИСТИНА)
    |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
    |				ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
    |					И (УчетнаяПолитикаНалоговыйУчет.Организация = Организации.Организация)
    |		
    |		СГРУППИРОВАТЬ ПО
    |			Периоды.Период,
    |			Организации.Организация) КАК Периоды
    |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
    |			ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
    |				И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
    |		ПО (Периоды.Организация = Организации.Организация)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
    |		ПО Организации.ОбособленноеПодразделение = ВидыДеятельности.ОбособленноеПодразделение
    |			И (Периоды.Период = ВидыДеятельности.Период)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
    |		ПО (ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ОписаниеТарифов.ВидТарифа)
    |			И (ГОД(Периоды.Период) = ОписаниеТарифов.РасчетныйПериод)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ТарифСтраховыхВзносов.ПФР,
    |	ТарифСтраховыхВзносов.ПФРНакопительная,
    |	ТарифСтраховыхВзносов.ФСС,
    |	ТарифСтраховыхВзносов.ФФОМС,
    |	ТарифСтраховыхВзносов.ТФОМС,
    |	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
    |	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа,
    |	ГОД(ДатыПоследнихДвижений.ПериодРегистрации) КАК РасчетныйПериод,
    |	ДатыПоследнихДвижений.ПериодРегистрации
    |ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
    |ИЗ
    |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
    |		ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа,
    |		КОНЕЦПЕРИОДА(Месяцы.Период, ГОД) КАК ПериодРегистрации,
    |		МАКСИМУМ(ТарифСтраховыхВзносов.Период) КАК Период
    |	ИЗ
    |		ВТПериоды КАК Месяцы
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифСтраховыхВзносов КАК ТарифСтраховыхВзносов
    |			ПО (КОНЕЦПЕРИОДА(Месяцы.Период, ГОД) >= ТарифСтраховыхВзносов.Период)
    |	
    |	СГРУППИРОВАТЬ ПО
    |		ТарифСтраховыхВзносов.ВидТарифа,
    |		Месяцы.Период) КАК ДатыПоследнихДвижений
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифСтраховыхВзносов КАК ТарифСтраховыхВзносов
    |		ПО ДатыПоследнихДвижений.ВидТарифа = ТарифСтраховыхВзносов.ВидТарифа
    |			И ДатыПоследнихДвижений.Период = ТарифСтраховыхВзносов.Период
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ВидТарифа,
    |	РасчетныйПериод
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	ТарифСтраховыхВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	ТарифСтраховыхВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	ГОД(ДатыПоследнихДвижений.ПериодРегистрации) КАК РасчетныйПериод
    |ПОМЕСТИТЬ ВТРазмерыТарифныхСтавокНаРаботахСДосрочнойПенсией
    |ИЗ
    |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
    |		КОНЕЦПЕРИОДА(Месяцы.Период, ГОД) КАК ПериодРегистрации,
    |		МАКСИМУМ(ТарифСтраховыхВзносов.Период) КАК Период
    |	ИЗ
    |		ВТПериоды КАК Месяцы
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифСтраховыхВзносов
    |			ПО (КОНЕЦПЕРИОДА(Месяцы.Период, ГОД) >= ТарифСтраховыхВзносов.Период)
    |	
    |	СГРУППИРОВАТЬ ПО
    |		Месяцы.Период) КАК ДатыПоследнихДвижений
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифСтраховыхВзносов
    |		ПО ДатыПоследнихДвижений.Период = ТарифСтраховыхВзносов.Период
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	РасчетныйПериод
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	СтраховыеВзносыСведенияОДоходах.Организация КАК Организация,
    |	СтраховыеВзносыСведенияОДоходах.Организация КАК ГоловнаяОрганизация,
    |	СтраховыеВзносыСведенияОДоходах.ВидДохода КАК ВидДохода,
    |	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
    |	СтраховыеВзносыСведенияОДоходах.РезультатОборот КАК Результат,
    |	СтраховыеВзносыСведенияОДоходах.СкидкаОборот КАК Скидка,
    |	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
    |	ВЫБОР
    |		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
    |				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
    |		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
    |				И ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
    |				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ПустаяСсылка)
    |			ТОГДА СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
    |		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
    |				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
    |	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
    |	ВЫБОР
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |				ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |				ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |				ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК НеОблагаетсяЦеликом,
    |	ВЫБОР
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДоговорыГПХ)
    |				ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДоговорыГПХОблагаемыеФСС_НС)
    |				ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДоходыСтудентовЗаРаботуВСтудотрядеПоГражданскоПравовомуДоговору)
    |			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ДоговорГПХ,
    |	ВЫБОР
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС
    |			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ОблагаемаяБазаФСС,
    |	ВЫБОР
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС
    |			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ОблагаемаяБазаФОМС,
    |	ВЫБОР
    |		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
    |		ИНАЧЕ 0
    |	КОНЕЦ КАК ОблагаемаяБазаПФР,
    |	СтраховыеВзносыСведенияОДоходах.СтрокиРегистра
    |ПОМЕСТИТЬ ВТДоходыВзносов
    |ИЗ
    |	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
    |		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.ПериодРегистрации
    |			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
    |		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
    |			И СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = ВидыТарифныхСтавок.ОбособленноеПодразделение
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
    |		ПО (ВЫБОР
    |				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
    |					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
    |				КОГДА СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ПустаяСсылка)
    |					ТОГДА СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф
    |				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
    |					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
    |				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
    |			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
    |			И (ГОД(СтраховыеВзносыСведенияОДоходах.Период) = ОписаниеТарифов.РасчетныйПериод)
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	ВидДохода,
    |	Организация,
    |	ОбособленноеПодразделение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерФСС,
    |	ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерФОМС,
    |	ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерПФР,
    |	ДатыПоследнихДвижений.ПериодРегистрации КАК ПериодРегистрации
    |ПОМЕСТИТЬ ВТПредельнаяВеличина
    |ИЗ
    |	(ВЫБРАТЬ
    |		МАКСИМУМ(ПредельнаяВеличинаБазыСтраховыхВзносов.Период) КАК Период,
    |		ВТПериоды.Период КАК ПериодРегистрации
    |	ИЗ
    |		ВТПериоды КАК ВТПериоды
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
    |			ПО ВТПериоды.Период >= ПредельнаяВеличинаБазыСтраховыхВзносов.Период
    |	
    |	СГРУППИРОВАТЬ ПО
    |		ВТПериоды.Период) КАК ДатыПоследнихДвижений
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
    |		ПО ДатыПоследнихДвижений.Период = ПредельнаяВеличинаБазыСтраховыхВзносов.Период
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ПериодРегистрации
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СведенияОДоходах.Организация,
    |	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаГод,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
    |					И СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаМесяц,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаГодФОМС,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
    |					И СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаМесяцФОМС,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФСС, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуФСС
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаГодФСС,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФСС, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
    |					И СведенияОДоходах.ВидДохода.ВходитВБазуФСС
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаМесяцФСС
    |ПОМЕСТИТЬ ВТБазаНарастающимИтогом
    |ИЗ
    |	ВТПериоды КАК Периоды
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |			ПО СведенияОДоходах.Период = Гражданство.ПериодРегистрации
    |				И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
    |			ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
    |				И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
    |				И СведенияОДоходах.Организация = ПринятыеПоДолгосрочнымДоговорам.Организация
    |		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.ФизЛицо,
    |	Периоды.Период,
    |	СведенияОДоходах.Организация
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	Период,
    |	ФизЛицо
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ОблагаемаяБаза.Организация,
    |	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
    |	ОблагаемаяБаза.Период КАК Период,
    |	ВЫБОР
    |		КОГДА Предел.РазмерПФР = 0
    |			ТОГДА 0
    |		ИНАЧЕ ВЫБОР
    |				КОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР >= 0
    |					ТОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР
    |				ИНАЧЕ 0
    |			КОНЕЦ - ВЫБОР
    |				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР >= 0
    |					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР
    |				ИНАЧЕ 0
    |			КОНЕЦ
    |	КОНЕЦ КАК СуммаПревысившаяПредел,
    |	ВЫБОР
    |		КОГДА Предел.РазмерФОМС = 0
    |			ТОГДА 0
    |		ИНАЧЕ ВЫБОР
    |				КОГДА ОблагаемаяБаза.ЗаГодФОМС - Предел.РазмерФОМС >= 0
    |					ТОГДА ОблагаемаяБаза.ЗаГодФОМС - Предел.РазмерФОМС
    |				ИНАЧЕ 0
    |			КОНЕЦ - ВЫБОР
    |				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - Предел.РазмерФОМС >= 0
    |					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - Предел.РазмерФОМС
    |				ИНАЧЕ 0
    |			КОНЕЦ
    |	КОНЕЦ КАК СуммаПревысившаяПределФОМС,
    |	ВЫБОР
    |		КОГДА Предел.РазмерФСС = 0
    |			ТОГДА 0
    |		ИНАЧЕ ВЫБОР
    |				КОГДА ОблагаемаяБаза.ЗаГодФСС - Предел.РазмерФСС >= 0
    |					ТОГДА ОблагаемаяБаза.ЗаГодФСС - Предел.РазмерФСС
    |				ИНАЧЕ 0
    |			КОНЕЦ - ВЫБОР
    |				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - Предел.РазмерФСС >= 0
    |					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - Предел.РазмерФСС
    |				ИНАЧЕ 0
    |			КОНЕЦ
    |	КОНЕЦ КАК СуммаПревысившаяПределФСС
    |ПОМЕСТИТЬ ВТБазаПревышенияДохода
    |ИЗ
    |	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
    |		ПО ОблагаемаяБаза.Период = Предел.ПериодРегистрации
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
    |		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
    |			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
    |			И ОблагаемаяБаза.Организация = ОблагаемаяБазаПрошлогоМесяца.Организация
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СведенияОДоходах.Организация,
    |	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	СведенияОДоходах.ПериодРегистрации КАК Период,
    |	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
    |	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.Результат - СведенияОДоходах.Скидка
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаМесяц,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
    |				ТОГДА СведенияОДоходах.Результат - СведенияОДоходах.Скидка
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаМесяцФОМС,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФСС, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуФСС
    |				ТОГДА СведенияОДоходах.Результат - СведенияОДоходах.Скидка
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ЗаМесяцФСС
    |ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
    |ИЗ
    |	ВТДоходыВзносов КАК СведенияОДоходах
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |		ПО СведенияОДоходах.ПериодРегистрации = Гражданство.ПериодРегистрации
    |			И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
    |		ПО СведенияОДоходах.ПериодРегистрации = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
    |			И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
    |			И СведенияОДоходах.Организация = ПринятыеПоДолгосрочнымДоговорам.Организация
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.ФизЛицо,
    |	СведенияОДоходах.ОбособленноеПодразделение,
    |	СведенияОДоходах.ПериодРегистрации,
    |	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
    |	СведенияОДоходах.Организация
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СведенияОДоходах.Организация,
    |	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	СведенияОДоходах.Период КАК Период,
    |	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
    |	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФОМС) КАК ЗаМесяцФОМС,
    |	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
    |ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
    |ИЗ
    |	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.Организация,
    |	СведенияОДоходах.ФизЛицо,
    |	СведенияОДоходах.Период
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	ЗаМесяц
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СведенияОДоходах.Организация,
    |	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	СведенияОДоходах.Период КАК Период,
    |	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
    |	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
    |ИЗ
    |	(ВЫБРАТЬ
    |		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |		СведенияОДоходах.Период КАК Период,
    |		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
    |		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение,
    |		СведенияОДоходах.Организация КАК Организация
    |	ИЗ
    |		ВТМаксБазаЗаМесяц КАК СведенияОДоходах
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
    |				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
    |				И СведенияОДоходах.Организация = БазаЗаМесяцПоОбособленным.Организация
    |	
    |	СГРУППИРОВАТЬ ПО
    |		СведенияОДоходах.ФизЛицо,
    |		СведенияОДоходах.Период,
    |		СведенияОДоходах.ЗаМесяц,
    |		СведенияОДоходах.Организация) КАК СведенияОДоходах
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
    |			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
    |			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.ФизЛицо,
    |	СведенияОДоходах.Период,
    |	СведенияОДоходах.ОбособленноеПодразделение,
    |	СведенияОДоходах.Организация
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	ОбособленноеПодразделение,
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ОблагаемаяБаза.Организация,
    |	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
    |	ОблагаемаяБаза.Период КАК Период,
    |	ВЫБОР
    |		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
    |				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
    |			ТОГДА 0
    |		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
    |	КОНЕЦ КАК СуммаПревысившаяПредел,
    |	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
    |	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
    |ИЗ
    |	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
    |		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
    |			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
    |			И ОблагаемаяБаза.Организация = ПревышениеДоходаПоВсемОП.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
    |			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
    |				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
    |				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
    |				И БазаЗаМесяцПоОбособленным.Организация = ОбособленноеПодразделениеДляОкругления.Организация
    |		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
    |			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |			И ОблагаемаяБаза.Организация = БазаЗаМесяцПоОбособленным.Организация
    |ГДЕ
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Превышение.ФизЛицо КАК ФизЛицо,
    |	Превышение.Период КАК Период,
    |	Превышение.СуммаПревысившаяПредел,
    |	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
    |	Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
    |ПОМЕСТИТЬ ВТПревышениеДохода
    |ИЗ
    |	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
    |
    |ОБЪЕДИНИТЬ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Превышение.ФизЛицо,
    |	Превышение.Период,
    |	СУММА(Превышение.СуммаПревысившаяПредел),
    |	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |ИЗ
    |	(ВЫБРАТЬ
    |		Превышение.Организация КАК Организация,
    |		Превышение.ФизЛицо КАК ФизЛицо,
    |		Превышение.Период КАК Период,
    |		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
    |	ИЗ
    |		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		Превышение.Организация,
    |		Превышение.ФизЛицо,
    |		Превышение.Период,
    |		Превышение.СуммаПревысившаяПредел
    |	ИЗ
    |		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
    |		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
    |			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
    |			И Превышение.Организация = ОбособленноеПодразделениеДляОкругления.Организация
    |
    |СГРУППИРОВАТЬ ПО
    |	Превышение.ФизЛицо,
    |	Превышение.Период,
    |	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	ОбособленноеПодразделение,
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СведенияОДоходах.Организация,
    |	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	СведенияОДоходах.Период КАК Период,
    |	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
    |	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФОМС
    |ИЗ
    |	(ВЫБРАТЬ
    |		СведенияОДоходах.Организация КАК Организация,
    |		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |		СведенияОДоходах.Период КАК Период,
    |		СведенияОДоходах.ЗаМесяцФОМС КАК ЗаМесяцФОМС,
    |		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
    |	ИЗ
    |		ВТМаксБазаЗаМесяц КАК СведенияОДоходах
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
    |				И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
    |				И СведенияОДоходах.Организация = БазаЗаМесяцПоОбособленным.Организация
    |	
    |	СГРУППИРОВАТЬ ПО
    |		СведенияОДоходах.ФизЛицо,
    |		СведенияОДоходах.Период,
    |		СведенияОДоходах.ЗаМесяцФОМС,
    |		СведенияОДоходах.Организация) КАК СведенияОДоходах
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
    |			И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
    |			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.ФизЛицо,
    |	СведенияОДоходах.Период,
    |	СведенияОДоходах.ОбособленноеПодразделение,
    |	СведенияОДоходах.Организация
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	ОбособленноеПодразделение,
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ОблагаемаяБаза.Организация,
    |	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
    |	ОблагаемаяБаза.Период КАК Период,
    |	ВЫБОР
    |		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС = 0
    |				ИЛИ ОблагаемаяБаза.ЗаМесяцФОМС = 0
    |			ТОГДА 0
    |		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
    |	КОНЕЦ КАК СуммаПревысившаяПредел,
    |	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
    |	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС
    |ИЗ
    |	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
    |		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
    |			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
    |			И ОблагаемаяБаза.Организация = ПревышениеДоходаПоВсемОП.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
    |			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
    |				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
    |				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
    |				И БазаЗаМесяцПоОбособленным.Организация = ОбособленноеПодразделениеДляОкругления.Организация
    |		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
    |			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |			И ОблагаемаяБаза.Организация = БазаЗаМесяцПоОбособленным.Организация
    |ГДЕ
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Превышение.ФизЛицо КАК ФизЛицо,
    |	Превышение.Период КАК Период,
    |	Превышение.СуммаПревысившаяПредел,
    |	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
    |	Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
    |ПОМЕСТИТЬ ВТПревышениеДоходаФОМС
    |ИЗ
    |	ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
    |
    |ОБЪЕДИНИТЬ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Превышение.ФизЛицо,
    |	Превышение.Период,
    |	СУММА(Превышение.СуммаПревысившаяПредел),
    |	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |ИЗ
    |	(ВЫБРАТЬ
    |		Превышение.Организация КАК Организация,
    |		Превышение.ФизЛицо КАК ФизЛицо,
    |		Превышение.Период КАК Период,
    |		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
    |	ИЗ
    |		ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		Превышение.Организация,
    |		Превышение.ФизЛицо,
    |		Превышение.Период,
    |		Превышение.СуммаПревысившаяПределФОМС
    |	ИЗ
    |		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
    |		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
    |			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
    |			И Превышение.Организация = ОбособленноеПодразделениеДляОкругления.Организация
    |
    |СГРУППИРОВАТЬ ПО
    |	Превышение.ФизЛицо,
    |	Превышение.Период,
    |	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	ОбособленноеПодразделение,
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СведенияОДоходах.Организация,
    |	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	СведенияОДоходах.Период КАК Период,
    |	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
    |	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
    |ИЗ
    |	(ВЫБРАТЬ
    |		СведенияОДоходах.Организация КАК Организация,
    |		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |		СведенияОДоходах.Период КАК Период,
    |		СведенияОДоходах.ЗаМесяцФСС КАК ЗаМесяцФСС,
    |		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
    |	ИЗ
    |		ВТМаксБазаЗаМесяц КАК СведенияОДоходах
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
    |				И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
    |				И СведенияОДоходах.Организация = БазаЗаМесяцПоОбособленным.Организация
    |	
    |	СГРУППИРОВАТЬ ПО
    |		СведенияОДоходах.ФизЛицо,
    |		СведенияОДоходах.Период,
    |		СведенияОДоходах.ЗаМесяцФСС,
    |		СведенияОДоходах.Организация) КАК СведенияОДоходах
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
    |			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
    |			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.ФизЛицо,
    |	СведенияОДоходах.Период,
    |	СведенияОДоходах.ОбособленноеПодразделение,
    |	СведенияОДоходах.Организация
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	ОбособленноеПодразделение,
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ОблагаемаяБаза.Организация,
    |	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
    |	ОблагаемаяБаза.Период КАК Период,
    |	ВЫБОР
    |		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
    |				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
    |			ТОГДА 0
    |		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
    |	КОНЕЦ КАК СуммаПревысившаяПредел,
    |	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
    |	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
    |ИЗ
    |	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
    |		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
    |			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
    |			И ОблагаемаяБаза.Организация = ПревышениеДоходаПоВсемОП.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
    |			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
    |				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
    |				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
    |				И БазаЗаМесяцПоОбособленным.Организация = ОбособленноеПодразделениеДляОкругления.Организация
    |		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
    |			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
    |			И ОблагаемаяБаза.Организация = БазаЗаМесяцПоОбособленным.Организация
    |ГДЕ
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Превышение.ФизЛицо КАК ФизЛицо,
    |	Превышение.Период КАК Период,
    |	Превышение.СуммаПревысившаяПредел,
    |	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
    |	Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
    |ПОМЕСТИТЬ ВТПревышениеДоходаФСС
    |ИЗ
    |	ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
    |
    |ОБЪЕДИНИТЬ
    |
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Превышение.ФизЛицо,
    |	Превышение.Период,
    |	СУММА(Превышение.СуммаПревысившаяПредел),
    |	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |ИЗ
    |	(ВЫБРАТЬ
    |		Превышение.Организация КАК Организация,
    |		Превышение.ФизЛицо КАК ФизЛицо,
    |		Превышение.Период КАК Период,
    |		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
    |	ИЗ
    |		ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		Превышение.Организация,
    |		Превышение.ФизЛицо,
    |		Превышение.Период,
    |		Превышение.СуммаПревысившаяПределФСС
    |	ИЗ
    |		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
    |		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
    |			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
    |			И Превышение.Организация = ОбособленноеПодразделениеДляОкругления.Организация
    |
    |СГРУППИРОВАТЬ ПО
    |	Превышение.ФизЛицо,
    |	Превышение.Период,
    |	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
    |	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	ОбособленноеПодразделение,
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ФизЛица.ФизЛицо КАК ФизЛицо,
    |	ФизЛица.ФизЛицо.ИНН КАК ФизЛицоИНН,
    |	ФизЛица.ФизЛицо.Наименование КАК ФизЛицоНаименование,
    |	ФизЛица.ФизЛицо.СтраховойНомерПФР КАК ФизЛицоСтраховойНомерПФР,
    |	ФизЛица.ФизЛицо.ДатаРождения КАК ФизЛицоДатаРождения,
    |	ФизЛица.ОбособленноеПодразделение КАК Организация,
    |	ФизЛица.ОбособленноеПодразделение.ИНН КАК ОрганизацияИНН,
    |	ФизЛица.ОбособленноеПодразделение.КПП КАК ОрганизацияКПП,
    |	ФизЛица.ОбособленноеПодразделение.НаименованиеСокращенное КАК ОрганизацияНаименование,
    |	ФизЛица.Организация КАК ГоловнаяОрганизация,
    |	ФизЛица.Организация.ИНН КАК ГоловнаяОрганизацияИНН,
    |	ФизЛица.Организация.КПП КАК ГоловнаяОрганизацияКПП,
    |	ФизЛица.Организация.НаименованиеСокращенное КАК ГоловнаяОрганизацияНаименование,
    |	Периоды.Период КАК Период,
    |	ТарифыСтраховыхВзносов.Ссылка КАК ВидТарифа
    |ПОМЕСТИТЬ ВТПериодыФизлицаСтавки
    |ИЗ
    |	ВТФизЛицаОрганизаций КАК ФизЛица,
    |	ВТПериоды КАК Периоды,
    |	Перечисление.ТарифыСтраховыхВзносов КАК ТарифыСтраховыхВзносов
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	Период,
    |	Организация,
    |	ВидТарифа
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ДоходыВзносов.ФизЛицо КАК ФизЛицо,
    |	ДоходыВзносов.Организация КАК ГоловнаяОрганизация,
    |	ДоходыВзносов.ОбособленноеПодразделение КАК Организация,
    |	ДоходыВзносов.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
    |	ДоходыВзносов.ПериодРегистрации КАК ПериодРегистрации,
    |	СУММА(ДоходыВзносов.Скидка) КАК Скидка,
    |	СУММА(ВЫБОР
    |			КОГДА ДоходыВзносов.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА ДоходыВзносов.Результат
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсего,
    |	СУММА(ВЫБОР
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА ДоходыВзносов.Результат
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА ДоходыВзносов.Скидка
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА ДоходыВзносов.Скидка
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА ДоходыВзносов.Скидка
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА ДоходыВзносов.Скидка
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагается,
    |	СУММА(ВЫБОР
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |				ТОГДА ДоходыВзносов.Результат
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК Пособие,
    |	СУММА(ВЫБОР
    |			КОГДА ДоходыВзносов.ВидДохода.ВходитВБазуФОМС
    |					И НЕ ДоходыВзносов.ВидДохода.ВходитВБазуПФР
    |				ТОГДА ДоходыВзносов.Результат - ДоходыВзносов.Скидка
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ВыплатыПрокуроров,
    |	СУММА(ВЫБОР
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА ДоходыВзносов.Результат
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДоговорыГПХ)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДоговорыГПХОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДоходыСтудентовЗаРаботуВСтудотрядеПоГражданскоПравовомуДоговору)
    |				ТОГДА ДоходыВзносов.Результат
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК ВыплатыПоДоговорам,
    |	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) - МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК НалоговаяБазаПФР,
    |	СУММА(ДоходыВзносов.ОблагаемаяБазаФСС) - МАКСИМУМ(ПревышениеДоходаФСС.СуммаПревысившаяПредел) КАК НалоговаяБазаФСС,
    |	СУММА(ДоходыВзносов.ОблагаемаяБазаФОМС) - МАКСИМУМ(ПревышениеДоходаФОМС.СуммаПревысившаяПредел) КАК НалоговаяБазаФОМС,
    |	СУММА(ВЫБОР
    |			КОГДА ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ ДоходыВзносов.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА ДоходыВзносов.Скидка
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторским,
    |	МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК ПревышениеДоходаПФР
    |ПОМЕСТИТЬ ВТБазаДляОтчета
    |ИЗ
    |	ВТДоходыВзносов КАК ДоходыВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
    |		ПО ДоходыВзносов.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
    |			И ДоходыВзносов.ОбособленноеПодразделение = ПревышениеДоходаПФР.ОбособленноеПодразделение
    |			И ДоходыВзносов.ПериодРегистрации = ПревышениеДоходаПФР.Период
    |			И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФОМС КАК ПревышениеДоходаФОМС
    |		ПО ДоходыВзносов.ФизЛицо = ПревышениеДоходаФОМС.ФизЛицо
    |			И ДоходыВзносов.ОбособленноеПодразделение = ПревышениеДоходаФОМС.ОбособленноеПодразделение
    |			И ДоходыВзносов.ПериодРегистрации = ПревышениеДоходаФОМС.Период
    |			И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФОМС.ВидТарифаСтраховыхВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
    |		ПО ДоходыВзносов.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
    |			И ДоходыВзносов.ОбособленноеПодразделение = ПревышениеДоходаФСС.ОбособленноеПодразделение
    |			И ДоходыВзносов.ПериодРегистрации = ПревышениеДоходаФСС.Период
    |			И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
    |
    |СГРУППИРОВАТЬ ПО
    |	ДоходыВзносов.ФизЛицо,
    |	ДоходыВзносов.Организация,
    |	ДоходыВзносов.ОбособленноеПодразделение,
    |	ДоходыВзносов.ПериодРегистрации,
    |	ДоходыВзносов.ВидТарифаСтраховыхВзносов
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ФизЛицо,
    |	ПериодРегистрации,
    |	Организация,
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Месяцы.ФизЛицо,
    |	Месяцы.ГоловнаяОрганизация,
    |	Месяцы.Организация,
    |	Месяцы.ПериодРегистрации,
    |	БазаДляОтчета.ВидТарифаСтраховыхВзносов
    |ПОМЕСТИТЬ ВТПериодыОдногоТарифа
    |ИЗ
    |	(ВЫБРАТЬ
    |		БазаДляОтчета.ФизЛицо КАК ФизЛицо,
    |		БазаДляОтчета.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
    |		БазаДляОтчета.Организация КАК Организация,
    |		БазаДляОтчета.ПериодРегистрации КАК ПериодРегистрации
    |	ИЗ
    |		ВТБазаДляОтчета КАК БазаДляОтчета
    |	
    |	СГРУППИРОВАТЬ ПО
    |		БазаДляОтчета.ГоловнаяОрганизация,
    |		БазаДляОтчета.Организация,
    |		БазаДляОтчета.ПериодРегистрации,
    |		БазаДляОтчета.ФизЛицо
    |	
    |	ИМЕЮЩИЕ
    |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) = 1) КАК Месяцы
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаДляОтчета КАК БазаДляОтчета
    |		ПО Месяцы.ФизЛицо = БазаДляОтчета.ФизЛицо
    |			И Месяцы.ГоловнаяОрганизация = БазаДляОтчета.ГоловнаяОрганизация
    |			И Месяцы.Организация = БазаДляОтчета.Организация
    |			И Месяцы.ПериодРегистрации = БазаДляОтчета.ПериодРегистрации
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек) КАК Тариф
    |ПОМЕСТИТЬ ВТОсобыеТарифы
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентПортаВладивосток)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентОсобойЗоныВКалининградскойОбласти)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	БазаДляОтчета.ФизЛицо КАК ФизЛицо,
    |	БазаДляОтчета.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
    |	БазаДляОтчета.Организация КАК Организация,
    |	БазаДляОтчета.ПериодРегистрации КАК ПериодРегистрации
    |ПОМЕСТИТЬ ВТМесяцыОсобыхТарифов
    |ИЗ
    |	ВТБазаДляОтчета КАК БазаДляОтчета
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсобыеТарифы КАК ОсобыеТарифы
    |		ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = ОсобыеТарифы.Тариф
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	МесяцыОсобыхТарифов.ФизЛицо,
    |	МесяцыОсобыхТарифов.ГоловнаяОрганизация,
    |	МесяцыОсобыхТарифов.Организация,
    |	МесяцыОсобыхТарифов.ПериодРегистрации,
    |	СУММА(БазаДляОтчета.НалоговаяБазаПФР * РазмерыТарифныхСтавок.ПФР) КАК ПФРПоСуммарномуТарифуЗаПериод,
    |	СУММА(БазаДляОтчета.НалоговаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
    |			КОГДА ГОД(МесяцыОсобыхТарифов.ФизЛицо.ДатаРождения) < 1967
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |				ТОГДА 0
    |			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
    |		КОНЕЦ)) КАК ПФРСтраховаяЗаПериод,
    |	СУММА(БазаДляОтчета.НалоговаяБазаПФР * ВЫБОР
    |			КОГДА ГОД(МесяцыОсобыхТарифов.ФизЛицо.ДатаРождения) < 1967
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |				ТОГДА 0
    |			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
    |		КОНЕЦ) КАК ПФРНакопительнаяЗаПериод,
    |	СУММА(БазаДляОтчета.НалоговаяБазаФСС * РазмерыТарифныхСтавок.ФСС) КАК ФССЗаПериод,
    |	СУММА(БазаДляОтчета.НалоговаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС) КАК ФОМСЗаПериод
    |ПОМЕСТИТЬ ВТПериодыДляРаспределенияВзносовПоТарифам
    |ИЗ
    |	ВТМесяцыОсобыхТарифов КАК МесяцыОсобыхТарифов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаДляОтчета КАК БазаДляОтчета
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТОсобыеТарифы КАК ОсобыеТарифы
    |			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = ОсобыеТарифы.Тариф
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
    |			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
    |				И (ГОД(БазаДляОтчета.ПериодРегистрации) = РазмерыТарифныхСтавок.РасчетныйПериод)
    |		ПО МесяцыОсобыхТарифов.ФизЛицо = БазаДляОтчета.ФизЛицо
    |			И МесяцыОсобыхТарифов.ГоловнаяОрганизация = БазаДляОтчета.ГоловнаяОрганизация
    |			И МесяцыОсобыхТарифов.Организация = БазаДляОтчета.Организация
    |			И МесяцыОсобыхТарифов.ПериодРегистрации = БазаДляОтчета.ПериодРегистрации
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |		ПО МесяцыОсобыхТарифов.ПериодРегистрации = Гражданство.ПериодРегистрации
    |			И МесяцыОсобыхТарифов.ФизЛицо = Гражданство.Физлицо
    |
    |СГРУППИРОВАТЬ ПО
    |	МесяцыОсобыхТарифов.ГоловнаяОрганизация,
    |	МесяцыОсобыхТарифов.Организация,
    |	МесяцыОсобыхТарифов.ПериодРегистрации,
    |	МесяцыОсобыхТарифов.ФизЛицо
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо,
    |	ПериодыДляРаспределенияВзносовПоТарифам.ГоловнаяОрганизация,
    |	ПериодыДляРаспределенияВзносовПоТарифам.Организация,
    |	ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации,
    |	ТарифыПоДоходам.ВидТарифаСтраховыхВзносов,
    |	ВЫБОР
    |		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРПоСуммарномуТарифуЗаПериод = 0
    |			ТОГДА 0
    |		ИНАЧЕ БазаДляОтчета.НалоговаяБазаПФР * РазмерыТарифныхСтавок.ПФР / ПериодыДляРаспределенияВзносовПоТарифам.ПФРПоСуммарномуТарифуЗаПериод
    |	КОНЕЦ КАК КоэффициентПФРПоСуммарномуТарифу,
    |	ВЫБОР
    |		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод = 0
    |			ТОГДА 0
    |		ИНАЧЕ БазаДляОтчета.НалоговаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
    |				КОГДА ГОД(ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо.ДатаРождения) < 1967
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |					ТОГДА 0
    |				ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
    |			КОНЕЦ) / ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод
    |	КОНЕЦ КАК КоэффициентПФРСтраховая,
    |	ВЫБОР
    |		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРНакопительнаяЗаПериод = 0
    |			ТОГДА 0
    |		ИНАЧЕ БазаДляОтчета.НалоговаяБазаПФР * ВЫБОР
    |				КОГДА ГОД(ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо.ДатаРождения) < 1967
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |					ТОГДА 0
    |				КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |					ТОГДА 0
    |				ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
    |			КОНЕЦ / ПериодыДляРаспределенияВзносовПоТарифам.ПФРНакопительнаяЗаПериод
    |	КОНЕЦ КАК КоэффициентПФРНакопительная,
    |	ВЫБОР
    |		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ФССЗаПериод = 0
    |			ТОГДА 0
    |		ИНАЧЕ БазаДляОтчета.НалоговаяБазаФСС * РазмерыТарифныхСтавок.ФСС / ПериодыДляРаспределенияВзносовПоТарифам.ФССЗаПериод
    |	КОНЕЦ КАК КоэффициентФСС,
    |	ВЫБОР
    |		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод = 0
    |			ТОГДА 0
    |		ИНАЧЕ БазаДляОтчета.НалоговаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС / ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод
    |	КОНЕЦ КАК КоэффициентФОМС
    |ПОМЕСТИТЬ ВТКоэффициентыРаспределенияВзносовПоТарифам
    |ИЗ
    |	ВТПериодыДляРаспределенияВзносовПоТарифам КАК ПериодыДляРаспределенияВзносовПоТарифам
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаДляОтчета КАК БазаДляОтчета
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
    |			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
    |				И (ГОД(БазаДляОтчета.ПериодРегистрации) = РазмерыТарифныхСтавок.РасчетныйПериод)
    |		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = БазаДляОтчета.ФизЛицо
    |			И ПериодыДляРаспределенияВзносовПоТарифам.ГоловнаяОрганизация = БазаДляОтчета.ГоловнаяОрганизация
    |			И ПериодыДляРаспределенияВзносовПоТарифам.Организация = БазаДляОтчета.Организация
    |			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = БазаДляОтчета.ПериодРегистрации
    |			И (БазаДляОтчета.ВидТарифаСтраховыхВзносов В
    |				(ВЫБРАТЬ
    |					ОсобыеТарифы.Тариф
    |				ИЗ
    |					ВТОсобыеТарифы КАК ОсобыеТарифы))
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаДляОтчета КАК ТарифыПоДоходам
    |		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = ТарифыПоДоходам.ФизЛицо
    |			И ПериодыДляРаспределенияВзносовПоТарифам.ГоловнаяОрганизация = ТарифыПоДоходам.ГоловнаяОрганизация
    |			И ПериодыДляРаспределенияВзносовПоТарифам.Организация = ТарифыПоДоходам.Организация
    |			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = ТарифыПоДоходам.ПериодРегистрации
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |		ПО ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = Гражданство.ПериодРегистрации
    |			И ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = Гражданство.Физлицо
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ДанныеУчета.ПериодРегистрации,
    |	ДанныеУчета.ФизЛицо,
    |	ДанныеУчета.ГоловнаяОрганизация,
    |	ДанныеУчета.Организация,
    |	ДанныеУчета.ВидТарифаСтраховыхВзносов,
    |	СУММА(ДанныеУчета.ПФРПоСуммарномуТарифу) КАК ПФРПоСуммарномуТарифу,
    |	СУММА(ДанныеУчета.ПФРСПревышения) КАК ПФРСПревышения,
    |	СУММА(ДанныеУчета.ПФРСтраховая) КАК ПФРСтраховая,
    |	СУММА(ДанныеУчета.ПФРНакопительная) КАК ПФРНакопительная,
    |	СУММА(ДанныеУчета.ФСС) КАК ФСС,
    |	СУММА(ДанныеУчета.ФФОМС) КАК ФФОМС,
    |	СУММА(ДанныеУчета.ТФОМС) КАК ТФОМС,
    |	СУММА(ДанныеУчета.ФССНесчастныеСлучаи) КАК ФССНесчастныеСлучаи,
    |	СУММА(ДанныеУчета.ПФРПоДополнительномуТарифу) КАК ПФРПоДополнительномуТарифу,
    |	СУММА(ДанныеУчета.ПФРНаДоплатуКПенсииШахтерам) КАК ПФРНаДоплатуКПенсииШахтерам,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ДанныеУчета.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
    |ПОМЕСТИТЬ ВТДанныеУчетаВзносов
    |ИЗ
    |	(ВЫБРАТЬ
    |		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) КАК ПериодРегистрации,
    |		СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
    |		СтраховыеВзносыИсчисленные.Организация КАК ГоловнаяОрганизация,
    |		СтраховыеВзносыИсчисленные.ОбособленноеПодразделение КАК Организация,
    |		ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
    |		СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленные.ПФРСПревышения КАК ПФРПоСуммарномуТарифу,
    |		СтраховыеВзносыИсчисленные.ПФРСПревышения КАК ПФРСПревышения,
    |		СтраховыеВзносыИсчисленные.ПФРСтраховая КАК ПФРСтраховая,
    |		СтраховыеВзносыИсчисленные.ПФРНакопительная КАК ПФРНакопительная,
    |		СтраховыеВзносыИсчисленные.ФСС КАК ФСС,
    |		СтраховыеВзносыИсчисленные.ФФОМС КАК ФФОМС,
    |		СтраховыеВзносыИсчисленные.ТФОМС КАК ТФОМС,
    |		СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
    |		СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу КАК ПФРПоДополнительномуТарифу,
    |		СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам КАК ПФРНаДоплатуКПенсииШахтерам,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |		СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
    |	ИЗ
    |		РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
    |			ПО (НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) = ВидыТарифныхСтавокОрганизаций.Период)
    |				И СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = ВидыТарифныхСтавокОрганизаций.ОбособленноеПодразделение
    |	ГДЕ
    |		СтраховыеВзносыИсчисленные.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &КонецПериода
    |		И (СтраховыеВзносыИсчисленные.ФизЛицо, СтраховыеВзносыИсчисленные.ОбособленноеПодразделение) В
    |				(ВЫБРАТЬ
    |					Организации.ФизЛицо,
    |					Организации.ОбособленноеПодразделение
    |				ИЗ
    |					ВТФизЛицаОрганизаций КАК Организации)
    |		И (СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличины <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРСПревышения <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРСтраховая <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРНакопительная <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ФСС <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ФФОМС <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ТФОМС <> 0)
    |	
    |	ОБЪЕДИНИТЬ ВСЕ
    |	
    |	ВЫБРАТЬ
    |		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ),
    |		СтраховыеВзносыИсчисленные.ФизЛицо,
    |		СтраховыеВзносыИсчисленные.Организация,
    |		СтраховыеВзносыИсчисленные.ОбособленноеПодразделение,
    |		ВЫБОР
    |			КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
    |				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |			ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
    |		КОНЕЦ,
    |		СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличиныЕНВД + СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД,
    |		СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД,
    |		СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД,
    |		СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД,
    |		СтраховыеВзносыИсчисленные.ФССЕНВД,
    |		СтраховыеВзносыИсчисленные.ФФОМСЕНВД,
    |		СтраховыеВзносыИсчисленные.ТФОМСЕНВД,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0,
    |		0
    |	ИЗ
    |		РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
    |			ПО (НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) = ВидыТарифныхСтавокОрганизаций.Период)
    |				И СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = ВидыТарифныхСтавокОрганизаций.ОбособленноеПодразделение
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
    |			ПО (ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа)
    |				И (ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода) = ОписаниеТарифов.РасчетныйПериод)
    |	ГДЕ
    |		СтраховыеВзносыИсчисленные.ДатаПолученияДохода МЕЖДУ &НачалоПериода И &КонецПериода
    |		И (СтраховыеВзносыИсчисленные.ФизЛицо, СтраховыеВзносыИсчисленные.ОбособленноеПодразделение) В
    |				(ВЫБРАТЬ
    |					Организации.ФизЛицо,
    |					Организации.ОбособленноеПодразделение
    |				ИЗ
    |					ВТФизЛицаОрганизаций КАК Организации)
    |		И (СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличиныЕНВД <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ФССЕНВД <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ФФОМСЕНВД <> 0
    |				ИЛИ СтраховыеВзносыИсчисленные.ТФОМСЕНВД <> 0)) КАК ДанныеУчета
    |
    |СГРУППИРОВАТЬ ПО
    |	ДанныеУчета.ПериодРегистрации,
    |	ДанныеУчета.ФизЛицо,
    |	ДанныеУчета.ГоловнаяОрганизация,
    |	ДанныеУчета.Организация,
    |	ДанныеУчета.ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ДанныеУчетаВзносов.ПериодРегистрации,
    |	ДанныеУчетаВзносов.ФизЛицо,
    |	ДанныеУчетаВзносов.ГоловнаяОрганизация,
    |	ДанныеУчетаВзносов.Организация,
    |	ВЫБОР
    |		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |			ТОГДА ВЫБОР
    |					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
    |							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
    |					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
    |				КОНЕЦ
    |		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
    |		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
    |				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
    |		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
    |	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL
    |								ТОГДА 0
    |							ИНАЧЕ 1
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ПФРСПревышения КАК ЧИСЛО(15, 2))) КАК ПФРСПревышения,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРПоСуммарномуТарифу
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРПоСуммарномуТарифу
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ПФРПоСуммарномуТарифу КАК ЧИСЛО(15, 2))) КАК ПФРПоСуммарномуТарифу,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ПФРСтраховая КАК ЧИСЛО(15, 2))) КАК ПФРСтраховая,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРНакопительная
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРНакопительная
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ПФРНакопительная КАК ЧИСЛО(15, 2))) КАК ПФРНакопительная,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФСС
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФСС
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ФСС КАК ЧИСЛО(15, 2))) КАК ФСС,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФСС
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФСС
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ФССНесчастныеСлучаи КАК ЧИСЛО(15, 2))) КАК ФССНесчастныеСлучаи,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ФФОМС КАК ЧИСЛО(15, 2))) КАК ФФОМС,
    |	СУММА(ДанныеУчетаВзносов.ТФОМС) КАК ТФОМС,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРПоСуммарномуТарифу
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРПоСуммарномуТарифу
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ПФРПоДополнительномуТарифу КАК ЧИСЛО(15, 2))) КАК ПФРПоДополнительномуТарифу,
    |	СУММА(ВЫРАЗИТЬ(ВЫБОР
    |				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА 1
    |				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |					ТОГДА ВЫБОР
    |							КОГДА ОсобыеТарифы.Тариф ЕСТЬ НЕ NULL 
    |								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРПоСуммарномуТарифу
    |							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРПоСуммарномуТарифу
    |						КОНЕЦ
    |				ИНАЧЕ 1
    |			КОНЕЦ * ДанныеУчетаВзносов.ПФРНаДоплатуКПенсииШахтерам КАК ЧИСЛО(15, 2))) КАК ПФРНаДоплатуКПенсииШахтерам
    |ПОМЕСТИТЬ ВТВзносы
    |ИЗ
    |	ВТДанныеУчетаВзносов КАК ДанныеУчетаВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
    |		ПО ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
    |			И (ГОД(ДанныеУчетаВзносов.ПериодРегистрации) = ОписаниеТарифов.РасчетныйПериод)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
    |		ПО ДанныеУчетаВзносов.ПериодРегистрации = Инвалиды.ПериодРегистрации
    |			И ДанныеУчетаВзносов.ФизЛицо = Инвалиды.Физлицо
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыОдногоТарифа КАК ПериодыОдногоТарифа
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеПериодаОдногоТарифа
    |			ПО ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов = ОписаниеПериодаОдногоТарифа.ВидТарифа
    |				И (ОписаниеПериодаОдногоТарифа.РасчетныйПериод = ГОД(ПериодыОдногоТарифа.ПериодРегистрации))
    |		ПО ДанныеУчетаВзносов.ФизЛицо = ПериодыОдногоТарифа.ФизЛицо
    |			И ДанныеУчетаВзносов.ГоловнаяОрганизация = ПериодыОдногоТарифа.ГоловнаяОрганизация
    |			И ДанныеУчетаВзносов.Организация = ПериодыОдногоТарифа.Организация
    |			И ДанныеУчетаВзносов.ПериодРегистрации = ПериодыОдногоТарифа.ПериодРегистрации
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыРаспределенияВзносовПоТарифам КАК КоэффициентыРаспределенияВзносовПоТарифам
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТОсобыеТарифы КАК ОсобыеТарифы
    |			ПО КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов = ОсобыеТарифы.Тариф
    |		ПО ДанныеУчетаВзносов.ФизЛицо = КоэффициентыРаспределенияВзносовПоТарифам.ФизЛицо
    |			И ДанныеУчетаВзносов.ГоловнаяОрганизация = КоэффициентыРаспределенияВзносовПоТарифам.ГоловнаяОрганизация
    |			И ДанныеУчетаВзносов.Организация = КоэффициентыРаспределенияВзносовПоТарифам.Организация
    |			И ДанныеУчетаВзносов.ПериодРегистрации = КоэффициентыРаспределенияВзносовПоТарифам.ПериодРегистрации
    |
    |СГРУППИРОВАТЬ ПО
    |	ВЫБОР
    |		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |			ТОГДА ВЫБОР
    |					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
    |							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
    |					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
    |				КОНЕЦ
    |		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
    |		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
    |				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
    |		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
    |	КОНЕЦ,
    |	ДанныеУчетаВзносов.ПериодРегистрации,
    |	ДанныеУчетаВзносов.ФизЛицо,
    |	ДанныеУчетаВзносов.ГоловнаяОрганизация,
    |	ДанныеУчетаВзносов.Организация
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим) КАК ВидТарифаСтраховыхВзносов,
    |	""01"" КАК Код,
    |	2010 КАК ГодС,
    |	2100 КАК ГодПо
    |ПОМЕСТИТЬ ВТКодыТарифов
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.СельХозПроизводители),
    |	""02"",
    |	2010,
    |	2011
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.СельХозПроизводители),
    |	""18"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.СельХозПроизводители),
    |	""01"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы),
    |	""02"",
    |	2011,
    |	2011
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы),
    |	""19"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы),
    |	""01"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов),
    |	""03"",
    |	2010,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов),
    |	""01"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны),
    |	""03"",
    |	2010,
    |	2010
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны),
    |	""36"",
    |	2011,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны),
    |	""05"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕСХН),
    |	""04"",
    |	2010,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕСХН),
    |	""01"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим),
    |	""05"",
    |	2010,
    |	2010
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим),
    |	""51"",
    |	2011,
    |	2011
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим),
    |	""52"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим),
    |	""02"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД),
    |	""05"",
    |	2010,
    |	2010
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД),
    |	""51"",
    |	2011,
    |	2011
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД),
    |	""53"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД),
    |	""03"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ITОрганизации),
    |	""06"",
    |	2011,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.Мультипликаторы),
    |	""18"",
    |	2018,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство),
    |	""07"",
    |	2011,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство),
    |	""08"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов),
    |	""08"",
    |	2011,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов),
    |	""04"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.СМИ),
    |	""09"",
    |	2011,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.СМИ),
    |	""01"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково),
    |	""10"",
    |	2010,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково),
    |	""13"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек),
    |	""11"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек),
    |	""09"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации),
    |	""12"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации),
    |	""10"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации),
    |	""13"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации),
    |	""11"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги),
    |	""14"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги),
    |	""01"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ),
    |	""15"",
    |	2012,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ),
    |	""07"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент),
    |	""16"",
    |	2013,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент),
    |	""12"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму),
    |	""23"",
    |	2015,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму),
    |	""14"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития),
    |	""24"",
    |	2015,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития),
    |	""15"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентПортаВладивосток),
    |	""25"",
    |	2016,
    |	2016
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентПортаВладивосток),
    |	""16"",
    |	2017,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.Мультипликаторы),
    |	""18"",
    |	2018,
    |	2100
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентОсобойЗоныВКалининградскойОбласти),
    |	""17"",
    |	2018,
    |	2025
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ВидТарифаСтраховыхВзносов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Физлица.ФизЛицо,
    |	Физлица.ГоловнаяОрганизация,
    |	Физлица.Период,
    |	Физлица.Организация
    |ПОМЕСТИТЬ ВТПериодыДопТарифов
    |ИЗ
    |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
    |		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |		СведенияОДоходах.Организация КАК ГоловнаяОрганизация,
    |		СведенияОДоходах.Период КАК Период,
    |		СведенияОДоходах.ОбособленноеПодразделение КАК Организация
    |	ИЗ
    |		ВТСведенияОДоходах КАК СведенияОДоходах
    |	ГДЕ
    |		(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
    |				ИЛИ СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу
    |				ИЛИ СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка))
    |	
    |	ОБЪЕДИНИТЬ
    |	
    |	ВЫБРАТЬ РАЗЛИЧНЫЕ
    |		ДанныеУчетаВзносов.ФизЛицо,
    |		ДанныеУчетаВзносов.ГоловнаяОрганизация,
    |		ДанныеУчетаВзносов.ПериодРегистрации,
    |		ДанныеУчетаВзносов.Организация
    |	ИЗ
    |		ВТДанныеУчетаВзносов КАК ДанныеУчетаВзносов
    |	ГДЕ
    |		(ДанныеУчетаВзносов.ПФРПоДополнительномуТарифу <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРНаДоплатуКПенсииШахтерам <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0)) КАК Физлица
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
    |	СведенияОДоходах.Период КАК Период,
    |	СведенияОДоходах.ОбособленноеПодразделение КАК Организация,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсего,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторским,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагается,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведениеОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТрудыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптурыОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведенияОблагаемыеФСС_НС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведенийОблагаемыеФСС_НС)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ВЫБОР
    |						КОГДА СведенияОДоходах.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |							ТОГДА СведенияОДоходах.РезультатОборот
    |						ИНАЧЕ 0
    |					КОНЕЦ
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликомПрокуроров)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС)
    |					ИЛИ СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих)
    |				ТОГДА СведенияОДоходах.РезультатОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			КОГДА СведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА СведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
    |				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
    |			ИНАЧЕ 0
    |		КОНЕЦ) КАК НалоговаяБазаПФР
    |ПОМЕСТИТЬ ВТДоходыСтраницыВредниковПомесячно
    |ИЗ
    |	ВТСведенияОДоходах КАК СведенияОДоходах
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |		ПО СведенияОДоходах.Период = Гражданство.ПериодРегистрации
    |			И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
    |		ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
    |			И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
    |			И СведенияОДоходах.Организация = ПринятыеПоДолгосрочнымДоговорам.Организация
    |
    |СГРУППИРОВАТЬ ПО
    |	СведенияОДоходах.ФизЛицо,
    |	СведенияОДоходах.Период,
    |	СведенияОДоходах.ОбособленноеПодразделение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ДоходыВзносов.ФизЛицо,
    |	ДоходыВзносов.Организация,
    |	МАКСИМУМ(ЕСТЬNULL(КодыТарифов.Код, ""??"")) КАК КодТарифа,
    |	ГОД(ДоходыВзносов.ПериодРегистрации) КАК Год
    |ПОМЕСТИТЬ ВТПервыйТариф
    |ИЗ
    |	ВТДоходыВзносов КАК ДоходыВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКодыТарифов КАК КодыТарифов
    |		ПО ДоходыВзносов.ВидТарифаСтраховыхВзносов = КодыТарифов.ВидТарифаСтраховыхВзносов
    |			И (ГОД(ДоходыВзносов.ПериодРегистрации) МЕЖДУ КодыТарифов.ГодС И КодыТарифов.ГодПо)
    |
    |СГРУППИРОВАТЬ ПО
    |	ДоходыВзносов.ФизЛицо,
    |	ДоходыВзносов.Организация,
    |	ГОД(ДоходыВзносов.ПериодРегистрации)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ВЫБОР
    |		КОГДА ПособияСоциальномуСтрахованию.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
    |			ТОГДА ПособияСоциальномуСтрахованию.Сотрудник.Физлицо
    |		ИНАЧЕ ПособияСоциальномуСтрахованию.Сотрудник
    |	КОНЕЦ КАК Физлицо,
    |	ПособияСоциальномуСтрахованию.Организация,
    |	ВЫБОР
    |		КОГДА ПособияСоциальномуСтрахованию.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
    |			ТОГДА ПособияСоциальномуСтрахованию.Организация
    |		ИНАЧЕ ПособияСоциальномуСтрахованию.Организация.ГоловнаяОрганизация
    |	КОНЕЦ КАК ГоловнаяОрганизация,
    |	ПособияСоциальномуСтрахованию.ВыплатаЗаСчетФедеральногоБюджета,
    |	ПособияСоциальномуСтрахованию.ВидПособияСоциальногоСтрахования,
    |	ПособияСоциальномуСтрахованию.СуммаВсего КАК Сумма,
    |	ПособияСоциальномуСтрахованию.СуммаСверхНорм,
    |	ВЫБОР
    |		КОГДА ПособияСоциальномуСтрахованию.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПриРожденииРебенка)
    |			ТОГДА ПособияСоциальномуСтрахованию.СтраховыеСлучаи
    |		КОГДА ПособияСоциальномуСтрахованию.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПриПостановкеНаУчетВРанниеСрокиБеременности)
    |			ТОГДА ПособияСоциальномуСтрахованию.СтраховыеСлучаи
    |		КОГДА ПособияСоциальномуСтрахованию.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ВСвязиСоСмертью)
    |			ТОГДА ПособияСоциальномуСтрахованию.СтраховыеСлучаи
    |		КОГДА ПособияСоциальномуСтрахованию.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами)
    |			ТОГДА ПособияСоциальномуСтрахованию.СтраховыеСлучаи
    |		ИНАЧЕ ПособияСоциальномуСтрахованию.ОплаченныеДни
    |	КОНЕЦ КАК ОплаченныеДни,
    |	НАЧАЛОПЕРИОДА(ПособияСоциальномуСтрахованию.Период, МЕСЯЦ) КАК Период,
    |	ЛОЖЬ КАК УходЗаПервымРебенком,
    |	ВЫБОР
    |		КОГДА ПособияСоциальномуСтрахованию.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)
    |			ТОГДА ""по внешнему совместительству""
    |		ИНАЧЕ ""основное место работы""
    |	КОНЕЦ КАК ОписаниеВидаЗанятости
    |ПОМЕСТИТЬ ВТПособия
    |ИЗ
    |	РегистрНакопления.ПособияСоциальномуСтрахованию КАК ПособияСоциальномуСтрахованию
    |ГДЕ
    |	ПособияСоциальномуСтрахованию.Период МЕЖДУ &НачалоПериода И &КонецПериода
    |	И (ВЫБОР
    |			КОГДА ПособияСоциальномуСтрахованию.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
    |				ТОГДА ПособияСоциальномуСтрахованию.Сотрудник.Физлицо
    |			ИНАЧЕ ПособияСоциальномуСтрахованию.Сотрудник
    |		КОНЕЦ, ПособияСоциальномуСтрахованию.Организация) В
    |			(ВЫБРАТЬ
    |				Организации.ФизЛицо,
    |				Организации.ОбособленноеПодразделение
    |			ИЗ
    |				ВТФизЛицаОрганизаций КАК Организации)
    |	И ПособияСоциальномуСтрахованию.Период >= &ДатаСтрахованияВсехВременноПребывающих
    |	И ПособияСоциальномуСтрахованию.ВидПособияСоциальногоСтрахования <> ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПустаяСсылка)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.ФизЛицо,
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.Организация,
    |	ВЫБОР
    |		КОГДА ПособияПоУходуЗаРебенкомДоПолутораЛет.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
    |			ТОГДА ПособияПоУходуЗаРебенкомДоПолутораЛет.Организация
    |		ИНАЧЕ ПособияПоУходуЗаРебенкомДоПолутораЛет.Организация.ГоловнаяОрганизация
    |	КОНЕЦ,
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.ВыплатаЗаСчетФедеральногоБюджета,
    |	ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет),
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.СуммаВсего,
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.СуммаСверхНорм,
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.СтраховыеСлучаи,
    |	НАЧАЛОПЕРИОДА(ПособияПоУходуЗаРебенкомДоПолутораЛет.Период, МЕСЯЦ),
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.УходЗаПервымРебенком,
    |	""""
    |ИЗ
    |	РегистрНакопления.ПособияПоУходуЗаРебенкомДоПолутораЛет КАК ПособияПоУходуЗаРебенкомДоПолутораЛет
    |ГДЕ
    |	ПособияПоУходуЗаРебенкомДоПолутораЛет.Период МЕЖДУ &НачалоПериода И &КонецПериода
    |	И (ПособияПоУходуЗаРебенкомДоПолутораЛет.ФизЛицо, ПособияПоУходуЗаРебенкомДоПолутораЛет.Организация) В
    |			(ВЫБРАТЬ
    |				Организации.ФизЛицо,
    |				Организации.ОбособленноеПодразделение
    |			ИЗ
    |				ВТФизЛицаОрганизаций КАК Организации)
    |	И ПособияПоУходуЗаРебенкомДоПолутораЛет.Период >= &ДатаСтрахованияВсехВременноПребывающих
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СуммыПособий.Физлицо,
    |	СуммыПособий.Организация,
    |	СуммыПособий.Период,
    |	СУММА(СуммыПособий.Сумма) КАК Сумма
    |ПОМЕСТИТЬ ВТИтогиПособий
    |ИЗ
    |	ВТПособия КАК СуммыПособий
    |
    |СГРУППИРОВАТЬ ПО
    |	СуммыПособий.Физлицо,
    |	СуммыПособий.Организация,
    |	СуммыПособий.Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СписокФизЛиц.ФизЛицо КАК ФизЛицо,
    |	СписокФизЛиц.Организация КАК Организация,
    |	СписокФизЛиц.ВидДоговора КАК ВидДоговора,
    |	СписокФизЛиц.НомерДоговора,
    |	СписокФизЛиц.ДатаЗаключенияДоговора КАК ДатаЗаключенияДоговора,
    |	ВЫБОР
    |		КОГДА СписокФизЛиц.ПериодС = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
    |			ТОГДА СписокФизЛиц.ПериодС
    |		ИНАЧЕ НАЧАЛОПЕРИОДА(СписокФизЛиц.ПериодС, ДЕНЬ)
    |	КОНЕЦ КАК ПериодС,
    |	ВЫБОР
    |		КОГДА СписокФизЛиц.ПериодПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
    |			ТОГДА СписокФизЛиц.ПериодПо
    |		ИНАЧЕ НАЧАЛОПЕРИОДА(СписокФизЛиц.ПериодПо, ДЕНЬ)
    |	КОНЕЦ КАК ПериодПо
    |ИЗ
    |	ВТДоговоры КАК СписокФизЛиц
    |
    |УПОРЯДОЧИТЬ ПО
    |	Организация,
    |	ФизЛицо,
    |	ВидДоговора УБЫВ,
    |	ПериодС
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Пособия.Физлицо КАК Физлицо,
    |	Пособия.Организация КАК Организация,
    |	СУММА(Пособия.Сумма) КАК Сумма,
    |	СУММА(Пособия.СуммаСверхНорм) КАК СуммаСверхНорм,
    |	СУММА(Пособия.ОплаченныеДни) КАК ОплаченныеДни,
    |	ВЫБОР
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.Нетрудоспособность)
    |			ТОГДА ""По временной нетрудоспособности, "" + Пособия.ОписаниеВидаЗанятости
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.БеременностьРоды)
    |			ТОГДА ""По беременности и родам, "" + Пособия.ОписаниеВидаЗанятости
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПриРожденииРебенка)
    |			ТОГДА ""Единовременное пособие при рождении ребенка""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПриПостановкеНаУчетВРанниеСрокиБеременности)
    |			ТОГДА ""Единовременное пособие женщинам, вставшим на учет в медицинских организациях в ранние сроки беременности""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ВСвязиСоСмертью)
    |			ТОГДА ""Социальное пособие на погребение или возмещение стоимости гарантированного перечня услуг по погребению""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами)
    |			ТОГДА ""Оплата 4-х дополнительных выходных дней для ухода за детьми-инвалидами""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами)
    |			ТОГДА ""Страховые взносы с оплаты 4-х дополнительных выходных дней для ухода за детьми-инвалидами""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет)
    |			ТОГДА ""Ежемесячное пособие по уходу за ребенком, по уходу за "" + ВЫБОР
    |					КОГДА Пособия.УходЗаПервымРебенком
    |						ТОГДА ""первым ребенком""
    |					ИНАЧЕ ""вторым и последующими детьми""
    |				КОНЕЦ
    |		ИНАЧЕ """"
    |	КОНЕЦ КАК ВидПособия,
    |	Пособия.Период КАК Период,
    |	Пособия.ВидПособияСоциальногоСтрахования КАК ВидПособияСоциальногоСтрахования
    |ИЗ
    |	ВТПособия КАК Пособия
    |ГДЕ
    |	НЕ Пособия.ВидПособияСоциальногоСтрахования В (ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьПрофзаболевание), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай))
    |
    |СГРУППИРОВАТЬ ПО
    |	Пособия.Физлицо,
    |	Пособия.Организация,
    |	Пособия.Период,
    |	Пособия.ВидПособияСоциальногоСтрахования,
    |	ВЫБОР
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.Нетрудоспособность)
    |			ТОГДА ""По временной нетрудоспособности, "" + Пособия.ОписаниеВидаЗанятости
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.БеременностьРоды)
    |			ТОГДА ""По беременности и родам, "" + Пособия.ОписаниеВидаЗанятости
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПриРожденииРебенка)
    |			ТОГДА ""Единовременное пособие при рождении ребенка""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПриПостановкеНаУчетВРанниеСрокиБеременности)
    |			ТОГДА ""Единовременное пособие женщинам, вставшим на учет в медицинских организациях в ранние сроки беременности""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ВСвязиСоСмертью)
    |			ТОГДА ""Социальное пособие на погребение или возмещение стоимости гарантированного перечня услуг по погребению""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами)
    |			ТОГДА ""Оплата 4-х дополнительных выходных дней для ухода за детьми-инвалидами""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами)
    |			ТОГДА ""Страховые взносы с оплаты 4-х дополнительных выходных дней для ухода за детьми-инвалидами""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет)
    |			ТОГДА ""Ежемесячное пособие по уходу за ребенком, по уходу за "" + ВЫБОР
    |					КОГДА Пособия.УходЗаПервымРебенком
    |						ТОГДА ""первым ребенком""
    |					ИНАЧЕ ""вторым и последующими детьми""
    |				КОНЕЦ
    |		ИНАЧЕ """"
    |	КОНЕЦ
    |
    |ИМЕЮЩИЕ
    |	(СУММА(Пособия.Сумма) <> 0
    |		ИЛИ СУММА(Пособия.СуммаСверхНорм) <> 0
    |		ИЛИ СУММА(Пособия.ОплаченныеДни) <> 0)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Организация,
    |	Физлицо,
    |	ВидПособияСоциальногоСтрахования,
    |	ВидПособия,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Пособия.Физлицо КАК Физлицо,
    |	Пособия.Организация КАК Организация,
    |	СУММА(Пособия.Сумма) КАК Сумма,
    |	СУММА(Пособия.СуммаСверхНорм) КАК СуммаСверхНорм,
    |	СУММА(Пособия.ОплаченныеДни) КАК ОплаченныеДни,
    |	ВЫБОР
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев)
    |			ТОГДА ""Оплата отпуска для санаторно-курортного лечения""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьПрофзаболевание)
    |			ТОГДА ""По временной нетрудоспособности в связи с професcиональными заболеваниями, "" + Пособия.ОписаниеВидаЗанятости
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай)
    |			ТОГДА ""По временной нетрудоспособности в связи с несчастными случаями на производстве, "" + Пособия.ОписаниеВидаЗанятости
    |		ИНАЧЕ """"
    |	КОНЕЦ КАК ВидПособия,
    |	Пособия.Период КАК Период,
    |	Пособия.ВидПособияСоциальногоСтрахования КАК ВидПособияСоциальногоСтрахования
    |ИЗ
    |	ВТПособия КАК Пособия
    |ГДЕ
    |	Пособия.ВидПособияСоциальногоСтрахования В (ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьПрофзаболевание), ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай))
    |
    |СГРУППИРОВАТЬ ПО
    |	Пособия.Физлицо,
    |	Пособия.Организация,
    |	Пособия.Период,
    |	Пособия.ВидПособияСоциальногоСтрахования,
    |	ВЫБОР
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныйОтпускПослеНесчастныхСлучаев)
    |			ТОГДА ""Оплата отпуска для санаторно-курортного лечения""
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьПрофзаболевание)
    |			ТОГДА ""По временной нетрудоспособности в связи с професcиональными заболеваниями, "" + Пособия.ОписаниеВидаЗанятости
    |		КОГДА Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.НетрудоспособностьНесчастныйСлучай)
    |			ТОГДА ""По временной нетрудоспособности в связи с несчастными случаями на производстве, "" + Пособия.ОписаниеВидаЗанятости
    |		ИНАЧЕ """"
    |	КОНЕЦ
    |
    |ИМЕЮЩИЕ
    |	(СУММА(Пособия.Сумма) <> 0
    |		ИЛИ СУММА(Пособия.СуммаСверхНорм) <> 0
    |		ИЛИ СУММА(Пособия.ОплаченныеДни) <> 0)
    |
    |УПОРЯДОЧИТЬ ПО
    |	Организация,
    |	Физлицо,
    |	ВидПособияСоциальногоСтрахования,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Пособия.Физлицо КАК Физлицо,
    |	Пособия.Организация КАК Организация,
    |	Пособия.ВыплатаЗаСчетФедеральногоБюджета,
    |	ГОД(Пособия.Период) КАК Год
    |ИЗ
    |	ВТПособия КАК Пособия
    |
    |УПОРЯДОЧИТЬ ПО
    |	Организация,
    |	Физлицо,
    |	Год
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	СписокФизлиц.ФизЛицо КАК ФизЛицо,
    |	СписокФизлиц.Период КАК Период,
    |	МАКСИМУМ(ГОД(СписокФизлиц.Период)) КАК Год,
    |	СписокФизлиц.Организация КАК Организация,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах, 0)) КАК ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах, 0)) КАК ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0)) КАК ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0)) КАК ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0)) КАК ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0)) КАК ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0)) КАК ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0)) КАК ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0)) КАК ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0)) КАК ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0)) КАК ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0)) КАК ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРНаДоплатуКПенсииШахтерам, 0)) КАК ИсчисленоПФРНаДоплатуКПенсииШахтерам,
    |	СУММА(ЕСТЬNULL(ДанныеУчетаВзносов.ПФРПоДополнительномуТарифу, 0)) КАК ИсчисленоПФРПоДополнительномуТарифу,
    |	ВЫБОР
    |		КОГДА СписокФизлиц.Период < &ДатаСтрахованияВсехВременноПребывающих
    |			ТОГДА ВЫБОР
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |						ТОГДА """"
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |						ТОГДА ""1""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |						ТОГДА ""2""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""4""
    |							КОНЕЦ
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |						ТОГДА ""5""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |						ТОГДА ""6""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""7""
    |							КОНЕЦ
    |					ИНАЧЕ """"
    |				КОНЕЦ
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |			ТОГДА """"
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |			ТОГДА ""1""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |			ТОГДА ""2""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |			ТОГДА ""3""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |			ТОГДА ""4""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |			ТОГДА ""5""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |			ТОГДА ""6""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС)
    |			ТОГДА ""7""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС)
    |			ТОГДА ""8""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |			ТОГДА ""9""
    |		ИНАЧЕ """"
    |	КОНЕЦ КАК СтатусЗастрахованного,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсего, 0)) КАК НачисленоВсего,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторским, 0)) КАК РасходыПоАвторским,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагается, 0)) КАК НеОблагается,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФР, 0)) КАК НалоговаяБазаПФР,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах, 0)) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботах, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах, 0)) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах, 0)) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботах, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах, 0)) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0)) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0)) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0)) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0)) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0)) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0)) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0)) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0)) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0)) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0)) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0)) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0)) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0)) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0)) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0)) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0)) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0)) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0)) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0)) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0)) КАК РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0)) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	СУММА(ЕСТЬNULL(СведенияОДоходах.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0)) КАК НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
    |	МАКСИМУМ(РазмерыТарифныхСтавокНаРаботахСДосрочнойПенсией.ЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ЗаЗанятыхНаПодземныхИВредныхРаботах,
    |	МАКСИМУМ(РазмерыТарифныхСтавокНаРаботахСДосрочнойПенсией.ЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ЗаЗанятыхНаТяжелыхИПрочихРаботах
    |ИЗ
    |	ВТПериодыДопТарифов КАК СписокФизлиц
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеУчетаВзносов КАК ДанныеУчетаВзносов
    |		ПО СписокФизлиц.ФизЛицо = ДанныеУчетаВзносов.ФизЛицо
    |			И СписокФизлиц.Организация = ДанныеУчетаВзносов.Организация
    |			И СписокФизлиц.Период = ДанныеУчетаВзносов.ПериодРегистрации
    |			И (ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
    |				ИЛИ ДанныеУчетаВзносов.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыСтраницыВредниковПомесячно КАК СведенияОДоходах
    |		ПО СписокФизлиц.ФизЛицо = СведенияОДоходах.ФизЛицо
    |			И СписокФизлиц.Организация = СведенияОДоходах.Организация
    |			И СписокФизлиц.Период = СведенияОДоходах.Период
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |		ПО СписокФизлиц.Период = Гражданство.ПериодРегистрации
    |			И СписокФизлиц.ФизЛицо = Гражданство.Физлицо
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
    |		ПО СписокФизлиц.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
    |			И СписокФизлиц.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
    |			И СписокФизлиц.ГоловнаяОрганизация = ПринятыеПоДолгосрочнымДоговорам.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавокНаРаботахСДосрочнойПенсией КАК РазмерыТарифныхСтавокНаРаботахСДосрочнойПенсией
    |		ПО (ГОД(СписокФизлиц.Период) = РазмерыТарифныхСтавокНаРаботахСДосрочнойПенсией.РасчетныйПериод)
    |
    |СГРУППИРОВАТЬ ПО
    |	СписокФизлиц.ФизЛицо,
    |	СписокФизлиц.Период,
    |	СписокФизлиц.Организация,
    |	ВЫБОР
    |		КОГДА СписокФизлиц.Период < &ДатаСтрахованияВсехВременноПребывающих
    |			ТОГДА ВЫБОР
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |						ТОГДА """"
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |						ТОГДА ""1""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |						ТОГДА ""2""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""4""
    |							КОНЕЦ
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |						ТОГДА ""5""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |						ТОГДА ""6""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""7""
    |							КОНЕЦ
    |					ИНАЧЕ """"
    |				КОНЕЦ
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |			ТОГДА """"
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |			ТОГДА ""1""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |			ТОГДА ""2""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |			ТОГДА ""3""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |			ТОГДА ""4""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |			ТОГДА ""5""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |			ТОГДА ""6""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС)
    |			ТОГДА ""7""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС)
    |			ТОГДА ""8""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |			ТОГДА ""9""
    |		ИНАЧЕ """"
    |	КОНЕЦ
    |
    |УПОРЯДОЧИТЬ ПО
    |	Год,
    |	Организация,
    |	ФизЛицо,
    |	Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ГОД(СписокФизЛиц.ПериодРегистрации) КАК Год,
    |	СписокФизЛиц.ОбособленноеПодразделение КАК Организация,
    |	СписокФизЛиц.ФизЛицо КАК ФизЛицо,
    |	СписокФизЛиц.ПериодРегистрации КАК ПериодРегистрации,
    |	ЕСТЬNULL(КодыТарифов.Код, ""??"") КАК ВидТарифаСтраховыхВзносов,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА СписокФизЛиц.Результат
    |			КОГДА СписокФизЛиц.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
    |				ТОГДА СписокФизЛиц.Скидка
    |			КОГДА СписокФизЛиц.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
    |				ТОГДА СписокФизЛиц.Скидка
    |			КОГДА СписокФизЛиц.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
    |				ТОГДА СписокФизЛиц.Скидка
    |			КОГДА СписокФизЛиц.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
    |				ТОГДА СписокФизЛиц.Скидка
    |			ИНАЧЕ СписокФизЛиц.Результат
    |		КОНЕЦ) КАК Сумма,
    |	ВЫБОР
    |		КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |				И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |			ТОГДА ""Доходы иностр. граждан (лиц без гр-ва), временно пребывающих на территории РФ (п. 15 ч. 1 ст. 9)""
    |		ИНАЧЕ СписокФизЛиц.ВидДохода
    |	КОНЕЦ КАК ВидДохода
    |ИЗ
    |	ВТДоходыВзносов КАК СписокФизЛиц
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |		ПО СписокФизЛиц.ФизЛицо = Гражданство.Физлицо
    |			И СписокФизЛиц.ПериодРегистрации = Гражданство.ПериодРегистрации
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
    |		ПО СписокФизЛиц.ПериодРегистрации = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
    |			И СписокФизЛиц.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
    |			И СписокФизЛиц.Организация = ПринятыеПоДолгосрочнымДоговорам.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКодыТарифов КАК КодыТарифов
    |		ПО СписокФизЛиц.ВидТарифаСтраховыхВзносов = КодыТарифов.ВидТарифаСтраховыхВзносов
    |			И (ГОД(СписокФизЛиц.ПериодРегистрации) МЕЖДУ КодыТарифов.ГодС И КодыТарифов.ГодПо)
    |ГДЕ
    |	СписокФизЛиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
    |	И СписокФизЛиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеСодержаниеПрокуроров)
    |	И СписокФизЛиц.ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям)
    |	И ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ""Доходы иностр. граждан (лиц без гр-ва), временно пребывающих на территории РФ (п. 15 ч. 1 ст. 9)""
    |			ИНАЧЕ СписокФизЛиц.ВидДохода
    |		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом)
    |	И СписокФизЛиц.СтрокиРегистра
    |
    |СГРУППИРОВАТЬ ПО
    |	СписокФизЛиц.ОбособленноеПодразделение,
    |	СписокФизЛиц.ФизЛицо,
    |	СписокФизЛиц.ПериодРегистрации,
    |	ЕСТЬNULL(КодыТарифов.Код, ""??""),
    |	ВЫБОР
    |		КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |				И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |			ТОГДА ""Доходы иностр. граждан (лиц без гр-ва), временно пребывающих на территории РФ (п. 15 ч. 1 ст. 9)""
    |		ИНАЧЕ СписокФизЛиц.ВидДохода
    |	КОНЕЦ
    |
    |УПОРЯДОЧИТЬ ПО
    |	Год,
    |	Организация,
    |	ФизЛицо,
    |	ВидТарифаСтраховыхВзносов УБЫВ,
    |	ВидДохода,
    |	ПериодРегистрации
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ГОД(СписокФизЛиц.Период) КАК Год,
    |	СписокФизЛиц.Организация КАК Организация,
    |	СписокФизЛиц.ОрганизацияКПП КАК КПП,
    |	СписокФизЛиц.ОрганизацияИНН КАК ИННОрг,
    |	СписокФизЛиц.ОрганизацияНаименование КАК НаименованиеОрганизации,
    |	ЕСТЬNULL(ФИООтветственных.ФИО, """") КАК ФИОГлБух,
    |	ЕСТЬNULL(ФИОФизлиц.Фамилия + ФИОФизлиц.Имя + ФИОФизлиц.Отчество, СписокФизЛиц.ФизЛицоНаименование) КАК АлфавитныйПорядок,
    |	СписокФизЛиц.ФизЛицо КАК ФизЛицо,
    |	СписокФизЛиц.ФизЛицоИНН КАК ИНН,
    |	СписокФизЛиц.ФизЛицоСтраховойНомерПФР КАК СтраховойНомерПФР,
    |	СписокФизЛиц.ФизЛицоДатаРождения КАК ДатаРождения,
    |	ВЫБОР
    |		КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВсехВременноПребывающих
    |			ТОГДА ВЫБОР
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |						ТОГДА """"
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |						ТОГДА ""1""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |						ТОГДА ""2""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""4""
    |							КОНЕЦ
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |						ТОГДА ""5""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |						ТОГДА ""6""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""7""
    |							КОНЕЦ
    |					ИНАЧЕ """"
    |				КОНЕЦ
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |			ТОГДА """"
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |			ТОГДА ""1""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |			ТОГДА ""2""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |			ТОГДА ""3""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |			ТОГДА ""4""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |			ТОГДА ""5""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |			ТОГДА ""6""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС)
    |			ТОГДА ""7""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС)
    |			ТОГДА ""8""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |			ТОГДА ""9""
    |		ИНАЧЕ """"
    |	КОНЕЦ КАК СтатусЗастрахованного,
    |	ЕСТЬNULL(КодыТарифов.Код, ""??"") КАК ВидТарифаСтраховыхВзносов,
    |	СписокФизЛиц.Период КАК ПериодРегистрации,
    |	СУММА(ЕСТЬNULL(Взносы.ПФРПоСуммарномуТарифу, 0)) - СУММА(ВЫБОР
    |			КОГДА СписокФизЛиц.Период >= &ДатаВыделенияВзносовНаОПСсСуммПревышения
    |				ТОГДА ЕСТЬNULL(Взносы.ПФРСПревышения, 0)
    |			КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВременноПребывающих
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Взносы.ПФРПоСуммарномуТарифу, 0) = 0
    |				ТОГДА 0
    |			КОГДА НЕ ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(БазаДляОтчета.НалоговаяБазаПФР, 0) = 0
    |					И ЕСТЬNULL(БазаПревышенияДохода.СуммаПревысившаяПредел, 0) <> 0
    |				ТОГДА ЕСТЬNULL(Взносы.ПФРПоСуммарномуТарифу, 0)
    |			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(БазаПревышенияДохода.СуммаПревысившаяПредел, 0) / 10 КАК ЧИСЛО(15, 2))
    |		КОНЕЦ) КАК ИсчисленоПФРПоСуммарномуТарифу,
    |	СУММА(ЕСТЬNULL(Взносы.ПФРСтраховая, 0)) - СУММА(ВЫБОР
    |			КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВременноПребывающих
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Взносы.ПФРСтраховая, 0) = 0
    |				ТОГДА 0
    |			КОГДА НЕ ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(БазаДляОтчета.НалоговаяБазаПФР, 0) = 0
    |					И ЕСТЬNULL(БазаПревышенияДохода.СуммаПревысившаяПредел, 0) <> 0
    |				ТОГДА ЕСТЬNULL(Взносы.ПФРСтраховая, 0)
    |			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(БазаПревышенияДохода.СуммаПревысившаяПредел, 0) / 10 КАК ЧИСЛО(15, 2))
    |		КОНЕЦ) КАК ИсчисленоПФРСтраховых,
    |	СУММА(ЕСТЬNULL(Взносы.ПФРНакопительная, 0)) КАК ИсчисленоПФРНакопительная,
    |	СУММА(ВЫБОР
    |			КОГДА СписокФизЛиц.Период >= &ДатаВыделенияВзносовНаОПСсСуммПревышения
    |				ТОГДА ЕСТЬNULL(Взносы.ПФРСПревышения, 0)
    |			КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВременноПребывающих
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(Взносы.ПФРСтраховая, 0) = 0
    |					И ЕСТЬNULL(Взносы.ПФРПоСуммарномуТарифу, 0) = 0
    |				ТОГДА 0
    |			КОГДА НЕ ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА ЕСТЬNULL(БазаДляОтчета.НалоговаяБазаПФР, 0) = 0
    |					И ЕСТЬNULL(БазаПревышенияДохода.СуммаПревысившаяПредел, 0) <> 0
    |				ТОГДА ЕСТЬNULL(Взносы.ПФРСтраховая, 0) + ЕСТЬNULL(Взносы.ПФРПоСуммарномуТарифу, 0)
    |			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(БазаПревышенияДохода.СуммаПревысившаяПредел, 0) / 10 КАК ЧИСЛО(15, 2))
    |		КОНЕЦ) КАК ИсчисленоПФРССуммПревышения,
    |	СУММА(ЕСТЬNULL(Взносы.ПФРПоДополнительномуТарифу, 0)) КАК ИсчисленоПФРПоДополнительномуТарифу,
    |	СУММА(ЕСТЬNULL(Взносы.ПФРНаДоплатуКПенсииШахтерам, 0)) КАК ИсчисленоПФРНаДоплатуКПенсииШахтерам,
    |	СУММА(ЕСТЬNULL(Взносы.ФСС, 0)) КАК ИсчисленоФСС,
    |	СУММА(ЕСТЬNULL(Взносы.ФФОМС, 0)) КАК ИсчисленоФФОМС,
    |	СУММА(ЕСТЬNULL(Взносы.ТФОМС, 0)) КАК ИсчисленоТФОМС,
    |	СУММА(ЕСТЬNULL(БазаДляОтчета.НачисленоВсего, 0)) КАК НачисленоВсего,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(БазаДляОтчета.РасходыПоАвторским, 0)
    |		КОНЕЦ) КАК РасходыПоАвторским,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА ЕСТЬNULL(БазаДляОтчета.НачисленоВсего, 0)
    |			ИНАЧЕ ЕСТЬNULL(БазаДляОтчета.НеОблагается, 0)
    |		КОНЕЦ) КАК НеОблагается,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФСС, ЛОЖЬ)
    |				ТОГДА 0
    |			КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВсехВременноПребывающих
    |				ТОГДА ЕСТЬNULL(БазаДляОтчета.Пособие, 0)
    |			КОГДА ПервыйТариф.КодТарифа ЕСТЬ NULL 
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(ИтогиПособий.Сумма, 0)
    |		КОНЕЦ) КАК Пособия,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(БазаДляОтчета.ВыплатыПрокуроров, 0)
    |		КОНЕЦ) КАК ВыплатыПрокуроров,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(БазаДляОтчета.ВыплатыПоДоговорам, 0)
    |		КОНЕЦ) КАК ВыплатыПоДоговорам,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(БазаДляОтчета.НалоговаяБазаПФР, 0)
    |		КОНЕЦ) КАК НалоговаяБазаПФР,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФСС, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(БазаДляОтчета.НалоговаяБазаФСС, 0)
    |		КОНЕЦ) КАК НалоговаяБазаФСС,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(БазаДляОтчета.НалоговаяБазаФОМС, 0)
    |		КОНЕЦ) КАК НалоговаяБазаФОМС,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеПФР, ЛОЖЬ)
    |					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(БазаПревышенияДохода.СуммаПревысившаяПредел, 0)
    |		КОНЕЦ) КАК ПревышениеПредельнойВеличины,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(ПревышениеДоходаФОМС.СуммаПревысившаяПредел, 0)
    |		КОНЕЦ) КАК ПревышениеПредельнойВеличиныФОМС,
    |	СУММА(ВЫБОР
    |			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФСС, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)
    |		КОНЕЦ) КАК ПревышениеПредельнойВеличиныФСС,
    |	ВЫБОР
    |		КОГДА Гражданство.Страна ЕСТЬ NULL 
    |				ИЛИ Гражданство.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
    |			ТОГДА ""Гражданин РФ""
    |		КОГДА Гражданство.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
    |			ТОГДА ""Лицо без гражданства""
    |		ИНАЧЕ Гражданство.Страна
    |	КОНЕЦ КАК Гражданство,
    |	ФИОФизлиц.Фамилия КАК Фамилия,
    |	ФИОФизлиц.Имя КАК Имя,
    |	ФИОФизлиц.Отчество КАК Отчество,
    |	ВЫБОР
    |		КОГДА СправкиОбИнвалидности.Инвалидность ЕСТЬ NULL 
    |			ТОГДА ЛОЖЬ
    |		ИНАЧЕ СправкиОбИнвалидности.Инвалидность
    |	КОНЕЦ КАК ЕстьИнвалидность,
    |	СправкиОбИнвалидности.ДатаВыдачи КАК ДатаВыдачи,
    |	СправкиОбИнвалидности.СрокДействияСправки КАК СрокДействияСправки,
    |	МАКСИМУМ(ВЫБОР
    |			КОГДА ГОД(СписокФизЛиц.ФизЛицоДатаРождения) < 1967
    |				ТОГДА ТарифныеСтавки.ПФР
    |			КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВременноПребывающих
    |				ТОГДА ТарифныеСтавки.ПФР - ТарифныеСтавки.ПФРНакопительная
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |				ТОГДА ТарифныеСтавки.ПФР
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |				ТОГДА ТарифныеСтавки.ПФР
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |				ТОГДА ТарифныеСтавки.ПФР
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |				ТОГДА ТарифныеСтавки.ПФР
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |				ТОГДА ТарифныеСтавки.ПФР
    |			ИНАЧЕ ТарифныеСтавки.ПФР - ТарифныеСтавки.ПФРНакопительная
    |		КОНЕЦ) КАК СЧ,
    |	МАКСИМУМ(ВЫБОР
    |			КОГДА ГОД(СписокФизЛиц.ФизЛицоДатаРождения) < 1967
    |				ТОГДА 0
    |			КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВременноПребывающих
    |				ТОГДА ТарифныеСтавки.ПФРНакопительная
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |				ТОГДА 0
    |			КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |				ТОГДА 0
    |			ИНАЧЕ ТарифныеСтавки.ПФРНакопительная
    |		КОНЕЦ) КАК НЧ,
    |	МАКСИМУМ(ВЫБОР
    |			КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВременноПребывающих
    |				ТОГДА 0
    |			КОГДА НЕ ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
    |				ТОГДА 0
    |			ИНАЧЕ 10
    |		КОНЕЦ) КАК ТарифСПревышения,
    |	МАКСИМУМ(ТарифныеСтавки.ФСС) КАК ФСС,
    |	МАКСИМУМ(ТарифныеСтавки.ФФОМС) КАК ФФОМС,
    |	МАКСИМУМ(ТарифныеСтавки.ТФОМС) КАК ТФОМС
    |ИЗ
    |	ВТПериодыФизлицаСтавки КАК СписокФизЛиц
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТКодыТарифов КАК КодыТарифов
    |		ПО СписокФизЛиц.ВидТарифа = КодыТарифов.ВидТарифаСтраховыхВзносов
    |			И (ГОД(СписокФизЛиц.Период) МЕЖДУ КодыТарифов.ГодС И КодыТарифов.ГодПо)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
    |		ПО СписокФизЛиц.ВидТарифа = ОписаниеТарифов.ВидТарифа
    |			И (ОписаниеТарифов.РасчетныйПериод = ГОД(СписокФизЛиц.Период))
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
    |		ПО СписокФизЛиц.Период = Гражданство.ПериодРегистрации
    |			И СписокФизЛиц.ФизЛицо = Гражданство.Физлицо
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
    |		ПО СписокФизЛиц.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
    |			И СписокФизЛиц.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
    |			И СписокФизЛиц.ГоловнаяОрганизация = ПринятыеПоДолгосрочнымДоговорам.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИОФизлиц КАК ФИОФизлиц
    |		ПО СписокФизЛиц.ФизЛицо = ФИОФизлиц.ФизЛицо
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВзносы КАК Взносы
    |		ПО СписокФизЛиц.ФизЛицо = Взносы.ФизЛицо
    |			И СписокФизЛиц.Организация = Взносы.Организация
    |			И СписокФизЛиц.ВидТарифа = Взносы.ВидТарифаСтраховыхВзносов
    |			И СписокФизЛиц.Период = Взносы.ПериодРегистрации
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаДляОтчета КАК БазаДляОтчета
    |		ПО СписокФизЛиц.ФизЛицо = БазаДляОтчета.ФизЛицо
    |			И СписокФизЛиц.Организация = БазаДляОтчета.Организация
    |			И СписокФизЛиц.ВидТарифа = БазаДляОтчета.ВидТарифаСтраховыхВзносов
    |			И СписокФизЛиц.Период = БазаДляОтчета.ПериодРегистрации
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК ТарифныеСтавки
    |		ПО (ГОД(СписокФизЛиц.Период) = ТарифныеСтавки.РасчетныйПериод)
    |			И (ТарифныеСтавки.ВидТарифа = СписокФизЛиц.ВидТарифа)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСправкиОбИнвалидности КАК СправкиОбИнвалидности
    |		ПО СписокФизЛиц.ФизЛицо = СправкиОбИнвалидности.Физлицо
    |			И (ГОД(СписокФизЛиц.Период) = СправкиОбИнвалидности.РасчетныйПериод)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветственные КАК Ответственные
    |			ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственных КАК ФИООтветственных
    |			ПО Ответственные.ФизическоеЛицо = ФИООтветственных.ФизЛицо
    |		ПО СписокФизЛиц.Организация = Ответственные.Организация
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК БазаПревышенияДохода
    |		ПО СписокФизЛиц.ФизЛицо = БазаПревышенияДохода.ФизЛицо
    |			И СписокФизЛиц.Организация = БазаПревышенияДохода.ОбособленноеПодразделение
    |			И СписокФизЛиц.Период = БазаПревышенияДохода.Период
    |			И СписокФизЛиц.ВидТарифа = БазаПревышенияДохода.ВидТарифаСтраховыхВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФОМС КАК ПревышениеДоходаФОМС
    |		ПО СписокФизЛиц.ФизЛицо = ПревышениеДоходаФОМС.ФизЛицо
    |			И СписокФизЛиц.Организация = ПревышениеДоходаФОМС.ОбособленноеПодразделение
    |			И СписокФизЛиц.Период = ПревышениеДоходаФОМС.Период
    |			И СписокФизЛиц.ВидТарифа = ПревышениеДоходаФОМС.ВидТарифаСтраховыхВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
    |		ПО СписокФизЛиц.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
    |			И СписокФизЛиц.Организация = ПревышениеДоходаФСС.ОбособленноеПодразделение
    |			И СписокФизЛиц.Период = ПревышениеДоходаФСС.Период
    |			И СписокФизЛиц.ВидТарифа = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПервыйТариф КАК ПервыйТариф
    |		ПО СписокФизЛиц.ФизЛицо = ПервыйТариф.ФизЛицо
    |			И СписокФизЛиц.Организация = ПервыйТариф.Организация
    |			И (ГОД(СписокФизЛиц.Период) = ПервыйТариф.Год)
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогиПособий КАК ИтогиПособий
    |		ПО СписокФизЛиц.ФизЛицо = ИтогиПособий.Физлицо
    |			И СписокФизЛиц.Организация = ИтогиПособий.Организация
    |			И СписокФизЛиц.Период = ИтогиПособий.Период
    |ГДЕ
    |	(БазаДляОтчета.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
    |			ИЛИ Взносы.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL )
    |
    |СГРУППИРОВАТЬ ПО
    |	СписокФизЛиц.Организация,
    |	СписокФизЛиц.ОрганизацияКПП,
    |	СписокФизЛиц.ОрганизацияИНН,
    |	СписокФизЛиц.ОрганизацияНаименование,
    |	ЕСТЬNULL(ФИООтветственных.ФИО, """"),
    |	СписокФизЛиц.ФизЛицо,
    |	СписокФизЛиц.Период,
    |	ВЫБОР
    |		КОГДА Гражданство.Страна ЕСТЬ NULL 
    |				ИЛИ Гражданство.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
    |			ТОГДА ""Гражданин РФ""
    |		КОГДА Гражданство.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
    |			ТОГДА ""Лицо без гражданства""
    |		ИНАЧЕ Гражданство.Страна
    |	КОНЕЦ,
    |	ФИОФизлиц.Фамилия,
    |	ФИОФизлиц.Имя,
    |	ФИОФизлиц.Отчество,
    |	ВЫБОР
    |		КОГДА СправкиОбИнвалидности.Инвалидность ЕСТЬ NULL 
    |			ТОГДА ЛОЖЬ
    |		ИНАЧЕ СправкиОбИнвалидности.Инвалидность
    |	КОНЕЦ,
    |	СправкиОбИнвалидности.ДатаВыдачи,
    |	СправкиОбИнвалидности.СрокДействияСправки,
    |	ГОД(СписокФизЛиц.Период),
    |	ЕСТЬNULL(ФИОФизлиц.Фамилия + ФИОФизлиц.Имя + ФИОФизлиц.Отчество, СписокФизЛиц.ФизЛицоНаименование),
    |	СписокФизЛиц.ФизЛицоИНН,
    |	СписокФизЛиц.ФизЛицоСтраховойНомерПФР,
    |	СписокФизЛиц.ФизЛицоДатаРождения,
    |	ЕСТЬNULL(КодыТарифов.Код, ""??""),
    |	ВЫБОР
    |		КОГДА СписокФизЛиц.Период < &ДатаСтрахованияВсехВременноПребывающих
    |			ТОГДА ВЫБОР
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |						ТОГДА """"
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |						ТОГДА ""1""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |						ТОГДА ""2""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""4""
    |							КОНЕЦ
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |						ТОГДА ""5""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |						ТОГДА ""6""
    |					КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |						ТОГДА ВЫБОР
    |								КОГДА ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
    |									ТОГДА ""3""
    |								ИНАЧЕ ""7""
    |							КОНЕЦ
    |					ИНАЧЕ """"
    |				КОНЕЦ
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)
    |			ТОГДА """"
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ПостоянноПроживающиеИностранцы)
    |			ТОГДА ""1""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
    |			ТОГДА ""2""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
    |			ТОГДА ""3""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
    |			ТОГДА ""4""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие)
    |			ТОГДА ""5""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
    |			ТОГДА ""6""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС)
    |			ТОГДА ""7""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС)
    |			ТОГДА ""8""
    |		КОГДА Гражданство.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
    |			ТОГДА ""9""
    |		ИНАЧЕ """"
    |	КОНЕЦ
    |
    |УПОРЯДОЧИТЬ ПО
    |	Год,
    |	Организация,
    |	АлфавитныйПорядок,
    |	ФизЛицо,
    |	ВидТарифаСтраховыхВзносов УБЫВ,
    |	ПериодРегистрации";							   

	ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	
	
	Если Не УчитыватьОбособленноеПодразделение тогда
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.Организация КАК Организация", "СписокФизЛиц.ГоловнаяОрганизация КАК Организация");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"Пособия.Организация КАК Организация", "Пособия.ГоловнаяОрганизация КАК Организация");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"Пособия.Организация,", "Пособия.ГоловнаяОрганизация,");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОрганизацияКПП КАК КПП",	"СписокФизЛиц.ГоловнаяОрганизацияКПП КАК КПП");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОрганизацияИНН КАК ИННОрг", "СписокФизЛиц.ГоловнаяОрганизацияИНН КАК ИННОрг");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОрганизацияНаименование КАК НаименованиеОрганизации", "СписокФизЛиц.ГоловнаяОрганизацияНаименование КАК НаименованиеОрганизации");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.Организация,", "СписокФизЛиц.ГоловнаяОрганизация,");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОрганизацияКПП,", "СписокФизЛиц.ГоловнаяОрганизацияКПП,");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОрганизацияИНН,", "СписокФизЛиц.ГоловнаяОрганизацияИНН,");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОрганизацияНаименование,", "СписокФизЛиц.ГоловнаяОрганизацияНаименование,");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОбособленноеПодразделение КАК Организация", "СписокФизЛиц.Организация КАК Организация");
		ДанныеРасчетаТекст = СтрЗаменить(ДанныеРасчетаТекст,"СписокФизЛиц.ОбособленноеПодразделение,", "СписокФизЛиц.Организация,");
	КонецЕсли;
	
	//-----------------------------------------------------------------------------
	// ВЫПОЛНЕНИЕ ЗАПРОСОВ
	
	// Данные расчета
	Запрос.Текст = ДанныеРасчетаТекст;
	МассивЗапросов = Запрос.ВыполнитьПакет();
	Выборка = МассивЗапросов[МассивЗапросов.Количество() - 1].Выбрать();
	ВыборкаДоходов = МассивЗапросов[МассивЗапросов.Количество() - 2].Выбрать();
	ВыборкаДопВзносов = МассивЗапросов[МассивЗапросов.Количество() - 3].Выбрать();
	ОснованияВыплатЗаСчетФедеральногоБюджета = МассивЗапросов[МассивЗапросов.Количество() - 4].Выгрузить();
	ВыборкаНСиПЗ = МассивЗапросов[МассивЗапросов.Количество() - 5].Выбрать();
	ВыборкаПособий = МассивЗапросов[МассивЗапросов.Количество() - 6].Выбрать();
	ТаблицаДоговоров = МассивЗапросов[МассивЗапросов.Количество() - 7].Выгрузить();
	
	//-----------------------------------------------------------------------------
	// ЗАПОЛНЕНИЕ ФОРМЫ
	
	// Области макета
	
	Макет2010 =	ПолучитьМакет("КарточкаСтраховыхВзносов");
	Макет2012 =	ПолучитьМакет("КарточкаСтраховыхВзносов2012");
	Макет2013 =	ПолучитьМакет("КарточкаСтраховыхВзносов2013");
	Макет2014 =	ПолучитьМакет("КарточкаСтраховыхВзносов2014");
	Макет2015 =	ПолучитьМакет("КарточкаСтраховыхВзносов2015");
	Макет2017 =	ПолучитьМакет("КарточкаСтраховыхВзносов2017");
	
	СНачалаГода = Новый Структура("НарастНачисленоВсего, 
								|	НарастПревышениеПредельнойВеличины, 
								|	НарастПревышениеПредельнойВеличиныФОМС, 
								|	НарастПревышениеПредельнойВеличиныФСС, 
								|	НарастРасходыПоАвторским, 
								|	НарастНеОблагается, 
								|	НарастПособия, 
								|	НарастВыплатыПрокуроров,
								|	НарастВыплатыПоДоговорам,
								|	НарастНалоговаяБазаПФР,
								|	НарастНалоговаяБазаФСС,
								|	НарастНалоговаяБазаФОМС,
								|	НарастИсчисленоПФРПоСуммарномуТарифу,
								|	НарастИсчисленоПФРСтраховых,
								|	НарастИсчисленоПФРНакопительная,
								|	НарастИсчисленоПФРССуммПревышения,
								|	НарастИсчисленоПФРПоДополнительномуТарифу,
								|	НарастИсчисленоПФРНаДоплатуКПенсииШахтерам,
								|	НарастИсчисленоФСС,
								|	НарастИсчисленоФФОМС,
								|	НарастИсчисленоТФОМС");
	
	СтруктураПоискаДоходовПоТарифу = Новый Структура("Год, Организация, ФизЛицо, ВидТарифаСтраховыхВзносов");
	СтруктураПоискаДопВзносов = Новый Структура("Год, Организация, ФизЛицо");
	
	ИспользуютсяРаботыСДосрочнойПенсией = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуВсехОрганизаций(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), "ИспользуютсяРаботыСДосрочнойПенсией");
	ВыводитьДоплатуШахтерам = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуВсехОрганизаций(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), "ИспользуетсяТрудШахтеров");
	ВыводитьДоплатуЧленамЛетныхЭкипажей = ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуВсехОрганизаций(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), "ИспользуетсяТрудЧленовЛетныхЭкипажей");
	
	СтруктураПоискаПособий = Новый Структура("Организация,ФизЛицо,Год");
	СтруктураПоискаПособийПоВидам = Новый Структура("Организация,ФизЛицо,ВидПособияСоциальногоСтрахования");
	СтруктураПоискаДоговоров = Новый Структура("Организация,ФизЛицо");
	СтруктураДанныхДоговора = Новый Структура("ЭтоТрудовойДоговор,ЭтоДоговорГПХ,ЭтоАвторскийДоговор,НомерЕдинственногоДоговора,ДатаЕдинственногоДоговора");
	
	Пока Выборка.СледующийПоЗначениюПоля("Год") Цикл
		
		// Внешний вид карточки меняется с течением лет
		ЭтоФорма2012Года = Выборка.Год = 2012;
		ЭтоФорма2013Года = Выборка.Год > 2012 И Выборка.Год < Год(РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР());
		ЭтоФорма2014Года = Выборка.Год = Год(РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР());
		ЭтоФорма2015Года = Выборка.Год >= РасчетСтраховыхВзносов.ГодРазделенияПредельныхОблагаемыхБаз() И Выборка.Год < Год(РасчетСтраховыхВзносов.ДатаПередачиАдминистрированияВзносовФНС());
		ЭтоФорма2017Года = Выборка.Год >= Год(РасчетСтраховыхВзносов.ДатаПередачиАдминистрированияВзносовФНС());
		ЭтоФорма2010Года = Ложь;
		Если ЭтоФорма2017Года Тогда
			Макет = Макет2017	
		ИначеЕсли ЭтоФорма2015Года Тогда
			Макет = Макет2015	
		ИначеЕсли ЭтоФорма2014Года Тогда
			Макет = Макет2014	
		ИначеЕсли ЭтоФорма2013Года Тогда
			Макет = Макет2013	
		ИначеЕсли ЭтоФорма2012Года Тогда
			Макет = Макет2012	
		Иначе 	
			ЭтоФорма2010Года = Истина;
			Макет = Макет2010	
		КонецЕсли;
		
		ВыводитьСтраницыПособий = ЭтоФорма2015Года Или ЭтоФорма2017Года;
		ВыводитьСтраницуДоговоров = ЭтоФорма2015Года;
		Если ВыводитьСтраницыПособий Тогда
			ОбластьШапкаСтраницыПособий = Макет.ПолучитьОбласть("ШапкаСтраницыПособий");
			ОбластьШапкаСтраницыПособийНСиПЗ = Макет.ПолучитьОбласть("ШапкаСтраницыПособийНСиПЗ");
			ОбластьНачалоСтрокиСтраницыПособий = Макет.ПолучитьОбласть("НачалоСтрокиСтраницыПособий");
			ОбластьПустойМесяцСтраницыПособий = Макет.ПолучитьОбласть("ПустойМесяцСтраницыПособий");
			ОбластьМесяцСтраницыПособий = Макет.ПолучитьОбласть("МесяцСтраницыПособий");
			ОбластьПустаяСтрокаПособий = Макет.ПолучитьОбласть("ПустаяСтрокаПособий");
			ОбластьНачалоСтрокиСтраницыПособийНСиПЗ = Макет.ПолучитьОбласть("НачалоСтрокиСтраницыПособийНСиПЗ");
			ОбластьПустойМесяцСтраницыПособийНСиПЗ = Макет.ПолучитьОбласть("ПустойМесяцСтраницыПособийНСиПЗ");
			ОбластьМесяцСтраницыПособийНСиПЗ = Макет.ПолучитьОбласть("МесяцСтраницыПособийНСиПЗ");
			ОбластьПустаяСтрокаПособийНСиПЗ = Макет.ПолучитьОбласть("ПустаяСтрокаПособийНСиПЗ");
			ОбластьПодвалСтраницыПособий = Макет.ПолучитьОбласть("ПодвалСтраницыПособий");
		КонецЕсли;
		Если ВыводитьСтраницуДоговоров Тогда
			ОбластьШапкаСтраницыДоговоров = Макет.ПолучитьОбласть("ШапкаСтраницыДоговоров");
			ОбластьСтрокаДоговора = Макет.ПолучитьОбласть("СтрокаДоговора");
		КонецЕсли;
		
		ОбластьПодвал     					= Макет.ПолучитьОбласть("Подвал");
		ОбластьШапкаВторойСтраницы			= Макет.ПолучитьОбласть("ШапкаВторойСтраницы");
		ОбластьНачалоСтрокиВторойСтраницы	= Макет.ПолучитьОбласть("НачалоСтрокиВторойСтраницы");
		ОбластьМесяцВторойСтраницы			= Макет.ПолучитьОбласть("МесяцВторойСтраницы");
		ОбластьПустойМесяцВторойСтраницы	= Макет.ПолучитьОбласть("ПустойМесяцВторойСтраницы");
		
		Пока Выборка.СледующийПоЗначениюПоля("Организация") Цикл
			
			ОбластьЗаглавие    = Макет.ПолучитьОбласть("Заглавие");
			ОбластьШапка       = Макет.ПолучитьОбласть("Шапка");
			ОбластьМесяц       = Макет.ПолучитьОбласть("Месяц");
			ОбластьПустойМесяц = Макет.ПолучитьОбласть("ПустойМесяц");
			
			ОбластьЗаглавие.Параметры.НалоговыйПериод = Формат(Выборка.Год,"ЧГ=");
			ОбластьЗаглавие.Параметры.ИННиКПП = СокрЛП(Выборка.ИННОрг) + "/" + СокрЛП(Выборка.КПП);
			ОбластьПодвал.Параметры.ФИОГлБух = Выборка.ФИОГлБух;
			
			ИспользуетсяТрудЧленовЛетныхЭкипажей = ЭтоФорма2010Года Или ЭтоФорма2012Года;
			ИспользуетсяТрудШахтеров = ЭтоФорма2010Года Или ЭтоФорма2012Года;
			Если ЭтоФорма2012Года Тогда // уточним формирование строк по летчикам и шахтерам
				УменьшениеВысоты = 0;
				ИспользуетсяТрудШахтеров = ВыводитьДоплатуШахтерам;
				Если Не ИспользуетсяТрудШахтеров Тогда
					ОбластьЗаглавие.УдалитьОбласть(ОбластьЗаглавие.Области.СтавкаШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьШапка.УдалитьОбласть(ОбластьШапка.Области.ШапкаШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьМесяц.УдалитьОбласть(ОбластьМесяц.Области.МесяцШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьПустойМесяц.УдалитьОбласть(ОбластьПустойМесяц.Области.ПустойМесяцШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					УменьшениеВысоты = УменьшениеВысоты + 2;
				КонецЕсли;
				ИспользуетсяТрудЧленовЛетныхЭкипажей = ВыводитьДоплатуЧленамЛетныхЭкипажей;
				Если Не ИспользуетсяТрудЧленовЛетныхЭкипажей Тогда
					ОбластьЗаглавие.УдалитьОбласть(ОбластьЗаглавие.Области.СтавкаЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьШапка.УдалитьОбласть(ОбластьШапка.Области.ШапкаЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьМесяц.УдалитьОбласть(ОбластьМесяц.Области.МесяцЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьПустойМесяц.УдалитьОбласть(ОбластьПустойМесяц.Области.ПустойМесяцЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					УменьшениеВысоты = УменьшениеВысоты + 2;
				КонецЕсли;
				Если УменьшениеВысоты > 0 Тогда
					ОбластьШапка = ОбластьШапка.ПолучитьОбласть(1, 1, ОбластьШапка.ВысотаТаблицы - УменьшениеВысоты, ОбластьШапка.ШиринаТаблицы);
					ОбластьМесяц = ОбластьМесяц.ПолучитьОбласть(1, 1, ОбластьМесяц.ВысотаТаблицы - УменьшениеВысоты, ОбластьМесяц.ШиринаТаблицы);
					ОбластьПустойМесяц = ОбластьПустойМесяц.ПолучитьОбласть(1, 1, ОбластьПустойМесяц.ВысотаТаблицы - УменьшениеВысоты, ОбластьПустойМесяц.ШиринаТаблицы);
				КонецЕсли;
			КонецЕсли;
			
			// Определим, надо ли выводить страницу по взносам за занятых на работах с досрочной пенсией, и подготовим ее области к использованию
			ВыводитьСтраницуДляЗанятыхНаРаботахСДосрочнойПенсией = Не (ЭтоФорма2010Года Или ЭтоФорма2012Года) И (ИспользуютсяРаботыСДосрочнойПенсией Или ВыводитьДоплатуЧленамЛетныхЭкипажей Или ВыводитьДоплатуШахтерам);
			Если ВыводитьСтраницуДляЗанятыхНаРаботахСДосрочнойПенсией Тогда 
				
				ОбластьЗаглавиеДопВзносов    = Макет.ПолучитьОбласть("ЗаглавиеСтраницыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией");
				ОбластьПодвалДопВзносов      = Макет.ПолучитьОбласть("ПодвалСтраницыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией");
				ОбластьШапкаДопВзносов       = Макет.ПолучитьОбласть("ШапкаСтраницыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией");
				ОбластьМесяцДопВзносов       = Макет.ПолучитьОбласть("МесяцСтраницыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией");
				ОбластьПустойМесяцДопВзносов = Макет.ПолучитьОбласть("ПустойМесяцСтраницыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией");
				
				УменьшениеВысоты = 0;
				Если Не ВыводитьДоплатуШахтерам Тогда
					ОбластьЗаглавиеДопВзносов.УдалитьОбласть(ОбластьЗаглавиеДопВзносов.Области.СтавкаШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьШапкаДопВзносов.УдалитьОбласть(ОбластьШапкаДопВзносов.Области.ШапкаШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьМесяцДопВзносов.УдалитьОбласть(ОбластьМесяцДопВзносов.Области.МесяцШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьПустойМесяцДопВзносов.УдалитьОбласть(ОбластьПустойМесяцДопВзносов.Области.ПустойМесяцШахтеров, ТипСмещенияТабличногоДокумента.ПоВертикали);
					УменьшениеВысоты = УменьшениеВысоты + 2;
				КонецЕсли;
				Если Не ВыводитьДоплатуЧленамЛетныхЭкипажей Тогда
					ОбластьЗаглавиеДопВзносов.УдалитьОбласть(ОбластьЗаглавиеДопВзносов.Области.СтавкаЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьШапкаДопВзносов.УдалитьОбласть(ОбластьШапкаДопВзносов.Области.ШапкаЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьМесяцДопВзносов.УдалитьОбласть(ОбластьМесяцДопВзносов.Области.МесяцЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьПустойМесяцДопВзносов.УдалитьОбласть(ОбластьПустойМесяцДопВзносов.Области.ПустойМесяцЛетчиков, ТипСмещенияТабличногоДокумента.ПоВертикали);
					УменьшениеВысоты = УменьшениеВысоты + 2;
				КонецЕсли;
				Если Не ВыводитьДоплатуШахтерам И Не ВыводитьДоплатуЧленамЛетныхЭкипажей Тогда
					ОбластьШапкаДопВзносов.УдалитьОбласть(ОбластьШапкаДопВзносов.Области.ШапкаБазыВзносовНаДоплатуКПенсии, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьМесяцДопВзносов.УдалитьОбласть(ОбластьМесяцДопВзносов.Области.МесяцБазыВзносовНаДоплатуКПенсии, ТипСмещенияТабличногоДокумента.ПоВертикали);
					ОбластьПустойМесяцДопВзносов.УдалитьОбласть(ОбластьПустойМесяцДопВзносов.Области.ПустойМесяцБазыВзносовНаДоплатуКПенсии, ТипСмещенияТабличногоДокумента.ПоВертикали);
					УменьшениеВысоты = УменьшениеВысоты + 2;
				КонецЕсли;
				Если УменьшениеВысоты > 0 Тогда
					ОбластьШапкаДопВзносов = ОбластьШапкаДопВзносов.ПолучитьОбласть(1, 1, ОбластьШапкаДопВзносов.ВысотаТаблицы - УменьшениеВысоты, ОбластьШапкаДопВзносов.ШиринаТаблицы);
					ОбластьМесяцДопВзносов = ОбластьМесяцДопВзносов.ПолучитьОбласть(1, 1, ОбластьМесяцДопВзносов.ВысотаТаблицы - УменьшениеВысоты, ОбластьМесяцДопВзносов.ШиринаТаблицы);
					ОбластьПустойМесяцДопВзносов = ОбластьПустойМесяцДопВзносов.ПолучитьОбласть(1, 1, ОбластьПустойМесяцДопВзносов.ВысотаТаблицы - УменьшениеВысоты, ОбластьПустойМесяцДопВзносов.ШиринаТаблицы);
				КонецЕсли;
				
			КонецЕсли;
			
			// Вывод данных в табличный документ
			Пока Выборка.СледующийПоЗначениюПоля("АлфавитныйПорядок") Цикл
				
				Пока Выборка.СледующийПоЗначениюПоля("ФизЛицо") Цикл
					
					НомерРаздела = 1;
					
					Если ВыводитьСтраницуДоговоров Тогда
						ЗаполнитьЗначенияСвойств(СтруктураПоискаДоговоров, Выборка);
						ДоговорыФизлица = ТаблицаДоговоров.Скопировать(ТаблицаДоговоров.НайтиСтроки(СтруктураПоискаДоговоров));
						Н = ДоговорыФизлица.Количество() - 1;
						Пока Н > 0 Цикл
							
							ТекущаяЗапись = ДоговорыФизлица[Н];
							ПредшествующаяЗапись = ДоговорыФизлица[Н-1];
							
							Если ТекущаяЗапись.ФизЛицо = ПредшествующаяЗапись.ФизЛицо // если совпадает физлицо
								И ТекущаяЗапись.ВидДоговора = ПредшествующаяЗапись.ВидДоговора
								И ТекущаяЗапись.НомерДоговора = ПредшествующаяЗапись.НомерДоговора
								И ТекущаяЗапись.ДатаЗаключенияДоговора = ПредшествующаяЗапись.ДатаЗаключенияДоговора
								И ТекущаяЗапись.ПериодС <= КонецДня(ПредшествующаяЗапись.ПериодПо)+1 // если записи идут друг за другом или пересекаются 
								Тогда
								// объединим записи в одну
								ПредшествующаяЗапись.ПериодПо = Макс(ТекущаяЗапись.ПериодПо, ПредшествующаяЗапись.ПериодПо); 
								ПредшествующаяЗапись.ПериодС = Мин(ТекущаяЗапись.ПериодС, ПредшествующаяЗапись.ПериодС); 
								ДоговорыФизлица.Удалить(ТекущаяЗапись);
							КонецЕсли;
							Н = Н - 1;
						КонецЦикла;
						СтруктураДанныхДоговора.ЭтоТрудовойДоговор = Ложь;
						СтруктураДанныхДоговора.ЭтоДоговорГПХ = Ложь;
						СтруктураДанныхДоговора.ЭтоАвторскийДоговор = Ложь;
						СтруктураДанныхДоговора.НомерЕдинственногоДоговора = "";
						СтруктураДанныхДоговора.ДатаЕдинственногоДоговора = "";
						Если ДоговорыФизлица.Количество() = 1 Тогда
							ВидДоговора = ДоговорыФизлица[0].ВидДоговора;
							СтруктураДанныхДоговора.ЭтоТрудовойДоговор = ВидДоговора = "Трудовой";
							СтруктураДанныхДоговора.ЭтоДоговорГПХ = ВидДоговора = "Гражданско-правовой";
							СтруктураДанныхДоговора.ЭтоАвторскийДоговор = ВидДоговора = "Авторский";
							СтруктураДанныхДоговора.НомерЕдинственногоДоговора = ДоговорыФизлица[0].НомерДоговора;
							СтруктураДанныхДоговора.ДатаЕдинственногоДоговора = ДоговорыФизлица[0].ДатаЗаключенияДоговора;
						ИначеЕсли ДоговорыФизлица.Количество() > 1 Тогда
							Для каждого СтрокаДоговора Из ДоговорыФизлица Цикл
								ВидДоговора = СтрокаДоговора.ВидДоговора;
								СтруктураДанныхДоговора.ЭтоТрудовойДоговор = СтруктураДанныхДоговора.ЭтоТрудовойДоговор Или ВидДоговора = "Трудовой";
								СтруктураДанныхДоговора.ЭтоДоговорГПХ = СтруктураДанныхДоговора.ЭтоДоговорГПХ Или ВидДоговора = "Гражданско-правовой";
								СтруктураДанныхДоговора.ЭтоАвторскийДоговор = СтруктураДанныхДоговора.ЭтоАвторскийДоговор Или ВидДоговора = "Авторский";
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					
					// основная страница карточки выводится в разрезе тарифов, по которым начислялись взносы
					Пока Выборка.СледующийПоЗначениюПоля("ВидТарифаСтраховыхВзносов") Цикл
						
						Если Не ЭтоФорма2017Года Тогда
							Если Выборка.ЕстьИнвалидность И (Выборка.ВидТарифаСтраховыхВзносов = "03" Или ВыводитьСтраницуДоговоров) Тогда
								ОбластьЗаглавие.Области.НЕТ.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии); 
								ОбластьЗаглавие.Области.ЕСТЬ.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1); 
							Иначе
								ОбластьЗаглавие.Области.ЕСТЬ.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии); 
								ОбластьЗаглавие.Области.НЕТ.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1); 
							КонецЕсли;
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(СтруктураПоискаДоходовПоТарифу, Выборка);
						
						ОбластьЗаглавие.Параметры.Заполнить(Выборка);
						ОбластьЗаглавие.Параметры.Заполнить(ВыборкаПревышения);
						ОбластьЗаглавие.Параметры.Заполнить(СтруктураДанныхДоговора);
						ОбластьЗаглавие.Параметры.НомерСтр = НомерРаздела;
						ОбластьЗаглавие.Параметры.КодТарифа = Выборка.ВидТарифаСтраховыхВзносов;
						
						ДокументРезультат.Вывести(ОбластьЗаглавие);
						ДокументРезультат.Вывести(ОбластьШапка);
						
						СНачалаГода.НарастНачисленоВсего = 0;
						СНачалаГода.НарастРасходыПоАвторским = 0;
						СНачалаГода.НарастНеОблагается = 0;
						СНачалаГода.НарастПревышениеПредельнойВеличины = 0;
						СНачалаГода.НарастПревышениеПредельнойВеличиныФОМС = 0;
						СНачалаГода.НарастПревышениеПредельнойВеличиныФСС = 0;
						СНачалаГода.НарастПособия = 0;
						СНачалаГода.НарастВыплатыПрокуроров = 0;
						СНачалаГода.НарастВыплатыПоДоговорам = 0;
						СНачалаГода.НарастНалоговаяБазаПФР = 0;
						СНачалаГода.НарастНалоговаяБазаФСС = 0;
						СНачалаГода.НарастНалоговаяБазаФОМС = 0;
						СНачалаГода.НарастИсчисленоПФРПоСуммарномуТарифу = 0;
						СНачалаГода.НарастИсчисленоПФРСтраховых = 0;
						СНачалаГода.НарастИсчисленоПФРНакопительная = 0;
						СНачалаГода.НарастИсчисленоПФРССуммПревышения = 0;
						СНачалаГода.НарастИсчисленоПФРПоДополнительномуТарифу = 0;
						СНачалаГода.НарастИсчисленоПФРНаДоплатуКПенсииШахтерам = 0;
						СНачалаГода.НарастИсчисленоФСС = 0;
						СНачалаГода.НарастИсчисленоФФОМС = 0;
						СНачалаГода.НарастИсчисленоТФОМС = 0;
						
						Месяц = 0;
						
						// Выводим данные за все 12 месяцев
						Пока Выборка.Следующий() Цикл
							
							МесяцНовый = Месяц(Выборка.ПериодРегистрации); // месяц, который выводим
							
							Если МесяцНовый > Месяц + 1 тогда
								Для СчМесяцев = Месяц + 1 По МесяцНовый - 1 Цикл
									ДокументРезультат.Присоединить(ОбластьПустойМесяц);
								КонецЦикла;	
							КонецЕсли;
							Месяц = МесяцНовый;
							
							ОбластьМесяц.Параметры.Заполнить(Выборка);
							
							СНачалаГода.НарастНачисленоВсего = СНачалаГода.НарастНачисленоВсего + ОбластьМесяц.Параметры.НачисленоВсего;
							СНачалаГода.НарастРасходыПоАвторским = СНачалаГода.НарастРасходыПоАвторским + ОбластьМесяц.Параметры.РасходыПоАвторским;
							СНачалаГода.НарастНеОблагается = СНачалаГода.НарастНеОблагается + ОбластьМесяц.Параметры.НеОблагается;
							СНачалаГода.НарастПревышениеПредельнойВеличины = СНачалаГода.НарастПревышениеПредельнойВеличины + ОбластьМесяц.Параметры.ПревышениеПредельнойВеличины;
							СНачалаГода.НарастПособия = СНачалаГода.НарастПособия + ОбластьМесяц.Параметры.Пособия;
							СНачалаГода.НарастВыплатыПрокуроров = СНачалаГода.НарастВыплатыПрокуроров + ОбластьМесяц.Параметры.ВыплатыПрокуроров;
							СНачалаГода.НарастВыплатыПоДоговорам = СНачалаГода.НарастВыплатыПоДоговорам + ОбластьМесяц.Параметры.ВыплатыПоДоговорам;
							СНачалаГода.НарастНалоговаяБазаПФР = СНачалаГода.НарастНалоговаяБазаПФР + ОбластьМесяц.Параметры.НалоговаяБазаПФР;
							СНачалаГода.НарастНалоговаяБазаФСС = СНачалаГода.НарастНалоговаяБазаФСС + ОбластьМесяц.Параметры.НалоговаяБазаФСС;
							СНачалаГода.НарастНалоговаяБазаФОМС = СНачалаГода.НарастНалоговаяБазаФОМС + ОбластьМесяц.Параметры.НалоговаяБазаФОМС;
							Если ИспользуетсяТрудЧленовЛетныхЭкипажей Тогда
								СНачалаГода.НарастИсчисленоПФРПоДополнительномуТарифу = СНачалаГода.НарастИсчисленоПФРПоДополнительномуТарифу + ОбластьМесяц.Параметры.ИсчисленоПФРПоДополнительномуТарифу;
							КонецЕсли;
							Если ИспользуетсяТрудШахтеров Тогда
								СНачалаГода.НарастИсчисленоПФРНаДоплатуКПенсииШахтерам = СНачалаГода.НарастИсчисленоПФРНаДоплатуКПенсииШахтерам + ОбластьМесяц.Параметры.ИсчисленоПФРНаДоплатуКПенсииШахтерам;
							КонецЕсли;
							СНачалаГода.НарастИсчисленоФСС = СНачалаГода.НарастИсчисленоФСС + ОбластьМесяц.Параметры.ИсчисленоФСС;
							СНачалаГода.НарастИсчисленоФФОМС = СНачалаГода.НарастИсчисленоФФОМС + ОбластьМесяц.Параметры.ИсчисленоФФОМС;
							Если ЭтоФорма2010Года Тогда
								СНачалаГода.НарастИсчисленоТФОМС = СНачалаГода.НарастИсчисленоТФОМС + ОбластьМесяц.Параметры.ИсчисленоТФОМС;
							ИначеЕсли ЭтоФорма2012Года Или ЭтоФорма2013Года Или ЭтоФорма2014Года Тогда
								СНачалаГода.НарастПревышениеПредельнойВеличиныФОМС = СНачалаГода.НарастПревышениеПредельнойВеличиныФОМС + ОбластьМесяц.Параметры.ПревышениеПредельнойВеличиныФОМС;
								СНачалаГода.НарастПревышениеПредельнойВеличиныФСС = СНачалаГода.НарастПревышениеПредельнойВеличиныФСС + ОбластьМесяц.Параметры.ПревышениеПредельнойВеличиныФСС;
								СНачалаГода.НарастИсчисленоПФРССуммПревышения = СНачалаГода.НарастИсчисленоПФРССуммПревышения + ОбластьМесяц.Параметры.ИсчисленоПФРССуммПревышения;
							Иначе	
								СНачалаГода.НарастПревышениеПредельнойВеличиныФСС = СНачалаГода.НарастПревышениеПредельнойВеличиныФСС + ОбластьМесяц.Параметры.ПревышениеПредельнойВеличиныФСС;
								СНачалаГода.НарастИсчисленоПФРССуммПревышения = СНачалаГода.НарастИсчисленоПФРССуммПревышения + ОбластьМесяц.Параметры.ИсчисленоПФРССуммПревышения;
							КонецЕсли;
							Если ЭтоФорма2010Года Или ЭтоФорма2012Года Или ЭтоФорма2013Года Тогда
								СНачалаГода.НарастИсчисленоПФРСтраховых = СНачалаГода.НарастИсчисленоПФРСтраховых + ОбластьМесяц.Параметры.ИсчисленоПФРСтраховых;
								СНачалаГода.НарастИсчисленоПФРНакопительная = СНачалаГода.НарастИсчисленоПФРНакопительная + ОбластьМесяц.Параметры.ИсчисленоПФРНакопительная;
							Иначе
								СНачалаГода.НарастИсчисленоПФРПоСуммарномуТарифу = СНачалаГода.НарастИсчисленоПФРПоСуммарномуТарифу + ОбластьМесяц.Параметры.ИсчисленоПФРПоСуммарномуТарифу;
							КонецЕсли;
							
							ОбластьМесяц.Параметры.Заполнить(СНачалаГода);
							
							// Выведем месяц
							ДокументРезультат.Присоединить(ОбластьМесяц);
							
						КонецЦикла; 
						
						Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
							Для СчМесяцев = Месяц + 1 По 12 Цикл
								// Выведем пустой месяц
								ДокументРезультат.Присоединить(ОбластьПустойМесяц);
							КонецЦикла;		
						КонецЕсли;
						
						ДокументРезультат.Вывести(ОбластьПодвал);
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						
						// Выведем необлагаемые доходы, если есть такие доходы
						ЗаголовокВыводили = Ложь;
						ВидДохода = "";
						Месяц = 0;
						
						ВыборкаДоходов.Сбросить();
						Пока ВыборкаДоходов.НайтиСледующий(СтруктураПоискаДоходовПоТарифу) Цикл
							Если Не ЗаголовокВыводили Тогда
								ОбластьШапкаВторойСтраницы.Параметры.Заполнить(ОбластьЗаглавие.Параметры);
								ДокументРезультат.Вывести(ОбластьШапкаВторойСтраницы);
								ЗаголовокВыводили = Истина;
							КонецЕсли;
							Если ВидДохода <> ВыборкаДоходов.ВидДохода Тогда
								
								Если ВидДохода <> "" Тогда
									Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
										Для СчМесяцев = Месяц + 1 По 12 Цикл
											// Выведем пустой месяц
											ДокументРезультат.Присоединить(ОбластьПустойМесяцВторойСтраницы);
										КонецЦикла;		
									КонецЕсли;
								КонецЕсли;
								
								ОбластьНачалоСтрокиВторойСтраницы.Параметры.ВидДохода = ВыборкаДоходов.ВидДохода;
								ДокументРезультат.Вывести(ОбластьНачалоСтрокиВторойСтраницы);
								ВидДохода = ВыборкаДоходов.ВидДохода;
								Месяц = 0;
							КонецЕсли;
							МесяцНовый = Месяц(ВыборкаДоходов.ПериодРегистрации); // месяц, который выводим
							
							Если МесяцНовый > Месяц + 1 тогда
								Для СчМесяцев = Месяц + 1 По МесяцНовый - 1 Цикл
									ДокументРезультат.Присоединить(ОбластьПустойМесяцВторойСтраницы);
								КонецЦикла;	
							КонецЕсли;
							
							Месяц = МесяцНовый;
							ОбластьМесяцВторойСтраницы.Параметры.НеОблагается = ВыборкаДоходов.Сумма;
							ДокументРезультат.Присоединить(ОбластьМесяцВторойСтраницы);
							
						КонецЦикла;
						
						Если ЗаголовокВыводили Тогда
							Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
								Для СчМесяцев = Месяц + 1 По 12 Цикл
									// Выведем пустой месяц
									ДокументРезультат.Присоединить(ОбластьПустойМесяцВторойСтраницы);
								КонецЦикла;		
							КонецЕсли;
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
						
						НомерРаздела = НомерРаздела + 1;
						
					КонецЦикла; 
					
					Если ВыводитьСтраницуДоговоров Тогда
						Если ДоговорыФизлица.Количество() > 1 Тогда
						
							ВременныйДокумент = Новый ТабличныйДокумент;
							
							ОбластьШапкаСтраницыДоговоров.Параметры.Заполнить(ОбластьЗаглавие.Параметры);
							ОбластьШапкаСтраницыДоговоров.Параметры.НомерСтр = НомерРаздела;
							ВременныйДокумент.Вывести(ОбластьШапкаСтраницыДоговоров);
							НомерРаздела = НомерРаздела + 1;
							
							Для каждого СтрокаДоговора Из ДоговорыФизлица Цикл
								ОбластьСтрокаДоговора.Параметры.Заполнить(СтрокаДоговора);
								ВременныйДокумент.Вывести(ОбластьСтрокаДоговора);
							КонецЦикла;
							
							ДокументРезультат.Вывести(ВременныйДокумент);
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							
						КонецЕсли;
					КонецЕсли;
					
					// страница по взносам за занятых на работах с досрочной пенсией не зависит от тарифа, но выводится не всегда
					Если ВыводитьСтраницуДляЗанятыхНаРаботахСДосрочнойПенсией Тогда 
						
						ЗаполнитьЗначенияСвойств(СтруктураПоискаДопВзносов, Выборка);
						СНачалаГодаДопВзносы = Новый Структура(
						"НарастНачисленоВсего, 
						|	НарастРасходыПоАвторским, 
						|	НарастНеОблагается, 
						|	НарастНалоговаяБазаПФР,
						|	НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботах, 
						|	НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
						|	НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
						|	НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботах, 
						|	НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
						|	НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
						|	НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 
						|	НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
						|	НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
						|	НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 
						|	НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
						|	НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
						|	НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 
						|	НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
						|	НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
						|	НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 
						|	НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
						|	НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
						|	НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 
						|	НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
						|	НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
						|	НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 
						|	НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
						|	НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
						|	НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 
						|	НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
						|	НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
						|	НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 
						|	НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
						|	НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
						|	НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 
						|	НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
						|	НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
						|	НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 
						|	НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 
						|	НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 
						|	НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
						|	НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
						|	НарастИсчисленоПФРПоДополнительномуТарифу,
						|	НарастИсчисленоПФРНаДоплатуКПенсииШахтерам");
						
						Для каждого Элемент Из СНачалаГодаДопВзносы Цикл
							СНачалаГодаДопВзносы.Вставить(Элемент.Ключ, 0)
						КонецЦикла;
						
						ЗаголовокВыводили = Ложь;
						Месяц = 0;
						ВременныйДокумент = Новый ТабличныйДокумент;
						
						ВыборкаДопВзносов.Сбросить();
						Пока ВыборкаДопВзносов.НайтиСледующий(СтруктураПоискаДопВзносов) Цикл
							
							Если Не ЗаголовокВыводили Тогда
								ОбластьЗаглавиеДопВзносов.Параметры.Заполнить(ОбластьЗаглавие.Параметры);
								ОбластьЗаглавиеДопВзносов.Параметры.Заполнить(ВыборкаДопВзносов);
								ОбластьЗаглавиеДопВзносов.Параметры.НомерСтр = НомерРаздела;
								ОбластьПодвалДопВзносов.Параметры.Заполнить(ОбластьПодвал.Параметры);
								ВременныйДокумент.Вывести(ОбластьЗаглавиеДопВзносов);
								ВременныйДокумент.Вывести(ОбластьШапкаДопВзносов);
								ЗаголовокВыводили = Истина;
							КонецЕсли;
							
							МесяцНовый = Месяц(ВыборкаДопВзносов.Период); // месяц, который выводим
							
							Если МесяцНовый > Месяц + 1 тогда
								Для СчМесяцев = Месяц + 1 По МесяцНовый - 1 Цикл
									ВременныйДокумент.Присоединить(ОбластьПустойМесяцДопВзносов);
								КонецЦикла;	
							КонецЕсли;
							
							Месяц = МесяцНовый;
							ОбластьМесяцДопВзносов.Параметры.Заполнить(ВыборкаДопВзносов);
							
							СНачалаГодаДопВзносы.НарастНачисленоВсего = СНачалаГодаДопВзносы.НарастНачисленоВсего + ОбластьМесяцДопВзносов.Параметры.НачисленоВсего;
							СНачалаГодаДопВзносы.НарастРасходыПоАвторским = СНачалаГодаДопВзносы.НарастРасходыПоАвторским + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторским;
							СНачалаГодаДопВзносы.НарастНеОблагается = СНачалаГодаДопВзносы.НарастНеОблагается + ОбластьМесяцДопВзносов.Параметры.НеОблагается;
							Если ВыводитьДоплатуЧленамЛетныхЭкипажей Или ВыводитьДоплатуШахтерам Тогда
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФР = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФР + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФР;
							КонецЕсли;
							Если ВыводитьДоплатуЧленамЛетныхЭкипажей Тогда
								СНачалаГодаДопВзносы.НарастИсчисленоПФРПоДополнительномуТарифу = СНачалаГодаДопВзносы.НарастИсчисленоПФРПоДополнительномуТарифу + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРПоДополнительномуТарифу;
							КонецЕсли;
							Если ВыводитьДоплатуШахтерам Тогда
								СНачалаГодаДопВзносы.НарастИсчисленоПФРНаДоплатуКПенсииШахтерам = СНачалаГодаДопВзносы.НарастИсчисленоПФРНаДоплатуКПенсииШахтерам + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРНаДоплатуКПенсииШахтерам;
							КонецЕсли;
							
							СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах;
							СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботах = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботах + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботах;
							СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах;
							СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботах;
							СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботах = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботах + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботах;
							
							СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах;
							СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботах = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботах + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботах;
							СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах;
							СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботах;
							СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботах = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботах + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботах;
							
							Если Не ЭтоФорма2013Года Тогда
								
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахОпасный = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахОпасный;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный;
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный;
								
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный1;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1;
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1;
								
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный2;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2;
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2;
								
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный3;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3;
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3;
								
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаПодземныхИВредныхРаботахВредный4;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4;
								СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 = СНачалаГодаДопВзносы.НарастНачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4;
								СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 = СНачалаГодаДопВзносы.НарастРасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.РасходыПоАвторскимЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4;
								СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 = СНачалаГодаДопВзносы.НарастНеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4;
								СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 = СНачалаГодаДопВзносы.НарастНалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.НалоговаяБазаПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4;
								СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 = СНачалаГодаДопВзносы.НарастИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 + ОбластьМесяцДопВзносов.Параметры.ИсчисленоПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4;
								
							КонецЕсли;
							
							ОбластьМесяцДопВзносов.Параметры.Заполнить(СНачалаГодаДопВзносы);
							
							ВременныйДокумент.Присоединить(ОбластьМесяцДопВзносов);
							
						КонецЦикла;
						
						Если ЗаголовокВыводили Тогда
							
							Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
								Для СчМесяцев = Месяц + 1 По 12 Цикл
									// Выведем пустой месяц
									ВременныйДокумент.Присоединить(ОбластьПустойМесяцДопВзносов);
								КонецЦикла;		
							КонецЕсли;
							
							Если Не ЭтоФорма2013Года Тогда
								УдалитьПустыеРазделыУсловийТруда(ВременныйДокумент)
							КонецЕсли;
							ВременныйДокумент.Вывести(ОбластьПодвалДопВзносов);
							
							ДокументРезультат.Вывести(ВременныйДокумент);
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							
							НомерРаздела = НомерРаздела + 1;
							
						КонецЕсли;
						
					КонецЕсли;
					
					// страница по расходам по соц.страхованию не зависит от тарифа, но выводится не всегда
					Если ВыводитьСтраницыПособий Тогда
						ЗаполнитьЗначенияСвойств(СтруктураПоискаПособий, Выборка);
						ЗаполнитьЗначенияСвойств(СтруктураПоискаПособийПоВидам, Выборка);
						СтрокиПособий = ОснованияВыплатЗаСчетФедеральногоБюджета.НайтиСтроки(СтруктураПоискаПособий);
						Если СтрокиПособий.Количество() > 0 Тогда
							
							ВременныйДокумент = Новый ТабличныйДокумент;
							
							ОбластьПодвалСтраницыПособий.Параметры.Заполнить(ОбластьПодвал.Параметры);
							
							ОбластьШапкаСтраницыПособий.Параметры.Заполнить(Выборка);
							ОбластьШапкаСтраницыПособий.Параметры.НомерСтр = НомерРаздела;
							ОбластьШапкаСтраницыПособий.Параметры.ЭтоЧернобыль = Ложь;
							ОбластьШапкаСтраницыПособий.Параметры.ЭтоСемипалатинск = Ложь;
							ОбластьШапкаСтраницыПособий.Параметры.ЭтоЗачетНестраховыхПериодов = Ложь;
							ОбластьШапкаСтраницыПособий.Параметры.ЭтоМаяк = Ложь;
							ОбластьШапкаСтраницыПособий.Параметры.ЭтоПодразделенияОсобогоРиска = Ложь;
							Для каждого СтрокаПособия Из СтрокиПособий Цикл
								ОбластьШапкаСтраницыПособий.Параметры.ЭтоЧернобыль = ОбластьШапкаСтраницыПособий.Параметры.ЭтоЧернобыль Или СтрокаПособия.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ВыплатыПособийЗаСчетФедеральногоБюджета.Чернобыль;
								ОбластьШапкаСтраницыПособий.Параметры.ЭтоСемипалатинск = ОбластьШапкаСтраницыПособий.Параметры.ЭтоСемипалатинск Или СтрокаПособия.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ВыплатыПособийЗаСчетФедеральногоБюджета.Семипалатинск;
								ОбластьШапкаСтраницыПособий.Параметры.ЭтоЗачетНестраховыхПериодов = ОбластьШапкаСтраницыПособий.Параметры.ЭтоЗачетНестраховыхПериодов Или СтрокаПособия.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ВыплатыПособийЗаСчетФедеральногоБюджета.ЗачетНестраховыхПериодов;
								ОбластьШапкаСтраницыПособий.Параметры.ЭтоМаяк = ОбластьШапкаСтраницыПособий.Параметры.ЭтоМаяк Или СтрокаПособия.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ВыплатыПособийЗаСчетФедеральногоБюджета.Маяк;
								ОбластьШапкаСтраницыПособий.Параметры.ЭтоПодразделенияОсобогоРиска = ОбластьШапкаСтраницыПособий.Параметры.ЭтоПодразделенияОсобогоРиска Или СтрокаПособия.ВыплатаЗаСчетФедеральногоБюджета = Перечисления.ВыплатыПособийЗаСчетФедеральногоБюджета.ПодразделенияОсобогоРиска;
							КонецЦикла;
							ВременныйДокумент.Вывести(ОбластьШапкаСтраницыПособий);
							
							ПособияВыводили = Ложь;
							Для каждого Значение Из Перечисления.ВидыПособийСоциальногоСтрахования Цикл
								
								СтруктураПоискаПособийПоВидам.ВидПособияСоциальногоСтрахования = Значение;
								
								Если Значение = Перечисления.ВидыПособийСоциальногоСтрахования.ПоУходуЗаРебенкомДоПолутораЛет Тогда
									
									ЗаголовокВыводили = Ложь;
									Месяц = 0;
									
									ВыборкаПособий.Сбросить();
									ВидПособия = "";
									Пока ВыборкаПособий.НайтиСледующий(СтруктураПоискаПособийПоВидам) Цикл
										
										ПособияВыводили = Истина;
										
										Если ВидПособия <> ВыборкаПособий.ВидПособия Тогда
											Если ЗаголовокВыводили Тогда
												
												Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
													Для СчМесяцев = Месяц + 1 По 12 Цикл
														// Выведем пустой месяц
														ВременныйДокумент.Присоединить(ОбластьПустойМесяцСтраницыПособий);
													КонецЦикла;		
												КонецЕсли;
												
											КонецЕсли;
											ЗаголовокВыводили = Ложь;
											Месяц = 0;
											ВидПособия = ВыборкаПособий.ВидПособия;
										КонецЕсли;
										
										Если Не ЗаголовокВыводили Тогда
											ОбластьНачалоСтрокиСтраницыПособий.Параметры.Заполнить(ВыборкаПособий);
											ВременныйДокумент.Вывести(ОбластьНачалоСтрокиСтраницыПособий);
											ЗаголовокВыводили = Истина;
										КонецЕсли;
										
										МесяцНовый = Месяц(ВыборкаПособий.Период); // месяц, который выводим
										
										Если МесяцНовый > Месяц + 1 тогда
											Для СчМесяцев = Месяц + 1 По МесяцНовый - 1 Цикл
												ВременныйДокумент.Присоединить(ОбластьПустойМесяцСтраницыПособий);
											КонецЦикла;	
										КонецЕсли;
										
										Месяц = МесяцНовый;
										
										ОбластьМесяцСтраницыПособий.Параметры.Заполнить(ВыборкаПособий);
										ВременныйДокумент.Присоединить(ОбластьМесяцСтраницыПособий);
											
									КонецЦикла;
									
									Если ЗаголовокВыводили Тогда
										
										Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
											Для СчМесяцев = Месяц + 1 По 12 Цикл
												// Выведем пустой месяц
												ВременныйДокумент.Присоединить(ОбластьПустойМесяцСтраницыПособий);
											КонецЦикла;		
										КонецЕсли;
										
									КонецЕсли;
									
								Иначе	
									
									ЗаголовокВыводили = Ложь;
									Месяц = 0;
									
									ВыборкаПособий.Сбросить();
									Пока ВыборкаПособий.НайтиСледующий(СтруктураПоискаПособийПоВидам) Цикл
										
										ПособияВыводили = Истина;
										Если Не ЗаголовокВыводили Тогда
											ОбластьНачалоСтрокиСтраницыПособий.Параметры.Заполнить(ВыборкаПособий);
											ВременныйДокумент.Вывести(ОбластьНачалоСтрокиСтраницыПособий);
											ЗаголовокВыводили = Истина;
										КонецЕсли;
										
										МесяцНовый = Месяц(ВыборкаПособий.Период); // месяц, который выводим
										
										Если МесяцНовый > Месяц + 1 тогда
											Для СчМесяцев = Месяц + 1 По МесяцНовый - 1 Цикл
												ВременныйДокумент.Присоединить(ОбластьПустойМесяцСтраницыПособий);
											КонецЦикла;	
										КонецЕсли;
										
										Месяц = МесяцНовый;
										
										ОбластьМесяцСтраницыПособий.Параметры.Заполнить(ВыборкаПособий);
										ВременныйДокумент.Присоединить(ОбластьМесяцСтраницыПособий);
											
									КонецЦикла;
									
									Если ЗаголовокВыводили Тогда
										
										Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
											Для СчМесяцев = Месяц + 1 По 12 Цикл
												// Выведем пустой месяц
												ВременныйДокумент.Присоединить(ОбластьПустойМесяцСтраницыПособий);
											КонецЦикла;		
										КонецЕсли;
										
									КонецЕсли;
								
								КонецЕсли;
								
							КонецЦикла;
							Если Не ПособияВыводили Тогда
								ВременныйДокумент.Вывести(ОбластьПустаяСтрокаПособий);
							КонецЕсли;
							
							Если ЭтоФорма2015Года Тогда
								ВременныйДокумент.Вывести(ОбластьШапкаСтраницыПособийНСиПЗ);
								ПособияВыводили = Ложь;
								Для каждого Значение Из Перечисления.ВидыПособийСоциальногоСтрахования Цикл
									
									СтруктураПоискаПособийПоВидам.ВидПособияСоциальногоСтрахования = Значение;
									
									ЗаголовокВыводили = Ложь;
									Месяц = 0;
									
									ВыборкаНСиПЗ.Сбросить();
									Пока ВыборкаНСиПЗ.НайтиСледующий(СтруктураПоискаПособийПоВидам) Цикл
										
										ПособияВыводили = Истина;
										Если Не ЗаголовокВыводили Тогда
											ОбластьНачалоСтрокиСтраницыПособийНСиПЗ.Параметры.Заполнить(ВыборкаНСиПЗ);
											ВременныйДокумент.Вывести(ОбластьНачалоСтрокиСтраницыПособийНСиПЗ);
											ЗаголовокВыводили = Истина;
										КонецЕсли;
										
										МесяцНовый = Месяц(ВыборкаНСиПЗ.Период); // месяц, который выводим
										
										Если МесяцНовый > Месяц + 1 тогда
											Для СчМесяцев = Месяц + 1 По МесяцНовый - 1 Цикл
												ВременныйДокумент.Присоединить(ОбластьПустойМесяцСтраницыПособийНСиПЗ);
											КонецЦикла;	
										КонецЕсли;
										
										Месяц = МесяцНовый;
										
										ОбластьМесяцСтраницыПособийНСиПЗ.Параметры.Заполнить(ВыборкаНСиПЗ);
										ВременныйДокумент.Присоединить(ОбластьМесяцСтраницыПособийНСиПЗ);
										
									КонецЦикла;
									
									Если ЗаголовокВыводили Тогда
										
										Если Месяц < 12 Тогда  // дополним таблицу пустыми строками
											Для СчМесяцев = Месяц + 1 По 12 Цикл
												// Выведем пустой месяц
												ВременныйДокумент.Присоединить(ОбластьПустойМесяцСтраницыПособийНСиПЗ);
											КонецЦикла;		
										КонецЕсли;
										
									КонецЕсли;
									
								КонецЦикла;
								Если Не ПособияВыводили Тогда
									ВременныйДокумент.Вывести(ОбластьПустаяСтрокаПособийНСиПЗ);
								КонецЕсли;
							КонецЕсли;
							
							ВременныйДокумент.Вывести(ОбластьПодвалСтраницыПособий);
							
							ДокументРезультат.Вывести(ВременныйДокумент);
							ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла; 
			
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	//-----------------------------------------------------------------------------
	
	//Параметры документа
	ДокументРезультат.Автомасштаб 			= 	Истина;
	ДокументРезультат.ОриентацияСтраницы 	= 	ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ТолькоПросмотр		= 	Истина;
	ДокументРезультат.ПолеСверху			= 	0;
	ДокументРезультат.ПолеСнизу				= 	0;
	
КонецПроцедуры

Процедура УдалитьПустыеРазделыУсловийТруда(ТабличныйДокумент)
	
	НачалоРаздела = ТабличныйДокумент.ВысотаТаблицы - 131;
	Для Сч = 1 По 12 Цикл
		Если РазделЗаполнен(ТабличныйДокумент.ПолучитьОбласть(НачалоРаздела,,НачалоРаздела + 10)) Тогда
			НачалоРаздела = НачалоРаздела + 11;
			Продолжить;
		КонецЕсли;
		ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область(НачалоРаздела,,НачалоРаздела + 10), ТипСмещенияТабличногоДокумента.ПоВертикали);	
	КонецЦикла;

КонецПроцедуры

Функция РазделЗаполнен(ТабличныйДокумент)

	ПроверяемыхСтрок = ТабличныйДокумент.ВысотаТаблицы - 1;
	ПроверяемыхКолонок = ТабличныйДокумент.ШиринаТаблицы - 3;
	
	Для СчСтрок = 1 По ПроверяемыхСтрок Цикл
		Для СчКолонок = 1 По ПроверяемыхКолонок Цикл
			Если ЗначениеЗаполнено(ТабличныйДокумент.Область("R" + (СчСтрок + 1) + "C" + (СчКолонок + 3)).Текст) Тогда
				Возврат Истина
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь
	
КонецФункции

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);
	
	// Считываение структуры настроек отчета
	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередВыводомЭлементРезультата(МакетКомпоновки, ПроцессорКомпоновки, ЭлементРезультата) Экспорт
	
КонецПроцедуры

Процедура ПередВыводомОтчета(МакетКомпоновки, ПроцессорКомпоновки) Экспорт
	
	
КонецПроцедуры

Процедура ПриВыводеЗаголовкаОтчета(ОбластьЗаголовок) Экспорт
КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СписокПолейПодстановкиОтборовПоУмолчанию = Новый Соответствие;
	
	Возврат Новый Структура("ДополнительныеНастройкиОтчета, ИспользоватьСобытияПриФормированииОтчета,
	|ПриВыводеЗаголовкаОтчета,
	|ПослеВыводаПанелиПользователя,
	|ПослеВыводаПериода,
	|ПослеВыводаПараметра,
	|ПослеВыводаГруппировки,
	|ПослеВыводаОтбора,
	|ДействияПанелиИзменениеФлажкаДопНастроек,
	|ПриПолучениеНастроекПользователя, 
	|ЗаполнитьОтборыПоУмолчанию, 
	|СписокПолейПодстановкиОтборовПоУмолчанию,
	|МинимальныйПериодОтчета", 
	Истина, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, истина, СписокПолейПодстановкиОтборовПоУмолчанию,"Год");
КонецФункции

Функция ПолучитьДополнительныеНастройкиОтчета() Экспорт
	МассивДополнительныхНастроек = Новый Массив;
	МассивДополнительныхНастроек.Добавить(Новый Структура("Имя, Заголовок, ЗначениеПоУмолчанию", "ГруппироватьПоОрганизации", "Выводить карточки по обособленным подразделениям", истина));
	Возврат МассивДополнительныхНастроек;
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;

Если КомпоновщикНастроек = Неопределено Тогда
	КомпоновщикНастроек =  Новый КомпоновщикНастроекКомпоновкиДанных;
КонецЕсли;

УчитыватьОбособленноеПодразделение = ложь;

УправлениеОтчетами.ЗаменитьНазваниеПолейСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);

