
//#Область ПрограммныйИнтерфейс

// В процедуре требуется реализовать заполнение данных по номенклатуре для переданного соответствия штрихкодов.
//
// Параметры:
//  Штрихкоды - Соответствие - штрихкоды, не являющиеся штрихкодами упаковок и акцизных марок:
//   * Ключ - Строка - штрихкод,
//   * Значение - Структура - заполняемая структура, см. АкцизныеМаркиКлиентСервер.РезультатОбработкиШтрихкода().
//  КэшированныеЗначения - Структура - кэш формы документа.
//
Процедура ЗаполнитьИнформациюПоШтрихкодам(Штрихкоды, КэшированныеЗначения) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Возвращает Истина, если акцизная марка никогда раньше не продавалась. Ложь - в противном случае.
//
// Параметры:
//  Операция - Строка - текущая операция, для которой требуется осуществить контроль. Возможные значения:
//   "Продажа" - проверка пройдена, если продажи за минусом возвратов <= 0,
//   "Возврат" - проверка пройдена, если продажи за минусом возвратов >= 0,
//   "АктПостановкиНаБаланс" - проверка пройдена, если не было продаж, возвратов, актов постановок на баланс,
//   "АктСписания" - проверка пройдена, если продажи за минусом возвратов <= 0 и поставлено на баланс - списано >= 0.
//
//  КодАкцизнойМарки - Строка - код акцизной марки,
//  ТекстОшибки - Строка, ФорматированнаяСтрока - текст сообщения пользователю, если акцизная марка не уникальна. Выходной параметр.
//
Процедура ПроверитьУникальностьАкцизнойМарки(Операция, КодАкцизнойМарки, ТекстОшибки) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

Функция ДанныеДляЗаполненияСлужебныхРеквизитов(Товары) Экспорт
	
	
	Возврат Неопределено;
	
КонецФункции

//#КонецОбласти

