//Получает параметры формы для отрытия записи регистра
//
Функция ПолучитьПараметрыОткрытияФормыЗаписиВзаимозависимогоЛица(Организация, Контрагент, Период) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент)
		ИЛИ НЕ ЗначениеЗаполнено(Период)
		ИЛИ НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат(Неопределено);
	КонецЕсли;
	
	ПараметрыВзаимозависимогоЛица = РегистрыСведений.ВзаимозависимыеЛица.СоздатьНаборЗаписей();
	ПараметрыВзаимозависимогоЛица.Отбор.Контрагент.Значение 		= Контрагент;
	ПараметрыВзаимозависимогоЛица.Отбор.Контрагент.Использование 	= Истина;
	ПараметрыВзаимозависимогоЛица.Отбор.Период.Значение 			= Период;
	ПараметрыВзаимозависимогоЛица.Отбор.Период.Использование 		= Истина;
	ПараметрыВзаимозависимогоЛица.Отбор.Организация.Значение 		= Организация;
	ПараметрыВзаимозависимогоЛица.Отбор.Организация.Использование 	= Истина;
	ПараметрыВзаимозависимогоЛица.Прочитать();
	
	Если ПараметрыВзаимозависимогоЛица.Количество()>0 Тогда
		ПараметрыФормы = Новый Структура("Ключ", РегистрыСведений.ВзаимозависимыеЛица.СоздатьКлючЗаписи(
			Новый Структура("Организация, Контрагент, Период", Организация, Контрагент, Период)));
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",
			Новый Структура("Организация, Контрагент, Период", Организация, Контрагент, Период));
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДоступностьКлючевыхЗаписей",Ложь);
	
	Возврат(ПараметрыФормы);

КонецФункции

