////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Процедура ЗаписатьГраницу(ВидГраницы, Период, ПредельнаяСумма)
	
	НаборЗаписей = РегистрыСведений.ГраницыКонтролируемостиСделок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОсобенностьОтнесенияСделкиККонтролируемой.Значение = ВидГраницы;
	НаборЗаписей.Отбор.ОсобенностьОтнесенияСделкиККонтролируемой.Использование = Истина;
	НаборЗаписей.Отбор.Период.Значение = Период;
	НаборЗаписей.Отбор.Период.Использование = Истина;
	Запись = НаборЗаписей.Добавить();
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = ВидГраницы;
	Запись.Период = Период;
	Запись.ПредельнаяСумма = ПредельнаяСумма;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГраницы()
	
	ИменаГраницВключенияСделок = ИменаГраницВключенияСделок();
	СуществующиеГраницы = НовыйГраницыСделок(ИменаГраницВключенияСделок);
	ЗаполнитьГраницы(СуществующиеГраницы, ИменаГраницВключенияСделок);
	
	ПериодДляЗаписи = Дата(Объект.ОтчетныйГод, 1, 1);
	Для Каждого ИмяГраницыВключенияСделок Из ИменаГраницВключенияСделок Цикл
		ИмяГраницы = ИмяГраницыВключенияСделок.Ключ;
		ЗначениеПеречисленияДляЗаписи = ИмяГраницыВключенияСделок.Значение;
		Если СуществующиеГраницы[ИмяГраницы] <> ЭтаФорма[ИмяГраницы] Тогда
			ЗаписатьГраницу(ЗначениеПеречисленияДляЗаписи,
				ПериодДляЗаписи, ЭтаФорма[ИмяГраницы]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГраницы(ОбъектЗаполнения, ИменаГраницВключенияСделок)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ОтчетныйГод", Дата(Объект.ОтчетныйГод, 1, 1));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой КАК ОсобенностьОтнесенияСделкиККонтролируемой,
	|	ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма КАК ПредельнаяСумма
	|ИЗ
	|	РегистрСведений.ГраницыКонтролируемостиСделок.СрезПоследних(КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД), ) КАК ГраницыКонтролируемостиСделокСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗначенияГраниц = Новый Соответствие();
	Пока Выборка.Следующий() Цикл
		ЗначенияГраниц.Вставить(Выборка.ОсобенностьОтнесенияСделкиККонтролируемой, Выборка.ПредельнаяСумма);
	КонецЦикла;
	
	Для Каждого ИмяГраницы Из ИменаГраницВключенияСделок Цикл
		ПредельнаяСумма = ЗначенияГраниц.Получить(ИмяГраницы.Значение);
		Если ПредельнаяСумма = Неопределено Тогда
			ПредельнаяСумма = 0;
		КонецЕсли;
		ОбъектЗаполнения[ИмяГраницы.Ключ] = ПредельнаяСумма;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИменаГраницВключенияСделок()
	
	ИменаГраницВключенияСделок = Новый Соответствие;
	
	ИменаГраницВключенияСделок.Вставить("ГраницаОбщая",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФОбщая",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФНДПИ",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФСпецрежим",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФПрибыль",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФОЭЗ",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФНовоеМорскоеМесторождение",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаДеятельностьМорскогоМесторождения);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФРегиональныйИнвестиционныйПроект",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаУчастникиРегиональногоИнвестиционногоПроекта);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФОсвобождениеНДС",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсвобождениеНДС);
	ИменаГраницВключенияСделок.Вставить("ГраницаРФИнвестиционныйВычет",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаИнвестиционныйВычет);
	ИменаГраницВключенияСделок.Вставить("ГраницаИностранныеНезависимыеЛица",
		Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица);
	
	Возврат ИменаГраницВключенияСделок;
	
КонецФункции

Функция НовыйГраницыСделок(ИменаГраницВключенияСделок)
	
	ГраницыСделок = Новый Структура;
	Для Каждого ИмяГраницыВключенияСделок Из ИменаГраницВключенияСделок Цикл
		ГраницыСделок.Вставить(ИмяГраницыВключенияСделок.Ключ, 0);
	КонецЦикла;
	Возврат ГраницыСделок;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);

	Заголовок = СтрЗаменить(НСтр("ru = 'Границы включения сделок в уведомление за %ОтчетныйГод% год'"),"%ОтчетныйГод%",Формат(Объект.ОтчетныйГод, "ЧЦ=4; ЧГ=0"));
	
	ИменаГраницВключенияСделок = ИменаГраницВключенияСделок();
	ЗаполнитьГраницы(ЭтаФорма, ИменаГраницВключенияСделок);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	ЗаписатьГраницы();
	Закрыть();
	
КонецПроцедуры
