
//#Область ПрограммныйИнтерфейс

// В функции требуется пересчитать количество введенных акцизных марок в количество единиц выбранной упаковки.
//
// Параметры:
//  Упаковка - ОпределяемыйТип.Упаковка - выбранная упаковка,
//  КоличествоАкцизныхМарок - Число - количество введенных акцизных марок,
//  КэшированныеЗначения - Струкктура, Неопределено - кэш формы документа.
//
// Возвращаемое значение:
//  Число - количество акцизных марок в единицах упаковки.
//
Функция КоличествоЕдиницАкцизныхМарок(Упаковка, КоличествоАкцизныхМарок, КэшированныеЗначения) Экспорт
	
	
КонецФункции

Процедура ЗаполнитьПараметрыСканированияАкцизныхМарок(Параметры, Форма) Экспорт

	Если СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЧекККМ") Тогда

		Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ВНаличии"));
		Параметры.ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка"));
		
		Параметры.КонтрольАкцизныхМарок         = Истина;
		Параметры.Операция                      = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЧекККМ");
		Параметры.ОперацияКонтроляАкцизныхМарок = "Продажа";
		Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
			Параметры.ОрганизацияЕГАИС              = Форма.Объект.ОрганизацияЕГАИС;
		Иначе
			Параметры.ОрганизацияЕГАИС              = Форма.ОрганизацияЕГАИС;
		КонецЕсли;
		Параметры.СоздаватьШтрихкодУпаковки     = Истина;
		
		Параметры.КлючевыеРеквизиты.Добавить("Цена");
		Параметры.КлючевыеРеквизиты.Добавить("Штрихкод");
	КонецЕсли;	
	
КонецПроцедуры

//#КонецОбласти

