
&НаКлиенте
Процедура КодГосударственногоЗаказчикаПриИзменении(Элемент)
	
	Объект.КодГосударственногоЗаказчика = 
		СтрЗаменить(Объект.КодГосударственногоЗаказчика, " ", "0");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификатор(Команда)
	
	Объект.Код = Прав(Строка(Объект.ГодЗаключения), 2) + 
					Прав(Строка(Объект.ГодОкончанияСрокаДействия), 2) + 
					Объект.КодГосударственногоЗаказчика + 
					КодСпособаОпределенияПоставщика + 
					Объект.ПорядковыйНомер + 
					Объект.ВидЦены + 
					Объект.ДополнительныеРазряды;
	
КонецПроцедуры

&НаКлиенте
Процедура КодГосударственногоЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяМакета",    "АдминистраторыДоходовБюджетов");
	СтруктураПараметров.Вставить("СтрокаПоиска", Объект.КодГосударственногоЗаказчика);
	СтруктураПараметров.Вставить("Заголовок",    НСтр("ru = 'Код государственного заказчика'"));
	СтруктураПараметров.Вставить("ГодПлатежа",   Объект.ГодЗаключения);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКодаИзКлассификатора", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядковыйНомерПриИзменении(Элемент)
	
	Объект.ПорядковыйНомер = 
		СтрЗаменить(Объект.ПорядковыйНомер, " ", "0");
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРазрядыПриИзменении(Элемент)
	
	Объект.ДополнительныеРазряды = 
		СтрЗаменить(Объект.ДополнительныеРазряды, " ", "0");
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.СтраницаКомментарий.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СтраницаКомментарий.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	КодСпособаОпределенияПоставщика = Объект.СпособОпределенияПоставщика.Код;

КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Попытка
		Объект.ДатаЗаключения 				= Дата(Число("20" + Лев(Объект.Код, 2)), 1, 1);
		Объект.ГодЗаключения 				= "20" + Лев(Объект.Код, 2);
		Объект.ГодОкончанияСрокаДействия 	= "20" + Сред(Объект.Код, 3, 2);
		Объект.КодГосударственногоЗаказчика = Сред(Объект.Код, 5, 3);
		КодСпособаОпределенияПоставщика		= Сред(Объект.Код, 8, 1);
		Объект.СпособОпределенияПоставщика	= СпособыОпределенияПоставщиковПоКоду(КодСпособаОпределенияПоставщика);
		Объект.ПорядковыйНомер 				= Сред(Объект.Код, 9, 4);
		Объект.ВидЦены 						= Сред(Объект.Код, 13, 1);
		Объект.ДополнительныеРазряды 		= Сред(Объект.Код, 14, 12);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Код) Тогда
		ЗаполнитьИдентификатор(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначения275КлиентСервер.ПроверитьИспользованиеПодсистемы(Отказ);
	
КонецПроцедуры


&НаКлиенте
Процедура СпособОпределенияПоставщикаПриИзменении(Элемент)
	СпособОпределенияПоставщикаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпособОпределенияПоставщикаПриИзмененииНаСервере()
	КодСпособаОпределенияПоставщика = Объект.СпособОпределенияПоставщика.Код;
КонецПроцедуры

&НаСервереБезКонтекста 
Функция СпособыОпределенияПоставщиковПоКоду(Код)
	
	Возврат Справочники.СпособыОпределенияПоставщиков.НайтиПоКоду(Код);
	
КонецФункции

&НаКлиенте
Процедура ГодЗаключенияПриИзменении(Элемент)
	Объект.ГодЗаключения = Год(Объект.ДатаЗаключения);
КонецПроцедуры
