Перем мТаблицаСоставПоказателей Экспорт; // состав показателей отчета

Перем мСтруктураВариантыЗаполнения Экспорт; // состав показателей отчета

Перем мДеревоСтраницОтчета Экспорт; // структура листов отчета

Перем мЕстьВыбранные Экспорт; // признак выбора печатных листов

Перем мВыбраннаяФорма Экспорт; // имя выбранной формы отчета

Перем мСкопированаФорма Экспорт; // признак скопированной формы

Перем мСохраненныйДок Экспорт; // ссылка на документ, хранящий данные отчета

Перем мВерсияФормы Экспорт;

Перем мПериодичность Экспорт;

Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета Экспорт;

Перем мСчетчикСтраниц Экспорт; 

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мЗаписьЗапрещена Экспорт;

Перем мАвтоВыборКодов Экспорт; // для флажка "отключить выбор значений из списка"

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске
Перем мТаблицаФормОтчета Экспорт;

Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

Перем мФормыИФорматы Экспорт;
Перем мВерсияОтчета Экспорт;

Перем мПечатьБезШтрихкодаРазрешена Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СтрокаЧГ0(ИсходноеЧисло) Экспорт // враппер
	
	Возврат РегламентированнаяОтчетность.СтрокаЧГ0(ИсходноеЧисло);
	
КонецФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

ФормаОтчета2005Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2005-09-23', "124н", "ФормаОтчета2005Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2005Кв1, "3.00000");

ФормаОтчета2007Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2007-03-29', "27н", "ФормаОтчета2007Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2007Кв1, "4.01");

ФормаОтчета2009Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2008-09-16', "95н", "ФормаОтчета2009Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2009Кв1, "5.01");

ФормаОтчета2011Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2011-10-28', "ММВ-7-11/696@", "ФормаОтчета2011Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2011Кв1, "5.02");

ФормаОтчета2013Кв4 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2013-11-14', "ММВ-7-3/501@", "ФормаОтчета2013Кв4");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2013Кв4, "5.03");

ФормаОтчета2014Кв4 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2013-11-14', "ММВ-7-3/501@", "ФормаОтчета2014Кв4");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2014Кв4, "5.03");

ФормаОтчета2017Кв4 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2017-05-10', "ММВ-7-21/347@", "ФормаОтчета2017Кв4");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2017Кв4, "5.04");

Форма2018Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2018-03-02', "ММВ-7-21/118@", "ФормаОтчета2018Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма2018Кв1, "5.05");

Форма2018Кв3 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1153005", '2018-08-30', "ММВ-7-21/509@", "ФормаОтчета2018Кв3");
ОпределитьФорматВДеревеФормИФорматов(Форма2018Кв3, "5.06");

мСтруктураВариантыЗаполнения = Новый Структура;
мТаблицаСоставПоказателей = РегламентированнаяОтчетность.СозданиеТаблицыСоставаПоказателей();
мТаблицаФормОтчета = РегламентированнаяОтчетность.СозданиеТаблицыФормОтчета();

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2005Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу Министерства финансов Российской Федерации от 23 сентября 2005 г. № 124н";
НоваяФорма.ДатаНачалоДействия = '2005-01-01';
НоваяФорма.ДатаКонецДействия  = '2006-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу Минфина РФ от 23.09.2005 г. № 124н (в редакции приказа Минфина РФ от 29.03.2007 № 27н)";
НоваяФорма.ДатаНачалоДействия = '2007-01-01';
НоваяФорма.ДатаКонецДействия  = '2008-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу Министерства финансов Российской Федерации от 16.09.2008 г. № 95н";
НоваяФорма.ДатаНачалоДействия = '2009-01-01';
НоваяФорма.ДатаКонецДействия  = '2010-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 28.10.2011 № ММВ-7-11/696@";
НоваяФорма.ДатаНачалоДействия = '2011-01-01';
НоваяФорма.ДатаКонецДействия  = '2012-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 28.10.2011 № ММВ-7-11/696@ (в ред. приказа ФНС России от 14 ноября 2013 г. № ММВ-7-3/501@)";
НоваяФорма.ДатаНачалоДействия = '2013-01-01';
НоваяФорма.ДатаКонецДействия  = '2013-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 28.10.2011 № ММВ-7-11/696@ (в ред. приказа ФНС России от 14 ноября 2013 г. № ММВ-7-3/501@)";
НоваяФорма.ДатаНачалоДействия = '2014-01-01';
НоваяФорма.ДатаКонецДействия  = '2016-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 10.05.2017 № ММВ-7-21/347@.";
НоваяФорма.ДатаНачалоДействия = '2017-01-01';
НоваяФорма.ДатаКонецДействия  = '2017-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2018Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 10.05.2017 № ММВ-7-21/347@ (в ред. приказа ФНС России от 02.03.2018 № ММВ-7-21/118@).";
НоваяФорма.ДатаНачалоДействия = '2018-01-01';
НоваяФорма.ДатаКонецДействия  = '2018-11-21';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2018Кв3";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 10.05.2017 № ММВ-7-21/347@ (в ред. приказа ФНС России от 30.08.2018 № ММВ-7-21/509@).";
НоваяФорма.ДатаНачалоДействия = '2018-01-01';
НоваяФорма.ДатаКонецДействия  = '2019-12-31';
