
Функция ТекстЗапросаТоварныеПозицииЧека() Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	АктОбОказанииПроизводственныхУслугУслуги.Количество,
	|	АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма
	|		ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма + АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	|	ВЫБОР
	|		КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	|			ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Цена
	|		ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Цена + АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС / АктОбОказанииПроизводственныхУслугУслуги.Количество
	|	КОНЕЦ КАК Цена,
	|	АктОбОказанииПроизводственныхУслугУслуги.Содержание КАК Наименование,
	|	0 КАК НомерСекции
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

