
Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю

Перем ДанныеОФизЛицеОрганизации, ВыборкаНалогиНачисленныеИтоги, ВыборкаАвансыЗачтенныеИтоги, ВыборкаНалогиПоМесяцаПоРазделам, ВыборкаНалогиУдержанныеИтоги, ВыборкаНалогиВзысканиеИтоги;
Перем ВыборкаНалогиВозвращенныеИтоги, ВыборкаНалогиПомесяцамПоСтавкам, ВыборкаСальдоРасчетовНаНачалоГода, ДанныеОПредоставленныхСправках, ВыборкаВычетыИтоги, ВыборкаНалогиИтоги;
Перем ВыборкаВычетыПоМесяцамПоВидам, ВыборкаНалогиПеречисленныеИтоги, ДатаНачалаНП, ДатаКонцаНП, ДатаПодписи, Ответственный, ПервыйРаз;
Перем ВыборкаСтандартныеВычеты, ВыборкаСоциальныеВычеты, ВыборкаСправкиНДФЛ, ВыборкаУведомления, ВыборкаСтатусов, ВыборкаВычетовПоСтавке13; 
Перем СоответствиеОКАТОКПП;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ВывестиГруппировку(ДокументРезультат, СтрокаДанных, Поле, Уровень)
	
	МакетГруппировки  = ПолучитьМакет("МакетГруппировки");
	ОбластьГрупировки = МакетГруппировки.ПолучитьОбласть("Группировка");
	
	ДоступноеПоле = ТиповыеОтчеты.ПолучитьДоступноеПоле(Новый ПолеКомпоновкиДанных(Поле), КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок);
	
	ОбластьГрупировки.Параметры.НазваниеПарметра = ДоступноеПоле.Заголовок;
	ОбластьГрупировки.Параметры.Значение = СтрокаДанных[СтрЗаменить(Поле, ".", "")];
	
	ДокументРезультат.Вывести(ОбластьГрупировки, Уровень+1);
	
КонецПроцедуры 

Процедура ВывестиКарточки(ДокументРезультат, СтрокиДеревоДанных, Уровень, Группировки, ЕстьОшибки)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		//выбрать карточки
		Для каждого СтрокаДерева из СтрокиДеревоДанных Цикл
			Если (Группировки.Количество() - 1) >= Уровень тогда 
				//Нарисовать группировку
				ВывестиГруппировку(ДокументРезультат, СтрокаДерева, Группировки.Получить(Уровень).Значение, Уровень);
				Если Группировки.Количество()-1 >= Уровень+1 тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ВывестиКарточки(ДокументРезультат, СтрокаДерева.Строки, Уровень+1, Группировки, ЕстьОшибки);
				
			Иначе			//Нарисовать карточку физлица
				//СформироватьМакет(ДокументРезультат, СтрокаДерева.ФизЛицо, СтрокаДерева.Год, СтрокаДерева.Организация, СтрокаДерева.ГоловнаяОрганизация, Уровень);
				СформироватьМакет(ДокументРезультат, СтрокаДерева.ФизЛицо, СтрокаДерева.Год,  СтрокаДерева.ГоловнаяОрганизация, Уровень);
				
			КонецЕсли;
		КонецЦикла;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПолучитьДанныеДляПостроенияОтчета(СписокФизЛицОрганизация)
	
	ДатаНачалаНП = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "НачалоПериода").Значение;
	ДатаКонцаНП  = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "КонецПериода").Значение;
	ДатаПодписи  = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "ДатаПодписи").Значение;
	Если ДатаПодписи = Неопределено или ДатаПодписи = '00010101' тогда
		ДатаПодписи = ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
	КонецЕсли;

	// Массив кодов доходов, отражаемых в разделе 7: Доходы от продажи имущества
	МассивКодовДоходовРаздела7 = Новый Массив;
	МассивКодовДоходовРаздела7.Добавить(Справочники.ДоходыНДФЛ.Код1530);
	МассивКодовДоходовРаздела7.Добавить(Справочники.ДоходыНДФЛ.Код2210);
	
	ФизЛицоОтветственного = ?(ТипЗнч(Ответственный) = Тип("СправочникСсылка.Пользователи"), ОбщегоНазначенияЗК.ПолучитьЗначениеРеквизита(Ответственный,"ФизЛицо"), Справочники.ФизическиеЛица.ПустаяСсылка());
	
	// Создание запроса и установка всех необходимых параметров
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ФизлицоОтветственного", ФизЛицоОтветственного);
	Запрос.УстановитьПараметр("НачалоНП", ДатаНачалаНП);
	Запрос.УстановитьПараметр("КонецНП", ДатаКонцаНП);
	Запрос.УстановитьПараметр("ПоследнийМесяцНП", НачалоМесяца(ДатаКонцаНП));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаПодписи);
	Запрос.УстановитьПараметр("МассивКодовДоходовРаздела7", МассивКодовДоходовРаздела7);
	Запрос.УстановитьПараметр("ПустойКодПоОКАТО","");
	Запрос.УстановитьПараметр("ПустойКПП","");
	Запрос.УстановитьПараметр("СписокФизЛицОрганизация", СписокФизЛицОрганизация);
	Запрос.УстановитьПараметр("ГодПереходаНаКодыОКТМО", Год(ПроведениеРасчетов.ДатаПереходаНаКодыОКТМО()));
	Запрос.УстановитьПараметр("ДатаЗакона285ФЗ", ПроведениеРасчетов.ДатаЗакона285ФЗ());
	Запрос.УстановитьПараметр("ГодЗакона285ФЗ", Год(ПроведениеРасчетов.ДатаЗакона285ФЗ()));
	Запрос.УстановитьПараметр("ДатаЗакона366ФЗ", ПроведениеРасчетов.ДатаИзмененияНалогообложенияДивидендов());
	Запрос.УстановитьПараметр("ДатаИзмененияИсчисленияДляИностранцев", ПроведениеРасчетов.ДатаИзмененияПорядкаИсчисленияНалогаДляИностранцев());
	Запрос.УстановитьПараметр("ДатаИзмененияСроковУплатыНалога", ПроведениеРасчетов.ДатаИзмененияСроковУплатыНалога());
	Запрос.УстановитьПараметр("ГодИзмененияИсчисленияДляИностранцев", Год(ПроведениеРасчетов.ДатаИзмененияПорядкаИсчисленияНалогаДляИностранцев()));
	
	// Сформируем текст запроса с датами месяцев налогового периода
	// первый месяц
	КонецМесяца = КонецМесяца(ДатаНачалаНП);
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат (КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	ПериодыТекст = ПериодыТекст + "
	|ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По 12 Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	ПериодыТекст = ПериодыТекст + "
	|ИНДЕКСИРОВАТЬ ПО Период";
	
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	//-----------------------------------------------------------------------------
	// ВЫБОРКА СВЕДЕНИЙ ОБ ОРГАНИЗАЦИИ И ФИЗЛИЦЕ (Данные разделов 1 и 2)
	// 	

	//ДанныеОбОрганизацииИФизлицеТекст
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизЛицаОганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ФизЛицаОганизация.Организация,
	|	ФизЛицаОганизация.ФизЛицо КАК ФизЛицо,
	|	ФизЛицаОганизация.Год КАК Год,
	|	ФизЛицаОганизация.НеОтбиратьПоОП
	|ПОМЕСТИТЬ ВТСписокФизЛицОрганизация
	|ИЗ
	|	&СписокФизЛицОрганизация КАК ФизЛицаОганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ГоловнаяОрганизация,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.ФизЛицо,
	|	СписокФизЛицОрганизация.Год,
	|	ВЫБОР
	|		КОГДА Организации.Ссылка ЕСТЬ NULL 
	|			ТОГДА СписокФизЛицОрганизация.Организация
	|		ИНАЧЕ Организации.Ссылка
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТОбособленныеПодразделения
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = Организации.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.ФизЛицо,
	|	СписокФизЛицОрганизация.Год,
	|	СписокФизЛицОрганизация.Организация
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГражданствоФизЛицаСрезПоследних.Год КАК Год,
	|	ГражданствоФизЛицаСрезПоследних.Физлицо КАК ФизЛицо,
	|	ГражданствоФизЛица.Страна
	|ПОМЕСТИТЬ ВТГражданствоФизЛиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Год КАК Год,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛица.Период) КАК ПериодСреза
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(Периоды.Период) КАК КонецНалоговогоПериода,
	|			СписокФизЛицОрганизация.Год КАК Год,
	|			СписокФизЛицОрганизация.ФизЛицо КАК Физлицо
	|		ИЗ
	|			ВТПериоды КАК Периоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|				ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СписокФизЛицОрганизация.Год,
	|			СписокФизЛицОрганизация.ФизЛицо) КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛица
	|			ПО Периоды.КонецНалоговогоПериода >= ГражданствоФизЛица.Период
	|				И Периоды.Физлицо = ГражданствоФизЛица.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Физлицо,
	|		Периоды.Год) КАК ГражданствоФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛица
	|		ПО ГражданствоФизЛицаСрезПоследних.ПериодСреза = ГражданствоФизЛица.Период
	|			И ГражданствоФизЛицаСрезПоследних.Физлицо = ГражданствоФизЛица.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицаСрезПоследних.Год КАК Год,
	|	СтатусФизЛицаСрезПоследних.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА СтатусФизЛицаСрезПоследних.Год < &ГодЗакона285ФЗ
	|				И НЕ ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Беженец))
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтатусФизЛицаСрезПоследних.Год < &ГодИзмененияИсчисленияДляИностранцев
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.ГражданинСтраныЕАЭС), ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьИностранныйАдрес,
	|	ВЫБОР
	|		КОГДА СтатусФизЛицаСрезПоследних.Год < &ГодЗакона285ФЗ
	|				И СтатусФизЛица.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Беженец)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ ВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Год КАК Год,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СтатусФизЛица.Период) КАК ПериодСреза
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(Периоды.Период) КАК КонецНалоговогоПериода,
	|			СписокФизЛицОрганизация.Год КАК Год,
	|			СписокФизЛицОрганизация.ФизЛицо КАК Физлицо
	|		ИЗ
	|			ВТПериоды КАК Периоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|				ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СписокФизЛицОрганизация.Год,
	|			СписокФизЛицОрганизация.ФизЛицо) КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|			ПО Периоды.КонецНалоговогоПериода >= СтатусФизЛица.Период
	|				И Периоды.Физлицо = СтатусФизЛица.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Физлицо,
	|		Периоды.Год) КАК СтатусФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|		ПО СтатусФизЛицаСрезПоследних.ПериодСреза = СтатусФизЛица.Период
	|			И СтатусФизЛицаСрезПоследних.Физлицо = СтатусФизЛица.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокФизЛицОрганизация.ФизЛицо КАК ФизЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.ИНН КАК Организация_ИНН,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.КПП КАК Организация_КПП,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.КодИМНС КАК Организация_КодИМНС,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.КодПоОКАТО КАК Организация_КодПоОКАТО,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.КодПоОКТМО КАК Организация_КодПоОКТМО,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.НаименованиеПолное
	|		ИНАЧЕ ФИОПредпринимателя.Фамилия + "" "" + ФИОПредпринимателя.Имя + "" "" + ФИОПредпринимателя.Отчество
	|	КОНЕЦ КАК Организация_Наименование,
	|	ДанныеОФизЛице.ИНН КАК ФизЛицо_ИНН,
	|	ЕСТЬNULL(ФИОФизЛица.Фамилия + "" "" + ФИОФизЛица.Имя + "" "" + ФИОФизЛица.Отчество, ДанныеОФизЛице.Наименование) КАК ФизЛицо_ФИО,
	|	ЕСТЬNULL(ФИОФизлицаОтветственного.Фамилия + "" "" + ФИОФизлицаОтветственного.Имя + "" "" + ФИОФизлицаОтветственного.Отчество, ЕСТЬNULL(ДанныеОбОтветственном.ФизЛицо.Наименование, ДанныеОбОтветственном.Наименование)) КАК Ответственный_ФИО,
	|	ВЫБОР
	|		КОГДА ДолжностьОтветственного.ПериодЗавершения <= &ДатаАктуальности
	|				И ДолжностьОтветственного.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДолжностьОтветственного.ДолжностьЗавершения.Наименование
	|		ИНАЧЕ ДолжностьОтветственного.Должность.Наименование
	|	КОНЕЦ КАК Ответственный_Должность,
	|	ПаспортныеДанныеФизЛица.ДокументВид.КодИМНС КАК ФизЛицо_КодДокументаУдЛичн,
	|	ПаспортныеДанныеФизЛица.ДокументСерия + "" "" + ПаспортныеДанныеФизЛица.ДокументНомер КАК ФизЛицо_СерияНомерДокументаУдЛичн,
	|	ДанныеОФизЛице.ДатаРождения КАК ФизЛицо_ДатаРождения,
	|	ЕСТЬNULL(ГражданствоФизЛица.Страна.Код, ""643"") КАК ФизЛицо_КодСтраны,
	|	НДФЛДоходыПредыдущегоМестаРаботы.Размер КАК ФизЛицо_ДоходыПредыдущегоМестаРаботы,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА Страны.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизЛицо_АдресКодСтраны,
	|	АдресРегистрацииФизЛица.Поле1 КАК ФизЛицо_АдресИндекс,
	|	РегионРегистрацииФизЛица.Код КАК ФизЛицо_АдресРегион,
	|	АдресРегистрацииФизЛица.Поле3 КАК ФизЛицо_АдресРайон,
	|	АдресРегистрацииФизЛица.Поле4 КАК ФизЛицо_АдресГород,
	|	АдресРегистрацииФизЛица.Поле5 КАК ФизЛицо_АдресНаселенныйПункт,
	|	АдресРегистрацииФизЛица.Поле6 КАК ФизЛицо_АдресУлица,
	|	АдресРегистрацииФизЛица.Поле7 КАК ФизЛицо_АдресДом,
	|	АдресРегистрацииФизЛица.Поле8 КАК ФизЛицо_АдресКорпус,
	|	АдресРегистрацииФизЛица.Поле9 КАК ФизЛицо_АдресКвартира,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА АдресаИностранцев.Представление
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизЛицо_ИностранныйАдрес
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				&ДатаАктуальности,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛица.ГоловнаяОрганизация.ИндивидуальныйПредприниматель
	|					ИЗ
	|						ВТСписокФизЛицОрганизация КАК ФизЛица)) КАК ФИОПредпринимателя
	|		ПО (ФИОПредпринимателя.ФизЛицо = СписокФизЛицОрганизация.ГоловнаяОрганизация.ИндивидуальныйПредприниматель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОФизЛице
	|		ПО СписокФизЛицОрганизация.ФизЛицо = ДанныеОФизЛице.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ДанныеОбОтветственном
	|		ПО (ДанныеОбОтветственном.Ссылка = &Ответственный)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				&ДатаАктуальности,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛица.ФизЛицо
	|					ИЗ
	|						ВТСписокФизЛицОрганизация КАК ФизЛица)) КАК ФИОФизЛица
	|		ПО СписокФизЛицОрганизация.ФизЛицо = ФИОФизЛица.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицоОтветственного) КАК ФИОФизлицаОтветственного
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|				&ДатаАктуальности,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛица.ФизЛицо
	|					ИЗ
	|						ВТСписокФизЛицОрганизация КАК ФизЛица)) КАК ПаспортныеДанныеФизЛица
	|		ПО (ПаспортныеДанныеФизЛица.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданствоФизЛиц КАК ГражданствоФизЛица
	|		ПО СписокФизЛицОрганизация.ФизЛицо = ГражданствоФизЛица.ФизЛицо
	|			И СписокФизЛицОрганизация.Год = ГражданствоФизЛица.Год
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресРегистрацииФизЛица
	|		ПО СписокФизЛицОрганизация.ФизЛицо = АдресРегистрацииФизЛица.Объект
	|			И (АдресРегистрацииФизЛица.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
	|			И (АдресРегистрацииФизЛица.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныйКлассификатор КАК РегионРегистрацииФизЛица
	|		ПО (РегионРегистрацииФизЛица.ТипАдресногоЭлемента = 1)
	|			И (РегионРегистрацииФизЛица.Наименование + "" "" + РегионРегистрацииФизЛица.Сокращение = АдресРегистрацииФизЛица.Поле2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаИностранцев
	|		ПО СписокФизЛицОрганизация.ФизЛицо = АдресаИностранцев.Объект
	|			И (АдресаИностранцев.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнострАдресФизЛица))
	|			И (АдресаИностранцев.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК Страны
	|		ПО (Страны.Наименование = АдресаИностранцев.Поле1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛДоходыПредыдущегоМестаРаботы КАК НДФЛДоходыПредыдущегоМестаРаботы
	|		ПО СписокФизЛицОрганизация.ФизЛицо = НДФЛДоходыПредыдущегоМестаРаботы.ФизЛицо
	|			И СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛДоходыПредыдущегоМестаРаботы.Организация
	|			И (СписокФизЛицОрганизация.Год = ГОД(НДФЛДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода))
	|			И (МЕСЯЦ(НДФЛДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода) = 12)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаАктуальности,
	|				Сотрудник.ФизЛицо = &ФизЛицоОтветственного
	|					И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК ДолжностьОтветственного
	|		ПО (ВЫБОР
	|				КОГДА ДолжностьОтветственного.ПериодЗавершения <= &ДатаАктуальности
	|						И ДолжностьОтветственного.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ДолжностьОтветственного.ПричинаИзмененияСостоянияЗавершения
	|				ИНАЧЕ ДолжностьОтветственного.ПричинаИзмененияСостояния
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|			И (ДолжностьОтветственного.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО СписокФизЛицОрганизация.ФизЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизЛицо
	|			И СписокФизЛицОрганизация.Год = СтатусыФизЛицНаКонецНалоговогоПериода.Год
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	Год";
	
	ДанныеОФизЛицеОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.Период,
	|	НДФЛСведенияОДоходах.Организация,
	|	НДФЛСведенияОДоходах.ФизЛицо,
	|	НДФЛСведенияОДоходах.КодДохода,
	|	НДФЛСведенияОДоходах.ПериодРегистрации,
	|	НДФЛСведенияОДоходах.СуммаДохода,
	|	НДФЛСведенияОДоходах.СуммаВычета,
	|	НДФЛСведенияОДоходах.КодВычета,
	|	НДФЛСведенияОДоходах.ОбособленноеПодразделение,
	|	НДФЛСведенияОДоходах.КодПоОКАТО,
	|	НДФЛСведенияОДоходах.КПП,
	|	НДФЛСведенияОДоходах.ПодразделениеОрганизации,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.КодПоОКТМО
	|ПОМЕСТИТЬ ВТНДФЛСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛСведенияОДоходах.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	|			И НДФЛСведенияОДоходах.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛСведенияОДоходах.ОбособленноеПодразделение = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.Период,
	|	НДФЛРасчетыСБюджетом.ВидДвижения,
	|	НДФЛРасчетыСБюджетом.ФизЛицо,
	|	НДФЛРасчетыСБюджетом.Организация,
	|	НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода,
	|	НДФЛРасчетыСБюджетом.Налог,
	|	НДФЛРасчетыСБюджетом.ОбособленноеПодразделение,
	|	НДФЛРасчетыСБюджетом.ВидСтроки,
	|	НДФЛРасчетыСБюджетом.КодПоОКАТО,
	|	НДФЛРасчетыСБюджетом.КПП,
	|	НДФЛРасчетыСБюджетом.ПодразделениеОрганизации,
	|	НДФЛРасчетыСБюджетом.КрайнийСрокУплаты КАК СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	НДФЛРасчетыСБюджетом.КодПоОКТМО
	|ПОМЕСТИТЬ ВТНДФЛРасчетыСБюджетом
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛРасчетыСБюджетом.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	|			И (ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) = СписокФизЛицОрганизация.Год)
	|			И НДФЛРасчетыСБюджетом.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛРасчетыСБюджетом.ОбособленноеПодразделение = СписокФизЛицОрганизация.Организация)
	|ГДЕ
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКАТО,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НДФЛСведенияОДоходах.КодПоОКТМО <> &ПустойКодПоОКАТО
	|				ТОГДА НДФЛСведенияОДоходах.КодПоОКТМО
	|			КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|				ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКТМО
	|			ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|		КОНЕЦ) КАК КодПоОКТМО,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КПП <> &ПустойКПП
	|			ТОГДА НДФЛСведенияОДоходах.КПП
	|		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ КАК КПП
	|ИЗ
	|	ВТНДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КПП <> &ПустойКПП
	|			ТОГДА НДФЛСведенияОДоходах.КПП
	|		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НДФЛРасчетыСБюджетом.КодПоОКТМО <> &ПустойКодПоОКАТО
	|				ТОГДА НДФЛРасчетыСБюджетом.КодПоОКТМО
	|			КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|				ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКТМО
	|			ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|		КОНЕЦ),
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
	|			ТОГДА НДФЛРасчетыСБюджетом.КПП
	|		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ
	|ИЗ
	|	ВТНДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
	|			ТОГДА НДФЛРасчетыСБюджетом.КПП
	|		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ";
	Выборка = Запрос.Выполнить().Выбрать();
	СоответствиеОКАТОКПП = Новый ТаблицаЗначений;
	СоответствиеОКАТОКПП.Колонки.Добавить("КодПоОКАТО",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
	СоответствиеОКАТОКПП.Колонки.Добавить("КодПоОКТМО",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
	СоответствиеОКАТОКПП.Колонки.Добавить("КПП",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(9)));
	СоответствиеОКАТОКПП.Колонки.Добавить("ОКАТО_КПП",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(21)));
	СоответствиеОКАТОКПП.Колонки.Добавить("ОКТМО_КПП",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(21)));
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СоответствиеОКАТОКПП.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ОКАТО_КПП = СправкиПоНДФЛ.СуммаОКАТОиКПП(Выборка.КодПоОКАТО, Выборка.КПП);
		НоваяСтрока.ОКТМО_КПП = СправкиПоНДФЛ.СуммаОКАТОиКПП(Выборка.КодПоОКТМО, Выборка.КПП);
	КонецЦикла;
	Запрос.УстановитьПараметр("СоответствиеОКАТОКПП",СоответствиеОКАТОКПП);
	СоответствиеОКАТОКПП.Индексы.Добавить("КодПоОКАТО");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеОКАТОКПП.КодПоОКАТО,
	|	СоответствиеОКАТОКПП.КодПоОКТМО,
	|	СоответствиеОКАТОКПП.КПП,
	|	СоответствиеОКАТОКПП.ОКАТО_КПП,
	|	СоответствиеОКАТОКПП.ОКТМО_КПП
	|ПОМЕСТИТЬ ВТСоответствиеОКАТОКПП
	|ИЗ
	|	&СоответствиеОКАТОКПП КАК СоответствиеОКАТОКПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтатусФизЛицаСрезПоследних.Месяц, МЕСЯЦ) КАК Месяц,
	|	СтатусФизЛицаСрезПоследних.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НерезидентРаботающийНаОснованииПатента)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.ГражданинСтраныЕАЭС)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.УчастникПрограммыПоПереселениюСоотечественников)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.ЧленЭкипажаСуднаПодФлагомРФ)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Беженец)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.ВысококвалифицированныйИностранныйСпециалист)
	|			ТОГДА 3
	|	КОНЕЦ КАК Статус,
	|	ВЫБОР
	|		КОГДА СтатусФизЛицаСрезПоследних.Месяц < &ДатаЗакона285ФЗ
	|				И ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Нерезидент), ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Беженец))
	|			ТОГДА ЛОЖЬ
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтатусФизЛицаСрезПоследних.Месяц < &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.ГражданинСтраныЕАЭС), ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ,
	|	ВЫБОР
	|		КОГДА СтатусФизЛицаСрезПоследних.Месяц < &ДатаЗакона285ФЗ
	|				И СтатусФизЛица.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Беженец)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|		ИНАЧЕ ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|	КОНЕЦ КАК ТекущийСтатус
	|ПОМЕСТИТЬ ВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Месяц КАК Месяц,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СтатусФизЛица.Период) КАК ПериодСреза
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Периоды.Период КАК Месяц,
	|			СписокФизЛицОрганизация.ФизЛицо КАК Физлицо
	|		ИЗ
	|			ВТПериоды КАК Периоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|				ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)) КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|			ПО Периоды.Месяц >= СтатусФизЛица.Период
	|				И Периоды.Физлицо = СтатусФизЛица.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Физлицо,
	|		Периоды.Месяц) КАК СтатусФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|		ПО СтатусФизЛицаСрезПоследних.ПериодСреза = СтатусФизЛица.Период
	|			И СтатусФизЛицаСрезПоследних.Физлицо = СтатусФизЛица.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПримененияВычетовСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПримененияВычетовСрезПоследних.Месяц КАК Месяц,
	|	НДФЛПрименениеВычетов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТПрименениеВычетовВМесяцаРезидентства
	|ИЗ
	|	РегистрСведений.НДФЛПрименениеВычетов КАК НДФЛПрименениеВычетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СтатусФизЛицНаКонецМесяца.ФизЛицо КАК ФизЛицо,
	|			СтатусФизЛицНаКонецМесяца.Месяц КАК Месяц,
	|			МАКСИМУМ(НДФЛПрименениеВычетов.Период) КАК Период
	|		ИЗ
	|			ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛПрименениеВычетов КАК НДФЛПрименениеВычетов
	|				ПО СтатусФизЛицНаКонецМесяца.ФизЛицо = НДФЛПрименениеВычетов.Физлицо
	|					И (КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) >= НДФЛПрименениеВычетов.Период)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СтатусФизЛицНаКонецМесяца.ФизЛицо,
	|			СтатусФизЛицНаКонецМесяца.Месяц) КАК ПримененияВычетовСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО ПримененияВычетовСрезПоследних.ФизЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизЛицо
	|				И (ГОД(ПримененияВычетовСрезПоследних.Месяц) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО НДФЛПрименениеВычетов.Физлицо = ПримененияВычетовСрезПоследних.ФизЛицо
	|			И НДФЛПрименениеВычетов.Период = ПримененияВычетовСрезПоследних.Период
	|ГДЕ
	|	СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтандартныеВычетыСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	СтандартныеВычетыСрезПоследних.Месяц КАК Месяц,
	|	НДФЛСтандартныеВычетыФизлиц.КодВычетаЛичный КАК КодВычетаЛичный,
	|	NULL КАК КоличествоДетей,
	|	НДФЛСтандартныеВычетыФизлиц.Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыПоМесяцамРезидентства
	|ИЗ
	|	(ВЫБРАТЬ
	|		РезидентствоФизЛиц.ФизЛицо КАК ФизЛицо,
	|		НАЧАЛОПЕРИОДА(РезидентствоФизЛиц.Месяц, МЕСЯЦ) КАК Месяц,
	|		МАКСИМУМ(НДФЛСтандартныеВычетыФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТПрименениеВычетовВМесяцаРезидентства КАК РезидентствоФизЛиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК НДФЛСтандартныеВычетыФизлиц
	|			ПО РезидентствоФизЛиц.ФизЛицо = НДФЛСтандартныеВычетыФизлиц.Физлицо
	|				И (НАЧАЛОПЕРИОДА(РезидентствоФизЛиц.Месяц, МЕСЯЦ) >= НДФЛСтандартныеВычетыФизлиц.Период)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РезидентствоФизЛиц.ФизЛицо,
	|		НАЧАЛОПЕРИОДА(РезидентствоФизЛиц.Месяц, МЕСЯЦ)) КАК СтандартныеВычетыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК НДФЛСтандартныеВычетыФизлиц
	|		ПО СтандартныеВычетыСрезПоследних.ФизЛицо = НДФЛСтандартныеВычетыФизлиц.Физлицо
	|			И СтандартныеВычетыСрезПоследних.Период = НДФЛСтандартныеВычетыФизлиц.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтандартныеВычетыНаДетейСрезПоследних.ФизЛицо,
	|	СтандартныеВычетыНаДетейСрезПоследних.Месяц,
	|	НДФЛСтандартныеВычетыНаДетей.КодВычета,
	|	ВЫБОР
	|		КОГДА НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения < НАЧАЛОПЕРИОДА(СтандартныеВычетыНаДетейСрезПоследних.Месяц, МЕСЯЦ)
	|			ТОГДА НДФЛСтандартныеВычетыНаДетей.КоличествоДетейЗавершения
	|		ИНАЧЕ НДФЛСтандартныеВычетыНаДетей.КоличествоДетей
	|	КОНЕЦ,
	|	НДФЛСтандартныеВычетыНаДетей.Основание
	|ИЗ
	|	(ВЫБРАТЬ
	|		РезидентствоФизЛиц.ФизЛицо КАК ФизЛицо,
	|		НАЧАЛОПЕРИОДА(РезидентствоФизЛиц.Месяц, МЕСЯЦ) КАК Месяц,
	|		МАКСИМУМ(НДФЛСтандартныеВычетыНаДетей.Период) КАК Период,
	|		НДФЛСтандартныеВычетыНаДетей.КодВычета КАК КодВычета
	|	ИЗ
	|		ВТПрименениеВычетовВМесяцаРезидентства КАК РезидентствоФизЛиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	|			ПО РезидентствоФизЛиц.ФизЛицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	|				И (НАЧАЛОПЕРИОДА(РезидентствоФизЛиц.Месяц, МЕСЯЦ) >= НДФЛСтандартныеВычетыНаДетей.Период)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РезидентствоФизЛиц.ФизЛицо,
	|		НДФЛСтандартныеВычетыНаДетей.КодВычета,
	|		НАЧАЛОПЕРИОДА(РезидентствоФизЛиц.Месяц, МЕСЯЦ)) КАК СтандартныеВычетыНаДетейСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	|		ПО СтандартныеВычетыНаДетейСрезПоследних.ФизЛицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	|			И СтандартныеВычетыНаДетейСрезПоследних.КодВычета = НДФЛСтандартныеВычетыНаДетей.КодВычета
	|			И СтандартныеВычетыНаДетейСрезПоследних.Период = НДФЛСтандартныеВычетыНаДетей.Период
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения < НАЧАЛОПЕРИОДА(СтандартныеВычетыНаДетейСрезПоследних.Месяц, МЕСЯЦ)
	|				ТОГДА НДФЛСтандартныеВычетыНаДетей.КоличествоДетейЗавершения
	|			ИНАЧЕ НДФЛСтандартныеВычетыНаДетей.КоличествоДетей
	|		КОНЕЦ > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц,
	|	КодВычетаЛичный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрименениеВычетовВМесяцаРезидентства.ФизЛицо,
	|	ПрименениеВычетовВМесяцаРезидентства.Месяц,
	|	ПрименениеВычетовВМесяцаРезидентства.Организация,
	|	СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный КАК КодВычета,
	|	СтандартныеВычетыПоМесяцамРезидентства.КоличествоДетей,
	|	СтандартныеВычетыПоМесяцамРезидентства.Основание
	|ПОМЕСТИТЬ ВТСтандартныеВычетыФизЛицОрганизации
	|ИЗ
	|	ВТПрименениеВычетовВМесяцаРезидентства КАК ПрименениеВычетовВМесяцаРезидентства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства
	|		ПО ПрименениеВычетовВМесяцаРезидентства.ФизЛицо = СтандартныеВычетыПоМесяцамРезидентства.ФизЛицо
	|			И ПрименениеВычетовВМесяцаРезидентства.Месяц = СтандартныеВычетыПоМесяцамРезидентства.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный КАК КодВычета,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Размер) КАК Размер,
	|	НДФЛИмущественныеВычетыФизлиц.Период КАК Дата,
	|	НДФЛИмущественныеВычетыФизлиц.Год
	|ПОМЕСТИТЬ ВТСоциальныеИИмущественныеВычеты
	|ИЗ
	|	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО НДФЛИмущественныеВычетыФизлиц.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	|			И НДФЛИмущественныеВычетыФизлиц.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение = СписокФизЛицОрганизация.Организация)
	|			И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ФизЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный,
	|	НДФЛИмущественныеВычетыФизлиц.Период,
	|	НДФЛИмущественныеВычетыФизлиц.Год
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокФизЛицОрганизация.ФизЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПримененныйВычет),
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период,
	|	ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода)
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛПредоставленныеСтандартныеВычетыФизЛиц КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация
	|			И СписокФизЛицОрганизация.ФизЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.ГруппаВычета = ЗНАЧЕНИЕ(Перечисление.ГруппыВычетовПоНДФЛ.Социальные))
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.ФизЛицо,
	|	ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода),
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ДатаПолученияДохода,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТСтрокиДатПолученияДохода
	|ИЗ
	|	ВТНДФЛСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ДатаПолученияДохода >= &ДатаИзмененияИсчисленияДляИностранцев
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСБюджетом.МесяцНалоговогоПериода,
	|	РасчетыСБюджетом.ФизЛицо
	|ИЗ
	|	ВТНДФЛРасчетыСБюджетом КАК РасчетыСБюджетом
	|ГДЕ
	|	РасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаИзмененияИсчисленияДляИностранцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицаСрезПоследних.ДатаПолученияДохода,
	|	СтатусФизЛицаСрезПоследних.Физлицо КАК ФизЛицо,
	|	ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) КАК ТекущийСтатус
	|ПОМЕСТИТЬ ВТСтатусФизЛицНаДатуПолученияДохода
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Периоды.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(СтатусФизЛица.Период) КАК ПериодСреза
	|	ИЗ
	|		ВТСтрокиДатПолученияДохода КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|			ПО Периоды.ДатаПолученияДохода >= СтатусФизЛица.Период
	|				И Периоды.ФизЛицо = СтатусФизЛица.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.ФизЛицо,
	|		Периоды.ДатаПолученияДохода) КАК СтатусФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|		ПО СтатусФизЛицаСрезПоследних.ПериодСреза = СтатусФизЛица.Период
	|			И СтатусФизЛицаСрезПоследних.Физлицо = СтатусФизЛица.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛСведенияОДоходах.Организация КАК ГоловнаяОрганизация,
	|	НДФЛСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	ГОД(НДФЛСведенияОДоходах.Период) КАК Год,
	|	НДФЛСведенияОДоходах.КодДохода КАК КодДохода,
	|	НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ) КАК Месяц,
	|	НДФЛСведенияОДоходах.СуммаДохода КАК СуммаДохода,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.СуммаВычета, 0)
	|		КОГДА НДФЛСведенияОДоходах.КодВычета.НеПредоставляетсяНерезидентам
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.СуммаВычета, 0)
	|	КОНЕЦ КАК СуммаВычета,
	|	НДФЛСведенияОДоходах.КодДохода.Код КАК КодДоходаКод,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.ДатаПолученияДохода >= &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|						ТОГДА ВЫБОР
	|								КОГДА СтатусФизЛицНаДатуПолученияДохода.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|								ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|							КОНЕЦ
	|					КОГДА СтатусФизЛицНаДатуПолученияДохода.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|						ТОГДА ВЫБОР
	|								КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|								КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|								КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|							КОНЕЦ
	|					КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				КОНЕЦ
	|		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛСведенияОДоходах.Период >= &ДатаЗакона366ФЗ
	|							И НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛСведенияОДоходах.Период >= &ДатаЗакона366ФЗ
	|							И НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК СтавкаНаКонецГода,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКТМО,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КПП <> &ПустойКПП
	|			ТОГДА НДФЛСведенияОДоходах.КПП
	|		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ КАК КПП,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КодДохода.СоответствуетОплатеТруда
	|			ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК МесяцНачисления,
	|	ВЫБОР
	|		КОГДА НДФЛСведенияОДоходах.КодДохода.СоответствуетОплатеТруда
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ НДФЛСведенияОДоходах.ДатаПолученияДохода
	|	КОНЕЦ КАК ДатаВыплаты,
	|	НДФЛСведенияОДоходах.КодВычета,
	|	НДФЛСведенияОДоходах.ПериодРегистрации КАК Период,
	|	НДФЛСведенияОДоходах.ДатаПолученияДохода,
	|	НДФЛСведенияОДоходах.КодДохода.КодДляОтчетности КАК КодДоходаКодДляОтчетности,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛСведенияОДоходах.Период) = 2010
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодДляОтчетности2010
	|		КОГДА ГОД(НДФЛСведенияОДоходах.Период) < 2015
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодДляОтчетности2011
	|		КОГДА ГОД(НДФЛСведенияОДоходах.Период) = 2015
	|			ТОГДА НДФЛСведенияОДоходах.КодВычета.КодДляОтчетности2015
	|		ИНАЧЕ НДФЛСведенияОДоходах.КодВычета.КодДляОтчетности2016
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности,
	|	СтатусФизЛицНаДатуПолученияДохода.ТекущийСтатус КАК СтатусНаДатуПолученияДохода
	|ПОМЕСТИТЬ ВТДоходыПоСтавкам
	|ИЗ
	|	ВТНДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаКонецМесяца КАК СтатусыФизЛицПоМесяцам
	|		ПО НДФЛСведенияОДоходах.ФизЛицо = СтатусыФизЛицПоМесяцам.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ) = СтатусыФизЛицПоМесяцам.Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицПоГодам
	|		ПО НДФЛСведенияОДоходах.ФизЛицо = СтатусыФизЛицПоГодам.ФизЛицо
	|			И (ГОД(НДФЛСведенияОДоходах.Период) = СтатусыФизЛицПоГодам.Год)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаДатуПолученияДохода КАК СтатусФизЛицНаДатуПолученияДохода
	|		ПО НДФЛСведенияОДоходах.ФизЛицо = СтатусФизЛицНаДатуПолученияДохода.ФизЛицо
	|			И НДФЛСведенияОДоходах.ДатаПолученияДохода = СтатусФизЛицНаДатуПолученияДохода.ДатаПолученияДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛРасчетыСБюджетом.Организация КАК ГоловнаяОрганизация,
	|	НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
	|	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) КАК ГОД,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.Начисление)
	|			ТОГДА НДФЛРасчетыСБюджетом.Налог
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогНачислено,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.Удержание)
	|			ТОГДА НДФЛРасчетыСБюджетом.Налог
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогУдержано,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки <> ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.Удержание)
	|			ТОГДА 0
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА 0
	|		КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус <> ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|							И СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|						ТОГДА НДФЛРасчетыСБюджетом.Налог
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|				И СтатусыФизЛицПоГодам.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|			ТОГДА НДФЛРасчетыСБюджетом.Налог
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УдержаноКЗачетуПоСтавке13,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.ПереданоНаВзыскание)
	|			ТОГДА НДФЛРасчетыСБюджетом.Налог
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогПереданоНаВзыскание,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога)
	|			ТОГДА -НДФЛРасчетыСБюджетом.Налог
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогВозвращено,
	|	НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ) КАК Месяц,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|						ТОГДА ВЫБОР
	|								КОГДА СтатусФизЛицНаДатуПолученияДохода.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|								ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|							КОНЕЦ
	|					КОГДА СтатусФизЛицНаДатуПолученияДохода.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|						ТОГДА ВЫБОР
	|								КОГДА НДФЛРасчетыСБюджетом.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|								КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|								КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|									ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|							КОНЕЦ
	|					КОГДА НДФЛРасчетыСБюджетом.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|				КОНЕЦ
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона366ФЗ
	|							И НДФЛРасчетыСБюджетом.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА НДФЛРасчетыСБюджетом.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода >= &ДатаЗакона366ФЗ
	|							И НДФЛРасчетыСБюджетом.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА НДФЛРасчетыСБюджетом.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК СтавкаПоИтогамГода,
	|	НДФЛРасчетыСБюджетом.КодДохода,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКТМО,
	|	ВЫБОР
	|		КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
	|			ТОГДА НДФЛРасчетыСБюджетом.КПП
	|		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ КАК КПП,
	|	НДФЛРасчетыСБюджетом.Период,
	|	НДФЛРасчетыСБюджетом.СрокПеречисления,
	|	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК ДатаПолученияДохода
	|ПОМЕСТИТЬ ВТДанныеОНалогах
	|ИЗ
	|	ВТНДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаКонецМесяца КАК СтатусыФизЛицПоМесяцам
	|		ПО НДФЛРасчетыСБюджетом.ФизЛицо = СтатусыФизЛицПоМесяцам.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ) = СтатусыФизЛицПоМесяцам.Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицПоГодам
	|		ПО НДФЛРасчетыСБюджетом.ФизЛицо = СтатусыФизЛицПоГодам.ФизЛицо
	|			И (ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) = СтатусыФизЛицПоГодам.Год)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаДатуПолученияДохода КАК СтатусФизЛицНаДатуПолученияДохода
	|		ПО НДФЛРасчетыСБюджетом.ФизЛицо = СтатусФизЛицНаДатуПолученияДохода.ФизЛицо
	|			И НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода = СтатусФизЛицНаДатуПолученияДохода.ДатаПолученияДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДФЛИмущественныеВычетыФизлиц.Организация КАК ГоловнаяОрганизация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) КАК Месяц,
	|	СУММА(НДФЛИмущественныеВычетыФизлиц.Размер) КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКТМО,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.КПП <> &ПустойКПП
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КПП
	|		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ КАК КПП,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный КАК КодВычета,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛИмущественныеВычетыФизлиц.Период) = 2010
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2010
	|		КОГДА ГОД(НДФЛИмущественныеВычетыФизлиц.Период) < 2015
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2011
	|		КОГДА ГОД(НДФЛИмущественныеВычетыФизлиц.Период) = 2015
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2015
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2016
	|	КОНЕЦ КАК КодВычетаКодДляОтчетности
	|ПОМЕСТИТЬ ВТВычетыПоСтавкам
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизЛицо
	|				И НДФЛИмущественныеВычетыФизлиц.Год = СтатусыФизЛицНаКонецНалоговогоПериода.Год
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛИмущественныеВычетыФизлиц.Организация
	|			И СписокФизЛицОрганизация.ФизЛицо = НДФЛИмущественныеВычетыФизлиц.ФизЛицо
	|			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И (НДФЛИмущественныеВычетыФизлиц.Период МЕЖДУ &НачалоНП И &КонецНП)
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛИмущественныеВычетыФизлиц.Организация,
	|	НДФЛИмущественныеВычетыФизлиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛИмущественныеВычетыФизлиц.КПП <> &ПустойКПП
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КПП
	|		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ,
	|	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛИмущественныеВычетыФизлиц.Период) = 2010
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2010
	|		КОГДА ГОД(НДФЛИмущественныеВычетыФизлиц.Период) < 2015
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2011
	|		КОГДА ГОД(НДФЛИмущественныеВычетыФизлиц.Период) = 2015
	|			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2015
	|		ИНАЧЕ НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2016
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПримененныйВычет),
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП <> &ПустойКПП
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП
	|		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = 2010
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2010
	|		КОГДА ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) < 2015
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2011
	|		КОГДА ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = 2015
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2015
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2016
	|	КОНЕЦ
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛПредоставленныеСтандартныеВычетыФизЛиц КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|			ПО НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизЛицо
	|				И (ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = СтатусыФизЛицНаКонецНалоговогоПериода.Год)
	|		ПО СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация
	|			И СписокФизЛицОрганизация.ФизЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо
	|			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ СписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО
	|		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП <> &ПустойКПП
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП
	|		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ,
	|	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ЯвляетсяРезидентомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = 2010
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2010
	|		КОГДА ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) < 2015
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2011
	|		КОГДА ГОД(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода) = 2015
	|			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2015
	|		ИНАЧЕ НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2016
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизЛицо,
	|	ВычетыПоСтавкам.Месяц,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	ВычетыПоСтавкам.Ставка,
	|	ВычетыПоСтавкам.КодПоОКАТО,
	|	ВычетыПоСтавкам.КодПоОКТМО,
	|	ВычетыПоСтавкам.КПП
	|ПОМЕСТИТЬ ВТВычетыСгруппированныеДанные
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизЛицо,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.Ставка,
	|	ВычетыПоСтавкам.КодПоОКАТО,
	|	ВычетыПоСтавкам.КодПоОКТМО,
	|	ВычетыПоСтавкам.КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходахПоРазделам.Месяц КАК Месяц,
	|	СУММА(СведенияОДоходахПоРазделам.СуммаДохода) КАК СуммаДохода,
	|	СведенияОДоходахПоРазделам.КодПоОКАТО,
	|	СведенияОДоходахПоРазделам.КодПоОКТМО,
	|	СведенияОДоходахПоРазделам.КПП
	|ПОМЕСТИТЬ ВТДоходыПоМесяцамПоСтавке13Итог
	|ИЗ
	|	ВТДоходыПоСтавкам КАК СведенияОДоходахПоРазделам
	|ГДЕ
	|	СведенияОДоходахПоРазделам.СтавкаНаКонецГода = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|	И СведенияОДоходахПоРазделам.КодДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходахПоРазделам.ГоловнаяОрганизация,
	|	СведенияОДоходахПоРазделам.ФизЛицо,
	|	СведенияОДоходахПоРазделам.Месяц,
	|	СведенияОДоходахПоРазделам.КодПоОКАТО,
	|	СведенияОДоходахПоРазделам.КодПоОКТМО,
	|	СведенияОДоходахПоРазделам.КПП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоходыПоСтавкам.ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизЛицо,
	|	ДоходыПоСтавкам.Год,
	|	ДоходыПоСтавкам.Месяц,
	|	ДоходыПоСтавкам.Ставка,
	|	ЕСТЬNULL(МАКСИМУМ(ПредыдущийМесяц.Месяц), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДоходыПоСтавкам.Месяц, ГОД), СЕКУНДА, -1)) КАК ПредыдущийМесяц,
	|	ДоходыПоСтавкам.КодПоОКАТО,
	|	ДоходыПоСтавкам.КодПоОКТМО,
	|	ДоходыПоСтавкам.КПП
	|ПОМЕСТИТЬ ВТДоходыПо13
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ПредыдущийМесяц
	|		ПО ДоходыПоСтавкам.ГоловнаяОрганизация = ПредыдущийМесяц.ГоловнаяОрганизация
	|			И ДоходыПоСтавкам.ФизЛицо = ПредыдущийМесяц.ФизЛицо
	|			И ДоходыПоСтавкам.Год = ПредыдущийМесяц.Год
	|			И ДоходыПоСтавкам.Месяц > ПредыдущийМесяц.Месяц
	|			И ДоходыПоСтавкам.КодПоОКАТО = ПредыдущийМесяц.КодПоОКАТО
	|			И ДоходыПоСтавкам.КодПоОКТМО = ПредыдущийМесяц.КодПоОКТМО
	|			И ДоходыПоСтавкам.КПП = ПредыдущийМесяц.КПП
	|			И ДоходыПоСтавкам.Ставка = ПредыдущийМесяц.Ставка
	|ГДЕ
	|	ДоходыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|	И ДоходыПоСтавкам.КодДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|	И (ДоходыПоСтавкам.ДатаПолученияДохода < &ДатаИзмененияИсчисленияДляИностранцев
	|			ИЛИ ДоходыПоСтавкам.СтатусНаДатуПолученияДохода = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоСтавкам.ГоловнаяОрганизация,
	|	ДоходыПоСтавкам.ФизЛицо,
	|	ДоходыПоСтавкам.Год,
	|	ДоходыПоСтавкам.Месяц,
	|	ДоходыПоСтавкам.Ставка,
	|	ДоходыПоСтавкам.КодПоОКАТО,
	|	ДоходыПоСтавкам.КодПоОКТМО,
	|	ДоходыПоСтавкам.КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПо13.ГоловнаяОрганизация,
	|	ДоходыПо13.ФизЛицо,
	|	ДоходыПо13.Год,
	|	ДоходыПо13.Месяц,
	|	ДоходыПо13.КодПоОКАТО,
	|	ДоходыПо13.КодПоОКТМО,
	|	ДоходыПо13.КПП,
	|	ДоходыПо13.Ставка,
	|	СУММА(ДоходыПоСтавкам.СуммаДохода) КАК СуммаДохода,
	|	СУММА(ДоходыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ПОМЕСТИТЬ ВТДоходыДоПолученияСтатусаРезидента
	|ИЗ
	|	ВТДоходыПо13 КАК ДоходыПо13
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоСтавкам КАК ДоходыПоСтавкам
	|		ПО ДоходыПо13.ГоловнаяОрганизация = ДоходыПоСтавкам.ГоловнаяОрганизация
	|			И ДоходыПо13.ФизЛицо = ДоходыПоСтавкам.ФизЛицо
	|			И (ДоходыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И ДоходыПо13.Месяц > ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.ПредыдущийМесяц < ДоходыПоСтавкам.Месяц
	|			И ДоходыПо13.Год = ДоходыПоСтавкам.Год
	|			И ДоходыПо13.КодПоОКАТО = ДоходыПоСтавкам.КодПоОКАТО
	|			И ДоходыПо13.КодПоОКТМО = ДоходыПоСтавкам.КодПоОКТМО
	|			И ДоходыПо13.КПП = ДоходыПоСтавкам.КПП
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПо13.Год,
	|	ДоходыПо13.ГоловнаяОрганизация,
	|	ДоходыПо13.ФизЛицо,
	|	ДоходыПо13.Месяц,
	|	ДоходыПо13.Ставка,
	|	ДоходыПо13.КодПоОКАТО,
	|	ДоходыПо13.КодПоОКТМО,
	|	ДоходыПо13.КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизЛицо КАК ФизЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма,
	|	ЕСТЬNULL(ПеречислениеНДФЛвБюджет.ПлатежноеПоручениеНомер, """") КАК НомерПП,
	|	ЕСТЬNULL(ПеречислениеНДФЛвБюджет.ПлатежноеПоручениеДата, """") КАК ДатаПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОКАТО_КПП КАК ОКАТО_КПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОКТМО_КПП КАК ОКТМО_КПП,
	|	ВЫБОР
	|		КОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация
	|		ИНАЧЕ РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|ИЗ
	|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбособленныеПодразделения КАК СписокФизЛицОрганизация
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	|			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация = СписокФизЛицОрганизация.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеречислениеНДФЛвБюджет КАК ПеречислениеНДФЛвБюджет
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор = ПеречислениеНДФЛвБюджет.Ссылка
	|ГДЕ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода КАК Месяц,
	|	МИНИМУМ(ДанныеОНалогах.Период) КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.ОКАТО_КПП,
	|	ДанныеОНалогах.ОКТМО_КПП
	|ПОМЕСТИТЬ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.ОКАТО_КПП,
	|	ДанныеОНалогах.ОКТМО_КПП,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо,
	|	ДанныеОНалогах.ГОД,
	|	ДанныеОНалогах.Месяц КАК МесяцНалоговогоПериода,
	|	ДанныеОНалогах.СтавкаПоИтогамГода КАК Ставка,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК Налог,
	|	СоответствиеОКАТОКПП.ОКАТО_КПП,
	|	СоответствиеОКАТОКПП.ОКТМО_КПП
	|ПОМЕСТИТЬ ВТУдержаноНДФЛПоМесяцам
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеОКАТОКПП КАК СоответствиеОКАТОКПП
	|		ПО ДанныеОНалогах.КПП = СоответствиеОКАТОКПП.КПП
	|			И (ВЫБОР
	|				КОГДА ДанныеОНалогах.ГОД < &ГодПереходаНаКодыОКТМО
	|					ТОГДА ДанныеОНалогах.КодПоОКАТО = СоответствиеОКАТОКПП.КодПоОКАТО
	|				ИНАЧЕ ДанныеОНалогах.КодПоОКТМО = СоответствиеОКАТОКПП.КодПоОКТМО
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо,
	|	ДанныеОНалогах.ГОД,
	|	ДанныеОНалогах.Месяц,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	СоответствиеОКАТОКПП.ОКАТО_КПП,
	|	СоответствиеОКАТОКПП.ОКТМО_КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.ОКАТО_КПП,
	|	ДанныеОНалогах.ОКТМО_КПП,
	|	СУММА(ДанныеОНалогах.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТПеречисленоНДФЛПоМесяцам
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК ДанныеОНалогах
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизЛицо,
	|	ДанныеОНалогах.МесяцНалоговогоПериода,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.ОКАТО_КПП,
	|	ДанныеОНалогах.ОКТМО_КПП,
	|	ДанныеОНалогах.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Перечислено.ГоловнаяОрганизация,
	|	Перечислено.ФизЛицо,
	|	Перечислено.МесяцНалоговогоПериода,
	|	Перечислено.ОКАТО_КПП,
	|	Перечислено.ОКТМО_КПП,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Перечислено.Сумма - (ВЫРАЗИТЬ(Перечислено.Сумма * ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) / (ЕСТЬNULL(УдержаноНДФЛПоСтавке30.Налог, 0) + ЕСТЬNULL(УдержаноНДФЛПоСтавке13.Налог, 0)) КАК ЧИСЛО(22, 0)))
	|	КОНЕЦ КАК КЗачетуПоСтавке13
	|ПОМЕСТИТЬ ВТКЗачетуПоПеречислениям
	|ИЗ
	|	ВТПеречисленоНДФЛПоМесяцам КАК Перечислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке13
	|		ПО Перечислено.ФизЛицо = УдержаноНДФЛПоСтавке13.ФизЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке13.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке13.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке13.ГоловнаяОрганизация
	|			И (ВЫБОР
	|				КОГДА ГОД(Перечислено.МесяцНалоговогоПериода) < &ГодПереходаНаКодыОКТМО
	|					ТОГДА Перечислено.ОКАТО_КПП = УдержаноНДФЛПоСтавке13.ОКАТО_КПП
	|				ИНАЧЕ Перечислено.ОКТМО_КПП = УдержаноНДФЛПоСтавке13.ОКТМО_КПП
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдержаноНДФЛПоМесяцам КАК УдержаноНДФЛПоСтавке30
	|		ПО Перечислено.ФизЛицо = УдержаноНДФЛПоСтавке30.ФизЛицо
	|			И Перечислено.МесяцНалоговогоПериода = УдержаноНДФЛПоСтавке30.МесяцНалоговогоПериода
	|			И (УдержаноНДФЛПоСтавке30.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|			И Перечислено.ГоловнаяОрганизация = УдержаноНДФЛПоСтавке30.ГоловнаяОрганизация
	|			И (ВЫБОР
	|				КОГДА ГОД(Перечислено.МесяцНалоговогоПериода) < &ГодПереходаНаКодыОКТМО
	|					ТОГДА Перечислено.ОКАТО_КПП = УдержаноНДФЛПоСтавке30.ОКАТО_КПП
	|				ИНАЧЕ Перечислено.ОКТМО_КПП = УдержаноНДФЛПоСтавке30.ОКТМО_КПП
	|			КОНЕЦ)
	|ГДЕ
	|	Перечислено.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗачтенныеАвансы.Организация КАК ГоловнаяОрганизация,
	|	ЗачтенныеАвансы.ФизЛицо КАК ФизЛицо,
	|	ЗачтенныеАвансы.МесяцНалоговогоПериода КАК Месяц,
	|	ЗачтенныеАвансы.Период КАК Дата,
	|	СУММА(ЗачтенныеАвансы.Сумма) КАК ЗачтеноАвансов,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.КПП <> &ПустойКПП
	|			ТОГДА ЗачтенныеАвансы.КПП
	|		КОГДА ЕСТЬNULL(ЗачтенныеАвансы.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА ЗачтенныеАвансы.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(ЗачтенныеАвансы.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ КАК КПП,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА ЗачтенныеАвансы.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(ЗачтенныеАвансы.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА ЗачтенныеАвансы.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(ЗачтенныеАвансы.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗачтенныеАвансы.МесяцНалоговогоПериода >= &ДатаЗакона366ФЗ
	|							И ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК Ставка,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗачтенныеАвансы.МесяцНалоговогоПериода >= &ДатаЗакона366ФЗ
	|							И ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ КАК СтавкаПоИтогамГода
	|ИЗ
	|	РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ КАК ЗачтенныеАвансы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО ЗачтенныеАвансы.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	|			И (ГОД(ЗачтенныеАвансы.МесяцНалоговогоПериода) = СписокФизЛицОрганизация.Год)
	|			И ЗачтенныеАвансы.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|				ИЛИ ЗачтенныеАвансы.ОбособленноеПодразделение = СписокФизЛицОрганизация.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаКонецМесяца КАК СтатусыФизЛицПоМесяцам
	|		ПО ЗачтенныеАвансы.ФизЛицо = СтатусыФизЛицПоМесяцам.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ЗачтенныеАвансы.МесяцНалоговогоПериода, МЕСЯЦ) = СтатусыФизЛицПоМесяцам.Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицПоГодам
	|		ПО ЗачтенныеАвансы.ФизЛицо = СтатусыФизЛицПоГодам.ФизЛицо
	|			И ЗачтенныеАвансы.Год = СтатусыФизЛицПоГодам.Год
	|ГДЕ
	|	ЗачтенныеАвансы.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	|	И ЗачтенныеАвансы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗачтенныеАвансы.Организация,
	|	ЗачтенныеАвансы.ФизЛицо,
	|	ЗачтенныеАвансы.МесяцНалоговогоПериода,
	|	ЗачтенныеАвансы.Период,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.КПП <> &ПустойКПП
	|			ТОГДА ЗачтенныеАвансы.КПП
	|		КОГДА ЕСТЬNULL(ЗачтенныеАвансы.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	|			ТОГДА ЗачтенныеАвансы.ПодразделениеОрганизации.КПП
	|		ИНАЧЕ ЕСТЬNULL(ЗачтенныеАвансы.ОбособленноеПодразделение.КПП, &ПустойКПП)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.КодПоОКТМО <> &ПустойКодПоОКАТО
	|			ТОГДА ЗачтенныеАвансы.КодПоОКТМО
	|		КОГДА ЕСТЬNULL(ЗачтенныеАвансы.ПодразделениеОрганизации.КодПоОКТМО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	|			ТОГДА ЗачтенныеАвансы.ПодразделениеОрганизации.КодПоОКТМО
	|		ИНАЧЕ ЕСТЬNULL(ЗачтенныеАвансы.ОбособленноеПодразделение.КодПоОКТМО, &ПустойКодПоОКАТО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоМесяцам.ТекущийСтатус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗачтенныеАвансы.МесяцНалоговогоПериода >= &ДатаЗакона366ФЗ
	|							И ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	|			ТОГДА ВЫБОР
	|					КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				КОНЕЦ
	|		КОГДА СтатусыФизЛицПоГодам.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ВЫБОР
	|					КОГДА ЗачтенныеАвансы.МесяцНалоговогоПериода >= &ДатаЗакона366ФЗ
	|							И ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|					КОГДА ЗачтенныеАвансы.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|				КОНЕЦ
	|		КОГДА ЗачтенныеАвансы.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ГОД(ВычетыПоСтавкам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ВычетыПоСтавкам.КодПоОКАТО
	|		ИНАЧЕ ВычетыПоСтавкам.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ВычетыПоСтавкам.КПП КАК КПП,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|ГДЕ
	|	ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ФизЛицо,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА ГОД(ВычетыПоСтавкам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ВычетыПоСтавкам.КодПоОКАТО
	|		ИНАЧЕ ВычетыПоСтавкам.КодПоОКТМО
	|	КОНЕЦ,
	|	ВычетыПоСтавкам.Месяц,
	|	ВычетыПоСтавкам.КПП
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц
	|ИТОГИ
	|	СУММА(СуммаВычета)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицНаКонецМесяца.ФизЛицо КАК ФизЛицо,
	|	КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Месяц,
	|	СтатусФизЛицНаКонецМесяца.Статус
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|ИТОГИ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПодтверждения.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизЛицо КАК ФизЛицо,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерВходящегоДокумента) КАК Номер,
	|	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокФизЛицОрганизация.ФизЛицо КАК ФизЛицо,
	|		СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|		МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ПО НДФЛИмущественныеВычетыФизлиц.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	|				И НДФЛИмущественныеВычетыФизлиц.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|				И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	|					ИЛИ НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение = СписокФизЛицОрганизация.Организация)
	|				И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	|				И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокФизЛицОрганизация.ФизЛицо,
	|		СписокФизЛицОрганизация.ГоловнаяОрганизация) КАК ДокументыПодтверждения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НДФЛПодтверждениеПраваНаИмущественныйВычет.РаботникиОрганизации КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	|		ПО ДокументыПодтверждения.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	|			И ДокументыПодтверждения.ФизЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыПодтверждения.ГоловнаяОрганизация,
	|	ДокументыПодтверждения.ФизЛицо
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата КАК ДатаСправки,
	|	МАКСИМУМ(ЕСТЬNULL(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.НомерСправки, СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки)) КАК НомерСправки,
	|	МаксимальныеДатыСправок.Сотрудник КАК ФизЛицо,
	|	1 КАК ТипСправки
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И (СписокФизЛицОрганизация.ГоловнаяОрганизация = ВЫБОР
	|					КОГДА СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация
	|					ИНАЧЕ СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				КОНЕЦ)
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод < &ГодИзмененияИсчисленияДляИностранцев)
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетность), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетностьЗаРеорганизованнуюОрганизацию)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ПринятоНалоговымОрганом)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Дата)
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрганС2015.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Сотрудник
	|				И (СписокФизЛицОрганизация.ГоловнаяОрганизация = ВЫБОР
	|					КОГДА СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Организация
	|					ИНАЧЕ СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				КОНЕЦ)
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетность), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетностьЗаРеорганизованнуюОрганизацию)))
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Проведен)
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.ПринятоНалоговымОрганом)
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.НалоговыйПериод >= &ГодИзмененияИсчисленияДляИностранцев)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Сотрудник) КАК МаксимальныеДатыСправок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрганС2015.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.Ссылка.Дата
	|ГДЕ
	|	(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.Сотрудник ЕСТЬ НЕ NULL 
	|			ИЛИ СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник ЕСТЬ НЕ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаксимальныеДатыСправок.Дата,
	|	МАКСИМУМ(ЕСТЬNULL(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.НомерСправки, СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки)),
	|	МаксимальныеДатыСправок.Сотрудник,
	|	3
	|ИЗ
	|	(ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|				И (СписокФизЛицОрганизация.ГоловнаяОрганизация = ВЫБОР
	|					КОГДА СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация
	|					ИНАЧЕ СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				КОНЕЦ)
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод < &ГодИзмененияИсчисленияДляИностранцев)
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛ), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛЗаРеорганизованнуюОрганизацию)))
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	|				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ПринятоНалоговымОрганом)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Сотрудник,
	|		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Дата)
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрганС2015.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации
	|			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Сотрудник
	|				И (СписокФизЛицОрганизация.ГоловнаяОрганизация = ВЫБОР
	|					КОГДА СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Организация
	|					ИНАЧЕ СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Организация.ГоловнаяОрганизация
	|				КОНЕЦ)
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок В (ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛ), ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛЗаРеорганизованнуюОрганизацию)))
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.Проведен)
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.ПринятоНалоговымОрганом)
	|				И (СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Ссылка.НалоговыйПериод >= &ГодИзмененияИсчисленияДляИностранцев)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СправкаПоНДФЛВНалоговыйОрганС2015СотрудникиОрганизации.Сотрудник) КАК МаксимальныеДатыСправок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрганС2015.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015
	|		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.Сотрудник
	|			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.Ссылка.Дата
	|ГДЕ
	|	(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации2015.Сотрудник ЕСТЬ НЕ NULL 
	|			ИЛИ СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник ЕСТЬ НЕ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальныеДатыСправок.Сотрудник,
	|	МаксимальныеДатыСправок.Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(СправкаПоНДФЛСотруднику2015.Дата, СправкаПоНДФЛСотруднику.Дата)),
	|	МАКСИМУМ(ЕСТЬNULL(СправкаПоНДФЛСотруднику2015.Номер, СправкаПоНДФЛСотруднику.Номер)),
	|	ПоследниеДатыСправок.ФизЛицо,
	|	2
	|ИЗ
	|	(ВЫБРАТЬ
	|		СписокФизЛицОрганизация.ФизЛицо КАК ФизЛицо,
	|		МАКСИМУМ(СправкаПоНДФЛСотруднику.Дата) КАК Дата
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛСотруднику КАК СправкаПоНДФЛСотруднику
	|			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|				И (СписокФизЛицОрганизация.ГоловнаяОрганизация = ВЫБОР
	|					КОГДА СправкаПоНДФЛСотруднику.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА СправкаПоНДФЛСотруднику.Ссылка.Организация
	|					ИНАЧЕ СправкаПоНДФЛСотруднику.Ссылка.Организация.ГоловнаяОрганизация
	|				КОНЕЦ)
	|				И (СправкаПоНДФЛСотруднику.НалоговыйПериод = ГОД(&НачалоНП))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокФизЛицОрганизация.ФизЛицо
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СписокФизЛицОрганизация.ФизЛицо,
	|		МАКСИМУМ(СправкаПоНДФЛСотрудникуС2015.Дата)
	|	ИЗ
	|		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛСотрудникуС2015 КАК СправкаПоНДФЛСотрудникуС2015
	|			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛСотрудникуС2015.Сотрудник
	|				И (СписокФизЛицОрганизация.ГоловнаяОрганизация = ВЫБОР
	|					КОГДА СправкаПоНДФЛСотрудникуС2015.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|						ТОГДА СправкаПоНДФЛСотрудникуС2015.Ссылка.Организация
	|					ИНАЧЕ СправкаПоНДФЛСотрудникуС2015.Ссылка.Организация.ГоловнаяОрганизация
	|				КОНЕЦ)
	|				И (СправкаПоНДФЛСотрудникуС2015.НалоговыйПериод = ГОД(&НачалоНП))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокФизЛицОрганизация.ФизЛицо) КАК ПоследниеДатыСправок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛСотруднику КАК СправкаПоНДФЛСотруднику
	|		ПО ПоследниеДатыСправок.Дата = СправкаПоНДФЛСотруднику.Дата
	|			И ПоследниеДатыСправок.ФизЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛСотрудникуС2015 КАК СправкаПоНДФЛСотруднику2015
	|		ПО ПоследниеДатыСправок.Дата = СправкаПоНДФЛСотруднику2015.Дата
	|			И ПоследниеДатыСправок.ФизЛицо = СправкаПоНДФЛСотруднику2015.Сотрудник
	|ГДЕ
	|	(СправкаПоНДФЛСотруднику2015.Сотрудник ЕСТЬ НЕ NULL 
	|			ИЛИ СправкаПоНДФЛСотруднику.Сотрудник ЕСТЬ НЕ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДатыСправок.ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	ТипСправки
	|ИТОГИ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтандартныеВычетыФизЛицОрганизации.ФизЛицо КАК ФизЛицо,
	|	СтандартныеВычетыФизЛицОрганизации.Месяц КАК Месяц,
	|	ВЫБОР
	|		КОГДА ГОД(СтандартныеВычетыФизЛицОрганизации.Месяц) = 2010
	|			ТОГДА СтандартныеВычетыФизЛицОрганизации.КодВычета.КодДляОтчетности2010
	|		КОГДА ГОД(СтандартныеВычетыФизЛицОрганизации.Месяц) < 2015
	|			ТОГДА СтандартныеВычетыФизЛицОрганизации.КодВычета.КодДляОтчетности2011
	|		КОГДА ГОД(СтандартныеВычетыФизЛицОрганизации.Месяц) = 2015
	|			ТОГДА СтандартныеВычетыФизЛицОрганизации.КодВычета.КодДляОтчетности2015
	|		ИНАЧЕ СтандартныеВычетыФизЛицОрганизации.КодВычета.КодДляОтчетности2016
	|	КОНЕЦ КАК КодВычета,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(СтандартныеВычетыФизЛицОрганизации.КоличествоДетей, 1) * ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.Размер, 0) КАК Размер,
	|	СтандартныеВычетыФизЛицОрганизации.Основание
	|ИЗ
	|	ВТСтандартныеВычетыФизЛицОрганизации КАК СтандартныеВычетыФизЛицОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(
	|				&КонецНП,
	|				КодВычета В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СтандартныеВычетыПоМесяцамРезидентства.КодВычетаЛичный
	|					ИЗ
	|						ВТСтандартныеВычетыПоМесяцамРезидентства КАК СтандартныеВычетыПоМесяцамРезидентства)) КАК НДФЛРазмерВычетовСрезПоследних
	|		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = НДФЛРазмерВычетовСрезПоследних.КодВычета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ПО СтандартныеВычетыФизЛицОрганизации.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	|			И СтандартныеВычетыФизЛицОрганизации.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодВычета,
	|	Месяц
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СоциальныеИИмущественныеВычеты.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Год = 2010
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2010
	|		КОГДА СоциальныеИИмущественныеВычеты.Год < 2015
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2011
	|		КОГДА СоциальныеИИмущественныеВычеты.Год = 2015
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2015
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2016
	|	КОНЕЦ КАК КодВычетаКод,
	|	СоциальныеИИмущественныеВычеты.Размер,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(СоциальныеИИмущественныеВычеты.Дата, МЕСЯЦ) = СтатусФизЛицНаКонецМесяца.Месяц
	|				ТОГДА СоциальныеИИмущественныеВычеты.Дата
	|			ИНАЧЕ СтатусФизЛицНаКонецМесяца.Месяц
	|		КОНЕЦ) КАК Дата
	|ИЗ
	|	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСоциальныеИИмущественныеВычеты КАК СоциальныеИИмущественныеВычеты
	|		ПО СтатусФизЛицНаКонецМесяца.ФизЛицо = СоциальныеИИмущественныеВычеты.ФизЛицо
	|			И (КОНЕЦПЕРИОДА(СтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) >= СоциальныеИИмущественныеВычеты.Дата)
	|ГДЕ
	|	СтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ
	|
	|СГРУППИРОВАТЬ ПО
	|	СоциальныеИИмущественныеВычеты.ФизЛицо,
	|	СоциальныеИИмущественныеВычеты.Размер,
	|	СоциальныеИИмущественныеВычеты.Дата,
	|	СоциальныеИИмущественныеВычеты.ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА СоциальныеИИмущественныеВычеты.Год = 2010
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2010
	|		КОГДА СоциальныеИИмущественныеВычеты.Год < 2015
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2011
	|		КОГДА СоциальныеИИмущественныеВычеты.Год = 2015
	|			ТОГДА СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2015
	|		ИНАЧЕ СоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2016
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодВычетаКод,
	|	Дата
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоМесяцам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.ФизЛицо КАК ФизЛицо,
	|	ДоходыПоМесяцам.Месяц КАК МесяцНалоговогоПериода,
	|	МАКСИМУМ(ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0)) КАК СуммаДоходаДоРезидентства,
	|	МАКСИМУМ(ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0)) КАК СуммаВычетаДоРезидентства,
	|	МАКСИМУМ(ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаДохода, 0) - ЕСТЬNULL(ДоходыДоПолученияСтатусаРезидента.СуммаВычета, 0)) КАК ОблагаемаяСуммаДоходаДоРезидентства,
	|	ДоходыПоМесяцам.МесяцНачисления КАК МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты КАК ДатаВыплаты,
	|	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0)) КАК СуммаДохода,
	|	ДоходыПоМесяцам.КодВычета КАК КодВычетаСсылка,
	|	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) КАК СуммаВычета,
	|	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) КАК ОблагаемаяСуммаДохода,
	|	0 КАК НалогНачислено,
	|	ДоходыПоМесяцам.Период КАК ДатаНачисления,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности КАК КодДохода,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	ДоходыПоМесяцам.Ставка,
	|	""Раздел4_Ставка13"" КАК Раздел,
	|	ВЫБОР
	|		КОГДА ГОД(ДоходыПоМесяцам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДоходыПоМесяцам.КодПоОКАТО
	|		ИНАЧЕ ДоходыПоМесяцам.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ДоходыПоМесяцам.КПП КАК КПП
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыДоПолученияСтатусаРезидента КАК ДоходыДоПолученияСтатусаРезидента
	|		ПО ДоходыПоМесяцам.ГоловнаяОрганизация = ДоходыДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|			И ДоходыПоМесяцам.ФизЛицо = ДоходыДоПолученияСтатусаРезидента.ФизЛицо
	|			И ДоходыПоМесяцам.Год = ДоходыДоПолученияСтатусаРезидента.Год
	|			И ДоходыПоМесяцам.Месяц = ДоходыДоПолученияСтатусаРезидента.Месяц
	|			И (ВЫБОР
	|				КОГДА ГОД(ДоходыПоМесяцам.Месяц) < &ГодПереходаНаКодыОКТМО
	|					ТОГДА ДоходыПоМесяцам.КодПоОКАТО = ДоходыДоПолученияСтатусаРезидента.КодПоОКАТО
	|				ИНАЧЕ ДоходыПоМесяцам.КодПоОКТМО = ДоходыДоПолученияСтатусаРезидента.КодПоОКТМО
	|			КОНЕЦ)
	|			И ДоходыПоМесяцам.КПП = ДоходыДоПолученияСтатусаРезидента.КПП
	|			И ДоходыПоМесяцам.Ставка = ДоходыДоПолученияСтатусаРезидента.Ставка
	|ГДЕ
	|	ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|	И ДоходыПоМесяцам.КодДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоМесяцам.ФизЛицо,
	|	ДоходыПоМесяцам.Месяц,
	|	ДоходыПоМесяцам.МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты,
	|	ДоходыПоМесяцам.КодДохода,
	|	ДоходыПоМесяцам.КодВычета,
	|	ДоходыПоМесяцам.ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.Период,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|	ДоходыПоМесяцам.Ставка,
	|	ДоходыПоМесяцам.КПП,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ВЫБОР
	|		КОГДА ГОД(ДоходыПоМесяцам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДоходыПоМесяцам.КодПоОКАТО
	|		ИНАЧЕ ДоходыПоМесяцам.КодПоОКТМО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоходыПоМесяцам.ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.ФизЛицо,
	|	ДоходыПоМесяцам.Месяц,
	|	0,
	|	0,
	|	0,
	|	ДоходыПоМесяцам.МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0),
	|	ДоходыПоМесяцам.КодВычета,
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|	ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0),
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.09
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.15
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.13
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.3
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|			ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.35
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.Период,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|	ДоходыПоМесяцам.Ставка,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|			ТОГДА ""Раздел4_Ставка35_15_9""
	|		ИНАЧЕ ""Раздел4_Ставка30""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГОД(ДоходыПоМесяцам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДоходыПоМесяцам.КодПоОКАТО
	|		ИНАЧЕ ДоходыПоМесяцам.КодПоОКТМО
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.КПП
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|ГДЕ
	|	(ДоходыПоМесяцам.Ставка <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ИЛИ ДоходыПоМесяцам.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010))
	|	И ДоходыПоМесяцам.ДатаПолученияДохода < &ДатаИзмененияИсчисленияДляИностранцев
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоходыПоМесяцам.ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.ФизЛицо,
	|	ДоходыПоМесяцам.Месяц,
	|	0,
	|	0,
	|	0,
	|	ДоходыПоМесяцам.МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты,
	|	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0)),
	|	ДоходыПоМесяцам.КодВычета,
	|	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)),
	|	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)),
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|			ТОГДА СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.09
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|			ТОГДА СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.15
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ТОГДА СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.13
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	|			ТОГДА СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.3
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|			ТОГДА СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.35
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.Период,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|	ДоходыПоМесяцам.Ставка,
	|	ВЫБОР
	|		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	|				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	|				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	|			ТОГДА ""Раздел4_Ставка35_15_9""
	|		ИНАЧЕ ""Раздел4_Ставка30""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГОД(ДоходыПоМесяцам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДоходыПоМесяцам.КодПоОКАТО
	|		ИНАЧЕ ДоходыПоМесяцам.КодПоОКТМО
	|	КОНЕЦ,
	|	ДоходыПоМесяцам.КПП
	|ИЗ
	|	ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	|ГДЕ
	|	(ДоходыПоМесяцам.Ставка <> ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	|			ИЛИ ДоходыПоМесяцам.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010))
	|	И ДоходыПоМесяцам.ДатаПолученияДохода >= &ДатаИзмененияИсчисленияДляИностранцев
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоМесяцам.ГоловнаяОрганизация,
	|	ДоходыПоМесяцам.ФизЛицо,
	|	ДоходыПоМесяцам.Месяц,
	|	ДоходыПоМесяцам.МесяцНачисления,
	|	ДоходыПоМесяцам.ДатаВыплаты,
	|	ДоходыПоМесяцам.КодВычета,
	|	ДоходыПоМесяцам.Период,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	|	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	|	ДоходыПоМесяцам.Ставка,
	|	ДоходыПоМесяцам.КПП,
	|	ВЫБОР
	|		КОГДА ГОД(ДоходыПоМесяцам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДоходыПоМесяцам.КодПоОКАТО
	|		ИНАЧЕ ДоходыПоМесяцам.КодПоОКТМО
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Раздел,
	|	МесяцНалоговогоПериода,
	|	МесяцНачисления,
	|	ДатаНачисления,
	|	ДатаВыплаты,
	|	КодДохода,
	|	КодВычета
	|ИТОГИ
	|	МАКСИМУМ(СуммаДоходаДоРезидентства),
	|	МАКСИМУМ(СуммаВычетаДоРезидентства),
	|	МАКСИМУМ(ОблагаемаяСуммаДоходаДоРезидентства),
	|	СУММА(СуммаДохода),
	|	СУММА(СуммаВычета),
	|	СУММА(ОблагаемаяСуммаДохода),
	|	МАКСИМУМ(НалогНачислено)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Раздел,
	|	МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизЛицо КАК ФизЛицо,
	|	ВычетыПоСтавкам.Месяц КАК Месяц,
	|	ВычетыПоСтавкам.КодВычета КАК КодВычетаСсылка,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	МАКСИМУМ(ЕСТЬNULL(ДоходыПоМесяцамПоСтавке13Итог.СуммаДохода, 0)) КАК СуммаДохода,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	ВЫБОР
	|		КОГДА ГОД(ВычетыПоСтавкам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ВычетыПоСтавкам.КодПоОКАТО
	|		ИНАЧЕ ВычетыПоСтавкам.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ВычетыПоСтавкам.КПП КАК КПП
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоМесяцамПоСтавке13Итог КАК ДоходыПоМесяцамПоСтавке13Итог
	|		ПО ВычетыПоСтавкам.ГоловнаяОрганизация = ДоходыПоМесяцамПоСтавке13Итог.ГоловнаяОрганизация
	|			И ВычетыПоСтавкам.ФизЛицо = ДоходыПоМесяцамПоСтавке13Итог.ФизЛицо
	|			И ВычетыПоСтавкам.Месяц = ДоходыПоМесяцамПоСтавке13Итог.Месяц
	|			И (ВЫБОР
	|				КОГДА ГОД(ВычетыПоСтавкам.Месяц) < &ГодПереходаНаКодыОКТМО
	|					ТОГДА ВычетыПоСтавкам.КодПоОКАТО = ДоходыПоМесяцамПоСтавке13Итог.КодПоОКАТО
	|				ИНАЧЕ ВычетыПоСтавкам.КодПоОКТМО = ДоходыПоМесяцамПоСтавке13Итог.КодПоОКТМО
	|			КОНЕЦ)
	|			И ВычетыПоСтавкам.КПП = ДоходыПоМесяцамПоСтавке13Итог.КПП
	|			И (ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.КодВычета,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизЛицо,
	|	ВычетыПоСтавкам.Месяц,
	|	ВЫБОР
	|		КОГДА ГОД(ВычетыПоСтавкам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ВычетыПоСтавкам.КодПоОКАТО
	|		ИНАЧЕ ВычетыПоСтавкам.КодПоОКТМО
	|	КОНЕЦ,
	|	ВычетыПоСтавкам.КПП
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц,
	|	КодВычета
	|ИТОГИ
	|	СУММА(СуммаВычета),
	|	МАКСИМУМ(СуммаДохода)
	|ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Месяц < &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ДанныеОНалогах.Месяц
	|		ИНАЧЕ ДанныеОНалогах.ДатаПолученияДохода
	|	КОНЕЦ КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	СУММА(ДанныеОНалогах.НалогНачислено) КАК НалогНачислено,
	|	ВЫБОР
	|		КОГДА ГОД(ДанныеОНалогах.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДанныеОНалогах.КодПоОКАТО
	|		ИНАЧЕ ДанныеОНалогах.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ДанныеОНалогах.КПП КАК КПП,
	|	ДанныеОНалогах.СтавкаПоИтогамГода
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогНачислено <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ФизЛицо,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.КПП,
	|	ДанныеОНалогах.СтавкаПоИтогамГода,
	|	ВЫБОР
	|		КОГДА ГОД(ДанныеОНалогах.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДанныеОНалогах.КодПоОКАТО
	|		ИНАЧЕ ДанныеОНалогах.КодПоОКТМО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Месяц < &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ДанныеОНалогах.Месяц
	|		ИНАЧЕ ДанныеОНалогах.ДатаПолученияДохода
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Месяц < &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ДанныеОНалогах.Месяц
	|		ИНАЧЕ ДанныеОНалогах.ДатаПолученияДохода
	|	КОНЕЦ КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаИзмененияСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ КАК СрокПеречисления,
	|	СУММА(ДанныеОНалогах.НалогУдержано) КАК НалогУдержано,
	|	СУММА(ДанныеОНалогах.УдержаноКЗачетуПоСтавке13) КАК КЗачетуПоСтавке13,
	|	ВЫБОР
	|		КОГДА ГОД(ДанныеОНалогах.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДанныеОНалогах.КодПоОКАТО
	|		ИНАЧЕ ДанныеОНалогах.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ДанныеОНалогах.КПП КАК КПП
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогУдержано <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОНалогах.ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Месяц < &ДатаИзмененияИсчисленияДляИностранцев
	|			ТОГДА ДанныеОНалогах.Месяц
	|		ИНАЧЕ ДанныеОНалогах.ДатаПолученияДохода
	|	КОНЕЦ,
	|	ДанныеОНалогах.Период,
	|	ДанныеОНалогах.Ставка,
	|	ВЫБОР
	|		КОГДА ДанныеОНалогах.Период < &ДатаИзмененияСроковУплатыНалога
	|			ТОГДА ДанныеОНалогах.Период
	|		ИНАЧЕ ДанныеОНалогах.СрокПеречисления
	|	КОНЕЦ,
	|	ДанныеОНалогах.КПП,
	|	ВЫБОР
	|		КОГДА ГОД(ДанныеОНалогах.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДанныеОНалогах.КодПоОКАТО
	|		ИНАЧЕ ДанныеОНалогах.КодПоОКТМО
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалогВозвращено,
	|	ВЫБОР
	|		КОГДА ГОД(ДанныеОНалогах.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДанныеОНалогах.КодПоОКАТО
	|		ИНАЧЕ ДанныеОНалогах.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ДанныеОНалогах.КПП КАК КПП
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогВозвращено <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	|	ДанныеОНалогах.Месяц КАК Месяц,
	|	ДанныеОНалогах.Период КАК Дата,
	|	ДанныеОНалогах.Ставка КАК Ставка,
	|	ДанныеОНалогах.НалогПереданоНаВзыскание,
	|	ВЫБОР
	|		КОГДА ГОД(ДанныеОНалогах.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ДанныеОНалогах.КодПоОКАТО
	|		ИНАЧЕ ДанныеОНалогах.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ДанныеОНалогах.КПП КАК КПП
	|ИЗ
	|	ВТДанныеОНалогах КАК ДанныеОНалогах
	|ГДЕ
	|	ДанныеОНалогах.НалогПереданоНаВзыскание <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизЛицо КАК ФизЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК Месяц,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Дата,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма,
	|	ЕСТЬNULL(ПеречисленоДоПолученияСтатусаРезидента.КЗачетуПоСтавке13, 0) КАК КЗачетуПоСтавке13,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.НомерПП,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ДатаПП,
	|	ВЫБОР
	|		КОГДА ГОД(РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОКАТО_КПП
	|		ИНАЧЕ РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОКТМО_КПП
	|	КОНЕЦ КАК ОКАТО_КПП
	|ИЗ
	|	ВТРасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПерваяСтрокаПеречисленногоНалогаЗаМесяц КАК ПерваяСтрокаПеречисленногоНалогаЗаМесяц
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТКЗачетуПоПеречислениям КАК ПеречисленоДоПолученияСтатусаРезидента
	|			ПО ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация = ПеречисленоДоПолученияСтатусаРезидента.ГоловнаяОрганизация
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизЛицо = ПеречисленоДоПолученияСтатусаРезидента.ФизЛицо
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц = ПеречисленоДоПолученияСтатусаРезидента.МесяцНалоговогоПериода
	|				И ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ОКАТО_КПП = ПеречисленоДоПолученияСтатусаРезидента.ОКАТО_КПП
	|				И (ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30))
	|		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ГоловнаяОрганизация = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ГоловнаяОрганизация
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизЛицо = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ФизЛицо
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Месяц
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Ставка
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОКАТО_КПП = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.ОКАТО_КПП
	|			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период = ПерваяСтрокаПеречисленногоНалогаЗаМесяц.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	ОКАТО_КПП,
	|	Месяц,
	|	Дата,
	|	Ставка
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	ОКАТО_КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизЛицо КАК ФизЛицо,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	|	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	|	ВЫБОР
	|		КОГДА ГОД(ВычетыПоСтавкам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ВычетыПоСтавкам.КодПоОКАТО
	|		ИНАЧЕ ВычетыПоСтавкам.КодПоОКТМО
	|	КОНЕЦ КАК КодПоОКАТО,
	|	ВычетыПоСтавкам.КПП КАК КПП
	|ИЗ
	|	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВычетыПоСтавкам.ГоловнаяОрганизация,
	|	ВычетыПоСтавкам.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ГОД(ВычетыПоСтавкам.Месяц) < &ГодПереходаНаКодыОКТМО
	|			ТОГДА ВычетыПоСтавкам.КодПоОКАТО
	|		ИНАЧЕ ВычетыПоСтавкам.КодПоОКТМО
	|	КОНЕЦ,
	|	ВычетыПоСтавкам.КПП,
	|	ВычетыПоСтавкам.КодВычетаКодДляОтчетности
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	КодПоОКАТО,
	|	КПП,
	|	КодВычета
	|ИТОГИ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо";
		
	Результат = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = Результат.Количество();
	
	ВыборкаАвансыЗачтенныеИтоги	= Результат[КоличествоРезультатов - 15].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаВычетовПоСтавке13 = Результат[КоличествоРезультатов - 14].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаСтатусов = Результат[КоличествоРезультатов - 13].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаУведомления = Результат[КоличествоРезультатов - 12].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаСправкиНДФЛ = Результат[КоличествоРезультатов - 11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаСтандартныеВычеты = Результат[КоличествоРезультатов - 10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаСоциальныеВычеты = Результат[КоличествоРезультатов - 9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНалогиПоМесяцаПоРазделам = Результат[КоличествоРезультатов - 8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаВычетыПоМесяцамПоВидам   = Результат[КоличествоРезультатов - 7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНалогиНачисленныеИтоги   = Результат[КоличествоРезультатов - 6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНалогиУдержанныеИтоги    = Результат[КоличествоРезультатов - 5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНалогиВозвращенныеИтоги  = Результат[КоличествоРезультатов - 4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНалогиВзысканиеИтоги     = Результат[КоличествоРезультатов - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаНалогиПеречисленныеИтоги = Результат[КоличествоРезультатов - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаВычетыИтоги = Результат[КоличествоРезультатов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
КонецПроцедуры

Процедура ПолучитьСпискиФизЛицИСотрудников(СтрокиДеревоДанных, СписокФизЛиц)
	
	Для Каждого СтрокаДанных из СтрокиДеревоДанных Цикл
		Если СтрокаДанных.ФизЛицо <> Неопределено  //СтрокаДанных.Организация <> Неопределено тогда
			                                                                                       Тогда
			СтрокаСписка = СписокФизЛиц.Добавить();
			СтрокаСписка.ФизЛицо     = СтрокаДанных.ФизЛицо;
			СтрокаСписка.Организация = СтрокаДанных.Организация;
			СтрокаСписка.ГоловнаяОрганизация = СтрокаДанных.ГоловнаяОрганизация;
			СтрокаСписка.Год = Год(СтрокаДанных.Год);
			СтрокаСписка.НЕОтбиратьПоОП = (СтрокаДанных.ГоловнаяОрганизация = СтрокаДанных.Организация)
			
		ИначеЕсли СтрокаДанных.Строки.Количество() > 0 Тогда
			
			ПолучитьСпискиФизЛицИСотрудников(СтрокаДанных.Строки, СписокФизЛиц);
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Неопределено, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	ЗначениеПанелипользователя = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ЭтотОбъект);
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	
	Группировка = ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроек, "");
	Группировка.ПоляГруппировки.Элементы.Очистить();
	
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ГоловнаяОрганизация");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "Организация");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ГОД");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ФизЛицо");
	
	ЭлементСортировки = КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементСортировки.Использование = Истина;
	ЭлементСортировки.Поле = Новый ПолеКомпоновкиДанных("ФизЛицо");
	
	ОтборПоОрганизации = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		ЭлементОрганизация = Новый ПолеКомпоновкиДанных("Организация");
		Если ЭлементОтбора.Использование = Истина И ЭлементОтбора.ЛевоеЗначение = ЭлементОрганизация Тогда
			ОтборПоОрганизации = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("ОтборПоОрганизации");
	ПараметрОтборПоОрганизации = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки); 
	ПараметрОтборПоОрганизации.Значение = ОтборПоОрганизации;
	ПараметрОтборПоОрганизации.Использование = Истина;
	
	ДокументРезультат.Очистить();
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Ответственный = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "Ответственный").Значение;
	ПервыйРаз     = истина;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДеревоДанных =  Новый ДеревоЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	МассивТипов = Новый Массив(2);
	МассивТипов[0]= Тип("Null");
	СписокФизЛицОрганизация = Новый ТаблицаЗначений;
	МассивТипов[1]= Тип("СправочникСсылка.ФизическиеЛица");
	СписокФизЛицОрганизация.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("СправочникСсылка.Организации");
	СписокФизЛицОрганизация.Колонки.Добавить("ГоловнаяОрганизация", Новый ОписаниеТипов(МассивТипов));
	СписокФизЛицОрганизация.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Число");
	СписокФизЛицОрганизация.Колонки.Добавить("Год", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Булево");
	СписокФизЛицОрганизация.Колонки.Добавить("НеОтбиратьПоОП", Новый ОписаниеТипов(МассивТипов));

	ПолучитьСпискиФизЛицИСотрудников(ДеревоДанных.Строки, СписокФизЛицОрганизация);
	Группировки = ТиповыеОтчеты.ПолучитьПоляГруппировок(КомпоновщикНастроек);
	Уровень = 0;
	
	ПолучитьДанныеДляПостроенияОтчета(СписокФизЛицОрганизация);
	
	ВывестиКарточки(ДокументРезультат, ДеревоДанных.Строки, Уровень, Группировки, ЕстьОшибки);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы 	= 	ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ТолькоПросмотр		= 	Истина;
	
	Возврат ДокументРезультат;
	
КонецФункции
	
#Если ТолстыйКлиентОбычноеПриложение Тогда

// Заполняет табличный документ
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//
Процедура СформироватьМакет(ДокументРезультат, ФизЛицо, Год, ГоловнаяОрганизация, Уровень) Экспорт
    Ответственный = Справочники.Пользователи.ПустаяСсылка();

	ДатаПереходаНаКодыОКТМО = ПроведениеРасчетов.ДатаПереходаНаКодыОКТМО();
	
	Если НЕ ПервыйРаз тогда
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	Иначе
		ПервыйРаз = ложь;
	КонецЕсли;
	
	Макет =	ПолучитьМакет("ФормаРегистрНалоговогоУчетаПоНДФЛ");
	
	НалогПоСтавке13ИсчисленПомесячно = Год < ПроведениеРасчетов.ДатаИзмененияПорядкаИсчисленияНалогаДляИностранцев();
	
	// Области-разделы
    Раздел1 = Макет.ПолучитьОбласть("Раздел1");									    
	Раздел2 = Макет.ПолучитьОбласть("Раздел2");	
	Раздел3 = Макет.ПолучитьОбласть("Раздел3");
	Раздел7 = Макет.ПолучитьОбласть("Раздел7");
	РасчетыНалогаПоСтавке13Шапка = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13Шапка");
	РасчетыНалогаПоСтавке13Строка = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13Строка");
	РасчетыНалогаПоСтавке13МесяцГруппа = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13МесяцГруппа");
	РасчетыНалогаПоСтавке13БылоПоСтавке30 = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13БылоПоСтавке30");
	РасчетыНалогаПоСтавке13Итог = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13ИтогМесяц");
	ПредоставленныеВычетыШапка = Макет.ПолучитьОбласть("ПредоставленныеВычетыШапка");
	ПредоставленныеВычетыЗаголовок = Макет.ПолучитьОбласть("ПредоставленныеВычетыЗаголовок");
	ПредоставленныеВычетыШапкаМесяцГруппа = Макет.ПолучитьОбласть("ПредоставленныеВычетыШапкаМесяцГруппа");
	ПредоставленныеВычетыСтрока = Макет.ПолучитьОбласть("ПредоставленныеВычетыСтрока");
	ПредоставленныеВычетыИтог = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтог");
	НалогПоСтавке30Заголовок = Макет.ПолучитьОбласть("НалогПоСтавке30Заголовок");
	НалогПоСтавке30Шапка = Макет.ПолучитьОбласть("НалогПоСтавке30Шапка");
	НалогПоСтавке30Строка = Макет.ПолучитьОбласть("НалогПоСтавке30Строка");
	НалогПоСтавке30Итог = Макет.ПолучитьОбласть("НалогПоСтавке30Итог");
	НалогПоСтавке9Шапка = Макет.ПолучитьОбласть("НалогПоСтавке9Шапка");
	НалогПоСтавке9Строка = Макет.ПолучитьОбласть("НалогПоСтавке9Строка");
	НалогПоСтавке9Итог = Макет.ПолучитьОбласть("НалогПоСтавке9Итог");
	ИсчисленоЗаголовок = Макет.ПолучитьОбласть("ИсчисленоЗаголовок");
	ИсчисленоШапка = Макет.ПолучитьОбласть("ИсчисленоШапка" + ?(НалогПоСтавке13ИсчисленПомесячно,"","2015"));
	ИсчисленоСтрока = Макет.ПолучитьОбласть("ИсчисленоСтрока");
	ЗачтеноАвансовЗаголовок = Макет.ПолучитьОбласть("ЗачтеноАвансовЗаголовок");
	ЗачтеноАвансовШапка = Макет.ПолучитьОбласть("ЗачтеноАвансовШапка");
	ЗачтеноАвансовСтрока = Макет.ПолучитьОбласть("ЗачтеноАвансовСтрока");
	УдержаноЗаголовок = Макет.ПолучитьОбласть("УдержаноЗаголовок");
	УдержаноШапка = Макет.ПолучитьОбласть("УдержаноШапка" + ?(НалогПоСтавке13ИсчисленПомесячно,"","2015"));
	УдержаноСтрока = Макет.ПолучитьОбласть("УдержаноСтрока" + ?(НалогПоСтавке13ИсчисленПомесячно,"","2015"));
	УдержаноБылоПоСтавке30 = Макет.ПолучитьОбласть("УдержаноБылоПоСтавке30");
	ВозвращеноЗаголовок = Макет.ПолучитьОбласть("ВозвращеноЗаголовок");
	ВозвращеноШапка = Макет.ПолучитьОбласть("ВозвращеноШапка");
	ВозвращеноСтрока = Макет.ПолучитьОбласть("ВозвращеноСтрока");
	ПереданоНаВзысканиеЗаголовок = Макет.ПолучитьОбласть("ПереданоНаВзысканиеЗаголовок");
	ПереданоНаВзысканиеШапка = Макет.ПолучитьОбласть("ПереданоНаВзысканиеШапка");
	ПереданоНаВзысканиеСтрока = Макет.ПолучитьОбласть("ПереданоНаВзысканиеСтрока");
	НалогПеречисленныйЗаголовок = Макет.ПолучитьОбласть("НалогПеречисленныйЗаголовок");
	НалогПеречисленныйШапка = Макет.ПолучитьОбласть("НалогПеречисленныйШапка");
	НалогПеречисленныйСтрока = Макет.ПолучитьОбласть("НалогПеречисленныйСтрока");
	НалогПеречисленныйБылоПоСтавке30 = Макет.ПолучитьОбласть("НалогПеречисленныйБылоПоСтавке30");
	ПредоставленныеВычетыИтогиЗаголовок = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиЗаголовок");
	ПредоставленныеВычетыИтогиИтог = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиИтог");
	ОбщиеСуммыИтогЗаголовок = Макет.ПолучитьОбласть("ОбщиеСуммыИтогЗаголовок");
	СтандартныеВычетыЗаголовок = Макет.ПолучитьОбласть("СтандартныеВычетыЗаголовок");
	СтандартныеВычетыШапка = Макет.ПолучитьОбласть("СтандартныеВычетыШапка");
	СтандартныеВычетыСтрока = Макет.ПолучитьОбласть("СтандартныеВычетыСтрока");
	СоциальныеВычетыЗаголовок = Макет.ПолучитьОбласть("СоциальныеВычетыЗаголовок");
	СоциальныеВычетыШапка = Макет.ПолучитьОбласть("СоциальныеВычетыШапка");
	СоциальныеВычетыСтрока = Макет.ПолучитьОбласть("СоциальныеВычетыСтрока");
	ИмущественныйВычетУведомление = Макет.ПолучитьОбласть("ИмущественныйВычетУведомление");
	Подписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьПустыеВычеты = Макет.ПолучитьОбласть("ОбластьПустыеВычеты");
	
	ДатаИзмененияНалогообложенияДивидендов = ПроведениеРасчетов.ДатаИзмененияНалогообложенияДивидендов();
	Если Год < ДобавитьМесяц(ДатаПереходаНаКодыОКТМО, -12) Тогда
		Раздел4 = Макет.ПолучитьОбласть("Раздел4");
		ОбщиеСуммыИтогШапка = Макет.ПолучитьОбласть("ОбщиеСуммыИтогШапка");
		ОбщиеСуммыСтроки = Макет.ПолучитьОбласть("ОбщиеСуммыСтроки");
		ПредоставленныеВычетыИтогиШапка = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиШапка");
		ПредоставленныеВычетыИтогиСтрока = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиСтрока");
	ИначеЕсли Год < ДатаПереходаНаКодыОКТМО Тогда
		Раздел4 = Макет.ПолучитьОбласть("Раздел4_2013");
		ОбщиеСуммыИтогШапка = Макет.ПолучитьОбласть("ОбщиеСуммыИтогШапка2013");
		ОбщиеСуммыСтроки = Макет.ПолучитьОбласть("ОбщиеСуммыСтроки2013");
		ПредоставленныеВычетыИтогиШапка = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиШапка2013");
		ПредоставленныеВычетыИтогиСтрока = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиСтрока2013");
	Иначе 
		Раздел4 = Макет.ПолучитьОбласть("Раздел4_2014");
		ПредоставленныеВычетыИтогиШапка = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиШапка2014");
		ПредоставленныеВычетыИтогиСтрока = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиСтрока2014");
		Если Год < ДатаИзмененияНалогообложенияДивидендов Тогда
			ОбщиеСуммыИтогШапка = Макет.ПолучитьОбласть("ОбщиеСуммыИтогШапка2014");
			ОбщиеСуммыСтроки = Макет.ПолучитьОбласть("ОбщиеСуммыСтроки2014");
		Иначе	
			ОбщиеСуммыИтогШапка = Макет.ПолучитьОбласть("ОбщиеСуммыИтогШапка2015");
			ОбщиеСуммыСтроки = Макет.ПолучитьОбласть("ОбщиеСуммыСтроки2015");
		КонецЕсли;
	КонецЕсли;
	
	Если Год < ДатаИзмененияНалогообложенияДивидендов Тогда
		РасчетыНалогаПоСтавке13Заголовок = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13Заголовок");
		НалогПоСтавке9Заголовок = Макет.ПолучитьОбласть("НалогПоСтавке9Заголовок");
	Иначе
		РасчетыНалогаПоСтавке13Заголовок = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13Заголовок2015");
		НалогПоСтавке9Заголовок = Макет.ПолучитьОбласть("НалогПоСтавке9Заголовок2015");
	КонецЕсли;

	//-----------------------------------------------------------------------------                                 
	// РАЗДЕЛ 1 и 2
	
	ТаблицаПоНалогамИтоги = СоздатьПустуюТаблицуИтогов();
	
	НалоговыйПериод = Год(Год);
	
	СтруктураОтбора = Новый Структура("ФизЛицо, Год, ГоловнаяОрганизация", ФизЛицо, НалоговыйПериод, ГоловнаяОрганизация);
	
	ДанныеОФизЛицеОрганизации.Сбросить();
	
	Если ДанныеОФизЛицеОрганизации.НайтиСледующий(СтруктураОтбора) тогда
		
		// Заполнение данных раздела 1
		Раздел1.Параметры.ГодНП = "" + Формат(Год, "ЧГ=0; ДФ=yyyy");
		Раздел1.Параметры.ИНН = "" + ДанныеОФизЛицеОрганизации.Организация_ИНН +"\" + ДанныеОФизЛицеОрганизации.Организация_КПП;
		Раздел1.Параметры.КодИМНС = ДанныеОФизЛицеОрганизации.Организация_КодИМНС;
		Раздел1.Параметры.НазваниеОрганизации = ДанныеОФизЛицеОрганизации.Организация_Наименование;
		
		// Заполнение данных раздела 2
		Раздел2.Параметры.ИНН = ДанныеОФизЛицеОрганизации.ФизЛицо_ИНН;
		Раздел2.Параметры.ФИО = ДанныеОФизЛицеОрганизации.ФизЛицо_ФИО;
		Раздел2.Параметры.КодДокумента = ДанныеОФизЛицеОрганизации.ФизЛицо_КодДокументаУдЛичн;
		Раздел2.Параметры.СерияНомерДокумента = ДанныеОФизЛицеОрганизации.ФизЛицо_СерияНомерДокументаУдЛичн;
		Раздел2.Параметры.ДатаРождения = Формат(ДанныеОФизЛицеОрганизации.ФизЛицо_ДатаРождения, "ДФ=dd.MM.yyyy");
		Раздел2.Параметры.КодСтраны = ДанныеОФизЛицеОрганизации.ФизЛицо_КодСтраны;
		Раздел2.Параметры.СтранаПроживания = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКодСтраны;
		Раздел2.Параметры.Индекс = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресИндекс;
		Раздел2.Параметры.Регион = ПроцедурыУправленияПерсоналом.ПолучитьКодРегионаРФИзКодаАдресногоЭлемента(ДанныеОФизЛицеОрганизации.ФизЛицо_АдресРегион);
		Раздел2.Параметры.Район = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресРайон;
		Раздел2.Параметры.Город = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресГород;
		Раздел2.Параметры.НаселенныйПункт = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресНаселенныйПункт;
		Раздел2.Параметры.Улица = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресУлица;
		Раздел2.Параметры.Дом = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресДом;
		Раздел2.Параметры.Корпус = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКорпус;
		Раздел2.Параметры.Квартира = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКвартира;
		Раздел2.Параметры.СтранаПроживания = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКодСтраны;
		Раздел2.Параметры.Адрес = ДанныеОФизЛицеОрганизации.ФизЛицо_ИностранныйАдрес;
		
	КонецЕсли;
	
	ДокументРезультат.Вывести(Раздел1);
	
	ВыборкаСтатусов.Сбросить();
	
	СтатусНаКонецПериода = Перечисления.СтатусыНалогоплательщиковПоНДФЛ.Резидент;
	Если ВыборкаСтатусов.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
		ВыборкаДетали = ВыборкаСтатусов.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			Раздел2.Параметры["Статус" + Строка(Месяц(ВыборкаДетали.Месяц))] = ВыборкаДетали.Статус;	
			СтатусНаКонецПериода = ?(ВыборкаДетали.Статус = 2, Перечисления.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент, Перечисления.СтатусыНалогоплательщиковПоНДФЛ.Резидент);
		КонецЦикла;	
	КонецЕсли;	
	
	ДокументРезультат.Вывести(Раздел2);
	
	Раздел3.Параметры.Доход = ДанныеОФизЛицеОрганизации.ФизЛицо_ДоходыПредыдущегоМестаРаботы;
	ДокументРезультат.Вывести(Раздел3);
	
	ВыводимыеОбласти = Новый Массив;
	
	ТаблицаСтандартныхВычетов = Новый ТаблицаЗначений();
	ТаблицаСтандартныхВычетов.Колонки.Добавить("КодВычета");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыРазмер");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыПериодС");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыПериодПо");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыОснование");
	
	ПредыдущийВычет = Неопределено;
	ПредыдущийПериод = '00010101';
	ПредыдущийРазмер = Неопределено;
	ПредыдущаяСтрока = Неопределено;
	СтрокаТаблицы = Неопределено;
		
	ВыборкаСтандартныеВычеты.Сбросить();
		
	Если ВыборкаСтандартныеВычеты.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
	
		ВыборкаСтандартныеВычетыПоФизЛицу = ВыборкаСтандартныеВычеты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Если ВыборкаСтандартныеВычетыПоФизЛицу.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаСтандартныеВычетыПоФизЛицу.Выбрать();
			
			ВыводимыеОбласти.Добавить(СтандартныеВычетыЗаголовок);
			ВыводимыеОбласти.Добавить(СтандартныеВычетыШапка);
			ВыводимыеОбласти.Добавить(СтандартныеВычетыСтрока);
			
			Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда 
	       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			
			ДокументРезультат.Вывести(СтандартныеВычетыШапка);
			
			Пока ВыборкаДетали.Следующий() Цикл
				Если ВыборкаДетали.КодВычета = ПредыдущийВычет И (КонецМесяца(ПредыдущийПериод) + 1) = ВыборкаДетали.Месяц И ПредыдущийРазмер = ВыборкаДетали.Размер Тогда
					ДатаЗавершения = КонецМесяца(ВыборкаДетали.Месяц);
				Иначе
					Если ПредыдущаяСтрока <> Неопределено Тогда 
						ПредыдущаяСтрока.СтандартныеВычетыПериодПо = ДатаЗавершения;
					КонецЕсли;	
					СтрокаТаблицы = ТаблицаСтандартныхВычетов.Добавить();
					СтрокаТаблицы.КодВычета = ВыборкаДетали.КодВычета;
					СтрокаТаблицы.СтандартныеВычетыПериодС = ВыборкаДетали.Месяц; 
				    СтрокаТаблицы.СтандартныеВычетыРазмер = ВыборкаДетали.Размер;
					СтрокаТаблицы.СтандартныеВычетыОснование = ВыборкаДетали.Основание;
					
					ДатаЗавершения = КонецМесяца(ВыборкаДетали.Месяц);
				КонецЕсли;	
				
				ПредыдущаяСтрока = СтрокаТаблицы;
				
				ПредыдущийВычет  = ВыборкаДетали.КодВычета;
				ПредыдущийПериод = ВыборкаДетали.Месяц;
				ПредыдущийРазмер = ВыборкаДетали.Размер;
			КонецЦикла;	
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаТаблицы.СтандартныеВычетыПериодПо = ДатаЗавершения;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	ЕстьПравоНавычеты = Ложь;
	Для Каждого Вычет Из ТаблицаСтандартныхВычетов Цикл
		ВыводимыеОбласти.Очистить();
		СтандартныеВычетыСтрока.Параметры.КодВычета = Вычет.КодВычета;
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыРазмер = Вычет.СтандартныеВычетыРазмер;
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыПериодС = Формат(Вычет.СтандартныеВычетыПериодС, "ДФ=дд.ММ.гггг");
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыПериодПо = Формат(Вычет.СтандартныеВычетыПериодПо, "ДФ=дд.ММ.гггг");
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыОснование = Вычет.СтандартныеВычетыОснование;
		
		ВыводимыеОбласти.Добавить(СтандартныеВычетыСтрока);
		
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ДокументРезультат.Вывести(СтандартныеВычетыШапка);
		КонецЕсли;
		
		ДокументРезультат.Вывести(СтандартныеВычетыСтрока);
		ЕстьПравоНавычеты = Истина;
	КонецЦикла;	
	
	ВыборкаСоциальныеВычеты.Сбросить();
	
	ВыводимыеОбласти.Очистить();
	Если ВыборкаСоциальныеВычеты.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
		
		ВыборкаПоФизЛицу = ВыборкаСоциальныеВычеты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаПоФизЛицу.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаПоФизЛицу.Выбрать();
			
			ВыводимыеОбласти.Добавить(СоциальныеВычетыЗаголовок);
			ВыводимыеОбласти.Добавить(СоциальныеВычетыШапка);
			ВыводимыеОбласти.Добавить(СоциальныеВычетыСтрока);
			
			Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			
			ДокументРезультат.Вывести(СоциальныеВычетыЗаголовок);
			ДокументРезультат.Вывести(СоциальныеВычетыШапка);
			
			Пока ВыборкаДетали.Следующий() Цикл
				ВыводимыеОбласти.Очистить();
				СоциальныеВычетыСтрока.Параметры.СоцВычетыКод = ВыборкаДетали.КодВычетаКод;
				СоциальныеВычетыСтрока.Параметры.СоцВычетыРазмер = ВыборкаДетали.Размер;
				СоциальныеВычетыСтрока.Параметры.СоцВычетыДата = Формат(ВыборкаДетали.Дата, "ДФ=дд.ММ.ггг");
				
				ВыводимыеОбласти.Добавить(СоциальныеВычетыСтрока);
				
				Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
		       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(СоциальныеВычетыШапка);
				КонецЕсли;
				
				ДокументРезультат.Вывести(СоциальныеВычетыСтрока);
				ЕстьПравоНавычеты = Истина;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЕстьПравоНавычеты Тогда
		ДокументРезультат.Вывести(ОбластьПустыеВычеты);
	КонецЕсли;	
	
	Если ВыборкаУведомления.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
		
		ВыводимыеОбласти.Очистить();
		
		ВыводимыеОбласти.Добавить(ИмущественныйВычетУведомление);
		
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ВыборкаПоФизЛицу = ВыборкаУведомления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаПоФизЛицу.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаПоФизЛицу.Выбрать();
			
			Если ВыборкаДетали.Следующий() Тогда
				ИмущественныйВычетУведомление.Параметры.Заполнить(ВыборкаДетали);
				ИмущественныйВычетУведомление.Параметры.ДатаУведомления = Формат(ВыборкаДетали.ДатаУведомления, "ДФ=дд.ММ.гггг");
				ДокументРезультат.Вывести(ИмущественныйВычетУведомление);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	

	ВыборкаНалогиПоМесяцаПоРазделам.Сбросить();
	
	ЕстьДанныеПоДоходам = Ложь;
	Если ВыборкаНалогиПоМесяцаПоРазделам.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") тогда
		ВыборкаФизЛиц  = ВыборкаНалогиПоМесяцаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаФизЛиц.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			
			ЕстьДанныеПоДоходам = Истина;
			ТаблицаПоНалогамИтоги.Очистить();

			ДанныеОНалогахНачисленныхПоОКАТО = Новый Соответствие;
			ДанныеОбАвансахЗачтенныхПоОКАТО = Новый Соответствие;
			ДанныеОНалогахУдержанныхПоОКАТО = Новый Соответствие;
			ДанныеОНалогахВозвращенныхПоОКАТО = Новый Соответствие;
			ДанныеОНалогахПереданныхНаВзысканиеПоОКАТО = Новый Соответствие;
			ДанныеОНалогахПеречисленныхПоОКАТО = Новый Соответствие;
			
			
			ВыборкаОКАТО = ВыборкаФизЛиц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОКАТО.Следующий() Цикл
				
				ВыборкаКПП = ВыборкаОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКПП.Следующий() Цикл					
					
					КодТерритории = СправкиПоНДФЛ.СуммаОКАТОиКПП(ВыборкаКПП.КодПоОКАТО, ВыборкаКПП.КПП);
					
	                ЗаполнитьКодыТерриторийВПараметрах(ВыборкаКПП, Раздел4.Параметры, Год);
					
					ВыборкаПоРазделам = ВыборкаКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					ВыводимыеОбласти.Очистить();
					
					ВыводимыеОбласти.Добавить(Раздел4);
					Если ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка13", "Раздел") Тогда
						ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Заголовок);				
						ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Шапка);				
						ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13МесяцГруппа);				
						ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Строка);				
						ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Итог);				
					ИначеЕсли ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка30", "Раздел") Тогда
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Заголовок);
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Шапка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Строка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Итог);
					ИначеЕсли ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка35_15_9", "Раздел") Тогда	
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Заголовок);
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Шапка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Строка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Итог);
					Иначе
						ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Заголовок);				
					КонецЕсли;	
					
					Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
			       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;

					ДокументРезультат.Вывести(Раздел4);
					
					СуммаДоходаДоРезидентстваНарастающийИтог = 0;
					ОблагаемаяСуммаДоходаДоРезидентстваНарастающийИтог = 0;
					
					ВыборкаПоРазделам.Сбросить();
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка13", "Раздел") Тогда
						
						ВычетыПоСтавке13 = Новый Соответствие;
						ВыборкаВычетовПоСтавке13.Сбросить();
						Если ВыборкаВычетовПоСтавке13.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
							ВыборкаВычетовПоСтавке13ПоФизЛицам = ВыборкаВычетовПоСтавке13.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаВычетовПоСтавке13ПоФизЛицам.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
								ВыборкаВычетовПоСтавке13ОКАТО = ВыборкаВычетовПоСтавке13ПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаВычетовПоСтавке13ОКАТО.НайтиСледующий(ВыборкаКПП.КодПоОКАТО, "КодПоОКАТО") Тогда
									ВыборкаВычетовПоСтавке13КПП =ВыборкаВычетовПоСтавке13ОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Если ВыборкаВычетовПоСтавке13КПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда
										ВыборкаДетали = ВыборкаВычетовПоСтавке13КПП.Выбрать();
										
										СуммаВычетаИтог = 0;
										Пока ВыборкаДетали.Следующий() Цикл 
											СуммаВычетаИтог = ВыборкаДетали.СуммаВычета + СуммаВычетаИтог;
											ВычетыПоСтавке13.Вставить(ВыборкаДетали.Месяц, СуммаВычетаИтог);		
										КонецЦикла;	
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;	
						КонецЕсли;	
						
						ДокументРезультат.Вывести(РасчетыНалогаПоСтавке13Заголовок);
						ДокументРезультат.Вывести(РасчетыНалогаПоСтавке13Шапка);
						
						ВыборкаПоМесяцамНалоговогоПериода = ВыборкаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						СуммаДоходаНарастающийИтог = 0;
						СуммаВычетовНарастающийИтог = 0;
						ОблагаемаяСуммаДоходаНарастающийИтог = 0;
						НалоговаяБаза = 0;
						СуммаВычетовСНачалаПериода = 0;
						СтавкаНалога = ПроцедурыУправленияПерсоналом.ЗначениеСтавкиНДФЛотСтавкиНалогообложенияРезидента(Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13) / 100;
						
						Пока ВыборкаПоМесяцамНалоговогоПериода.Следующий() Цикл
							ВыводимыеОбласти.Очистить();
							
							ОбластьНалогПоСтавке13Группа = Новый ТабличныйДокумент;
							Если ЗначениеЗаполнено(ВыборкаПоМесяцамНалоговогоПериода.СуммаДоходаДоРезидентства) Тогда
								ЗаполнитьЗначенияСвойств(РасчетыНалогаПоСтавке13БылоПоСтавке30.Параметры,ВыборкаПоМесяцамНалоговогоПериода);
								РасчетыНалогаПоСтавке13БылоПоСтавке30.Параметры.НалоговаяБазаДоРезидентства = НалоговаяБаза + ВыборкаПоМесяцамНалоговогоПериода.ОблагаемаяСуммаДоходаДоРезидентства;
								РасчетыНалогаПоСтавке13БылоПоСтавке30.Параметры.НалогНачисленоДоРезидентства = Окр((НалоговаяБаза + ВыборкаПоМесяцамНалоговогоПериода.ОблагаемаяСуммаДоходаДоРезидентства) * СтавкаНалога);
								ОбластьНалогПоСтавке13Группа.Вывести(РасчетыНалогаПоСтавке13БылоПоСтавке30);
								СуммаДоходаДоРезидентстваНарастающийИтог = СуммаДоходаДоРезидентстваНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.СуммаДоходаДоРезидентства;
							КонецЕсли;
							
							СуммаДоходаНарастающийИтог = СуммаДоходаНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.СуммаДохода;
							СуммаВычетовНарастающийИтог = СуммаВычетовНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.СуммаВычета;
							ОблагаемаяСуммаДоходаНарастающийИтог = ОблагаемаяСуммаДоходаНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.ОблагаемаяСуммаДохода;
							ОблагаемаяСуммаДоходаДоРезидентстваНарастающийИтог = ОблагаемаяСуммаДоходаДоРезидентстваНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.ОблагаемаяСуммаДоходаДоРезидентства;
							
							СуммаВычетовСНачалаПериода = ?(ВычетыПоСтавке13.Получить(ВыборкаПоМесяцамНалоговогоПериода.МесяцНалоговогоПериода) = Неопределено, СуммаВычетовСНачалаПериода, ВычетыПоСтавке13.Получить(ВыборкаПоМесяцамНалоговогоПериода.МесяцНалоговогоПериода));
							
							НалоговаяБаза = ОблагаемаяСуммаДоходаНарастающийИтог -  СуммаВычетовСНачалаПериода + ОблагаемаяСуммаДоходаДоРезидентстваНарастающийИтог;
							
							РасчетыНалогаПоСтавке13МесяцГруппа.Параметры.Месяц = Формат(ВыборкаПоМесяцамНалоговогоПериода.МесяцНалоговогоПериода, "ДФ=ММММ");
							
							ОбластьНалогПоСтавке13Группа.Вывести(РасчетыНалогаПоСтавке13МесяцГруппа);
							
							ВыводимыеОбласти.Добавить(ОбластьНалогПоСтавке13Группа);
							
							ВыборкаПоДатамПолученияДохода = ВыборкаПоМесяцамНалоговогоПериода.Выбрать();
							
							Пока ВыборкаПоДатамПолученияДохода.Следующий() Цикл
								
								РасчетыНалогаПоСтавке13Строка.Параметры.Заполнить(ВыборкаПоДатамПолученияДохода);
								РасчетыНалогаПоСтавке13Строка.Параметры.ДатаНачисления = Формат(ВыборкаПоДатамПолученияДохода.ДатаНачисления, "ДФ=дд.ММ.гггг");
								РасчетыНалогаПоСтавке13Строка.Параметры.МесяцНачисления = Формат(ВыборкаПоДатамПолученияДохода.МесяцНачисления, "ДФ=ММММ; ДП=-");
								РасчетыНалогаПоСтавке13Строка.Параметры.ДатаВыплаты = Формат(ВыборкаПоДатамПолученияДохода.ДатаВыплаты, "ДФ=дд.ММ.гггг; ДП=-");
								РасчетыНалогаПоСтавке13Строка.Параметры.ДатаПолученияДохода = Формат(ВыборкаПоДатамПолученияДохода.ДатаПолученияДохода, "ДФ=дд.ММ.гггг");
								
								ОбластьДоходыПоСтавке13 = Новый ТабличныйДокумент;
								ОбластьДоходыПоСтавке13.Вывести(РасчетыНалогаПоСтавке13Строка);
								
								ВыводимыеОбласти.Добавить(ОбластьДоходыПоСтавке13);		
								
							КонецЦикла;	
							
							РасчетыНалогаПоСтавке13Итог.Параметры.Заполнить(ВыборкаПоМесяцамНалоговогоПериода);
							РасчетыНалогаПоСтавке13Итог.Параметры.СуммаДоходаНарастающийИтог = СуммаДоходаНарастающийИтог;
							РасчетыНалогаПоСтавке13Итог.Параметры.СуммаВычетаНарастающийИтог = СуммаВычетовНарастающийИтог;
							РасчетыНалогаПоСтавке13Итог.Параметры.ОблагаемаяСуммаДоходаИтог = ОблагаемаяСуммаДоходаНарастающийИтог;
							РасчетыНалогаПоСтавке13Итог.Параметры.НалоговаяБаза = НалоговаяБаза;
							РасчетыНалогаПоСтавке13Итог.Параметры.НалогНачислено = Окр(НалоговаяБаза * СтавкаНалога);
							
							ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Итог);
							
							Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
					       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументРезультат.Вывести(РасчетыНалогаПоСтавке13Шапка);
							КонецЕсли;

							Для Каждого Область Из ВыводимыеОбласти Цикл
								ДокументРезультат.Вывести(Область);
							КонецЦикла;	
							
						КонецЦикла;
						
						СтрокаТаблицыИтогов = ТаблицаПоНалогамИтоги.Добавить();
               			ЗаполнитьКодыТерриторийВПараметрах(ВыборкаКПП, СтрокаТаблицыИтогов, Год);
						СтрокаТаблицыИтогов.Ставка = Перечисления.НДФЛСтавки.Ставка13;
						СтрокаТаблицыИтогов.ОбщаяСуммаДохода = ВыборкаПоРазделам.СуммаДохода + СуммаДоходаДоРезидентстваНарастающийИтог;
						СтрокаТаблицыИтогов.НалоговаяБаза = НалоговаяБаза;
						
						ВыборкаВычетыПоМесяцамПоВидам.Сбросить();
						
						ВыводимыеОбласти.Очистить();
						Если ВыборкаВычетыПоМесяцамПоВидам.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
							ВыборкаВычетыПоФизЛицу = ВыборкаВычетыПоМесяцамПоВидам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Если ВыборкаВычетыПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
								ВыборкаВычетыПоОКАТО = ВыборкаВычетыПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаВычетыПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда 
									ВыборкаВычетыПоКПП = ВыборкаВычетыПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									Если ВыборкаВычетыПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда 
									
										ВыборкаВычетыПоМесяцам = ВыборкаВычетыПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
										
										ВыводимыеОбласти.Добавить(ПредоставленныеВычетыЗаголовок);
										ВыводимыеОбласти.Добавить(ПредоставленныеВычетыШапка);
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
								       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
										КонецЕсли;

										
										ДокументРезультат.Вывести(ПредоставленныеВычетыЗаголовок);
										ДокументРезультат.Вывести(ПредоставленныеВычетыШапка);
										
										ДоходИтог = 0;
										СуммаВычетаНарастающийИтог = 0;
										Пока ВыборкаВычетыПоМесяцам.Следующий() Цикл
											ВыводимыеОбласти.Очистить();
											
											ДоходИтог = ДоходИтог + ВыборкаВычетыПоМесяцам.СуммаДохода;
																				
											ПредоставленныеВычетыШапкаМесяцГруппа.Параметры.Месяц = Формат(ВыборкаВычетыПоМесяцам.Месяц, "ДФ=ММММ");	
											ПредоставленныеВычетыШапкаМесяцГруппа.Параметры.Доход = Формат(ДоходИтог, "ЧДЦ=2");
											
											ВыводимыеОбласти.Добавить(ПредоставленныеВычетыШапкаМесяцГруппа);
											
											ВыборкаВычетыДетали = ВыборкаВычетыПоМесяцам.Выбрать();
											
											Пока ВыборкаВычетыДетали.Следующий() Цикл
												ПредоставленныеВычетыСтрока.Параметры.КодВычета = ВыборкаВычетыДетали.КодВычета;
												ПредоставленныеВычетыСтрока.Параметры.СуммаВычета = ВыборкаВычетыДетали.СуммаВычета;
												
												ОбластьПредоставленныеВычеты = Новый ТабличныйДокумент;
												ОбластьПредоставленныеВычеты.Вывести(ПредоставленныеВычетыСтрока);
												
												ВыводимыеОбласти.Добавить(ОбластьПредоставленныеВычеты);	
												
												СуммаВычетаНарастающийИтог = СуммаВычетаНарастающийИтог + ВыборкаВычетыДетали.СуммаВычета;
											КонецЦикла;	
											
											ПредоставленныеВычетыИтог.Параметры.СуммаВычета = ВыборкаВычетыПоМесяцам.СуммаВычета;
											ПредоставленныеВычетыИтог.Параметры.СуммаВычетаНарастающийИтог = СуммаВычетаНарастающийИтог;
											
											ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтог);
											
											Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
									       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
												ДокументРезультат.Вывести(ПредоставленныеВычетыШапка);
											КонецЕсли;
											
											Для Каждого Область Из ВыводимыеОбласти Цикл
												ДокументРезультат.Вывести(Область);
											КонецЦикла;	
										КонецЦикла;	
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;		
						КонецЕсли;	
					
					КонецЕсли;	
					
					ВыборкаПоРазделам.Сбросить();
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка30", "Раздел") Тогда
						
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Заголовок);
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Шапка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Строка);
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
				       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
	 
						ДокументРезультат.Вывести(НалогПоСтавке30Заголовок);
						ДокументРезультат.Вывести(НалогПоСтавке30Шапка);
						
						ВыборкаПоМесяцамНалоговогоПериода = ВыборкаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						СуммаДоходаИтог = 0;
						СуммаВычетовИтог = 0;
						ОблагаемаяСуммаДоходаИтог = 0;
						НалогНачисленоИтог = 0;
						
						Пока ВыборкаПоМесяцамНалоговогоПериода.Следующий() Цикл
										
							ВыборкаПоДатамПолученияДохода = ВыборкаПоМесяцамНалоговогоПериода.Выбрать();
							
							Пока ВыборкаПоДатамПолученияДохода.Следующий() Цикл
								
								ВыводимыеОбласти.Очистить();
								
								НалогПоСтавке30Строка.Параметры.Заполнить(ВыборкаПоДатамПолученияДохода);
								НалогПоСтавке30Строка.Параметры.ДатаПолученияДохода = Формат(ВыборкаПоДатамПолученияДохода.ДатаПолученияДохода, "ДФ=дд.ММ.гггг");
								НалогПоСтавке30Строка.Параметры.ДатаНачисления = Формат(ВыборкаПоДатамПолученияДохода.ДатаНачисления, "ДФ=дд.ММ.гггг");
								НалогПоСтавке30Строка.Параметры.МесяцНачисления = Формат(ВыборкаПоДатамПолученияДохода.МесяцНачисления, "ДФ=ММММ; ДП=-");
								НалогПоСтавке30Строка.Параметры.ДатаВыплаты = Формат(ВыборкаПоДатамПолученияДохода.ДатаВыплаты, "ДФ=дд.ММ.гггг; ДП=-");
								
								НалогНачислено = Окр(ВыборкаПоДатамПолученияДохода.НалогНачислено); 
								НалогПоСтавке30Строка.Параметры.НалогНачислено = НалогНачислено;
								
								ВыводимыеОбласти.Добавить(НалогПоСтавке30Строка);
								
								Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									ВыводимыеОбласти.Добавить(НалогПоСтавке30Шапка);
								КонецЕсли;

								ДокументРезультат.Вывести(НалогПоСтавке30Строка);	
								
								СуммаДоходаИтог = СуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.СуммаДохода;
								СуммаВычетовИтог = СуммаВычетовИтог + ВыборкаПоДатамПолученияДохода.СуммаВычета;
								ОблагаемаяСуммаДоходаИтог = ОблагаемаяСуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.ОблагаемаяСуммаДохода;
								НалогНачисленоИтог = НалогНачисленоИтог + НалогНачислено;
								
							КонецЦикла;	
						КонецЦикла;
						НалогПоСтавке30Итог.Параметры.СуммаДохода = СуммаДоходаИтог;
						НалогПоСтавке30Итог.Параметры.СуммаВычета = СуммаВычетовИтог;
						НалогПоСтавке30Итог.Параметры.ОблагаемаяСуммаДохода = ОблагаемаяСуммаДоходаИтог;
						НалогПоСтавке30Итог.Параметры.НалогНачислено = НалогНачисленоИтог;
						
						ВыводимыеОбласти.Очистить();
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Итог);
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
				       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ВыводимыеОбласти.Добавить(НалогПоСтавке30Шапка);
						КонецЕсли;

						ДокументРезультат.Вывести(НалогПоСтавке30Итог);
						
						Если СуммаДоходаИтог > СуммаДоходаДоРезидентстваНарастающийИтог Тогда
							СтрокаТаблицыИтогов = ТаблицаПоНалогамИтоги.Добавить();
                			ЗаполнитьКодыТерриторийВПараметрах(ВыборкаКПП, СтрокаТаблицыИтогов, Год);
							СтрокаТаблицыИтогов.Ставка = Перечисления.НДФЛСтавки.Ставка30;
							СтрокаТаблицыИтогов.ОбщаяСуммаДохода = СуммаДоходаИтог - СуммаДоходаДоРезидентстваНарастающийИтог;
							СтрокаТаблицыИтогов.НалоговаяБаза = ОблагаемаяСуммаДоходаИтог - Мин(ОблагаемаяСуммаДоходаИтог,ОблагаемаяСуммаДоходаДоРезидентстваНарастающийИтог);
						КонецЕсли;
					КонецЕсли;	
					
					ВыборкаПоРазделам.Сбросить();
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка35_15_9", "Раздел") Тогда
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Заголовок);
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Шапка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Строка);
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
				       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;

						ДокументРезультат.Вывести(НалогПоСтавке9Заголовок);
						ДокументРезультат.Вывести(НалогПоСтавке9Шапка);
						
						ВыборкаПоМесяцамНалоговогоПериода = ВыборкаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						СуммаДоходаИтог = 0;
						СуммаВычетовИтог = 0;
						ОблагаемаяСуммаДоходаИтог = 0;
						НалогНачисленоИтог = 0;
						
						Пока ВыборкаПоМесяцамНалоговогоПериода.Следующий() Цикл
										
							ВыборкаПоДатамПолученияДохода = ВыборкаПоМесяцамНалоговогоПериода.Выбрать();
							
							Пока ВыборкаПоДатамПолученияДохода.Следующий() Цикл
								ВыводимыеОбласти.Очистить();
								НалогПоСтавке9Строка.Параметры.Заполнить(ВыборкаПоДатамПолученияДохода);
								НалогПоСтавке9Строка.Параметры.ДатаНачисления = Формат(ВыборкаПоДатамПолученияДохода.ДатаНачисления, "ДФ=дд.ММ.гггг");
								НалогПоСтавке9Строка.Параметры.ДатаВыплаты = Формат(ВыборкаПоДатамПолученияДохода.ДатаВыплаты, "ДФ=дд.ММ.гггг");
								
								НалогНачислено = Окр(ВыборкаПоДатамПолученияДохода.НалогНачислено); 
								НалогПоСтавке9Строка.Параметры.НалогНачислено = НалогНачислено;
								
								ВыводимыеОбласти.Добавить(НалогПоСтавке9Строка);
								Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
					       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									ВыводимыеОбласти.Добавить(НалогПоСтавке9Шапка);
								КонецЕсли;
								
								ДокументРезультат.Вывести(НалогПоСтавке9Строка);	
								
								СуммаДоходаИтог = СуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.СуммаДохода;
								СуммаВычетовИтог = СуммаВычетовИтог + ВыборкаПоДатамПолученияДохода.СуммаВычета;
								ОблагаемаяСуммаДоходаИтог = ОблагаемаяСуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.ОблагаемаяСуммаДохода;
								НалогНачисленоИтог = НалогНачисленоИтог + НалогНачислено;
								
								СтрокаТаблицыИтогов = ТаблицаПоНалогамИтоги.Добавить();
	                			ЗаполнитьКодыТерриторийВПараметрах(ВыборкаКПП, СтрокаТаблицыИтогов, Год);
								СтрокаТаблицыИтогов.Ставка = ВыборкаПоДатамПолученияДохода.Ставка;
								СтрокаТаблицыИтогов.ОбщаяСуммаДохода = ВыборкаПоДатамПолученияДохода.СуммаДохода;
								СтрокаТаблицыИтогов.НалоговаяБаза = ВыборкаПоДатамПолученияДохода.ОблагаемаяСуммаДохода;

							КонецЦикла;	
						КонецЦикла;
						НалогПоСтавке9Итог.Параметры.СуммаДохода = СуммаДоходаИтог;
						НалогПоСтавке9Итог.Параметры.СуммаВычета = СуммаВычетовИтог;
						НалогПоСтавке9Итог.Параметры.ОблагаемаяСуммаДохода = ОблагаемаяСуммаДоходаИтог;
						НалогПоСтавке9Итог.Параметры.НалогНачислено = НалогНачисленоИтог;
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, НалогПоСтавке9Итог) Тогда
			       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ВыводимыеОбласти.Добавить(НалогПоСтавке9Шапка);
						КонецЕсли;

						ДокументРезультат.Вывести(НалогПоСтавке9Итог);
						
					КонецЕсли;	

					ВыборкаНалогиНачисленныеИтоги.Сбросить();
					
					ДанныеОНалогахНачисленныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиНачисленныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиНачисленныеИтогиПоФизЛицу = ВыборкаНалогиНачисленныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиНачисленныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиНачисленныеИтогиПоОКАТО = ВыборкаНалогиНачисленныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиНачисленныеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОКАТО, "КодПоОКАТО") Тогда
								ВыборкаНалогиНачисленныеИтогиПоКПП = ВыборкаНалогиНачисленныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиНачисленныеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда
									ВыборкаНалогиНачисленныеДетали = ВыборкаНалогиНачисленныеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(ИсчисленоЗаголовок);
									ВыводимыеОбласти.Добавить(ИсчисленоШапка);
									ВыводимыеОбласти.Добавить(ИсчисленоСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(ИсчисленоЗаголовок);
									ДокументРезультат.Вывести(ИсчисленоШапка);
									Пока ВыборкаНалогиНачисленныеДетали.Следующий() Цикл
										
										ИсчисленоСтрока.Параметры.Месяц = Формат(ВыборкаНалогиНачисленныеДетали.Месяц, ?(НалогПоСтавке13ИсчисленПомесячно,"ДФ=ММММ","ДФ=дд.ММ.гггг"));
										ИсчисленоСтрока.Параметры.Дата = Формат(ВыборкаНалогиНачисленныеДетали.Дата, "ДФ=дд.ММ.гггг");
										ИсчисленоСтрока.Параметры.Ставка = ВыборкаНалогиНачисленныеДетали.Ставка;
										ИсчисленоСтрока.Параметры.Сумма =  ВыборкаНалогиНачисленныеДетали.НалогНачислено;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ИсчисленоСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(ИсчисленоШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(ИсчисленоСтрока);
										
										Если ВыборкаНалогиНачисленныеДетали.Ставка = Перечисления.НДФЛСтавки.Ставка30 И ВыборкаНалогиНачисленныеДетали.СтавкаПоИтогамГода = Перечисления.НДФЛСтавки.Ставка13 Тогда
											СтавкаИтогов = Перечисления.НДФЛСтавки.Ставка13
										Иначе
											СтавкаИтогов = ВыборкаНалогиНачисленныеДетали.Ставка
										КонецЕсли;
										Если ДанныеОНалогахНачисленныхПоСтавкам.Получить(СтавкаИтогов) = Неопределено Тогда
											ДанныеОНалогахНачисленныхПоСтавкам.Вставить(СтавкаИтогов, ВыборкаНалогиНачисленныеДетали.НалогНачислено);
										Иначе
											ДанныеОНалогахНачисленныхПоСтавкам[СтавкаИтогов] = ДанныеОНалогахНачисленныхПоСтавкам[СтавкаИтогов] + ВыборкаНалогиНачисленныеДетали.НалогНачислено;
										КонецЕсли;	
									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
					
					ДанныеОНалогахНачисленныхПоОКАТО.Вставить(КодТерритории, ДанныеОНалогахНачисленныхПоСтавкам); 
					
					ВыборкаАвансыЗачтенныеИтоги.Сбросить();
					
					ДанныеОбАвансахЗачтенныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаАвансыЗачтенныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаАвансыЗачтенныеИтогиПоФизЛицу = ВыборкаАвансыЗачтенныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаАвансыЗачтенныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаАвансыЗачтенныеИтогиПоОКАТО = ВыборкаАвансыЗачтенныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаАвансыЗачтенныеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОКАТО, "КодПоОКАТО") Тогда
								ВыборкаАвансыЗачтенныеИтогиПоКПП = ВыборкаАвансыЗачтенныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаАвансыЗачтенныеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда
									ВыборкаАвансыЗачтенныеДетали = ВыборкаАвансыЗачтенныеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(ЗачтеноАвансовЗаголовок);
									ВыводимыеОбласти.Добавить(ЗачтеноАвансовШапка);
									ВыводимыеОбласти.Добавить();
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(ЗачтеноАвансовЗаголовок);
									ДокументРезультат.Вывести(ЗачтеноАвансовШапка);
									Пока ВыборкаАвансыЗачтенныеДетали.Следующий() Цикл
										
										ЗачтеноАвансовСтрока.Параметры.Месяц = Формат(ВыборкаАвансыЗачтенныеДетали.Месяц, "ДФ=ММММ");
										ЗачтеноАвансовСтрока.Параметры.Дата = Формат(ВыборкаАвансыЗачтенныеДетали.Дата, "ДФ=дд.ММ.гггг");
										ЗачтеноАвансовСтрока.Параметры.Ставка = ВыборкаАвансыЗачтенныеДетали.Ставка;
										ЗачтеноАвансовСтрока.Параметры.Сумма =  ВыборкаАвансыЗачтенныеДетали.ЗачтеноАвансов;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ЗачтеноАвансовСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(ЗачтеноАвансовШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(ЗачтеноАвансовСтрока);
										
										Если ВыборкаАвансыЗачтенныеДетали.Ставка = Перечисления.НДФЛСтавки.Ставка30 И ВыборкаАвансыЗачтенныеДетали.СтавкаПоИтогамГода = Перечисления.НДФЛСтавки.Ставка13 Тогда
											СтавкаИтогов = Перечисления.НДФЛСтавки.Ставка13
										Иначе
											СтавкаИтогов = ВыборкаАвансыЗачтенныеДетали.Ставка
										КонецЕсли;
										Если ДанныеОбАвансахЗачтенныхПоСтавкам.Получить(СтавкаИтогов) = Неопределено Тогда
											ДанныеОбАвансахЗачтенныхПоСтавкам.Вставить(СтавкаИтогов, ВыборкаАвансыЗачтенныеДетали.ЗачтеноАвансов);
										Иначе
											ДанныеОбАвансахЗачтенныхПоСтавкам[СтавкаИтогов] = ДанныеОбАвансахЗачтенныхПоСтавкам[СтавкаИтогов] + ВыборкаАвансыЗачтенныеДетали.ЗачтеноАвансов;
										КонецЕсли;	
									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
					
					ДанныеОбАвансахЗачтенныхПоОКАТО.Вставить(КодТерритории, ДанныеОбАвансахЗачтенныхПоСтавкам); 
					
					ВыборкаНалогиУдержанныеИтоги.Сбросить();
					
					ДанныеОналогахУдержанныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиУдержанныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиУдержанныеИтогиПоФизЛицу = ВыборкаНалогиУдержанныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиУдержанныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиУдержанныеИтогиПоОКАТО = ВыборкаНалогиУдержанныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиУдержанныеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда
								ВыборкаНалогиУдержанныеИтогиПоКПП = ВыборкаНалогиУдержанныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиУдержанныеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда

									ВыборкаНалогиУдержанныеДетали = ВыборкаНалогиУдержанныеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(УдержаноЗаголовок);
									ВыводимыеОбласти.Добавить(УдержаноШапка);
									ВыводимыеОбласти.Добавить(УдержаноСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(УдержаноЗаголовок);
									ДокументРезультат.Вывести(УдержаноШапка);
									КЗачетуПоСтавке13 = 0;
									Пока ВыборкаНалогиУдержанныеДетали.Следующий() Цикл
										
										Если ВыборкаНалогиУдержанныеДетали.Ставка = Перечисления.НДФЛСтавки.Ставка13 И ЗначениеЗаполнено(КЗачетуПоСтавке13) Тогда
											УдержаноБылоПоСтавке30.Параметры.Сумма = КЗачетуПоСтавке13;
											Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, УдержаноБылоПоСтавке30) Тогда
								       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
												ДокументРезультат.Вывести(УдержаноШапка);
											КонецЕсли;
											ДокументРезультат.Вывести(УдержаноБылоПоСтавке30);
											КЗачетуПоСтавке13 = 0;
										КонецЕсли;
										
										УдержаноСтрока.Параметры.Месяц = Формат(ВыборкаНалогиУдержанныеДетали.Месяц, ?(НалогПоСтавке13ИсчисленПомесячно,"ДФ=ММММ","ДФ=дд.ММ.гггг"));
										УдержаноСтрока.Параметры.Дата = Формат(ВыборкаНалогиУдержанныеДетали.Дата, "ДФ=дд.ММ.гггг");
										УдержаноСтрока.Параметры.Ставка = ВыборкаНалогиУдержанныеДетали.Ставка;
										УдержаноСтрока.Параметры.Сумма =  ВыборкаНалогиУдержанныеДетали.НалогУдержано;
										Если Не НалогПоСтавке13ИсчисленПомесячно Тогда
											УдержаноСтрока.Параметры.СрокПеречисления =  ВыборкаНалогиУдержанныеДетали.СрокПеречисления;
										КонецЕсли;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, УдержаноСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(УдержаноШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(УдержаноСтрока);
										
										Если ДанныеОналогахУдержанныхПоСтавкам.Получить(ВыборкаНалогиУдержанныеДетали.Ставка) = Неопределено Тогда
											ДанныеОналогахУдержанныхПоСтавкам.Вставить(ВыборкаНалогиУдержанныеДетали.Ставка, ВыборкаНалогиУдержанныеДетали.НалогУдержано);
										Иначе
											ДанныеОналогахУдержанныхПоСтавкам[ВыборкаНалогиУдержанныеДетали.Ставка] = ДанныеОналогахУдержанныхПоСтавкам[ВыборкаНалогиУдержанныеДетали.Ставка] + ВыборкаНалогиУдержанныеДетали.НалогУдержано;
										КонецЕсли;	

										Если ВыборкаНалогиУдержанныеДетали.Ставка = Перечисления.НДФЛСтавки.Ставка30 И ЗначениеЗаполнено(ВыборкаНалогиУдержанныеДетали.КЗачетуПоСтавке13) Тогда
											КЗачетуПоСтавке13 = КЗачетуПоСтавке13 + ВыборкаНалогиУдержанныеДетали.КЗачетуПоСтавке13;
											Если ДанныеОналогахУдержанныхПоСтавкам.Получить(Перечисления.НДФЛСтавки.Ставка30) <> Неопределено Тогда
												ДанныеОналогахУдержанныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка30] = ДанныеОналогахУдержанныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка30] - ВыборкаНалогиУдержанныеДетали.КЗачетуПоСтавке13;
											КонецЕсли;
											Если ДанныеОналогахУдержанныхПоСтавкам.Получить(Перечисления.НДФЛСтавки.Ставка13) = Неопределено Тогда
												ДанныеОналогахУдержанныхПоСтавкам.Вставить(Перечисления.НДФЛСтавки.Ставка13, ВыборкаНалогиУдержанныеДетали.КЗачетуПоСтавке13);
											Иначе
												ДанныеОналогахУдержанныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка13] = ДанныеОналогахУдержанныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка13] + ВыборкаНалогиУдержанныеДетали.КЗачетуПоСтавке13;
											КонецЕсли;	
										КонецЕсли;
									КонецЦикла;
									
									Если ЗначениеЗаполнено(КЗачетуПоСтавке13) Тогда
										УдержаноБылоПоСтавке30.Параметры.Сумма = КЗачетуПоСтавке13;
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, УдержаноБылоПоСтавке30) Тогда
											ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(УдержаноШапка);
										КонецЕсли;
										ДокументРезультат.Вывести(УдержаноБылоПоСтавке30);
									КонецЕсли;
									
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;		
					
					ДанныеОНалогахУдержанныхПоОКАТО.Вставить(КодТерритории, ДанныеОналогахУдержанныхПоСтавкам);
					
					ВыборкаНалогиВозвращенныеИтоги.Сбросить();
					
					ДанныеОНалогахВозвращенныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиВозвращенныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиВозвращенныеИтогиПоФизЛицу = ВыборкаНалогиВозвращенныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиВозвращенныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиВозвращенныеИтогиПоОКАТО = ВыборкаНалогиВозвращенныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиВозвращенныеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда
								ВыборкаНалогиВозвращенныеИтогиПоКПП = ВыборкаНалогиВозвращенныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиВозвращенныеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда

									ВыборкаНалогиВозвращенныеДетали = ВыборкаНалогиВозвращенныеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(ВозвращеноЗаголовок);
									ВыводимыеОбласти.Добавить(УдержаноШапка);
									ВыводимыеОбласти.Добавить(ВозвращеноСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(ВозвращеноЗаголовок);
									ДокументРезультат.Вывести(ВозвращеноШапка);
									Пока ВыборкаНалогиВозвращенныеДетали.Следующий() Цикл
										ВозвращеноСтрока.Параметры.Месяц = Формат(ВыборкаНалогиВозвращенныеДетали.Месяц, "ДФ=ММММ");
										ВозвращеноСтрока.Параметры.Дата = Формат(ВыборкаНалогиВозвращенныеДетали.Дата, "ДФ=дд.ММ.гггг");
										ВозвращеноСтрока.Параметры.Ставка = ВыборкаНалогиВозвращенныеДетали.Ставка;
										ВозвращеноСтрока.Параметры.Сумма =  ВыборкаНалогиВозвращенныеДетали.НалогВозвращено;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВозвращеноСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(ВозвращеноШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(ВозвращеноСтрока);
										
										Если ДанныеОНалогахВозвращенныхПоСтавкам.Получить(ВыборкаНалогиВозвращенныеДетали.Ставка) = Неопределено Тогда
											ДанныеОНалогахВозвращенныхПоСтавкам.Вставить(ВыборкаНалогиВозвращенныеДетали.Ставка, ВыборкаНалогиВозвращенныеДетали.НалогВозвращено);
										Иначе
											ДанныеОНалогахВозвращенныхПоСтавкам[ВыборкаНалогиВозвращенныеДетали.Ставка] = ДанныеОНалогахВозвращенныхПоСтавкам[ВыборкаНалогиВозвращенныеДетали.Ставка] + ВыборкаНалогиВозвращенныеДетали.НалогВозвращено;
										КонецЕсли;	
										
									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					ДанныеОНалогахВозвращенныхПоОКАТО.Вставить(КодТерритории, ДанныеОНалогахВозвращенныхПоСтавкам);
					
					ВыборкаНалогиВзысканиеИтоги.Сбросить();
					
					ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиВзысканиеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиВзысканиеИтогиПоФизЛицу = ВыборкаНалогиВзысканиеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиВзысканиеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиВзысканиеИтогиПоОКАТО = ВыборкаНалогиВзысканиеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиВзысканиеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда
								ВыборкаНалогиВзысканиеИтогиПоКПП = ВыборкаНалогиВзысканиеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиВзысканиеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда
									
									ВыборкаНалогиВзысканиеДетали = ВыборкаНалогиВзысканиеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(ПереданоНаВзысканиеЗаголовок);
									ВыводимыеОбласти.Добавить(ПереданоНаВзысканиеШапка);
									ВыводимыеОбласти.Добавить(ПереданоНаВзысканиеСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
										ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;
									
									ДокументРезультат.Вывести(ПереданоНаВзысканиеЗаголовок);
									ДокументРезультат.Вывести(ПереданоНаВзысканиеШапка);
									Пока ВыборкаНалогиВзысканиеДетали.Следующий() Цикл
										ПереданоНаВзысканиеСтрока.Параметры.Месяц = Формат(ВыборкаНалогиВзысканиеДетали.Месяц, "ДФ=ММММ");
										ПереданоНаВзысканиеСтрока.Параметры.Дата = Формат(ВыборкаНалогиВзысканиеДетали.Дата, "ДФ=дд.ММ.гггг");
										ПереданоНаВзысканиеСтрока.Параметры.Ставка = ВыборкаНалогиВзысканиеДетали.Ставка;
										ПереданоНаВзысканиеСтрока.Параметры.Сумма =  ВыборкаНалогиВзысканиеДетали.НалогПереданоНаВзыскание;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ПереданоНаВзысканиеСтрока) Тогда
											ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(ПереданоНаВзысканиеШапка);
										КонецЕсли;
										
										ДокументРезультат.Вывести(ПереданоНаВзысканиеСтрока);
										
										Если ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам.Получить(ВыборкаНалогиВзысканиеДетали.Ставка) = Неопределено Тогда
											ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам.Вставить(ВыборкаНалогиВзысканиеДетали.Ставка, ВыборкаНалогиВзысканиеДетали.НалогПереданоНаВзыскание);
										Иначе
											ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам[ВыборкаНалогиВзысканиеДетали.Ставка] = ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам[ВыборкаНалогиВзысканиеДетали.Ставка] + ВыборкаНалогиВзысканиеДетали.НалогПереданоНаВзыскание;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					ДанныеОНалогахПереданныхНаВзысканиеПоОКАТО.Вставить(КодТерритории, ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам);
					
					ВыборкаНалогиПеречисленныеИтоги.Сбросить();
					
					ДанныеОНалогахПеречисленныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиПеречисленныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиПеречисленныеИтогиПоФизЛицу = ВыборкаНалогиПеречисленныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Если ВыборкаНалогиПеречисленныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиПеречисленныеИтогиПоОКАТО = ВыборкаНалогиПеречисленныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиПеречисленныеИтогиПоОКАТО.НайтиСледующий(КодТерритории, "ОКАТО_КПП") Тогда
								ВыборкаНалогиПеречисленныеДетали = ВыборкаНалогиПеречисленныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								ВыводимыеОбласти.Добавить(НалогПеречисленныйЗаголовок);
								ВыводимыеОбласти.Добавить(НалогПеречисленныйШапка);
								ВыводимыеОбласти.Добавить(НалогПеречисленныйСтрока);
								
								Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
									ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								КонецЕсли;
								
								ДокументРезультат.Вывести(НалогПеречисленныйЗаголовок);
								ДокументРезультат.Вывести(НалогПеречисленныйШапка);
								КЗачетуПоСтавке13 = 0;
								ПредыдущийМесяц = "";
								Пока ВыборкаНалогиПеречисленныеДетали.Следующий() Цикл
									
									Если ВыборкаНалогиПеречисленныеДетали.Ставка = Перечисления.НДФЛСтавки.Ставка13 И ЗначениеЗаполнено(КЗачетуПоСтавке13) Тогда
										НалогПеречисленныйБылоПоСтавке30.Параметры.Сумма =  КЗачетуПоСтавке13;
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, НалогПеречисленныйБылоПоСтавке30) Тогда
											ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(НалогПеречисленныйШапка);
										КонецЕсли;
										ДокументРезультат.Вывести(НалогПеречисленныйБылоПоСтавке30);
										КЗачетуПоСтавке13 = 0;
									КонецЕсли;
									
									НалогПеречисленныйСтрока.Параметры.Месяц = Формат(ВыборкаНалогиПеречисленныеДетали.Месяц, "ДФ=ММММ");
									НалогПеречисленныйСтрока.Параметры.Дата = Формат(ВыборкаНалогиПеречисленныеДетали.Дата, "ДФ=дд.ММ.гггг");
									НалогПеречисленныйСтрока.Параметры.Ставка = ВыборкаНалогиПеречисленныеДетали.Ставка;
									НалогПеречисленныйСтрока.Параметры.Сумма =  ВыборкаНалогиПеречисленныеДетали.Сумма;
									НалогПеречисленныйСтрока.Параметры.РеквизитыПП = "№ " + ВыборкаНалогиПеречисленныеДетали.НомерПП + " от " + Формат(ВыборкаНалогиПеречисленныеДетали.ДатаПП, "ДФ=дд.ММ.гггг");
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, НалогПеречисленныйСтрока) Тогда
										ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
										ДокументРезультат.Вывести(НалогПеречисленныйШапка);
									КонецЕсли;
									
									ДокументРезультат.Вывести(НалогПеречисленныйСтрока);
									
									СтрокаТаблицыИтогов = ТаблицаПоНалогамИтоги.Добавить();
		                			ЗаполнитьКодыТерриторийВПараметрах(ВыборкаКПП, СтрокаТаблицыИтогов, Год);
									СтрокаТаблицыИтогов.Ставка = ВыборкаНалогиПеречисленныеДетали.Ставка;
									
									Если ДанныеОНалогахПеречисленныхПоСтавкам.Получить(ВыборкаНалогиПеречисленныеДетали.Ставка) = Неопределено Тогда
										ДанныеОНалогахПеречисленныхПоСтавкам.Вставить(ВыборкаНалогиПеречисленныеДетали.Ставка, ВыборкаНалогиПеречисленныеДетали.Сумма);
									Иначе
										ДанныеОНалогахПеречисленныхПоСтавкам[ВыборкаНалогиПеречисленныеДетали.Ставка] = ДанныеОНалогахПеречисленныхПоСтавкам[ВыборкаНалогиПеречисленныеДетали.Ставка] + ВыборкаНалогиПеречисленныеДетали.Сумма;
									КонецЕсли;
									
									Если ПредыдущийМесяц <> ВыборкаНалогиПеречисленныеДетали.Месяц И ВыборкаНалогиПеречисленныеДетали.Ставка = Перечисления.НДФЛСтавки.Ставка30 И ЗначениеЗаполнено(ВыборкаНалогиПеречисленныеДетали.КЗачетуПоСтавке13) Тогда
										ПредыдущийМесяц = ВыборкаНалогиПеречисленныеДетали.Месяц;
										КЗачетуПоСтавке13 = КЗачетуПоСтавке13 + ВыборкаНалогиПеречисленныеДетали.КЗачетуПоСтавке13;
										Если ДанныеОНалогахПеречисленныхПоСтавкам.Получить(Перечисления.НДФЛСтавки.Ставка30) <> Неопределено Тогда
											ДанныеОНалогахПеречисленныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка30] = ДанныеОНалогахПеречисленныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка30] - ВыборкаНалогиПеречисленныеДетали.КЗачетуПоСтавке13;
										КонецЕсли;
										Если ДанныеОНалогахПеречисленныхПоСтавкам.Получить(Перечисления.НДФЛСтавки.Ставка13) = Неопределено Тогда
											ДанныеОНалогахПеречисленныхПоСтавкам.Вставить(Перечисления.НДФЛСтавки.Ставка13, ВыборкаНалогиПеречисленныеДетали.КЗачетуПоСтавке13);
										Иначе
											ДанныеОНалогахПеречисленныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка13] = ДанныеОНалогахПеречисленныхПоСтавкам[Перечисления.НДФЛСтавки.Ставка13] + ВыборкаНалогиПеречисленныеДетали.КЗачетуПоСтавке13;
										КонецЕсли;	
									КонецЕсли;
									
								КонецЦикла;
								
								Если ЗначениеЗаполнено(КЗачетуПоСтавке13) Тогда
									НалогПеречисленныйБылоПоСтавке30.Параметры.Сумма = КЗачетуПоСтавке13;
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, НалогПеречисленныйБылоПоСтавке30) Тогда
										ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
										ДокументРезультат.Вывести(НалогПеречисленныйШапка);
									КонецЕсли;
									ДокументРезультат.Вывести(НалогПеречисленныйБылоПоСтавке30);
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					ДанныеОНалогахПеречисленныхПоОКАТО.Вставить(КодТерритории, ДанныеОНалогахПеречисленныхПоСтавкам);
					
				КонецЦикла;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЕстьДанныеПоДоходам Тогда
		ВыводимыеОбласти.Очистить();
		ВыводимыеОбласти.Добавить(Раздел4);
		
		Если СтатусНаКонецПериода = Перечисления.СтатусыНалогоплательщиковПоНДФЛ.Резидент Тогда
			ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Заголовок);
		Иначе
			ВыводимыеОбласти.Добавить(НалогПоСтавке30Заголовок);
		КонецЕсли;	
		
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, УдержаноСтрока) Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Для Каждого Область Из ВыводимыеОбласти Цикл
			ДокументРезультат.Вывести(Область);
		КонецЦикла;	
	КонецЕсли;	

	ВыборкаВычетыИтоги.Сбросить();
	
	ВыводимыеОбласти.Очистить();
	
	ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтогиЗаголовок);
	ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтогиШапка);
	ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтогиСтрока);
	
	Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
   		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиЗаголовок);
	ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиШапка);
	
	Если ВыборкаВычетыИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") тогда
		ВыборкаФизЛиц  = ВыборкаВычетыИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаФизЛиц.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаФизЛиц.Выбрать();
			СуммаВычетаИтог = 0; 
			Пока ВыборкаДетали.Следующий() Цикл
				ПредоставленныеВычетыИтогиСтрока.Параметры.Заполнить(ВыборкаДетали);	
                ЗаполнитьКодыТерриторийВПараметрах(ВыборкаДетали, ПредоставленныеВычетыИтогиСтрока.Параметры, Год);
				
				Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ПредоставленныеВычетыИтогиСтрока) Тогда
	       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиШапка);
				КонецЕсли;

				ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиСтрока);
				СуммаВычетаИтог = СуммаВычетаИтог + ВыборкаДетали.СуммаВычета;
			КонецЦикла;
			ПредоставленныеВычетыИтогиИтог.Параметры.СуммаВычета = СуммаВычетаИтог;
			Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ПредоставленныеВычетыИтогиИтог) Тогда
       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиШапка);
			КонецЕсли;

			ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиИтог);
		Иначе
			ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиСтрока);
		КонецЕсли;
	Иначе 
		ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиСтрока);	
	КонецЕсли;	
	
	ВыводимыеОбласти.Очистить();
	
	ВыводимыеОбласти.Добавить(ОбщиеСуммыИтогЗаголовок);
	ВыводимыеОбласти.Добавить(ОбщиеСуммыИтогШапка);
	ВыводимыеОбласти.Добавить(ОбщиеСуммыСтроки);
	
	Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбщиеСуммыИтогЗаголовок);
	ДокументРезультат.Вывести(ОбщиеСуммыИтогШапка);
	
	Если Год < ДатаПереходаНаКодыОКТМО Тогда
		ТаблицаПоНалогамИтоги.Свернуть("ОКАТО_КПП, Ставка", "ОбщаяСуммаДохода, НалоговаяБаза");
		ТаблицаПоНалогамИтоги.Сортировать("ОКАТО_КПП, Ставка");
		ТаблицаПоНалогамИтоги.Колонки.Добавить("ОКТМО_КПП");
		Для Каждого НалогиИтоги Из ТаблицаПоНалогамИтоги Цикл
			СтрокиОКАТО = СоответствиеОКАТОКПП.НайтиСтроки(Новый Структура("КодПоОКАТО",СправкиПоНДФЛ.КодОКАТОизСуммыОКАТОиКПП(НалогиИтоги.ОКАТО_КПП)));
			Если СтрокиОКАТО.Количество() > 0 Тогда
				НалогиИтоги.ОКТМО_КПП = СтрокиОКАТО[0].ОКТМО_КПП;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТаблицаПоНалогамИтоги.Свернуть("ОКТМО_КПП, Ставка", "ОбщаяСуммаДохода, НалоговаяБаза");
		ТаблицаПоНалогамИтоги.Сортировать("ОКТМО_КПП, Ставка");
	КонецЕсли;
	
	Для Каждого НалогиИтоги Из ТаблицаПоНалогамИтоги Цикл
		
		Если Год < ДатаПереходаНаКодыОКТМО Тогда
			ИмяКолонкиКода = "ОКАТО_КПП";
		Иначе
			ИмяКолонкиКода = "ОКТМО_КПП";
		КонецЕсли;	
		
		НалогиИсчисленныеПоОКАТО = ДанныеОНалогахНачисленныхПоОКАТО.Получить(НалогиИтоги[ИмяКолонкиКода]);
		
		Если НалогиИсчисленныеПоОКАТО = Неопределено Тогда
			СуммаНалогаИсчисленная = 0;
		Иначе
			НалогиИсчисленныеПоСтавкам = НалогиИсчисленныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаИсчисленная = ?(НалогиИсчисленныеПоСтавкам = Неопределено, 0, НалогиИсчисленныеПоСтавкам);
		КонецЕсли;	
		
		АвансыЗачтенныеПоОКАТО = ДанныеОбАвансахЗачтенныхПоОКАТО.Получить(НалогиИтоги[ИмяКолонкиКода]);
		Если АвансыЗачтенныеПоОКАТО = Неопределено Тогда
			СуммаАвансаЗачтенного = 0;
		Иначе
			АвансыЗачтенныеПоСтавкам = АвансыЗачтенныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаАвансаЗачтенного = ?(АвансыЗачтенныеПоСтавкам = Неопределено, 0, АвансыЗачтенныеПоСтавкам);
		КонецЕсли;	
		
		НалогиУдержанныеПоОКАТО = ДанныеОНалогахУдержанныхПоОКАТО.Получить(НалогиИтоги[ИмяКолонкиКода]);
		
		Если НалогиУдержанныеПоОКАТО = Неопределено Тогда
			СуммаНалогаУдержанная = 0;
		Иначе
			НалогиУдержанныеПоСтавкам = НалогиУдержанныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаУдержанная = ?(НалогиУдержанныеПоСтавкам = Неопределено, 0, НалогиУдержанныеПоСтавкам);
		КонецЕсли;
		
		НалогиВозвращенныеПоОКАТО = ДанныеОНалогахВозвращенныхПоОКАТО.Получить(НалогиИтоги[ИмяКолонкиКода]);
		
		Если НалогиВозвращенныеПоОКАТО = Неопределено Тогда
			СуммаНалогаВозвращенная = 0;
		Иначе
			НалогиВозвращенныеПоСтавкам = НалогиВозвращенныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаВозвращенная = ?(НалогиВозвращенныеПоСтавкам = Неопределено, 0, НалогиВозвращенныеПоСтавкам);
		КонецЕсли;
		
		СуммаНалогаУдержанная = СуммаНалогаУдержанная - СуммаНалогаВозвращенная;
		
		НалогиВзысканиеПоОКАТО = ДанныеОНалогахПереданныхНаВзысканиеПоОКАТО.Получить(НалогиИтоги[ИмяКолонкиКода]);
		
		Если НалогиВзысканиеПоОКАТО = Неопределено Тогда
			СуммаНалогаВзыскание = 0;
		Иначе
			НалогиВзысканиеПоСтавкам = НалогиВзысканиеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаВзыскание = ?(НалогиВзысканиеПоСтавкам = Неопределено, 0, НалогиВзысканиеПоСтавкам);
		КонецЕсли;
		
		НалогиПеречисленныеПоОКАТО = ДанныеОНалогахПеречисленныхПоОКАТО.Получить(НалогиИтоги[ИмяКолонкиКода]);
		
		Если НалогиПеречисленныеПоОКАТО = Неопределено Тогда
			СуммаНалогаПеречисленная = 0;
		Иначе
			НалогиПеречисленныеПоСтавкам = НалогиПеречисленныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаПеречисленная = ?(НалогиПеречисленныеПоСтавкам = Неопределено, 0, НалогиПеречисленныеПоСтавкам);
		КонецЕсли;
		
		Если НалогиИтоги.ОбщаяСуммаДохода = 0 И НалогиИтоги.НалоговаяБаза = 0 И СуммаНалогаИсчисленная = 0 И СуммаНалогаУдержанная = 0 И СуммаНалогаПеречисленная = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщиеСуммыСтроки.Параметры.Заполнить(НалогиИтоги);
		ОбщиеСуммыСтроки.Параметры.СуммаНалогаИсчисленная = СуммаНалогаИсчисленная;
		Если ЗначениеЗаполнено(СуммаАвансаЗачтенного) Тогда
			ОбщиеСуммыСтроки.Параметры.СуммаАвансовыхПлатежейЗачтенная = СуммаАвансаЗачтенного;
		ИначеЕсли Год >= ДатаИзмененияНалогообложенияДивидендов Тогда	
			ОбщиеСуммыСтроки.Параметры.СуммаАвансовыхПлатежейЗачтенная = 0;
		КонецЕсли;
		ОбщиеСуммыСтроки.Параметры.СуммаНалогаУдержанная = СуммаНалогаУдержанная;
	    ОбщиеСуммыСтроки.Параметры.СуммаНалогаПеречисленная = СуммаНалогаПеречисленная;
		
		СальдоПоНалогам = СуммаНалогаИсчисленная - СуммаАвансаЗачтенного - СуммаНалогаУдержанная - СуммаНалогаВзыскание;
		
		Если СальдоПоНалогам > 0 Тогда 
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаНеУдержанная = СальдоПоНалогам;	
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаИзлишнеУдержанная = 0;
		Иначе	
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаИзлишнеУдержанная = -СальдоПоНалогам;
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаНеУдержанная = 0;
		КонецЕсли;	
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ОбщиеСуммыСтроки) Тогда
   			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ДокументРезультат.Вывести(ОбщиеСуммыИтогШапка);
		КонецЕсли;

		ДокументРезультат.Вывести(ОбщиеСуммыСтроки);
	КонецЦикла;	
		
	ВыборкаСправкиНДФЛ.Сбросить();
	
	ВыводимыеОбласти.Очистить();
	ВыводимыеОбласти.Добавить(Раздел7);
	ВыводимыеОбласти.Добавить(Подписи);
	
	Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
   		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	Если ВыборкаСправкиНДФЛ.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
		ВыборкаПоСправкам = ВыборкаСправкиНДФЛ.Выбрать();
		
		Пока ВыборкаПоСправкам.Следующий() Цикл
			Раздел7.Параметры["НомерСправки" + Строка(ВыборкаПоСправкам.ТипСправки)] = ВыборкаПоСправкам.НомерСправки;
			Раздел7.Параметры["ДатаСправки" + Строка(ВыборкаПоСправкам.ТипСправки)] = Формат(ВыборкаПоСправкам.ДатаСправки, "ДФ=дд.ММ.гггг");
		КонецЦикла;
	КонецЕсли;	
	
	ДокументРезультат.Вывести(Раздел7);
	
	
	Подписи.Параметры.ДатаПодписи = Формат(ДатаПодписи, "ДФ=dd.MM.yyyy");
	Подписи.Параметры.ФИООтветственного = ДанныеОФизЛицеОрганизации.Ответственный_ФИО;
	Подписи.Параметры.ДолжностьОтветственного = ДанныеОФизЛицеОрганизации.Ответственный_Должность;
	
	ДокументРезультат.Вывести(Подписи);
	
КонецПроцедуры

Процедура ЗаполнитьКодыТерриторийВПараметрах(Выборка, Параметры, Год)
	
	ДатаПереходаНаКодыОКТМО = ПроведениеРасчетов.ДатаПереходаНаКодыОКТМО();
	
	ОКАТО_КПП = СправкиПоНДФЛ.СуммаОКАТОиКПП(Выборка.КодПоОКАТО, Выборка.КПП);
	Если Год >= ДатаПереходаНаКодыОКТМО Тогда
		ОКТМО_КПП = ОКАТО_КПП;
		Параметры.ОКТМО_КПП = ОКТМО_КПП;
	ИначеЕсли Год = ДобавитьМесяц(ДатаПереходаНаКодыОКТМО, -12) Тогда
		СтрокиОКАТО = СоответствиеОКАТОКПП.НайтиСтроки(Новый Структура("КодПоОКАТО",Выборка.КодПоОКАТО));
		Если СтрокиОКАТО.Количество() > 0 Тогда
			ОКТМО_КПП = СтрокиОКАТО[0].ОКТМО_КПП;
		КонецЕсли;
		Параметры.ОКАТО_КПП = ОКАТО_КПП;
		Параметры.ОКТМО_КПП = ОКТМО_КПП;
	Иначе
		Параметры.ОКАТО_КПП = ОКАТО_КПП;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

Функция СоздатьПустуюТаблицуИтогов()
	ТаблицаИтогов = Новый ТаблицаЗначений();	
	ТаблицаИтогов.Колонки.Добавить("ОКАТО_КПП");
	ТаблицаИтогов.Колонки.Добавить("ОКТМО_КПП");
	ТаблицаИтогов.Колонки.Добавить("Ставка");
	ТаблицаИтогов.Колонки.Добавить("ОбщаяСуммаДохода");
    ТаблицаИтогов.Колонки.Добавить("НалоговаяБаза");
		
	Возврат ТаблицаИтогов;
КонецФункции	

Процедура ПередВыводомЭлементРезультата(МакетКомпоновки, ПроцессорКомпоновки, ЭлементРезультата) Экспорт
	
КонецПроцедуры

Процедура ПередВыводомОтчета(МакетКомпоновки, ПроцессорКомпоновки) Экспорт
	
	
КонецПроцедуры

Процедура ПриВыводеЗаголовкаОтчета(ОбластьЗаголовок) Экспорт
КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СписокПолейПодстановкиОтборовПоУмолчанию = Новый Соответствие;
	СписокПолейПодстановкиОтборовПоУмолчанию.Вставить("Организация", "ОсновнаяОрганизация");
	
	Возврат Новый Структура("ИспользоватьСобытияПриФормированииОтчета,
	|ПриВыводеЗаголовкаОтчета,
	|ПослеВыводаПанелиПользователя,
	|ПослеВыводаПериода,
	|ПослеВыводаПараметра,
	|ПослеВыводаГруппировки,
	|ПослеВыводаОтбора,
	|ДействияПанелиИзменениеФлажкаДопНастроек,
	|ПриПолучениеНастроекПользователя, 
	|ЗаполнитьОтборыПоУмолчанию, 
	|СписокПолейПодстановкиОтборовПоУмолчанию,
	|СписокДоступныхПредопределенныхНастроек,
	|МинимальныйПериодОтчета", 
	ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, истина, СписокПолейПодстановкиОтборовПоУмолчанию,, "Год");

КонецФункции


Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;

Если КомпоновщикНастроек = Неопределено Тогда
	КомпоновщикНастроек =  Новый КомпоновщикНастроекКомпоновкиДанных;
КонецЕсли;

УправлениеОтчетами.ЗаменитьНазваниеПолейСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
