
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборСписка();
	
	Если Параметры.РежимВыбора Тогда
		Элементы.СписокВыполняются.РежимВыбора = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыФормыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьОтборСписка();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка()
	
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыполняются Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Состояние", Перечисления.СостоянияКонтрактов.Завершен, ВидСравненияКомпоновкиДанных.НеРавно);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Состояние", Перечисления.СостоянияКонтрактов.Завершен, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначения275КлиентСервер.ПроверитьИспользованиеПодсистемы(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПаспортКонтракта(Команда)
	АктивныйСписок = Элементы.СписокВыполняются;
	Если Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗавершены Тогда
		АктивныйСписок = Элементы.СписокЗавершены;
	КонецЕсли;
	Если АктивныйСписок.ТекущиеДанные <> Неопределено Тогда
		ПФ = Новый Структура("Ссылка", АктивныйСписок.ТекущиеДанные.Ссылка);
		ОткрытьФорму("Отчет.ПаспортКонтракта.Форма.Форма", ПФ, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
