Процедура ПриПолученииНовогоШаблонаФСГС(Знач ПараметрыШаблона) Экспорт
	Если Метаданные.РегистрыСведений.Найти("ШаблоныЭВФОтчетовСтатистики") = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ДобавитьШаблоны(ПараметрыШаблона);
КонецПроцедуры

Процедура ДобавитьШаблоны(ПараметрыШаблона) Экспорт 
	Попытка
		КоличествоНезагруженныхШаблонов = 0;
		ФормаСписка = РегистрыСведений.ШаблоныЭВФОтчетовСтатистики.ПолучитьФорму("ФормаСписка");
		КороткиеИменаФайлов = Новый Массив;
		КороткиеИменаФайлов.Добавить(ПараметрыШаблона.ИсходноеИмяФайла);
		ШаблоныЭВФ = Новый Массив;
		ШаблонЭВФ = Новый Структура;
		ШаблонЭВФ.Вставить("ИмяФайлаШаблона", НРег(ПараметрыШаблона.ИсходноеИмяФайла));
		ОбъектФайл = Новый Файл(ПараметрыШаблона.ПолноеИмяФайлаДанных);
		ШаблонЭВФ.Вставить("Размер", ОбъектФайл.Размер());
		ШаблонЭВФ.Вставить("Шаблон", Новый ДвоичныеДанные(ПараметрыШаблона.ПолноеИмяФайлаДанных));
		ШаблоныЭВФ.Добавить(ШаблонЭВФ);
		ФормаСписка.ЗагрузитьШаблоны(ШаблоныЭВФ, КоличествоНезагруженныхШаблонов);
		Если КоличествоНезагруженныхШаблонов > 0 Тогда 
			ЗаписьЖурналаРегистрации("ПриПолученииНовогоШаблонаФСГС", УровеньЖурналаРегистрации.Предупреждение, , , "Не удалось загрузить шаблон");
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("ПриПолученииНовогоШаблонаФСГС", УровеньЖурналаРегистрации.Предупреждение, , , "Не удалось загрузить шаблон");
	КонецПопытки;
КонецПроцедуры
