Перем мТаблицаСоставПоказателей Экспорт; // состав показателей отчета

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы периода построения отчета
// и периодичность
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;
Перем мПериодичность Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мСчетчикСтраниц Экспорт; // флажок на форме выбора страниц, если Истина, то пересчет автоматический убрать

Перем мАвтоВыборКодов Экспорт; // для флажка "отключить выбор значений из списка"

Перем мЗаписьЗапрещена Экспорт;

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске

Перем мТаблицаФормОтчета Экспорт;

Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

// Переменная для хранения корректного текста для подменю Очистить.
// Хранится текст, декларация или отчет или расчет... очищать.
Перем мЧтоОчищать Экспорт;

Перем СвойстваЗаполненияОтчета Экспорт;

Перем мФормыИФорматы Экспорт;
Перем мВерсияОтчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПерсУчетВоВнешнейПрограмме() Экспорт
	
	ИмяКонстанты = "УчетЗарплатыИКадровВоВнешнейПрограмме";
	
	УчетВоВнешнейПрограмме = РегламентированнаяОтчетность.ИДКонфигурации() = "БГУ"
	                     ИЛИ Метаданные.Константы.Найти(ИмяКонстанты) <> Неопределено И Константы[ИмяКонстанты].Получить();
	
	Возврат УчетВоВнешнейПрограмме;
	
КонецФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция СтрокаЧГ0(ИсходноеЧисло) Экспорт // враппер
	
	Возврат РегламентированнаяОтчетность.СтрокаЧГ0(ИсходноеЧисло);
	
КонецФункции

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

Форма20100101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1169999", '20091112', "894н", "ФормаОтчета2010Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20100101, "7.00", '20100227', "55р");

Форма20101001 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1169999", '20101220', "1135н", "ФормаОтчета2010Кв4");
ОпределитьФорматВДеревеФормИФорматов(Форма20101001, "7.00", '20100227', "55р");

Форма20110101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1169999", '20110131', "54н", "ФормаОтчета2011Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20110101, "7.00", '20110331', "120р");

Форма20120101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1169999", '20120315', "232н", "ФормаОтчета2012Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20120101, "7.00", '20120330', "92р");

Форма20130101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1169999", '2012-12-28', "639н", "ФормаОтчета2013Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20130101, "7.00", '2013-03-21', "97p");

ФормаОтчета2014Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1169999", '2014-01-16', "2п", "ФормаОтчета2014Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2014Кв1, "7.00", '2014-03-03', "25п");

ФормаОтчета2015Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1169999", '2015-06-04', "194п", "ФормаОтчета2015Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2015Кв1, "7.00");

мЧтоОчищать = "Расчет";

ОписаниеТиповСтрока15  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);
ОписаниеТиповСтрока50  = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);

мТаблицаСоставПоказателей    = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСтруктуре",  ОписаниеТиповСтрока50);

мСтруктураВариантыЗаполнения = Новый Структура;

ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(254);

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);


НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Минздравсоцразвития РФ от 12.11.2009 № 894н";
НоваяФорма.ДатаНачалоДействия = '2010-01-01';
НоваяФорма.ДатаКонецДействия  = '2010-09-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв4";
НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Минздравсоцразвития РФ от 12.11.2009 г №894н (в редакции приказа Минздравсоцразвития РФ от 20.12.2010 № 1135н)";
НоваяФорма.ДатаНачалоДействия = '2010-10-01';
НоваяФорма.ДатаКонецДействия  = '2010-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Минздравсоцразвития РФ от 12.11.2009 г №894н (в редакции приказов Минздравсоцразвития РФ от 20.12.2010 № 1135н, от 31.01.2011 №54н)";
НоваяФорма.ДатаНачалоДействия = '2011-01-01';
НоваяФорма.ДатаКонецДействия  = '2011-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Минздравсоцразвития РФ от 15.03.2012 № 232н";
НоваяФорма.ДатаНачалоДействия = '2012-01-01';
НоваяФорма.ДатаКонецДействия  = '2012-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Минтруда России от 28.12.2012 № 639н";
НоваяФорма.ДатаНачалоДействия = '2013-01-01';
НоваяФорма.ДатаКонецДействия  = '2013-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена постановлением Правления ПФР от 16.01.2014 № 2п";
НоваяФорма.ДатаНачалоДействия = '2014-01-01';
НоваяФорма.ДатаКонецДействия  = '2015-03-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена Постановлением Правления ПФР от 16.01.2014 № 2п (в редакции постановления Правления ПФР от 04.06.2015 № 194п).";
НоваяФорма.ДатаНачалоДействия = '2015-04-01';
НоваяФорма.ДатаКонецДействия  = '2016-12-31';
