// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

Перем мВерсияФормы Экспорт;

Перем мПериодичность Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мСчетчикСтраниц Экспорт; 

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мЗаписьЗапрещена Экспорт;

Перем мАвтоВыборКодов Экспорт; // для флажка "отключить выбор значений из списка"

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске
Перем мТаблицаФормОтчета Экспорт;

Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

Перем мПечатьБезШтрихкодаРазрешена Экспорт;

Перем мФормыИФорматы Экспорт;
Перем мВерсияОтчета Экспорт;

Перем мПроверятьСоотношенияПриПечатиИВыгрузки Экспорт; // Флаг для запуска КС

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция СтрокаЧГ0(ИсходноеЧисло) Экспорт // враппер
	
	Возврат РегламентированнаяОтчетность.СтрокаЧГ0(ИсходноеЧисло);
	
КонецФункции

Процедура Инкр(ИнкрементируемоеЗначение) Экспорт
	
	ИнкрементируемоеЗначение = ИнкрементируемоеЗначение + 1;
	
КонецПроцедуры

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

Форма20080101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152028", '2008-02-20', "27н", "ФормаОтчета2008Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20080101, "5.01");

Форма20120101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152028", '2011-11-24', "ММВ-7-11/895", "ФормаОтчета2011Кв3");
ОпределитьФорматВДеревеФормИФорматов(Форма20120101, "5.02");

Форма20140101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152028", '2013-11-05', "ММВ-7-11/478@", "ФормаОтчета2013Кв4");
ОпределитьФорматВДеревеФормИФорматов(Форма20140101, "5.03");

Форма20170101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152028", '2017-03-31', "ММВ-7-21/271@", "ФормаОтчета2017Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20170101, "5.04");

Форма20190101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152028", '2018-10-04', "ММВ-7-21/575@", "ФормаОтчета2019Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20190101, "5.05");

мТаблицаСоставПоказателей = РегламентированнаяОтчетность.СозданиеТаблицыСоставаПоказателей();
мСтруктураВариантыЗаполнения = Новый Структура;
мТаблицаФормОтчета = РегламентированнаяОтчетность.СозданиеТаблицыФормОтчета();

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2008Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №3 к приказу Минфина РФ от 20.02.2008 г. №27н";
НоваяФорма.ДатаНачалоДействия = '2008-01-01';
НоваяФорма.ДатаКонецДействия  = '2011-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв3";
НоваяФорма.ОписаниеОтчета     = "Приложение № 4 к приказу ФНС России от 24.11.2011 № ММВ-7-11/895";
НоваяФорма.ДатаНачалоДействия = '2012-01-01';
НоваяФорма.ДатаКонецДействия  = '2013-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение №4 к приказу ФНС России от 05.11.2013 № ММВ-7-11/478@";
НоваяФорма.ДатаНачалоДействия = '2014-01-01';
НоваяФорма.ДатаКонецДействия  = '2015-09-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв4_Виртуальная";
НоваяФорма.ОписаниеОтчета     = "Приложение №4 к приказу ФНС России от 05.11.2013 № ММВ-7-11/478@ (в редакции письма ФНС России от 25.03.2016 № БС-4-11/5197@).";
НоваяФорма.ДатаНачалоДействия = '2016-01-01';
НоваяФорма.ДатаКонецДействия  = '2017-09-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 4 к приказу ФНС России от 31.03.2017 № ММВ-7-21/271@.";
НоваяФорма.ДатаНачалоДействия = '2017-01-01';
НоваяФорма.ДатаКонецДействия  = '2018-09-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2019Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 4 к приказу ФНС России от 31.03.2017 № ММВ-7-21/271@ (в редакции приказа ФНС России от 04.10.2018 № ММВ-7-21/575@).";
НоваяФорма.ДатаНачалоДействия = '2019-01-01';
НоваяФорма.ДатаКонецДействия  = '2019-09-30';
