
//#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ИнтеграцияЕГАИСВызовСервера.ПриПолученииФормыСправочника(
		"ВидыАлкогольнойПродукции",
		ВидФормы,
		Параметры,
		ВыбраннаяФорма,
		ДополнительнаяИнформация,
		СтандартнаяОбработка);
	
КонецПроцедуры

//#КонецОбласти

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию() Экспорт
	
	ЭлементыДляОбработки = Справочники.ВидыАлкогольнойПродукции.Выбрать();
	
	Пока ЭлементыДляОбработки.Следующий() Цикл
		
		Если (Не ЗначениеЗаполнено(ЭлементыДляОбработки.ВидЛицензии)) И значениеЗаполнено(ЭлементыДляОбработки.УдаленаВидЛицензии) Тогда
			ЭлементДляОбработки = ЭлементыДляОбработки.ПолучитьОбъект();
			ЭлементДляОбработки.ВидЛицензии = ?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.АлкогольнаяПродукция, Перечисления.ВидыЛицензийАлкогольнойПродукции.АлкогольнаяПродукция,
				?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.Пиво, Перечисления.ВидыЛицензийАлкогольнойПродукции.Пиво,
					?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.Спирт, Перечисления.ВидыЛицензийАлкогольнойПродукции.Спирт,
						?(ЭлементДляОбработки.УдаленаВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.СпиртосодержащаяНеПищеваяПродукция, Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяНеПищеваяПродукция,
							Перечисления.ВидыЛицензийАлкогольнойПродукции.СпиртосодержащаяПищеваяПродукция
						)
					)
				));
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементДляОбработки);
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры
	