//#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФормуЕГАИС(ИмяФормыРабочегоМестаПоОформлениюДокументаТТНВходящаяЕГАИС(),,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИмяФормыРабочегоМестаПоОформлениюДокументаТТНВходящаяЕГАИС()
	
	Возврат ИнтеграцияЕГАИСПереопределяемый.ИмяФормыРабочегоМестаПоОформлениюДокументаТТНВходящаяЕГАИС();
	
КонецФункции

//#КонецОбласти
