////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	ДоступностьКлючевыхЗаписей = Истина;
	Если Параметры.Свойство("ДоступностьКлючевыхЗаписей") Тогда
		ДоступностьКлючевыхЗаписей = Параметры.ДоступностьКлючевыхЗаписей;
	КонецЕсли;
	
	ЭтаФорма.Элементы.ПредметСделки.ТолькоПросмотр 							= НЕ ДоступностьКлючевыхЗаписей;
	ЭтаФорма.Элементы.ЯвляетсяТоваромМировойБиржевойТорговли.ТолькоПросмотр = НЕ ДоступностьКлючевыхЗаписей;
	
	ОтметкаЗаполнения = ДоступностьКлючевыхЗаписей И НЕ ЗначениеЗаполнено(Запись.КодПоОКВЭД) И НЕ ЗначениеЗаполнено(Запись.КодПоОКП)
		И НЕ ЗначениеЗаполнено(Запись.КодПоТНВЭД) И НЕ ЗначениеЗаполнено(Запись.КодПоОКВЭД2) И НЕ ЗначениеЗаполнено(Запись.КодПоОКПД2);
	
	ЭтаФорма.Элементы.КодПоОквэд.АвтоОтметкаНезаполненного  = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКП.АвтоОтметкаНезаполненного    = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоТНВЭД.АвтоОтметкаНезаполненного  = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКПД2.АвтоОтметкаНезаполненного  = ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКВЭД2.АвтоОтметкаНезаполненного = ОтметкаЗаполнения;
	
КонецПроцедуры
