Процедура ЗаполнитьГраницыКонтролируемости() Экспорт
	
	Записи = РегистрыСведений.ГраницыКонтролируемостиСделок.СоздатьНаборЗаписей();
	Записи.Записать();
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица;
	Запись.ПредельнаяСумма = 3000000000;

	Запись = Записи.Добавить();
	Запись.Период = Дата('20130101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица;
	Запись.ПредельнаяСумма = 2000000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20140101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица;
	Запись.ПредельнаяСумма = 1000000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах;
	Запись.ПредельнаяСумма = 100000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона;
	Запись.ПредельнаяСумма = 999999999999999;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20140101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона;
	Запись.ПредельнаяСумма = 60000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль;
	Запись.ПредельнаяСумма = 60000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ;
	Запись.ПредельнаяСумма = 60000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаДеятельностьМорскогоМесторождения;
	Запись.ПредельнаяСумма = 999999999999999;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20140101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаДеятельностьМорскогоМесторождения;
	Запись.ПредельнаяСумма = 60000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаУчастникиРегиональногоИнвестиционногоПроекта;
	Запись.ПредельнаяСумма = 999999999999999;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20140101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаУчастникиРегиональногоИнвестиционногоПроекта;
	Запись.ПредельнаяСумма = 60000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаИнвестиционныйВычет;
	Запись.ПредельнаяСумма = 999999999999999;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20180101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаИнвестиционныйВычет;
	Запись.ПредельнаяСумма = 60000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсвобождениеНДС;
	Запись.ПредельнаяСумма = 999999999999999;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20160101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсвобождениеНДС;
	Запись.ПредельнаяСумма = 60000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление;
	Запись.ПредельнаяСумма = 100000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20130101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление;
	Запись.ПредельнаяСумма = 80000000;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20140101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление;
	Запись.ПредельнаяСумма = 0;
	
	Запись = Записи.Добавить();
	Запись.Период = Дата('20120101');
	Запись.ОсобенностьОтнесенияСделкиККонтролируемой = Перечисления.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица;
	Запись.ПредельнаяСумма = 60000000;
	
	Записи.Записать();
	
КонецПроцедуры