
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		СтрокаНабора.Фамилия	= СокрЛП(СтрокаНабора.Фамилия);
		СтрокаНабора.Имя		= СокрЛП(СтрокаНабора.Имя);
		СтрокаНабора.Отчество	= СокрЛП(СтрокаНабора.Отчество);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Предупредим о "последствиях" пустой фамилии
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаНабора.Фамилия) Тогда
			СтрокаСообщенияОбОшибке = "Для физического лица " + СтрокаНабора.ФизЛицо + " не указана фамилия. Возможны ошибки представления в отчетах! " + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаСообщенияОбОшибке) Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
			ОбработкаКомментариев.УдалитьСообщения();
			ОбработкаКомментариев.ДобавитьСообщение(СтрокаСообщенияОбОшибке, Перечисления.ВидыСообщений.ВажнаяИнформация);
			ОбработкаКомментариев.ПоказатьСообщения();
		#Иначе
			Сообщить(СтрокаСообщенияОбОшибке, СтатусСообщения.Внимание);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры
