
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОшибки = "Элемент справочника ""Нормативы обслуживания ОС"" не записан.";
	
	Если ЗначениеЗаполнено(ПериодичностьОбслуживания) И КоличествоПериодов = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Количество периодов обслуживание должно быть больше нуля.",, СтрокаОшибки);
		Отказ = Истина;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПараметрВыработки) И ЗначениеПараметраВыработки = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Количество параметра выработки должно быть больше нуля.",, СтрокаОшибки);
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПериодичностьОбслуживания) И  НЕ ЗначениеЗаполнено(ПараметрВыработки) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Должен быть заполнен параметр выработки или периодичность обслуживания",, СтрокаОшибки);
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

