////////////////////////////////////////////////////////////////////////////////

Функция ВписатьКатегорииВДанныеСтажа2011(ОбособленноеПодразделение, ДатаНачалаПериодаЗаполнения, ДатаОкончанияПериодаЗаполнения, ТаблицаСтажа) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОтчетныйПериод",				ДатаНачалаПериодаЗаполнения);
	Запрос.УстановитьПараметр("Организация",				ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",		ОбщегоНазначенияЗК.ГоловнаяОрганизация(ОбособленноеПодразделение));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",		КонецМесяца(ДатаОкончанияПериодаЗаполнения));
 	Запрос.УстановитьПараметр("ДатаНовойРедакцииЗакона212", ПроведениеРасчетов.ДатаРасширенияПеречняЛьготныхТарифовСтраховыхВзносов());

	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(ДатаНачалаПериодаЗаполнения);
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = Месяц(ДатаНачалаПериодаЗаполнения) По Месяц(ДатаОкончанияПериодаЗаполнения) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаФизлиц.Физлицо,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет
	|ПОМЕСТИТЬ ВТТаблицаСтажа
	|ИЗ
	|	&ТаблицаФизлиц КАК ТаблицаФизлиц";
	Запрос.УстановитьПараметр("ТаблицаФизлиц", ТаблицаСтажа);
	Запрос.Выполнить();
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСтажа.Физлицо КАК Физлицо,
	|	ТаблицаСтажа.ОтчетныйПериод,
	|	ТаблицаСтажа.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаНачалаПериода < НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|			ТОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|		ИНАЧЕ ТаблицаСтажа.ДатаНачалаПериода
	|	КОНЕЦ КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаОкончанияПериода < Периоды.Период
	|			ТОГДА ТаблицаСтажа.ДатаОкончанияПериода
	|		ИНАЧЕ Периоды.Период
	|	КОНЕЦ КАК ДатаОкончанияПериода,
	|	ТаблицаСтажа.ТерриториальныеУсловия,
	|	ТаблицаСтажа.ОсобыеУсловияТруда,
	|	ТаблицаСтажа.КодПозицииСписка,
	|	ТаблицаСтажа.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаСтажа.ТретийПараметрВыслугиЛет,
	|	ТаблицаСтажа.ПараметрТерриториальныхУсловий,
	|	ТаблицаСтажа.ОснованиеВыслугиЛет,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	ВТТаблицаСтажа КАК ТаблицаСтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
	|		ПО (Периоды.Период МЕЖДУ НАЧАЛОПЕРИОДА(ТаблицаСтажа.ДатаНачалаПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(ТаблицаСтажа.ДатаОкончанияПериода, МЕСЯЦ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховая + ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВД
	|		КОНЕЦ) КАК ПФРСтраховаяОборот,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительная + ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВД
	|		КОНЕЦ) КАК ПФРНакопительнаяОборот,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВД
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСтраховаяЕНВДОборот,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВД
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРНакопительнаяЕНВДОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленныеОбороты
	|ГДЕ
	|	СтраховыеВзносыИсчисленныеОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|	И СтраховыеВзносыИсчисленныеОбороты.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.Физлицо
	|			ИЗ
	|				ВТФизЛица КАК ФизЛица)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|	ГДЕ
	|		СведенияОбИнвалидностиФизлиц.Физлицо В
	|				(ВЫБРАТЬ
	|					Физлица.Физлицо
	|				ИЗ
	|					ВТФизЛица КАК Физлица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Исчислено.ФизЛицо КАК ФизЛицо,
	|	Исчислено.КатегорияЗастрахованныхЛиц,
	|	Исчислено.МесяцОтчетногоПериода
	|ПОМЕСТИТЬ ВТИсчисленоПоКатегориямЗЛ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоЗЛ.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоЗЛ.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
	|		ИсчисленоПоЗЛ.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|		СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|		ИсчисленоПоЗЛ.МесяцОтчетногоПериода КАК МесяцОтчетногоПериода
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|				ПО ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|					И (ГОД(ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|			ПО ИсчисленоПоЗЛ.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсчисленоПоЗЛ.ФизЛицо,
	|		ИсчисленоПоЗЛ.ПФРНакопительнаяЕНВДОборот,
	|		ИсчисленоПоЗЛ.ПФРСтраховаяЕНВДОборот,
	|		СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц,
	|		ИсчисленоПоЗЛ.МесяцОтчетногоПериода
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД) = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов)
	|				И (ГОД(ИсчисленоПоЗЛ.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)) КАК Исчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	Исчислено.ФизЛицо,
	|	Исчислено.КатегорияЗастрахованныхЛиц,
	|	Исчислено.МесяцОтчетногоПериода
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Исчислено.ПФРНакопительнаяОборот) <> 0
	|		ИЛИ СУММА(Исчислено.ПФРСтраховаяОборот) <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.Физлицо КАК ФизЛицо,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ВЫБОР
	|		КОГДА Инвалиды.Физлицо ЕСТЬ НЕ NULL 
	|			ТОГДА ЕСТЬNULL(СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц, ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ИсчисленоПоЗЛ.КатегорияЗастрахованныхЛиц, ЕСТЬNULL(СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц, ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ПустаяСсылка)))
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ТаблицаФизлиц.Физлицо = Инвалиды.Физлицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоКатегориямЗЛ КАК ИсчисленоПоЗЛ
	|		ПО ТаблицаФизлиц.Физлицо = ИсчисленоПоЗЛ.ФизЛицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = ИсчисленоПоЗЛ.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (ВЫБОР
	|				КОГДА Инвалиды.Физлицо ЕСТЬ НЕ NULL 
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов)
	|			И (ГОД(ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц,
	|	ДатаНачалаПериода";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());

	РезультатЗапроса = Запрос.Выполнить();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ВписатьКатегорииВДанныеСтажа2012(ОбособленноеПодразделение, ДатаНачалаПериодаЗаполнения, ДатаОкончанияПериодаЗаполнения, ТаблицаСтажа) 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОтчетныйПериод",			НачалоМесяца(ДатаНачалаПериодаЗаполнения));
	Запрос.УстановитьПараметр("Организация",			ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначенияЗК.ГоловнаяОрганизация(ОбособленноеПодразделение));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",	КонецМесяца(ДатаОкончанияПериодаЗаполнения));
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());

	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(ДатаНачалаПериодаЗаполнения);
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = Месяц(ДатаНачалаПериодаЗаполнения) По Месяц(ДатаОкончанияПериодаЗаполнения) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаФизлиц.Физлицо,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет
	|ПОМЕСТИТЬ ВТТаблицаСтажа
	|ИЗ
	|	&ТаблицаФизлиц КАК ТаблицаФизлиц";
	Запрос.УстановитьПараметр("ТаблицаФизлиц", ТаблицаСтажа);
	Запрос.Выполнить();
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(Запрос.МенеджерВременныхТаблиц);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСтажа.Физлицо КАК Физлицо,
	|	ТаблицаСтажа.ОтчетныйПериод,
	|	ТаблицаСтажа.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаНачалаПериода < НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|			ТОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|		ИНАЧЕ ТаблицаСтажа.ДатаНачалаПериода
	|	КОНЕЦ КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаОкончанияПериода < Периоды.Период
	|			ТОГДА ТаблицаСтажа.ДатаОкончанияПериода
	|		ИНАЧЕ Периоды.Период
	|	КОНЕЦ КАК ДатаОкончанияПериода,
	|	ТаблицаСтажа.ТерриториальныеУсловия,
	|	ТаблицаСтажа.ОсобыеУсловияТруда,
	|	ТаблицаСтажа.КодПозицииСписка,
	|	ТаблицаСтажа.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаСтажа.ТретийПараметрВыслугиЛет,
	|	ТаблицаСтажа.ПараметрТерриториальныхУсловий,
	|	ТаблицаСтажа.ОснованиеВыслугиЛет,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	ВТТаблицаСтажа КАК ТаблицаСтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
	|		ПО (Периоды.Период МЕЖДУ НАЧАЛОПЕРИОДА(ТаблицаСтажа.ДатаНачалаПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(ТаблицаСтажа.ДатаОкончанияПериода, МЕСЯЦ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Результат) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Скидка) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходахОбороты
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.Физлицо
	|			ИЗ
	|				ВТФизЛица КАК ФизЛица)
	|	И НЕ СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.Период,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТВидыДеятельностиПоФизлицам
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Инвалидность,
	|	СрезПоследнихДат.ПериодРегистрации КАК МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|	ГДЕ
	|		СведенияОбИнвалидностиФизлиц.Физлицо В
	|				(ВЫБРАТЬ
	|					Физлица.Физлицо
	|				ИЗ
	|					ВТФизЛица КАК Физлица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ГражданствоФизЛиц.ВидЗастрахованногоЛица,
	|	НЕ ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК ИмеетПравоНаСтрахование
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.Физлицо
	|				ИЗ
	|					ВТФизЛица КАК Организации)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК МесяцОтчетногоПериода,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|				И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ),
	|		Периоды.Физлицо) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	ВЫБОР
	|		КОГДА ВидыДеятельности.ТолькоДоходыФармацевтов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА ВидыДеятельности.ТолькоДоходыМоряков
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО (НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = ВидыДеятельности.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ПФРНакопительная,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС,
	|	ТарифСтраховыхВзносов.ТФОМС,
	|	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
	|	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&КонецОтчетногоПериода, ) КАК ТарифСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тарифы.ВидТарифа,
	|	ВЫБОР
	|		КОГДА Тарифы.СуммарныйТариф > ТарифДляИнвалидов.СуммарныйТариф
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыделятьДоходыИнвалидов
	|ПОМЕСТИТЬ ВТОписаниеТарифов
	|ИЗ
	|	ВТРазмерыТарифныхСтавок КАК Тарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК ТарифДляИнвалидов
	|		ПО (ТарифДляИнвалидов.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК МесяцОтчетногоПериода,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоВидамТарифа
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.МесяцОтчетногоПериода
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.Физлицо КАК ФизЛицо,
	|	ТаблицаФизлиц.МесяцОтчетногоПериода,
	|	ЕСТЬNULL(СоответствиеТарифаПоДоходам.КатегорияЗастрахованныхЛиц, ЕСТЬNULL(СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц, ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ПустаяСсылка))) КАК КатегорияЗастрахованныхЛиц
	|ПОМЕСТИТЬ ВТКатегорииПоТарифам
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахПоВидамТарифа КАК КатегорииПоДоходам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаПоДоходам
	|			ПО КатегорииПоДоходам.ВидТарифаСтраховыхВзносов = СоответствиеТарифаПоДоходам.ВидТарифаСтраховыхВзносов
	|				И (ГОД(КатегорииПоДоходам.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаПоДоходам.ГодС И СоответствиеТарифаПоДоходам.ГодПо)
	|		ПО ТаблицаФизлиц.Физлицо = КатегорииПоДоходам.ФизЛицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = КатегорииПоДоходам.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельностиПоФизлицам КАК ВидыДеятельностиПоФизлицам
	|		ПО ТаблицаФизлиц.Физлицо = ВидыДеятельностиПоФизлицам.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|			ПО ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (ВЫБОР
	|				КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|						И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				КОГДА ВидыДеятельностиПоФизлицам.ТолькоДоходыФармацевтов
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА ВидыДеятельностиПоФизлицам.ТолькоДоходыМоряков
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов)
	|			И (ГОД(ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеВидыДохода)
	|				ТОГДА СведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъектНестрахуемых,
	|	СУММА(СведенияОДоходах.РезультатОборот) КАК ВесьОбъект,
	|	СведенияОДоходах.Период КАК МесяцОтчетногоПериода,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТСоставДоходов
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.Физлицо КАК ФизЛицо,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, КатегорииПоТарифам.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКатегорииПоТарифам КАК КатегорииПоТарифам
	|		ПО ТаблицаФизлиц.Физлицо = КатегорииПоТарифам.ФизЛицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = КатегорииПоТарифам.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = Гражданство.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (КатегорииПоТарифам.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И (ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = ПринятыеПоДолгосрочнымДоговорам.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоставДоходов КАК СоставДоходов
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = СоставДоходов.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = СоставДоходов.ФизЛицо
	|ГДЕ
	|	(ЕСТЬNULL(Гражданство.ИмеетПравоНаСтрахование, ИСТИНА)
	|			ИЛИ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ))
	|	И (ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) = 0
	|			ИЛИ ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) <> ЕСТЬNULL(СоставДоходов.ОбъектНестрахуемых, 0))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц,
	|	ДатаНачалаПериода";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());

	РезультатЗапроса = Запрос.Выполнить();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ВписатьКатегорииВДанныеСтажа(ОбособленноеПодразделение, ДатаНачалаПериодаЗаполнения, ДатаОкончанияПериодаЗаполнения, ТаблицаСтажа, ВРазрезеТипаДоговора) Экспорт
	
	Если ДатаОкончанияПериодаЗаполнения < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда
		Возврат ВписатьКатегорииВДанныеСтажа2011(ОбособленноеПодразделение, ДатаНачалаПериодаЗаполнения, ДатаОкончанияПериодаЗаполнения, ТаблицаСтажа)
	ИначеЕсли ДатаОкончанияПериодаЗаполнения < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Или Не ВРазрезеТипаДоговора Тогда	
		Возврат ВписатьКатегорииВДанныеСтажа2012(ОбособленноеПодразделение, ДатаНачалаПериодаЗаполнения, ДатаОкончанияПериодаЗаполнения, ТаблицаСтажа)
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОтчетныйПериод",			НачалоМесяца(ДатаНачалаПериодаЗаполнения));
	Запрос.УстановитьПараметр("Организация",			ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначенияЗК.ГоловнаяОрганизация(ОбособленноеПодразделение));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",	КонецМесяца(ДатаОкончанияПериодаЗаполнения));
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());

	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(ДатаНачалаПериодаЗаполнения);
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = Месяц(ДатаНачалаПериодаЗаполнения) По Месяц(ДатаОкончанияПериодаЗаполнения) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаФизлиц.Физлицо,
	|	ТаблицаФизлиц.ТипДоговора,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет
	|ПОМЕСТИТЬ ВТТаблицаСтажа
	|ИЗ
	|	&ТаблицаФизлиц КАК ТаблицаФизлиц";
	
	КолонкиТаблицыСтажа = ТаблицаСтажа.Колонки;
	Если КолонкиТаблицыСтажа.Найти("ТипДоговора") = Неопределено Тогда
		КолонкиТаблицыСтажа.Добавить("ТипДоговора", Новый ОписаниеТипов("ПеречислениеСсылка.ТипДоговораСЗВ63"))
	КонецЕсли;
	Если КолонкиТаблицыСтажа.Найти("ОтчетныйПериод") = Неопределено Тогда
		КолонкиТаблицыСтажа.Добавить("ОтчетныйПериод", Новый ОписаниеТипов("Дата"));
		ТаблицаСтажа.ЗаполнитьЗначения(НачалоМесяца(ДатаНачалаПериодаЗаполнения),"ОтчетныйПериод");
	КонецЕсли;
	Если КолонкиТаблицыСтажа.Найти("ОбособленноеПодразделение") = Неопределено Тогда
		КолонкиТаблицыСтажа.Добавить("ОбособленноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		ТаблицаСтажа.ЗаполнитьЗначения(ОбособленноеПодразделение,"ОбособленноеПодразделение");
	КонецЕсли;
	Запрос.УстановитьПараметр("ТаблицаФизлиц", ТаблицаСтажа);
	Запрос.Выполнить();
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(Запрос.МенеджерВременныхТаблиц, Год(ДатаНачалаПериодаЗаполнения));

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСтажа.Физлицо КАК Физлицо,
	|	ТаблицаСтажа.ОтчетныйПериод,
	|	ТаблицаСтажа.ТипДоговора,
	|	ТаблицаСтажа.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаНачалаПериода < НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|			ТОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|		ИНАЧЕ ТаблицаСтажа.ДатаНачалаПериода
	|	КОНЕЦ КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаОкончанияПериода < Периоды.Период
	|			ТОГДА ТаблицаСтажа.ДатаОкончанияПериода
	|		ИНАЧЕ Периоды.Период
	|	КОНЕЦ КАК ДатаОкончанияПериода,
	|	ТаблицаСтажа.ТерриториальныеУсловия,
	|	ТаблицаСтажа.ОсобыеУсловияТруда,
	|	ТаблицаСтажа.КодПозицииСписка,
	|	ТаблицаСтажа.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаСтажа.ТретийПараметрВыслугиЛет,
	|	ТаблицаСтажа.ПараметрТерриториальныхУсловий,
	|	ТаблицаСтажа.ОснованиеВыслугиЛет,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	ВТТаблицаСтажа КАК ТаблицаСтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
	|		ПО (Периоды.Период МЕЖДУ НАЧАЛОПЕРИОДА(ТаблицаСтажа.ДатаНачалаПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(ТаблицаСтажа.ДатаОкончанияПериода, МЕСЯЦ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Результат) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Скидка) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходахОбороты
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.Физлицо
	|			ИЗ
	|				ВТФизЛица КАК ФизЛица)
	|	И НЕ СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.Период,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТВидыДеятельностиПоФизлицам
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.Физлицо
	|			ИЗ
	|				ВТФизЛица КАК ФизЛица)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Инвалидность,
	|	СрезПоследнихДат.ПериодРегистрации КАК МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|	ГДЕ
	|		СведенияОбИнвалидностиФизлиц.Физлицо В
	|				(ВЫБРАТЬ
	|					Физлица.Физлицо
	|				ИЗ
	|					ВТФизЛица КАК Физлица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ГражданствоФизЛиц.ВидЗастрахованногоЛица,
	|	НЕ ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК ИмеетПравоНаСтрахование
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.Физлицо
	|				ИЗ
	|					ВТФизЛица КАК Организации)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК МесяцОтчетногоПериода,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|				И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ),
	|		Периоды.Физлицо) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	ВЫБОР
	|		КОГДА ВидыДеятельности.ТолькоДоходыФармацевтов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА ВидыДеятельности.ТолькоДоходыМоряков
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО (НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = ВидыДеятельности.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ПФРНакопительная,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС,
	|	ТарифСтраховыхВзносов.ТФОМС,
	|	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
	|	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&КонецОтчетногоПериода, ) КАК ТарифСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тарифы.ВидТарифа,
	|	ВЫБОР
	|		КОГДА Тарифы.СуммарныйТариф > ТарифДляИнвалидов.СуммарныйТариф
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыделятьДоходыИнвалидов
	|ПОМЕСТИТЬ ВТОписаниеТарифов
	|ИЗ
	|	ВТРазмерыТарифныхСтавок КАК Тарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК ТарифДляИнвалидов
	|		ПО (ТарифДляИнвалидов.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК МесяцОтчетногоПериода,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода В (&НестрахуемыеВидыДохода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ПустаяСсылка)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ГражданскоПравовой)
	|	КОНЕЦ КАК ТипДоговора
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоВидамТарифа
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.МесяцОтчетногоПериода
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.Физлицо
	|			ИЗ
	|				ВТФизЛица КАК ФизЛица)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.Физлицо КАК ФизЛицо,
	|	ТаблицаФизлиц.МесяцОтчетногоПериода,
	|	ТаблицаФизлиц.ТипДоговора,
	|	ЕСТЬNULL(СоответствиеТарифаПоДоходам.КатегорияЗастрахованныхЛиц, ЕСТЬNULL(СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц, ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ПустаяСсылка))) КАК КатегорияЗастрахованныхЛиц
	|ПОМЕСТИТЬ ВТКатегорииПоТарифам
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходахПоВидамТарифа КАК КатегорииПоДоходам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаПоДоходам
	|			ПО КатегорииПоДоходам.ВидТарифаСтраховыхВзносов = СоответствиеТарифаПоДоходам.ВидТарифаСтраховыхВзносов
	|				И (ГОД(КатегорииПоДоходам.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаПоДоходам.ГодС И СоответствиеТарифаПоДоходам.ГодПо)
	|		ПО ТаблицаФизлиц.Физлицо = КатегорииПоДоходам.ФизЛицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = КатегорииПоДоходам.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.ТипДоговора = КатегорииПоДоходам.ТипДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельностиПоФизлицам КАК ВидыДеятельностиПоФизлицам
	|		ПО ТаблицаФизлиц.Физлицо = ВидыДеятельностиПоФизлицам.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|			ПО ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (ВЫБОР
	|				КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|						И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				КОГДА ВидыДеятельностиПоФизлицам.ТолькоДоходыФармацевтов
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА ВидыДеятельностиПоФизлицам.ТолькоДоходыМоряков
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов)
	|			И (ГОД(ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеВидыДохода)
	|				ТОГДА СведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъектНестрахуемых,
	|	СУММА(СведенияОДоходах.РезультатОборот) КАК ВесьОбъект,
	|	СведенияОДоходах.Период КАК МесяцОтчетногоПериода,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТСоставДоходов
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.Физлицо
	|			ИЗ
	|				ВТФизЛица КАК ФизЛица)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.Физлицо КАК ФизЛицо,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ТипДоговора КАК ТипДоговора,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, КатегорииПоТарифам.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКатегорииПоТарифам КАК КатегорииПоТарифам
	|		ПО ТаблицаФизлиц.Физлицо = КатегорииПоТарифам.ФизЛицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = КатегорииПоТарифам.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.ТипДоговора = КатегорииПоТарифам.ТипДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = Гражданство.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (КатегорииПоТарифам.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И (ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = ПринятыеПоДолгосрочнымДоговорам.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоставДоходов КАК СоставДоходов
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = СоставДоходов.МесяцОтчетногоПериода
	|			И ТаблицаФизлиц.Физлицо = СоставДоходов.ФизЛицо
	|ГДЕ
	|	(ЕСТЬNULL(Гражданство.ИмеетПравоНаСтрахование, ИСТИНА)
	|			ИЛИ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ))
	|	И (ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) = 0
	|			ИЛИ ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) <> ЕСТЬNULL(СоставДоходов.ОбъектНестрахуемых, 0))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	ТипДоговора,
	|	КатегорияЗастрахованныхЛиц,
	|	ДатаНачалаПериода";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());

	РезультатЗапроса = Запрос.Выполнить();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции


Функция ДанныеОВзносахПоКатегориям2011(ДатаАктуальности, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, МассивФизлиц = Неопределено, КомментироватьРасчет = Ложь, ДанныеКомментирования = Неопределено) 
	
	Если КомментироватьРасчет Тогда // инициализируем данные комментария
		ДанныеКомментирования = Новый Структура("РаспределениеСУчетомПринятыхПФРДанных, РасчетКоэффициентовСтраховая, РасчетКоэффициентовНакопительная, ПрошлыеПериоды, Итоги, РасчетСотрудников, Переплаты", Ложь, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("ДатаЗаменыЕСН", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ОтчетныйПериод", ПервыйОтчетныйПериод);
	Запрос.УстановитьПараметр("ОтчетныйГод", Год(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("КонецПериодаУплаты", Мин(КонецДня(ДатаАктуальности), ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ДатаНовойРедакцииЗакона212", ПроведениеРасчетов.ДатаРасширенияПеречняЛьготныхТарифовСтраховыхВзносов());
	Запрос.УстановитьПараметр("МассивКатегорийИностранцев", ПроцедурыПерсонифицированногоУчета.МассивКатегорийЗЛИностранцев());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияПринятыеПФР.КомплектДокументов
	|ПОМЕСТИТЬ ВТПринятоВПФР
	|ИЗ
	|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
	|ГДЕ
	|	СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4вПФР.ПустаяСсылка)
	|	И СведенияПринятыеПФР.Организация = &Организация
	|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, КВАРТАЛ)
	|	КОНЕЦ КАК ОтчетныйПериод,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховая + ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВД
	|		КОНЕЦ) КАК ПФРСтраховаяОборот,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительная + ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВД
	|		КОНЕЦ) КАК ПФРНакопительнаяОборот,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВД
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСтраховаяЕНВДОборот,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < &ДатаНовойРедакцииЗакона212
	|				ТОГДА СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВД
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРНакопительнаяЕНВДОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленныеОбороты
	|ГДЕ
	|	СтраховыеВзносыИсчисленныеОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, КВАРТАЛ)
	|	КОНЕЦ,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.МесяцОтчетногоПериода КАК МесяцОтчетногоПериода,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И Периоды.ФизЛицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.ФизЛицо,
	|		Периоды.МесяцОтчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	СрезПоследнихДат.МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.МесяцОтчетногоПериода,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.МесяцОтчетногоПериода КАК МесяцОтчетногоПериода,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.МесяцОтчетногоПериода,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Периоды.МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоЗЛ.ФизЛицо КАК ФизЛицо,
	|	ИсчисленоПоЗЛ.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
	|	ИсчисленоПоЗЛ.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|	ИсчисленоПоЗЛ.ОтчетныйПериод КАК ОтчетныйПериод,
	|	НАЧАЛОПЕРИОДА(ИсчисленоПоЗЛ.ОтчетныйПериод, ГОД) КАК ГодОтчетногоПериода,
	|	ВЫБОР
	|		КОГДА Инвалиды.Физлицо ЕСТЬ НЕ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛпоВидамТарифа
	|ИЗ
	|	ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ИсчисленоПоЗЛ.ФизЛицо = Инвалиды.Физлицо
	|			И ИсчисленоПоЗЛ.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|		ПО ИсчисленоПоЗЛ.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсчисленоПоЗЛ.ФизЛицо,
	|	ИсчисленоПоЗЛ.ПФРНакопительнаяЕНВДОборот,
	|	ИсчисленоПоЗЛ.ПФРСтраховаяЕНВДОборот,
	|	ИсчисленоПоЗЛ.ОтчетныйПериод,
	|	НАЧАЛОПЕРИОДА(ИсчисленоПоЗЛ.ОтчетныйПериод, ГОД),
	|	ВЫБОР
	|		КОГДА Инвалиды.Физлицо ЕСТЬ НЕ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|	КОНЕЦ
	|ИЗ
	|	ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ИсчисленоПоЗЛ.ФизЛицо = Инвалиды.Физлицо
	|			И ИсчисленоПоЗЛ.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоЗЛ.ФизЛицо,
	|	СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц,
	|	СУММА(ИсчисленоПоЗЛ.ПФРСтраховаяОборот) КАК ПФРСтраховая,
	|	СУММА(ИсчисленоПоЗЛ.ПФРНакопительнаяОборот) КАК ПФРНакопительная
	|ПОМЕСТИТЬ ВТНачисленоЗаОтчетныйПериодФормирования
	|ИЗ
	|	ВТИсчисленоПоЗЛпоВидамТарифа КАК ИсчисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (&ОтчетныйГод МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|			И ИсчисленоПоЗЛ.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц,
	|	ИсчисленоПоЗЛ.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяОборот + РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяЕНВДОборот) КАК ПФРСтраховаяПриход,
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяОборот + РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяЕНВДОборот) КАК ПФРНакопительнаяПриход
	|ПОМЕСТИТЬ ВТВсегоНачислено
	|ИЗ
	|	ВТИсчисленоПоЗЛ КАК РасчетыПоСтраховымВзносамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяРасход КАК ПФРСтраховаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяРасход КАК ПФРНакопительнаяРасход,
	|	""Уплата"" КАК ВидСтроки
	|ПОМЕСТИТЬ ВТВсегоУплачено
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			&ОтчетныйПериод,
	|			&КонецПериодаУплаты,
	|			,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И МесяцРасчетногоПериода >= &ДатаЗаменыЕСН
	|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОстатки.ПФРСтраховаяОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -РасчетыПоСтраховымВзносамОстатки.ПФРСтраховаяОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОстатки.ПФРНакопительнаяОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -РасчетыПоСтраховымВзносамОстатки.ПФРНакопительнаяОстаток
	|	КОНЕЦ,
	|	""Переплата""
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|			&ОтчетныйПериод,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И МесяцРасчетногоПериода >= &ДатаЗаменыЕСН
	|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод)
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод
	|ПОМЕСТИТЬ ВТПринятоУплаты
	|ИЗ
	|	ВТПринятоВПФР КАК ПринятоВПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
	|		ПО ПринятоВПФР.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятоУплаты.ОтчетныйПериод КАК ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КорректируемыйПериод)
	|			ТОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц,
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ПОМЕСТИТЬ ВТДокументыКорректировки
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияПринятыеПФР КАК Корректировки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ПО Корректировки.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ПО ПринятоУплаты.ОтчетныйПериод < Корректировки.ОтчетныйПериодПерсучетаПФР
	|			И (&ОтчетныйПериод > Корректировки.ОтчетныйПериодПерсучетаПФР)
	|			И (Корректировки.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ В (ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ), ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОписаниеДокумента.ОтчетныйПериод,
	|	ОписаниеДокумента.ФизЛицо,
	|	ОписаниеДокумента.КатегорияЗастрахованныхЛиц,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая
	|	КОНЕЦ КАК УплаченоСтраховая,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная
	|	КОНЕЦ КАК УплаченоНакопительная,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая
	|	КОНЕЦ КАК НачисленоСтраховая,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная
	|	КОНЕЦ КАК НачисленоНакопительная
	|ПОМЕСТИТЬ ВТКорректировкиПринятыеПФР
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПринятоУплаты.ОтчетныйПериод КАК ОтчетныйПериод,
	|		ПринятоУплаты.ФизЛицо КАК ФизЛицо,
	|		МАКСИМУМ(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод) КАК ОтчетныйПериодКорректировки,
	|		ПринятоУплаты.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц
	|	ИЗ
	|		ВТПринятоУплаты КАК ПринятоУплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыКорректировки КАК Корректировки
	|			ПО ПринятоУплаты.ОтчетныйПериод = Корректировки.ОтчетныйПериод
	|				И ПринятоУплаты.КатегорияЗастрахованныхЛиц = Корректировки.КатегорияЗастрахованныхЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПринятоУплаты.ОтчетныйПериод = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|				И ПринятоУплаты.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|				И (Корректировки.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка)
	|	ГДЕ
	|		СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо ЕСТЬ НЕ NULL 
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПринятоУплаты.ОтчетныйПериод,
	|		ПринятоУплаты.ФизЛицо,
	|		ПринятоУплаты.КатегорияЗастрахованныхЛиц) КАК ОписаниеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыКорректировки КАК Корректировки
	|		ПО ОписаниеДокумента.ОтчетныйПериод = Корректировки.ОтчетныйПериод
	|			И ОписаниеДокумента.КатегорияЗастрахованныхЛиц = Корректировки.КатегорияЗастрахованныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|		ПО ОписаниеДокумента.ОтчетныйПериод = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|			И ОписаниеДокумента.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|			И ОписаниеДокумента.ОтчетныйПериодКорректировки = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод
	|			И (Корректировки.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПринятоУплаты.ФизЛицо,
	|	ПринятоУплаты.КатегорияЗастрахованныхЛиц,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.УплаченоНакопительная, ПринятоУплаты.УплаченоНакопительная)) КАК УплаченоНакопительная,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.УплаченоСтраховая, ПринятоУплаты.УплаченоСтраховая)) КАК УплаченоСтраховая,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.НачисленоНакопительная, ПринятоУплаты.НачисленоНакопительная)) КАК НачисленоНакопительная,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.НачисленоСтраховая, ПринятоУплаты.НачисленоСтраховая)) КАК НачисленоСтраховая
	|ПОМЕСТИТЬ ВТУплатыПринятыеПФР
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКорректировкиПринятыеПФР КАК КорректировкиПринятыеПФР
	|		ПО ПринятоУплаты.ФизЛицо = КорректировкиПринятыеПФР.ФизЛицо
	|			И ПринятоУплаты.ОтчетныйПериод = КорректировкиПринятыеПФР.ОтчетныйПериод
	|			И ПринятоУплаты.КатегорияЗастрахованныхЛиц = КорректировкиПринятыеПФР.КатегорияЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятоУплаты.ФизЛицо,
	|	ПринятоУплаты.КатегорияЗастрахованныхЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаСПереплатой
	|ИЗ
	|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
	|
	|СГРУППИРОВАТЬ ПО
	|	УплатыПринятыеПФР.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	(СУММА(УплатыПринятыеПФР.НачисленоНакопительная) < СУММА(УплатыПринятыеПФР.УплаченоНакопительная)
	|		ИЛИ СУММА(УплатыПринятыеПФР.НачисленоСтраховая) < СУММА(УплатыПринятыеПФР.УплаченоСтраховая))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо,
	|	УплатыПринятыеПФР.КатегорияЗастрахованныхЛиц,
	|	УплатыПринятыеПФР.НачисленоНакопительная - УплатыПринятыеПФР.УплаченоНакопительная КАК Накопительная,
	|	УплатыПринятыеПФР.НачисленоСтраховая - УплатыПринятыеПФР.УплаченоСтраховая КАК Страховая
	|ПОМЕСТИТЬ ВТНедоуплаченоЗаПрошлыеПериоды
	|ИЗ
	|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
	|ГДЕ
	|	(НЕ УплатыПринятыеПФР.ФизЛицо В
	|				(ВЫБРАТЬ
	|					ФизЛица.ФизЛицо
	|				ИЗ
	|					ВТФизлицаСПереплатой КАК ФизЛица))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) КАК Накопительная,
	|	ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) КАК Страховая,
	|	ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) КАК ПФРСтраховаяПриход,
	|	ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) КАК ПФРНакопительнаяПриход,
	|	ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) КАК ПФРСтраховаяРасход,
	|	ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) КАК ПФРНакопительнаяРасход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) > ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ((ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0)) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентТекущегоПериодаСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) > ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ((ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0)) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентТекущегоПериодаНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) < ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентПрошлыхПериодовСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) < ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентПрошлыхПериодовНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0)
	|	КОНЕЦ КАК УчтеноУплатыСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0)
	|	КОНЕЦ КАК УчтеноУплатыНакопительная
	|ПОМЕСТИТЬ ВТКоэффициентыУплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК Поле) КАК СтрокаЗапроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоНачислено КАК ВсегоНачислено
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВсегоУплачено.ПФРСтраховаяРасход) КАК ПФРСтраховаяРасход,
	|			СУММА(ВсегоУплачено.ПФРНакопительнаяРасход) КАК ПФРНакопительнаяРасход
	|		ИЗ
	|			ВТВсегоУплачено КАК ВсегоУплачено) КАК ВсегоУплачено
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(НедоуплаченоЗаПрошлыеПериоды.Накопительная) КАК Накопительная,
	|			СУММА(НедоуплаченоЗаПрошлыеПериоды.Страховая) КАК Страховая
	|		ИЗ
	|			ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды) КАК ПрошлыеПериоды
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо,
	|	МАКСИМУМ(Начислено.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц
	|ПОМЕСТИТЬ ВТКатегорииНачисленийТекущегоПериода
	|ИЗ
	|	ВТНачисленоЗаОтчетныйПериодФормирования КАК Начислено
	|ГДЕ
	|	(Начислено.ПФРНакопительная <> 0
	|			ИЛИ Начислено.ПФРСтраховая <> 0)
	|	И НЕ Начислено.КатегорияЗастрахованныхЛиц В (&МассивКатегорийИностранцев)
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НедоуплаченоЗаПрошлыеПериоды.ФизЛицо КАК ФизЛицо,
	|	ЕСТЬNULL(КатегорииНачисленийТекущегоПериода.КатегорияЗастрахованныхЛиц, НедоуплаченоЗаПрошлыеПериоды.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|	НедоуплаченоЗаПрошлыеПериоды.Накопительная * КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная / 100000 КАК УплаченоНакопительная,
	|	НедоуплаченоЗаПрошлыеПериоды.Страховая * КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая / 100000 КАК УплаченоСтраховая,
	|	0 КАК НачисленоСтраховая,
	|	0 КАК НачисленоНакопительная,
	|	""Прошлые периоды"" КАК ВидСтроки
	|ПОМЕСТИТЬ ВТРасчетСумм
	|ИЗ
	|	ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКатегорииНачисленийТекущегоПериода КАК КатегорииНачисленийТекущегоПериода
	|		ПО НедоуплаченоЗаПрошлыеПериоды.ФизЛицо = КатегорииНачисленийТекущегоПериода.ФизЛицо
	|ГДЕ
	|	(НедоуплаченоЗаПрошлыеПериоды.Накопительная <> 0
	|			ИЛИ НедоуплаченоЗаПрошлыеПериоды.Страховая <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленоПоЗЛ.ФизЛицо,
	|	НачисленоПоЗЛ.КатегорияЗастрахованныхЛиц,
	|	НачисленоПоЗЛ.ПФРНакопительная * КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная / 100000,
	|	НачисленоПоЗЛ.ПФРСтраховая * КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая / 100000,
	|	НачисленоПоЗЛ.ПФРСтраховая,
	|	НачисленоПоЗЛ.ПФРНакопительная,
	|	""Текущий период""
	|ИЗ
	|	ВТНачисленоЗаОтчетныйПериодФормирования КАК НачисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	(НачисленоПоЗЛ.ПФРНакопительная <> 0
	|			ИЛИ НачисленоПоЗЛ.ПФРСтраховая <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Уплачено.УчтеноУплатыСтраховая КАК Страховая,
	|	Уплачено.УчтеноУплатыНакопительная КАК Накопительная
	|ИЗ
	|	ВТКоэффициентыУплаты КАК Уплачено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоСтраховая КАК ЧИСЛО(15, 2))), 0) КАК Страховая,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоНакопительная КАК ЧИСЛО(15, 2))), 0) КАК Накопительная
	|ИЗ
	|	ВТРасчетСумм КАК РасчетныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
	|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	СУММА(РасчетныеДанные.УплаченоНакопительная) КАК УплаченоНакопительная,
	|	СУММА(РасчетныеДанные.УплаченоСтраховая) КАК УплаченоСтраховая,
	|	СУММА(РасчетныеДанные.НачисленоСтраховая) КАК НачисленоСтраховая,
	|	СУММА(РасчетныеДанные.НачисленоНакопительная) КАК НачисленоНакопительная
	|ИЗ
	|	ВТРасчетСумм КАК РасчетныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетныеДанные.ФизЛицо,
	|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
	|
	|ИМЕЮЩИЕ
	|	(СУММА(РасчетныеДанные.УплаченоНакопительная) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.УплаченоСтраховая) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.НачисленоСтраховая) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.НачисленоНакопительная) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	Результаты = Запрос.ВыполнитьПакет();
	ВсегоЗапросов = Результаты.Количество();
	РезультатЗапроса = Результаты[ВсегоЗапросов - 1].Выгрузить();
	Распределено = Результаты[ВсегоЗапросов - 2].Выбрать();
	Распределено.Следующий();
	Зарегистрировано = Результаты[ВсегоЗапросов - 3].Выбрать();
	Зарегистрировано.Следующий();
	
	Если Зарегистрировано.Страховая <> Распределено.Страховая Или Зарегистрировано.Накопительная <> Распределено.Накопительная Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(РасчетныеДанные.УплаченоНакопительная) КАК УплаченоНакопительная,
		|	СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоНакопительная КАК ЧИСЛО(15, 2))) КАК Итог
		|ИЗ
		|	ВТРасчетСумм КАК РасчетныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетныеДанные.ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетныеДанные.УплаченоНакопительная) <> 0 Или
		|	СУММА(РасчетныеДанные.НачисленоНакопительная) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(РасчетныеДанные.УплаченоСтраховая) КАК УплаченоСтраховая,
		|	СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоСтраховая КАК ЧИСЛО(15, 2))) КАК Итог
		|ИЗ
		|	ВТРасчетСумм КАК РасчетныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетныеДанные.ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетныеДанные.УплаченоСтраховая) <> 0 Или
		|	СУММА(РасчетныеДанные.НачисленоСтраховая) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо";
		
		Результаты = Запрос.ВыполнитьПакет();
		ВсегоЗапросов = Результаты.Количество();
		СтруктураПоиска = Новый Структура("ФизЛицо,КатегорияЗастрахованныхЛиц"); 
		Если Зарегистрировано.Страховая <> Распределено.Страховая Тогда
			Расхождение = Зарегистрировано.Страховая - Распределено.Страховая;
			ВременнаяТаблица = Результаты[ВсегоЗапросов - 1].Выгрузить();
			ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"УплаченоСтраховая", ВременнаяТаблица.Итог("Итог") + Расхождение, 2, "ФизЛицо,КатегорияЗастрахованныхЛиц");
			Для каждого СтрокаТЧ Из ВременнаяТаблица Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
				РезультатЗапроса.НайтиСтроки(СтруктураПоиска)[0].УплаченоСтраховая = СтрокаТЧ.УплаченоСтраховая;
			КонецЦикла;
		КонецЕсли;
		Если Зарегистрировано.Накопительная <> Распределено.Накопительная Тогда
			Расхождение = Зарегистрировано.Накопительная - Распределено.Накопительная;
			ВременнаяТаблица = Результаты[ВсегоЗапросов - 2].Выгрузить();
			ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"УплаченоНакопительная", ВременнаяТаблица.Итог("Итог") + Расхождение, 2, "ФизЛицо,КатегорияЗастрахованныхЛиц");
			Для каждого СтрокаТЧ Из ВременнаяТаблица Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
				РезультатЗапроса.НайтиСтроки(СтруктураПоиска)[0].УплаченоНакопительная = СтрокаТЧ.УплаченоНакопительная;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из РезультатЗапроса Цикл
		СтрокаТЧ.УплаченоСтраховая = Окр(СтрокаТЧ.УплаченоСтраховая, 2);
		СтрокаТЧ.УплаченоНакопительная = Окр(СтрокаТЧ.УплаченоНакопительная, 2);
	КонецЦикла;
	
	Если МассивФизлиц <> Неопределено Тогда
		Запрос.УстановитьПараметр("РезультатЗапроса", РезультатЗапроса);
		Запрос.УстановитьПараметр("МассивФизлиц", МассивФизлиц);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетСумм.ФизЛицо КАК ФизЛицо,
		|	РасчетСумм.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	РасчетСумм.УплаченоНакопительная,
		|	РасчетСумм.УплаченоСтраховая,
		|	РасчетСумм.НачисленоСтраховая,
		|	РасчетСумм.НачисленоНакопительная
		|ПОМЕСТИТЬ ВТРезультатЗапроса
		|ИЗ
		|	&РезультатЗапроса КАК РасчетСумм
		|ГДЕ
		|	РасчетСумм.ФизЛицо В(&МассивФизлиц)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатЗапроса.ФизЛицо КАК ФизЛицо,
		|	РезультатЗапроса.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	РезультатЗапроса.УплаченоНакопительная,
		|	РезультатЗапроса.УплаченоСтраховая,
		|	РезультатЗапроса.НачисленоСтраховая,
		|	РезультатЗапроса.НачисленоНакопительная
		|ИЗ
		|	ВТРезультатЗапроса КАК РезультатЗапроса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	КатегорияЗастрахованныхЛиц";
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если КомментироватьРасчет Тогда
		Запрос.УстановитьПараметр("РезультатЗапроса", РезультатЗапроса);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетСумм.ФизЛицо,
		|	РасчетСумм.КатегорияЗастрахованныхЛиц,
		|	РасчетСумм.УплаченоНакопительная,
		|	РасчетСумм.УплаченоСтраховая,
		|	РасчетСумм.НачисленоСтраховая,
		|	РасчетСумм.НачисленоНакопительная
		|ПОМЕСТИТЬ ВТРасчетСуммСПодгонкой
		|ИЗ
		|	&РезультатЗапроса КАК РасчетСумм";
		Запрос.Выполнить();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоэффициентыУплаты.Накопительная,
		|	КоэффициентыУплаты.Страховая,
		|	КоэффициентыУплаты.ПФРСтраховаяПриход,
		|	КоэффициентыУплаты.ПФРНакопительнаяПриход,
		|	КоэффициентыУплаты.ПФРСтраховаяРасход КАК ВсегоУплаченоСтраховая,
		|	КоэффициентыУплаты.ПФРНакопительнаяРасход КАК ВсегоУплаченоНакопительная,
		|	ЕСТЬNULL(Уплата.ПФРСтраховаяРасход, 0) КАК ЗачтенаПереплатаСтраховая,
		|	ЕСТЬNULL(Уплата.ПФРНакопительнаяРасход, 0) КАК ЗачтенаПереплатаНакопительная,
		|	КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая,
		|	КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная,
		|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая,
		|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|ИЗ
		|	ВТКоэффициентыУплаты КАК КоэффициентыУплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВсегоУплачено.ПФРСтраховаяРасход) КАК ПФРСтраховаяРасход,
		|			СУММА(ВсегоУплачено.ПФРНакопительнаяРасход) КАК ПФРНакопительнаяРасход
		|		ИЗ
		|			ВТВсегоУплачено КАК ВсегоУплачено
		|		ГДЕ
		|			ВсегоУплачено.ВидСтроки = ""Переплата"") КАК Уплата
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НедоуплаченоЗаПрошлыеПериоды.ФизЛицо.Наименование КАК ФИО,
		|	НедоуплаченоЗаПрошлыеПериоды.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	НедоуплаченоЗаПрошлыеПериоды.Накопительная,
		|	НедоуплаченоЗаПрошлыеПериоды.Страховая
		|ИЗ
		|	ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды
		|ГДЕ
		|	(НедоуплаченоЗаПрошлыеПериоды.Накопительная > 0
		|			ИЛИ НедоуплаченоЗаПрошлыеПериоды.Страховая > 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	КатегорияЗастрахованныхЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСПодгонкой.ВидСтроки КАК Период,
		|	ДанныеСПодгонкой.ФизЛицо КАК ФизЛицо,
		|	ДанныеСПодгонкой.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(ДанныеСПодгонкой.УплаченоНакопительная) КАК УплаченоНакопительная,
		|	СУММА(ДанныеСПодгонкой.УплаченоСтраховая) КАК УплаченоСтраховая,
		|	СУММА(ДанныеСПодгонкой.НачисленоСтраховая) КАК НачисленоСтраховая,
		|	СУММА(ДанныеСПодгонкой.НачисленоНакопительная) КАК НачисленоНакопительная,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая
		|	КОНЕЦ КАК КоэффициентУплатыСтраховая,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|	КОНЕЦ КАК КоэффициентУплатыНакопительная
		|ИЗ
		|	(ВЫБРАТЬ
		|		""Текущий период"" КАК ВидСтроки,
		|		РасчетСумм.ФизЛицо КАК ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|		-РасчетСумм.УплаченоНакопительная КАК УплаченоНакопительная,
		|		-РасчетСумм.УплаченоСтраховая КАК УплаченоСтраховая,
		|		-РасчетСумм.НачисленоСтраховая КАК НачисленоСтраховая,
		|		-РасчетСумм.НачисленоНакопительная КАК НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСумм КАК РасчетСумм
		|	ГДЕ
		|		РасчетСумм.ВидСтроки = ""Прошлые периоды""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""Текущий период"",
		|		РасчетСумм.ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц,
		|		РасчетСумм.УплаченоНакопительная,
		|		РасчетСумм.УплаченоСтраховая,
		|		РасчетСумм.НачисленоСтраховая,
		|		РасчетСумм.НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСуммСПодгонкой КАК РасчетСумм
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетСумм.ВидСтроки,
		|		РасчетСумм.ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц,
		|		РасчетСумм.УплаченоНакопительная,
		|		РасчетСумм.УплаченоСтраховая,
		|		РасчетСумм.НачисленоСтраховая,
		|		РасчетСумм.НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСумм КАК РасчетСумм
		|	ГДЕ
		|		РасчетСумм.ВидСтроки = ""Прошлые периоды"") КАК ДанныеСПодгонкой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеСПодгонкой.ВидСтроки,
		|	ДанныеСПодгонкой.ФизЛицо,
		|	ДанныеСПодгонкой.КатегорияЗастрахованныхЛиц,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорияЗастрахованныхЛиц,
		|	ФизЛицо,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УплатыПринятыеПФР.ФизЛицо.Наименование КАК ФИО,
		|	УплатыПринятыеПФР.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	ВЫБОР
		|		КОГДА УплатыПринятыеПФР.УплаченоНакопительная > УплатыПринятыеПФР.НачисленоНакопительная
		|			ТОГДА УплатыПринятыеПФР.УплаченоНакопительная - УплатыПринятыеПФР.НачисленоНакопительная
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Накопительная,
		|	ВЫБОР
		|		КОГДА УплатыПринятыеПФР.УплаченоСтраховая > УплатыПринятыеПФР.НачисленоСтраховая
		|			ТОГДА УплатыПринятыеПФР.УплаченоСтраховая - УплатыПринятыеПФР.НачисленоСтраховая
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Страховая
		|ИЗ
		|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
		|ГДЕ
		|	УплатыПринятыеПФР.ФизЛицо В
		|			(ВЫБРАТЬ
		|				ФизЛица.ФизЛицо
		|			ИЗ
		|				ВТФизлицаСПереплатой КАК ФизЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	КатегорияЗастрахованныхЛиц";
		
		РезультатыДляКомментирования = Запрос.ВыполнитьПакет();
		ТЗИтоги = РезультатыДляКомментирования[0].Выгрузить();
		ТЗПрошлыеПериоды = РезультатыДляКомментирования[1].Выгрузить();
		ТЗПрошлыеПериоды.Колонки.КатегорияЗастрахованныхЛиц.Заголовок = "Категория ЗЛ";
		ТЗСотрудников = РезультатыДляКомментирования[2].Выгрузить();
		ТЗСотрудников.Колонки.НачисленоСтраховая.Заголовок = "Начислено";
		ТЗСотрудников.Колонки.КоэффициентУплатыСтраховая.Заголовок = "Коэффициент уплаты";
		ТЗСотрудников.Колонки.УплаченоСтраховая.Заголовок = "Уплачено";
		ТЗСотрудников.Колонки.НачисленоНакопительная.Заголовок = "Начислено";
		ТЗСотрудников.Колонки.КоэффициентУплатыНакопительная.Заголовок = "Коэффициент уплаты";
		ТЗСотрудников.Колонки.УплаченоНакопительная.Заголовок = "Уплачено";
		Для каждого СтрокаТЗ Из ТЗСотрудников Цикл
		    СтрокаТЗ.КоэффициентУплатыСтраховая = Формат(СтрокаТЗ.КоэффициентУплатыСтраховая / 100000,"ЧДЦ=10; ЧН=-");
		    СтрокаТЗ.КоэффициентУплатыНакопительная = Формат(СтрокаТЗ.КоэффициентУплатыНакопительная / 100000,"ЧДЦ=10; ЧН=-");
		КонецЦикла;
		ТЗПереплаты = РезультатыДляКомментирования[3].Выгрузить();
		ТЗПереплаты.Колонки.КатегорияЗастрахованныхЛиц.Заголовок = "Категория ЗЛ";
		
		ДанныеКомментирования.РаспределениеСУчетомПринятыхПФРДанных = Истина;
		ДанныеКомментирования.Итоги = ТЗИтоги;
		ДанныеКомментирования.ПрошлыеПериоды = ТЗПрошлыеПериоды;
		ДанныеКомментирования.РасчетСотрудников = ТЗСотрудников;
		ДанныеКомментирования.Переплаты = ТЗПереплаты;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса;
	
КонецФункции 

Функция ДанныеОВзносахПоКатегориям2012(ДатаАктуальности, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, МассивФизлиц = Неопределено, КомментироватьРасчет = Ложь, ДанныеКомментирования = Неопределено) 
	
	Если ПоследнийОтчетныйПериод < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда
		Возврат ДанныеОВзносахПоКатегориям2011(ДатаАктуальности, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, МассивФизлиц, КомментироватьРасчет, ДанныеКомментирования);
	КонецЕсли;
	
	Если КомментироватьРасчет Тогда // инициализируем данные комментария
		ДанныеКомментирования = Новый Структура("РаспределениеСУчетомПринятыхПФРДанных, РасчетКоэффициентовСтраховая, РасчетКоэффициентовНакопительная, ПрошлыеПериоды, Итоги, РасчетСотрудников, Переплаты", Ложь, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("ДатаЗаменыЕСН", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ОтчетныйПериод", ПервыйОтчетныйПериод);
	Запрос.УстановитьПараметр("НачалоОтчетногоГода", НачалоГода(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("ОтчетныйГод", Год(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("КонецПериодаУплаты", Мин(КонецДня(ДатаАктуальности), ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("МассивКатегорийИностранцев", ПроцедурыПерсонифицированногоУчета.МассивКатегорийЗЛИностранцев());
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПервыйОтчетныйПериод));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТДатыПериода";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод)) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияПринятыеПФР.КомплектДокументов
	|ПОМЕСТИТЬ ВТПринятоВПФР
	|ИЗ
	|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
	|ГДЕ
	|	СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4вПФР.ПустаяСсылка)
	|	И СведенияПринятыеПФР.Организация = &Организация
	|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаСДоходами
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			,
	|			,
	|			МЕСЯЦ,
	|			Организация = &ГоловнаяОрганизация
	|				И (ДатаПолученияДохода МЕЖДУ &НачалоОтчетногоГода И &КонецОтчетногоПериода)
	|				И ОбособленноеПодразделение = &Организация
	|				И НЕ ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Результат) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Скидка) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходахОбороты
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходахОбороты.Организация = &ГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода МЕЖДУ &НачалоОтчетногоГода И &КонецОтчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.ФизЛицо
	|			ИЗ
	|				ВТФизлицаСДоходами КАК ФизЛица)
	|	И НЕ СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, КВАРТАЛ) КАК ОтчетныйПериод,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховая + СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВД) КАК ПФРСтраховаяОборот,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительная + СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВД) КАК ПФРНакопительнаяОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленныеОбороты
	|ГДЕ
	|	СтраховыеВзносыИсчисленныеОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, КВАРТАЛ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Даты.Период,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ
	|	ВТДатыПериода КАК Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.Период,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.МесяцОтчетногоПериода,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И Периоды.ФизЛицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	СрезПоследнихДат.МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	ВЫБОР
	|		КОГДА ВидыДеятельности.ТолькоДоходыФармацевтов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА ВидыДеятельности.ТолькоДоходыМоряков
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Периоды.Период = ВидыДеятельности.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаСтрахование,
	|	ГражданствоФизЛиц.ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И Периоды.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК ПериодРегистрации,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И Периоды.ФизЛицо = ВременноПребывающие.ФизЛицо
	|				И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		Периоды.ФизЛицо) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ПФРНакопительная,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС,
	|	ТарифСтраховыхВзносов.ТФОМС,
	|	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
	|	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&КонецОтчетногоПериода, ) КАК ТарифСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тарифы.ВидТарифа,
	|	ВЫБОР
	|		КОГДА Тарифы.СуммарныйТариф > ТарифДляИнвалидов.СуммарныйТариф
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыделятьДоходыИнвалидов
	|ПОМЕСТИТЬ ВТОписаниеТарифов
	|ИЗ
	|	ВТРазмерыТарифныхСтавок КАК Тарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК ТарифДляИнвалидов
	|		ПО (ТарифДляИнвалидов.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот,
	|	СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоВидамТарифа
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.МесяцОтчетногоПериода
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерПФР, 0) КАК Размер,
	|	ДатыПоследнихДвижений.ПериодРегистрации КАК Период
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПредельнаяВеличинаБазыСтраховыхВзносов.Период) КАК Период,
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|			ПО Периоды.Период >= ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|		ПО ДатыПоследнихДвижений.Период = ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|					И СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|			ПО СведенияОДоходах.Период = Гражданство.Период
	|				И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|			ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|				И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|			И Периоды.ФизЛицо = СведенияОДоходах.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО ОблагаемаяБаза.Период = Предел.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СведенияОДоходах.Период = Гражданство.Период
	|			И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|			И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|	ИЗ
	|		ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел * БазаЗаМесяцПоОбособленным.ЗаМесяц / ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|ГДЕ
	|	Превышение.ОбособленноеПодразделение = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения) КАК ГодРождения,
	|	Гражданство.ВидЗастрахованногоЛица,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаПФР,
	|	МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим))
	|			ТОГДА 0
	|		КОГДА СУММА(ВЫБОР
	|					КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|						ТОГДА 0
	|					КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|							И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|						ТОГДА 0
	|					КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|						ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) / 10 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ИсчисленоПФРССуммПревышения
	|ПОМЕСТИТЬ ВТДоходыВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПревышениеДоходаПФР.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения),
	|	Гражданство.ВидЗастрахованногоЛица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Месяцы.ФизЛицо,
	|	Месяцы.ПериодРегистрации,
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПериодыОдногоТарифа
	|ИЗ
	|	(ВЫБРАТЬ
	|		БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|		БазаДляОтчета.Период КАК ПериодРегистрации
	|	ИЗ
	|		ВТДоходыВзносов КАК БазаДляОтчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БазаДляОтчета.Период,
	|		БазаДляОтчета.ФизЛицо
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) = 1) КАК Месяцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО Месяцы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И Месяцы.ПериодРегистрации = БазаДляОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|	БазаДляОтчета.Период КАК ПериодРегистрации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТМесяцыОсобыхТарифов
	|ИЗ
	|	ВТДоходыВзносов КАК БазаДляОтчета
	|ГДЕ
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаДляОтчета.ФизЛицо,
	|	БазаДляОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ПериодРегистрации,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
	|			КОГДА БазаДляОтчета.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ)) КАК ПФРСтраховаяЗаПериод,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаПФР * ВЫБОР
	|			КОГДА БазаДляОтчета.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ) КАК ПФРНакопительнаяЗаПериод,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТПериодыДляРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТМесяцыОсобыхТарифов КАК ОсобыеТарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
	|		ПО ОсобыеТарифы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ОсобыеТарифы.ПериодРегистрации = БазаДляОтчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсобыеТарифы.ПериодРегистрации,
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации,
	|	ТарифыПоДоходам.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
	|				КОГДА БазаДляОтчета.ГодРождения < 1967
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|					ТОГДА 0
	|				ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|			КОНЕЦ) / ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод
	|	КОНЕЦ КАК КоэффициентПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРНакопительнаяЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаПФР * ВЫБОР
	|				КОГДА БазаДляОтчета.ГодРождения < 1967
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|					ТОГДА 0
	|				ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|			КОНЕЦ / ПериодыДляРаспределенияВзносовПоТарифам.ПФРНакопительнаяЗаПериод
	|	КОНЕЦ КАК КоэффициентПФРНакопительная
	|ПОМЕСТИТЬ ВТКоэффициентыРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТПериодыДляРаспределенияВзносовПоТарифам КАК ПериодыДляРаспределенияВзносовПоТарифам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|		ПО (РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = БазаДляОтчета.Период
	|			И (БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ТарифыПоДоходам
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = ТарифыПоДоходам.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = ТарифыПоДоходам.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчетаВзносов.МесяцОтчетногоПериода,
	|	НАЧАЛОПЕРИОДА(ДанныеУчетаВзносов.ОтчетныйПериод, ГОД) КАК ГодОтчетногоПериода,
	|	ДанныеУчетаВзносов.ОтчетныйПериод,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРСтраховаяОборот КАК ЧИСЛО(15, 2))) КАК ПФРСтраховаяОборот,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРНакопительная
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРНакопительная
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРНакопительнаяОборот КАК ЧИСЛО(15, 2))) КАК ПФРНакопительнаяОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛпоВидамТарифа
	|ИЗ
	|	ВТИсчисленоПоЗЛ КАК ДанныеУчетаВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|		ПО ДанныеУчетаВзносов.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ДанныеУчетаВзносов.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|			И ДанныеУчетаВзносов.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыОдногоТарифа КАК ПериодыОдногоТарифа
	|		ПО ДанныеУчетаВзносов.ФизЛицо = ПериодыОдногоТарифа.ФизЛицо
	|			И ДанныеУчетаВзносов.МесяцОтчетногоПериода = ПериодыОдногоТарифа.ПериодРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыРаспределенияВзносовПоТарифам КАК КоэффициентыРаспределенияВзносовПоТарифам
	|		ПО ДанныеУчетаВзносов.ФизЛицо = КоэффициентыРаспределенияВзносовПоТарифам.ФизЛицо
	|			И ДанныеУчетаВзносов.МесяцОтчетногоПериода = КоэффициентыРаспределенияВзносовПоТарифам.ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ДанныеУчетаВзносов.МесяцОтчетногоПериода,
	|	ДанныеУчетаВзносов.ОтчетныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоЗЛ.ФизЛицо,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыВзносов.ОблагаемаяБазаПФР = ДоходыВзносов.СуммаПревысившаяПредел
	|					И ДоходыВзносов.СуммаПревысившаяПредел <> 0
	|				ТОГДА 0
	|			ИНАЧЕ ИсчисленоПоЗЛ.ПФРСтраховаяОборот - ЕСТЬNULL(ДоходыВзносов.ИсчисленоПФРССуммПревышения, 0)
	|		КОНЕЦ) КАК ПФРСтраховая,
	|	СУММА(ИсчисленоПоЗЛ.ПФРНакопительнаяОборот) КАК ПФРНакопительная
	|ПОМЕСТИТЬ ВТНачисленоЗаОтчетныйПериодФормирования
	|ИЗ
	|	ВТИсчисленоПоЗЛпоВидамТарифа КАК ИсчисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ДоходыВзносов
	|		ПО ИсчисленоПоЗЛ.ФизЛицо = ДоходыВзносов.ФизЛицо
	|			И ИсчисленоПоЗЛ.МесяцОтчетногоПериода = ДоходыВзносов.Период
	|			И ИсчисленоПоЗЛ.ВидТарифаСтраховыхВзносов = ДоходыВзносов.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (ГОД(ИсчисленоПоЗЛ.ГодОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|			И ИсчисленоПоЗЛ.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО ИсчисленоПоЗЛ.МесяцОтчетногоПериода = Гражданство.Период
	|			И ИсчисленоПоЗЛ.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И (ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц),
	|	ИсчисленоПоЗЛ.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяОборот) КАК ПФРСтраховаяПриход,
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяОборот) КАК ПФРНакопительнаяПриход
	|ПОМЕСТИТЬ ВТВсегоНачислено
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|		РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК РасчетыПоСтраховымВзносамОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ДоходыВзносов.ОблагаемаяБазаПФР = ДоходыВзносов.СуммаПревысившаяПредел
	|					И ДоходыВзносов.СуммаПревысившаяПредел <> 0
	|				ТОГДА -ЕСТЬNULL(ИсчисленоВзносов.ПФРСтраховаяОборот, 0)
	|			ИНАЧЕ -ДоходыВзносов.ИсчисленоПФРССуммПревышения
	|		КОНЕЦ,
	|		0
	|	ИЗ
	|		ВТДоходыВзносов КАК ДоходыВзносов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоЗЛпоВидамТарифа КАК ИсчисленоВзносов
	|			ПО ДоходыВзносов.Период = ИсчисленоВзносов.МесяцОтчетногоПериода
	|				И ДоходыВзносов.ФизЛицо = ИсчисленоВзносов.ФизЛицо
	|				И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ИсчисленоВзносов.ВидТарифаСтраховыхВзносов) КАК РасчетыПоСтраховымВзносамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяРасход КАК ПФРСтраховаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяРасход КАК ПФРНакопительнаяРасход,
	|	""Уплата"" КАК ВидСтроки
	|ПОМЕСТИТЬ ВТВсегоУплачено
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			&ОтчетныйПериод,
	|			&КонецПериодаУплаты,
	|			,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И МесяцРасчетногоПериода >= &ДатаЗаменыЕСН
	|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОстатки.ПФРСтраховаяОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -РасчетыПоСтраховымВзносамОстатки.ПФРСтраховаяОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОстатки.ПФРНакопительнаяОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -РасчетыПоСтраховымВзносамОстатки.ПФРНакопительнаяОстаток
	|	КОНЕЦ,
	|	""Переплата""
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|			&ОтчетныйПериод,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И МесяцРасчетногоПериода >= &ДатаЗаменыЕСН
	|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод)
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод
	|ПОМЕСТИТЬ ВТПринятоУплаты
	|ИЗ
	|	ВТПринятоВПФР КАК ПринятоВПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
	|		ПО ПринятоВПФР.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятоУплаты.ОтчетныйПериод КАК ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КорректируемыйПериод)
	|			ТОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц,
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ПОМЕСТИТЬ ВТДокументыКорректировки
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияПринятыеПФР КАК Корректировки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ПО Корректировки.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ПО ПринятоУплаты.ОтчетныйПериод < Корректировки.ОтчетныйПериодПерсучетаПФР
	|			И (&ОтчетныйПериод > Корректировки.ОтчетныйПериодПерсучетаПФР)
	|			И (Корректировки.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ В (ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ), ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ))
	|	И НЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОписаниеДокумента.ОтчетныйПериод,
	|	ОписаниеДокумента.ФизЛицо,
	|	ОписаниеДокумента.КатегорияЗастрахованныхЛиц,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая
	|	КОНЕЦ КАК УплаченоСтраховая,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная
	|	КОНЕЦ КАК УплаченоНакопительная,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая
	|	КОНЕЦ КАК НачисленоСтраховая,
	|	ВЫБОР
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная
	|	КОНЕЦ КАК НачисленоНакопительная
	|ПОМЕСТИТЬ ВТКорректировкиПринятыеПФР
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПринятоУплаты.ОтчетныйПериод КАК ОтчетныйПериод,
	|		ПринятоУплаты.ФизЛицо КАК ФизЛицо,
	|		МАКСИМУМ(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод) КАК ОтчетныйПериодКорректировки,
	|		ПринятоУплаты.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц
	|	ИЗ
	|		ВТПринятоУплаты КАК ПринятоУплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыКорректировки КАК Корректировки
	|			ПО ПринятоУплаты.ОтчетныйПериод = Корректировки.ОтчетныйПериод
	|				И ПринятоУплаты.КатегорияЗастрахованныхЛиц = Корректировки.КатегорияЗастрахованныхЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПринятоУплаты.ОтчетныйПериод = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|				И ПринятоУплаты.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|				И (Корректировки.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка)
	|	ГДЕ
	|		СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо ЕСТЬ НЕ NULL 
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПринятоУплаты.ОтчетныйПериод,
	|		ПринятоУплаты.ФизЛицо,
	|		ПринятоУплаты.КатегорияЗастрахованныхЛиц) КАК ОписаниеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыКорректировки КАК Корректировки
	|		ПО ОписаниеДокумента.ОтчетныйПериод = Корректировки.ОтчетныйПериод
	|			И ОписаниеДокумента.КатегорияЗастрахованныхЛиц = Корректировки.КатегорияЗастрахованныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|		ПО ОписаниеДокумента.ОтчетныйПериод = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|			И ОписаниеДокумента.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|			И ОписаниеДокумента.ОтчетныйПериодКорректировки = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод
	|			И (Корректировки.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПринятоУплаты.ФизЛицо,
	|	ПринятоУплаты.КатегорияЗастрахованныхЛиц,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.УплаченоНакопительная, ПринятоУплаты.УплаченоНакопительная)) КАК УплаченоНакопительная,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.УплаченоСтраховая, ПринятоУплаты.УплаченоСтраховая)) КАК УплаченоСтраховая,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.НачисленоНакопительная, ПринятоУплаты.НачисленоНакопительная)) КАК НачисленоНакопительная,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.НачисленоСтраховая, ПринятоУплаты.НачисленоСтраховая)) КАК НачисленоСтраховая
	|ПОМЕСТИТЬ ВТУплатыПринятыеПФР
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКорректировкиПринятыеПФР КАК КорректировкиПринятыеПФР
	|		ПО ПринятоУплаты.ФизЛицо = КорректировкиПринятыеПФР.ФизЛицо
	|			И ПринятоУплаты.ОтчетныйПериод = КорректировкиПринятыеПФР.ОтчетныйПериод
	|			И ПринятоУплаты.КатегорияЗастрахованныхЛиц = КорректировкиПринятыеПФР.КатегорияЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятоУплаты.ФизЛицо,
	|	ПринятоУплаты.КатегорияЗастрахованныхЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаСПереплатой
	|ИЗ
	|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
	|
	|СГРУППИРОВАТЬ ПО
	|	УплатыПринятыеПФР.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	(СУММА(УплатыПринятыеПФР.НачисленоНакопительная) < СУММА(УплатыПринятыеПФР.УплаченоНакопительная)
	|		ИЛИ СУММА(УплатыПринятыеПФР.НачисленоСтраховая) < СУММА(УплатыПринятыеПФР.УплаченоСтраховая))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо,
	|	УплатыПринятыеПФР.КатегорияЗастрахованныхЛиц,
	|	УплатыПринятыеПФР.НачисленоНакопительная - УплатыПринятыеПФР.УплаченоНакопительная КАК Накопительная,
	|	УплатыПринятыеПФР.НачисленоСтраховая - УплатыПринятыеПФР.УплаченоСтраховая КАК Страховая
	|ПОМЕСТИТЬ ВТНедоуплаченоЗаПрошлыеПериоды
	|ИЗ
	|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
	|ГДЕ
	|	НЕ УплатыПринятыеПФР.ФизЛицо В
	|				(ВЫБРАТЬ
	|					ФизЛица.ФизЛицо
	|				ИЗ
	|					ВТФизлицаСПереплатой КАК ФизЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) КАК Накопительная,
	|	ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) КАК Страховая,
	|	ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) КАК ПФРСтраховаяПриход,
	|	ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) КАК ПФРНакопительнаяПриход,
	|	ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) КАК ПФРСтраховаяРасход,
	|	ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) КАК ПФРНакопительнаяРасход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) > ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ((ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0)) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентТекущегоПериодаСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) > ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ((ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0)) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентТекущегоПериодаНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) < ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентПрошлыхПериодовСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) < ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентПрошлыхПериодовНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0)
	|	КОНЕЦ КАК УчтеноУплатыСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0)
	|	КОНЕЦ КАК УчтеноУплатыНакопительная
	|ПОМЕСТИТЬ ВТКоэффициентыУплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК Поле) КАК СтрокаЗапроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоНачислено КАК ВсегоНачислено
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВсегоУплачено.ПФРСтраховаяРасход) КАК ПФРСтраховаяРасход,
	|			СУММА(ВсегоУплачено.ПФРНакопительнаяРасход) КАК ПФРНакопительнаяРасход
	|		ИЗ
	|			ВТВсегоУплачено КАК ВсегоУплачено) КАК ВсегоУплачено
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(НедоуплаченоЗаПрошлыеПериоды.Накопительная) КАК Накопительная,
	|			СУММА(НедоуплаченоЗаПрошлыеПериоды.Страховая) КАК Страховая
	|		ИЗ
	|			ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды) КАК ПрошлыеПериоды
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо,
	|	МАКСИМУМ(Начислено.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц
	|ПОМЕСТИТЬ ВТКатегорииНачисленийТекущегоПериода
	|ИЗ
	|	ВТНачисленоЗаОтчетныйПериодФормирования КАК Начислено
	|ГДЕ
	|	(Начислено.ПФРНакопительная <> 0
	|			ИЛИ Начислено.ПФРСтраховая <> 0)
	|	И НЕ Начислено.КатегорияЗастрахованныхЛиц В (&МассивКатегорийИностранцев)
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НедоуплаченоЗаПрошлыеПериоды.ФизЛицо КАК ФизЛицо,
	|	ЕСТЬNULL(КатегорииНачисленийТекущегоПериода.КатегорияЗастрахованныхЛиц, НедоуплаченоЗаПрошлыеПериоды.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|	НедоуплаченоЗаПрошлыеПериоды.Накопительная * КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная / 100000 КАК УплаченоНакопительная,
	|	НедоуплаченоЗаПрошлыеПериоды.Страховая * КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая / 100000 КАК УплаченоСтраховая,
	|	0 КАК НачисленоСтраховая,
	|	0 КАК НачисленоНакопительная,
	|	""Прошлые периоды"" КАК ВидСтроки
	|ПОМЕСТИТЬ ВТРасчетСумм
	|ИЗ
	|	ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКатегорииНачисленийТекущегоПериода КАК КатегорииНачисленийТекущегоПериода
	|		ПО НедоуплаченоЗаПрошлыеПериоды.ФизЛицо = КатегорииНачисленийТекущегоПериода.ФизЛицо
	|ГДЕ
	|	(НедоуплаченоЗаПрошлыеПериоды.Накопительная <> 0
	|			ИЛИ НедоуплаченоЗаПрошлыеПериоды.Страховая <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленоПоЗЛ.ФизЛицо,
	|	НачисленоПоЗЛ.КатегорияЗастрахованныхЛиц,
	|	НачисленоПоЗЛ.ПФРНакопительная * КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная / 100000,
	|	НачисленоПоЗЛ.ПФРСтраховая * КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая / 100000,
	|	НачисленоПоЗЛ.ПФРСтраховая,
	|	НачисленоПоЗЛ.ПФРНакопительная,
	|	""Текущий период""
	|ИЗ
	|	ВТНачисленоЗаОтчетныйПериодФормирования КАК НачисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	(НачисленоПоЗЛ.ПФРНакопительная <> 0
	|			ИЛИ НачисленоПоЗЛ.ПФРСтраховая <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Доходы.ФизЛицо,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц),
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(Доходы.ОблагаемаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
	|			КОГДА Доходы.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ) / 100 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(Доходы.ОблагаемаяБазаПФР * ВЫБОР
	|			КОГДА Доходы.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ / 100 КАК ЧИСЛО(15, 2)),
	|	""Текущий период""
	|ИЗ
	|	(ВЫБРАТЬ
	|		Доходы.ФизЛицо КАК ФизЛицо,
	|		Доходы.ГодРождения КАК ГодРождения,
	|		Доходы.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
	|		Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		СУММА(Доходы.ОблагаемаяБазаПФР - Доходы.СуммаПревысившаяПредел) КАК ОблагаемаяБазаПФР
	|	ИЗ
	|		ВТДоходыВзносов КАК Доходы
	|	ГДЕ
	|		Доходы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Доходы.ГодРождения,
	|		Доходы.ФизЛицо,
	|		Доходы.ВидЗастрахованногоЛица,
	|		Доходы.ВидТарифаСтраховыхВзносов) КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|		ПО (РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (&ОтчетныйГод МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|			И Доходы.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И Доходы.ВидЗастрахованногоЛица = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Уплачено.УчтеноУплатыСтраховая КАК Страховая,
	|	Уплачено.УчтеноУплатыНакопительная КАК Накопительная
	|ИЗ
	|	ВТКоэффициентыУплаты КАК Уплачено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоСтраховая КАК ЧИСЛО(15, 2))), 0) КАК Страховая,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоНакопительная КАК ЧИСЛО(15, 2))), 0) КАК Накопительная
	|ИЗ
	|	ВТРасчетСумм КАК РасчетныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
	|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	СУММА(РасчетныеДанные.УплаченоНакопительная) КАК УплаченоНакопительная,
	|	СУММА(РасчетныеДанные.УплаченоСтраховая) КАК УплаченоСтраховая,
	|	СУММА(РасчетныеДанные.НачисленоСтраховая) КАК НачисленоСтраховая,
	|	СУММА(РасчетныеДанные.НачисленоНакопительная) КАК НачисленоНакопительная
	|ИЗ
	|	ВТРасчетСумм КАК РасчетныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетныеДанные.ФизЛицо,
	|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
	|
	|ИМЕЮЩИЕ
	|	(СУММА(РасчетныеДанные.УплаченоНакопительная) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.УплаченоСтраховая) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.НачисленоСтраховая) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.НачисленоНакопительная) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	Результаты = Запрос.ВыполнитьПакет();
	ВсегоЗапросов = Результаты.Количество();
	РезультатЗапроса = Результаты[ВсегоЗапросов - 1].Выгрузить();
	Распределено = Результаты[ВсегоЗапросов - 2].Выбрать();
	Распределено.Следующий();
	Зарегистрировано = Результаты[ВсегоЗапросов - 3].Выбрать();
	Зарегистрировано.Следующий();
	
	Если Зарегистрировано.Страховая <> Распределено.Страховая Или Зарегистрировано.Накопительная <> Распределено.Накопительная Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(РасчетныеДанные.УплаченоНакопительная) КАК УплаченоНакопительная,
		|	СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоНакопительная КАК ЧИСЛО(15, 2))) КАК Итог
		|ИЗ
		|	ВТРасчетСумм КАК РасчетныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетныеДанные.ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетныеДанные.УплаченоНакопительная) <> 0 Или
		|	СУММА(РасчетныеДанные.НачисленоНакопительная) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(РасчетныеДанные.УплаченоСтраховая) КАК УплаченоСтраховая,
		|	СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоСтраховая КАК ЧИСЛО(15, 2))) КАК Итог
		|ИЗ
		|	ВТРасчетСумм КАК РасчетныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетныеДанные.ФизЛицо,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетныеДанные.УплаченоСтраховая) <> 0 Или
		|	СУММА(РасчетныеДанные.НачисленоСтраховая) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо";
		
		Результаты = Запрос.ВыполнитьПакет();
		ВсегоЗапросов = Результаты.Количество();
		СтруктураПоиска = Новый Структура("ФизЛицо,КатегорияЗастрахованныхЛиц"); 
		Если Зарегистрировано.Страховая <> Распределено.Страховая Тогда
			Расхождение = Зарегистрировано.Страховая - Распределено.Страховая;
			ВременнаяТаблица = Результаты[ВсегоЗапросов - 1].Выгрузить();
			ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"УплаченоСтраховая", ВременнаяТаблица.Итог("Итог") + Расхождение, 2, "ФизЛицо,КатегорияЗастрахованныхЛиц");
			Для каждого СтрокаТЧ Из ВременнаяТаблица Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
				РезультатЗапроса.НайтиСтроки(СтруктураПоиска)[0].УплаченоСтраховая = СтрокаТЧ.УплаченоСтраховая;
			КонецЦикла;
		КонецЕсли;
		Если Зарегистрировано.Накопительная <> Распределено.Накопительная Тогда
			Расхождение = Зарегистрировано.Накопительная - Распределено.Накопительная;
			ВременнаяТаблица = Результаты[ВсегоЗапросов - 2].Выгрузить();
			ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"УплаченоНакопительная", ВременнаяТаблица.Итог("Итог") + Расхождение, 2, "ФизЛицо,КатегорияЗастрахованныхЛиц");
			Для каждого СтрокаТЧ Из ВременнаяТаблица Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
				РезультатЗапроса.НайтиСтроки(СтруктураПоиска)[0].УплаченоНакопительная = СтрокаТЧ.УплаченоНакопительная;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из РезультатЗапроса Цикл
		СтрокаТЧ.УплаченоСтраховая = Окр(СтрокаТЧ.УплаченоСтраховая, 2);
		СтрокаТЧ.УплаченоНакопительная = Окр(СтрокаТЧ.УплаченоНакопительная, 2);
	КонецЦикла;
	
	Если МассивФизлиц <> Неопределено Тогда
		Запрос.УстановитьПараметр("РезультатЗапроса", РезультатЗапроса);
		Запрос.УстановитьПараметр("МассивФизлиц", МассивФизлиц);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетСумм.ФизЛицо КАК ФизЛицо,
		|	РасчетСумм.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	РасчетСумм.УплаченоНакопительная,
		|	РасчетСумм.УплаченоСтраховая,
		|	РасчетСумм.НачисленоСтраховая,
		|	РасчетСумм.НачисленоНакопительная
		|ПОМЕСТИТЬ ВТРезультатЗапроса
		|ИЗ
		|	&РезультатЗапроса КАК РасчетСумм
		|ГДЕ
		|	РасчетСумм.ФизЛицо В(&МассивФизлиц)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатЗапроса.ФизЛицо КАК ФизЛицо,
		|	РезультатЗапроса.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	РезультатЗапроса.УплаченоНакопительная,
		|	РезультатЗапроса.УплаченоСтраховая,
		|	РезультатЗапроса.НачисленоСтраховая,
		|	РезультатЗапроса.НачисленоНакопительная
		|ИЗ
		|	ВТРезультатЗапроса КАК РезультатЗапроса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	КатегорияЗастрахованныхЛиц";
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если КомментироватьРасчет Тогда
		Запрос.УстановитьПараметр("РезультатЗапроса", РезультатЗапроса);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетСумм.ФизЛицо,
		|	РасчетСумм.КатегорияЗастрахованныхЛиц,
		|	РасчетСумм.УплаченоНакопительная,
		|	РасчетСумм.УплаченоСтраховая,
		|	РасчетСумм.НачисленоСтраховая,
		|	РасчетСумм.НачисленоНакопительная
		|ПОМЕСТИТЬ ВТРасчетСуммСПодгонкой
		|ИЗ
		|	&РезультатЗапроса КАК РасчетСумм";
		Запрос.Выполнить();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоэффициентыУплаты.Накопительная,
		|	КоэффициентыУплаты.Страховая,
		|	КоэффициентыУплаты.ПФРСтраховаяПриход,
		|	КоэффициентыУплаты.ПФРНакопительнаяПриход,
		|	КоэффициентыУплаты.ПФРСтраховаяРасход КАК ВсегоУплаченоСтраховая,
		|	КоэффициентыУплаты.ПФРНакопительнаяРасход КАК ВсегоУплаченоНакопительная,
		|	ЕСТЬNULL(Уплата.ПФРСтраховаяРасход, 0) КАК ЗачтенаПереплатаСтраховая,
		|	ЕСТЬNULL(Уплата.ПФРНакопительнаяРасход, 0) КАК ЗачтенаПереплатаНакопительная,
		|	КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая,
		|	КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная,
		|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая,
		|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|ИЗ
		|	ВТКоэффициентыУплаты КАК КоэффициентыУплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВсегоУплачено.ПФРСтраховаяРасход) КАК ПФРСтраховаяРасход,
		|			СУММА(ВсегоУплачено.ПФРНакопительнаяРасход) КАК ПФРНакопительнаяРасход
		|		ИЗ
		|			ВТВсегоУплачено КАК ВсегоУплачено
		|		ГДЕ
		|			ВсегоУплачено.ВидСтроки = ""Переплата"") КАК Уплата
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НедоуплаченоЗаПрошлыеПериоды.ФизЛицо.Наименование КАК ФИО,
		|	НедоуплаченоЗаПрошлыеПериоды.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	НедоуплаченоЗаПрошлыеПериоды.Накопительная,
		|	НедоуплаченоЗаПрошлыеПериоды.Страховая
		|ИЗ
		|	ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды
		|ГДЕ
		|	(НедоуплаченоЗаПрошлыеПериоды.Накопительная > 0
		|			ИЛИ НедоуплаченоЗаПрошлыеПериоды.Страховая > 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	КатегорияЗастрахованныхЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСПодгонкой.ВидСтроки КАК Период,
		|	ДанныеСПодгонкой.ФизЛицо КАК ФизЛицо,
		|	ДанныеСПодгонкой.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(ДанныеСПодгонкой.УплаченоНакопительная) КАК УплаченоНакопительная,
		|	СУММА(ДанныеСПодгонкой.УплаченоСтраховая) КАК УплаченоСтраховая,
		|	СУММА(ДанныеСПодгонкой.НачисленоСтраховая) КАК НачисленоСтраховая,
		|	СУММА(ДанныеСПодгонкой.НачисленоНакопительная) КАК НачисленоНакопительная,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая
		|	КОНЕЦ КАК КоэффициентУплатыСтраховая,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|	КОНЕЦ КАК КоэффициентУплатыНакопительная
		|ИЗ
		|	(ВЫБРАТЬ
		|		""Текущий период"" КАК ВидСтроки,
		|		РасчетСумм.ФизЛицо КАК ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|		-РасчетСумм.УплаченоНакопительная КАК УплаченоНакопительная,
		|		-РасчетСумм.УплаченоСтраховая КАК УплаченоСтраховая,
		|		-РасчетСумм.НачисленоСтраховая КАК НачисленоСтраховая,
		|		-РасчетСумм.НачисленоНакопительная КАК НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСумм КАК РасчетСумм
		|	ГДЕ
		|		РасчетСумм.ВидСтроки = ""Прошлые периоды""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""Текущий период"",
		|		РасчетСумм.ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц,
		|		РасчетСумм.УплаченоНакопительная,
		|		РасчетСумм.УплаченоСтраховая,
		|		РасчетСумм.НачисленоСтраховая,
		|		РасчетСумм.НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСуммСПодгонкой КАК РасчетСумм
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетСумм.ВидСтроки,
		|		РасчетСумм.ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц,
		|		РасчетСумм.УплаченоНакопительная,
		|		РасчетСумм.УплаченоСтраховая,
		|		РасчетСумм.НачисленоСтраховая,
		|		РасчетСумм.НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСумм КАК РасчетСумм
		|	ГДЕ
		|		РасчетСумм.ВидСтроки = ""Прошлые периоды"") КАК ДанныеСПодгонкой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеСПодгонкой.ВидСтроки,
		|	ДанныеСПодгонкой.ФизЛицо,
		|	ДанныеСПодгонкой.КатегорияЗастрахованныхЛиц,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорияЗастрахованныхЛиц,
		|	ФизЛицо,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УплатыПринятыеПФР.ФизЛицо.Наименование КАК ФИО,
		|	УплатыПринятыеПФР.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	ВЫБОР
		|		КОГДА УплатыПринятыеПФР.УплаченоНакопительная > УплатыПринятыеПФР.НачисленоНакопительная
		|			ТОГДА УплатыПринятыеПФР.УплаченоНакопительная - УплатыПринятыеПФР.НачисленоНакопительная
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Накопительная,
		|	ВЫБОР
		|		КОГДА УплатыПринятыеПФР.УплаченоСтраховая > УплатыПринятыеПФР.НачисленоСтраховая
		|			ТОГДА УплатыПринятыеПФР.УплаченоСтраховая - УплатыПринятыеПФР.НачисленоСтраховая
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Страховая
		|ИЗ
		|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
		|ГДЕ
		|	УплатыПринятыеПФР.ФизЛицо В
		|			(ВЫБРАТЬ
		|				ФизЛица.ФизЛицо
		|			ИЗ
		|				ВТФизлицаСПереплатой КАК ФизЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	КатегорияЗастрахованныхЛиц";
		
		РезультатыДляКомментирования = Запрос.ВыполнитьПакет();
		ТЗИтоги = РезультатыДляКомментирования[0].Выгрузить();
		ТЗПрошлыеПериоды = РезультатыДляКомментирования[1].Выгрузить();
		ТЗПрошлыеПериоды.Колонки.КатегорияЗастрахованныхЛиц.Заголовок = "Категория ЗЛ";
		ТЗСотрудников = РезультатыДляКомментирования[2].Выгрузить();
		ТЗСотрудников.Колонки.НачисленоСтраховая.Заголовок = "Начислено";
		ТЗСотрудников.Колонки.КоэффициентУплатыСтраховая.Заголовок = "Коэффициент уплаты";
		ТЗСотрудников.Колонки.УплаченоСтраховая.Заголовок = "Уплачено";
		ТЗСотрудников.Колонки.НачисленоНакопительная.Заголовок = "Начислено";
		ТЗСотрудников.Колонки.КоэффициентУплатыНакопительная.Заголовок = "Коэффициент уплаты";
		ТЗСотрудников.Колонки.УплаченоНакопительная.Заголовок = "Уплачено";
		Для каждого СтрокаТЗ Из ТЗСотрудников Цикл
		    СтрокаТЗ.КоэффициентУплатыСтраховая = Формат(СтрокаТЗ.КоэффициентУплатыСтраховая / 100000,"ЧДЦ=10; ЧН=-");
		    СтрокаТЗ.КоэффициентУплатыНакопительная = Формат(СтрокаТЗ.КоэффициентУплатыНакопительная / 100000,"ЧДЦ=10; ЧН=-");
		КонецЦикла;
		ТЗПереплаты = РезультатыДляКомментирования[3].Выгрузить();
		ТЗПереплаты.Колонки.КатегорияЗастрахованныхЛиц.Заголовок = "Категория ЗЛ";
		
		ДанныеКомментирования.РаспределениеСУчетомПринятыхПФРДанных = Истина;
		ДанныеКомментирования.Итоги = ТЗИтоги;
		ДанныеКомментирования.ПрошлыеПериоды = ТЗПрошлыеПериоды;
		ДанныеКомментирования.РасчетСотрудников = ТЗСотрудников;
		ДанныеКомментирования.Переплаты = ТЗПереплаты;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ДанныеОВзносахПоКатегориям(ДатаАктуальности, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, МассивФизлиц = Неопределено, КомментироватьРасчет = Ложь, ДанныеКомментирования = Неопределено) Экспорт 
	
	Если ПоследнийОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
		ВременнаяТаблица = ДанныеОВзносахПоКатегориям2012(ДатаАктуальности, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, МассивФизлиц, КомментироватьРасчет, ДанныеКомментирования);
		ВременнаяТаблица.Колонки.Добавить("ТипДоговора", Новый ОписаниеТипов("ПеречислениеСсылка.ТипДоговораСЗВ63"));
		Возврат	ВременнаяТаблица
	КонецЕсли;
	
	Если КомментироватьРасчет Тогда // инициализируем данные комментария
		ДанныеКомментирования = Новый Структура("РасчетКоэффициентовСтраховая, РасчетКоэффициентовНакопительная, ПрошлыеПериоды, Итоги, РасчетСотрудников, Переплаты", Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений, Новый ТаблицаЗначений);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("ДатаЗаменыЕСН", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ОтчетныйПериод", ПервыйОтчетныйПериод);
	Запрос.УстановитьПараметр("НачалоОтчетногоГода", НачалоГода(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("ОтчетныйГод", Год(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("КонецПериодаУплаты", Мин(КонецДня(ДатаАктуальности), ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("МассивКатегорийИностранцев", ПроцедурыПерсонифицированногоУчета.МассивКатегорийЗЛИностранцев());
	Запрос.УстановитьПараметр("ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией", ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией());
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПервыйОтчетныйПериод));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТДатыПериода";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПервыйОтчетныйПериод)) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияПринятыеПФР.КомплектДокументов,
	|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР
	|ПОМЕСТИТЬ ВТПринятоВПФР
	|ИЗ
	|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
	|ГДЕ
	|	СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4вПФР.ПустаяСсылка)
	|	И СведенияПринятыеПФР.Организация = &Организация
	|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаСДоходами
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			,
	|			,
	|			МЕСЯЦ,
	|			Организация = &ГоловнаяОрганизация
	|				И (ДатаПолученияДохода МЕЖДУ &НачалоОтчетногоГода И &КонецОтчетногоПериода)
	|				И ОбособленноеПодразделение = &Организация
	|				И НЕ ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Результат) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.Скидка) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода В (&НестрахуемыеВидыДохода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ПустаяСсылка)
	|		КОГДА СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ГражданскоПравовой)
	|	КОНЕЦ КАК ТипДоговора
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходахОбороты
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходахОбороты.Организация = &ГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода МЕЖДУ &НачалоОтчетногоГода И &КонецОтчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.ФизЛицо
	|			ИЗ
	|				ВТФизлицаСДоходами КАК ФизЛица)
	|	И НЕ СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, КВАРТАЛ) КАК ОтчетныйПериод,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховая + СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВД) КАК ПФРСтраховаяОборот,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительная + СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВД) КАК ПФРНакопительнаяОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленныеОбороты
	|ГДЕ
	|	СтраховыеВзносыИсчисленныеОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, КВАРТАЛ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Даты.Период,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ
	|	ВТДатыПериода КАК Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.Период,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.МесяцОтчетногоПериода,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И Периоды.ФизЛицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	СрезПоследнихДат.МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	ВЫБОР
	|		КОГДА ВидыДеятельности.ТолькоДоходыФармацевтов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА ВидыДеятельности.ТолькоДоходыМоряков
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Периоды.Период = ВидыДеятельности.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК НеИмеетПравоНаСтрахование,
	|	ГражданствоФизЛиц.ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И Периоды.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК ПериодРегистрации,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И Периоды.ФизЛицо = ВременноПребывающие.ФизЛицо
	|				И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		Периоды.ФизЛицо) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ПФРНакопительная,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС,
	|	ТарифСтраховыхВзносов.ТФОМС,
	|	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
	|	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&КонецОтчетногоПериода, ) КАК ТарифСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тарифы.ВидТарифа,
	|	ВЫБОР
	|		КОГДА Тарифы.СуммарныйТариф > ТарифДляИнвалидов.СуммарныйТариф
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыделятьДоходыИнвалидов
	|ПОМЕСТИТЬ ВТОписаниеТарифов
	|ИЗ
	|	ВТРазмерыТарифныхСтавок КАК Тарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК ТарифДляИнвалидов
	|		ПО (ТарифДляИнвалидов.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот,
	|	СтраховыеВзносыСведенияОДоходах.СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходах.ТипДоговора
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоВидамТарифа
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.МесяцОтчетногоПериода
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерПФР, 0) КАК Размер,
	|	ДатыПоследнихДвижений.ПериодРегистрации КАК Период
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПредельнаяВеличинаБазыСтраховыхВзносов.Период) КАК Период,
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|			ПО Периоды.Период >= ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|		ПО ДатыПоследнихДвижений.Период = ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|					И СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|			ПО СведенияОДоходах.Период = Гражданство.Период
	|				И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|			ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|				И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|			И Периоды.ФизЛицо = СведенияОДоходах.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО ОблагаемаяБаза.Период = Предел.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ТипДоговора,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СведенияОДоходах.Период = Гражданство.Период
	|			И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|			И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ТипДоговора
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ТипДоговора) КАК ТипДоговора
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел * БазаЗаМесяцПоОбособленным.ЗаМесяц / ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ТипДоговора,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|				И БазаЗаМесяцПоОбособленным.ТипДоговора = ОбособленноеПодразделениеДляОкругления.ТипДоговора
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ТипДоговора,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|ГДЕ
	|	Превышение.ОбособленноеПодразделение = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ТипДоговора,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ТипДоговора,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения) КАК ГодРождения,
	|	Гражданство.ВидЗастрахованногоЛица,
	|	СтраховыеВзносыСведенияОДоходах.ТипДоговора КАК ТипДоговора,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаПФР,
	|	МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим))
	|			ТОГДА 0
	|		КОГДА СУММА(ВЫБОР
	|					КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|						ТОГДА 0
	|					КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|							И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|						ТОГДА 0
	|					КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|						ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|					ИНАЧЕ 0
	|				КОНЕЦ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) / 10 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ИсчисленоПФРССуммПревышения
	|ПОМЕСТИТЬ ВТДоходыВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПревышениеДоходаПФР.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И СтраховыеВзносыСведенияОДоходах.ТипДоговора = ПревышениеДоходаПФР.ТипДоговора
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ТипДоговора,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения),
	|	Гражданство.ВидЗастрахованногоЛица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) КАК ОблагаемаяБазаПФР
	|ПОМЕСТИТЬ ВТДоходыВзносовПоМесяцамИТарифам
	|ИЗ
	|	ВТДоходыВзносов КАК ДоходыВзносов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Месяцы.ФизЛицо,
	|	Месяцы.ПериодРегистрации,
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПериодыОдногоТарифа
	|ИЗ
	|	(ВЫБРАТЬ
	|		БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|		БазаДляОтчета.Период КАК ПериодРегистрации
	|	ИЗ
	|		ВТДоходыВзносов КАК БазаДляОтчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БазаДляОтчета.Период,
	|		БазаДляОтчета.ФизЛицо
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) = 1) КАК Месяцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО Месяцы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И Месяцы.ПериодРегистрации = БазаДляОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|	БазаДляОтчета.Период КАК ПериодРегистрации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТМесяцыОсобыхТарифов
	|ИЗ
	|	ВТДоходыВзносов КАК БазаДляОтчета
	|ГДЕ
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаДляОтчета.ФизЛицо,
	|	БазаДляОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ПериодРегистрации,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
	|			КОГДА БазаДляОтчета.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ)) КАК ПФРСтраховаяЗаПериод,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаПФР * ВЫБОР
	|			КОГДА БазаДляОтчета.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ) КАК ПФРНакопительнаяЗаПериод,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТПериодыДляРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТМесяцыОсобыхТарифов КАК ОсобыеТарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
	|		ПО ОсобыеТарифы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ОсобыеТарифы.ПериодРегистрации = БазаДляОтчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсобыеТарифы.ПериодРегистрации,
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации,
	|	ТарифыПоДоходам.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
	|				КОГДА БазаДляОтчета.ГодРождения < 1967
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|					ТОГДА 0
	|				ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|			КОНЕЦ) / ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод
	|	КОНЕЦ КАК КоэффициентПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРНакопительнаяЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаПФР * ВЫБОР
	|				КОГДА БазаДляОтчета.ГодРождения < 1967
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|					ТОГДА 0
	|				КОГДА БазаДляОтчета.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|					ТОГДА 0
	|				ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|			КОНЕЦ / ПериодыДляРаспределенияВзносовПоТарифам.ПФРНакопительнаяЗаПериод
	|	КОНЕЦ КАК КоэффициентПФРНакопительная
	|ПОМЕСТИТЬ ВТКоэффициентыРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТПериодыДляРаспределенияВзносовПоТарифам КАК ПериодыДляРаспределенияВзносовПоТарифам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|		ПО (РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = БазаДляОтчета.Период
	|			И (БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ТарифыПоДоходам
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = ТарифыПоДоходам.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = ТарифыПоДоходам.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчетаВзносов.МесяцОтчетногоПериода,
	|	НАЧАЛОПЕРИОДА(ДанныеУчетаВзносов.ОтчетныйПериод, ГОД) КАК ГодОтчетногоПериода,
	|	ДанныеУчетаВзносов.ОтчетныйПериод,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРСтраховаяОборот КАК ЧИСЛО(15, 2))) КАК ПФРСтраховаяОборот,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРНакопительная
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРНакопительная
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРНакопительнаяОборот КАК ЧИСЛО(15, 2))) КАК ПФРНакопительнаяОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛпоВидамТарифа
	|ИЗ
	|	ВТИсчисленоПоЗЛ КАК ДанныеУчетаВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|		ПО ДанныеУчетаВзносов.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ДанныеУчетаВзносов.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|			И ДанныеУчетаВзносов.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыОдногоТарифа КАК ПериодыОдногоТарифа
	|		ПО ДанныеУчетаВзносов.ФизЛицо = ПериодыОдногоТарифа.ФизЛицо
	|			И ДанныеУчетаВзносов.МесяцОтчетногоПериода = ПериодыОдногоТарифа.ПериодРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыРаспределенияВзносовПоТарифам КАК КоэффициентыРаспределенияВзносовПоТарифам
	|		ПО ДанныеУчетаВзносов.ФизЛицо = КоэффициентыРаспределенияВзносовПоТарифам.ФизЛицо
	|			И ДанныеУчетаВзносов.МесяцОтчетногоПериода = КоэффициентыРаспределенияВзносовПоТарифам.ПериодРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ДанныеУчетаВзносов.МесяцОтчетногоПериода,
	|	ДанныеУчетаВзносов.ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоЗЛпоВидамТарифа.МесяцОтчетногоПериода,
	|	ИсчисленоПоЗЛпоВидамТарифа.ГодОтчетногоПериода,
	|	ИсчисленоПоЗЛпоВидамТарифа.ОтчетныйПериод,
	|	ИсчисленоПоЗЛпоВидамТарифа.ФизЛицо,
	|	ИсчисленоПоЗЛпоВидамТарифа.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР, 0) = 0
	|			ТОГДА 0
	|		КОГДА ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ИсчисленоПоЗЛпоВидамТарифа.ПФРСтраховаяОборот / ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР * ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРСтраховаяОборот,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР, 0) = 0
	|			ТОГДА 0
	|		КОГДА ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ИсчисленоПоЗЛпоВидамТарифа.ПФРНакопительнаяОборот / ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР * ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРНакопительнаяОборот,
	|	ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ГражданскоПравовой) КАК ТипДоговора
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛпоВидамТарифаТипуДоговора
	|ИЗ
	|	ВТИсчисленоПоЗЛпоВидамТарифа КАК ИсчисленоПоЗЛпоВидамТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносовПоМесяцамИТарифам КАК ИтогоДоходыВзносовПоМесяцамИТарифам
	|		ПО ИсчисленоПоЗЛпоВидамТарифа.МесяцОтчетногоПериода = ИтогоДоходыВзносовПоМесяцамИТарифам.Период
	|			И ИсчисленоПоЗЛпоВидамТарифа.ФизЛицо = ИтогоДоходыВзносовПоМесяцамИТарифам.ФизЛицо
	|			И ИсчисленоПоЗЛпоВидамТарифа.ВидТарифаСтраховыхВзносов = ИтогоДоходыВзносовПоМесяцамИТарифам.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ДоходыВзносовПоТипамДоговора
	|		ПО ИсчисленоПоЗЛпоВидамТарифа.МесяцОтчетногоПериода = ДоходыВзносовПоТипамДоговора.Период
	|			И ИсчисленоПоЗЛпоВидамТарифа.ФизЛицо = ДоходыВзносовПоТипамДоговора.ФизЛицо
	|			И ИсчисленоПоЗЛпоВидамТарифа.ВидТарифаСтраховыхВзносов = ДоходыВзносовПоТипамДоговора.ВидТарифаСтраховыхВзносов
	|			И (ДоходыВзносовПоТипамДоговора.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ГражданскоПравовой))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсчисленоПоЗЛпоВидамТарифа.МесяцОтчетногоПериода,
	|	ИсчисленоПоЗЛпоВидамТарифа.ГодОтчетногоПериода,
	|	ИсчисленоПоЗЛпоВидамТарифа.ОтчетныйПериод,
	|	ИсчисленоПоЗЛпоВидамТарифа.ФизЛицо,
	|	ИсчисленоПоЗЛпоВидамТарифа.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР, 0) = 0
	|			ТОГДА ИсчисленоПоЗЛпоВидамТарифа.ПФРСтраховаяОборот
	|		КОГДА ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР = 0
	|			ТОГДА ИсчисленоПоЗЛпоВидамТарифа.ПФРСтраховаяОборот
	|		ИНАЧЕ ИсчисленоПоЗЛпоВидамТарифа.ПФРСтраховаяОборот - (ВЫРАЗИТЬ(ИсчисленоПоЗЛпоВидамТарифа.ПФРСтраховаяОборот / ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР * ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР, 0) = 0
	|			ТОГДА ИсчисленоПоЗЛпоВидамТарифа.ПФРНакопительнаяОборот
	|		КОГДА ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР = 0
	|			ТОГДА ИсчисленоПоЗЛпоВидамТарифа.ПФРНакопительнаяОборот
	|		ИНАЧЕ ИсчисленоПоЗЛпоВидамТарифа.ПФРНакопительнаяОборот - (ВЫРАЗИТЬ(ИсчисленоПоЗЛпоВидамТарифа.ПФРНакопительнаяОборот / ИтогоДоходыВзносовПоМесяцамИТарифам.ОблагаемаяБазаПФР * ДоходыВзносовПоТипамДоговора.ОблагаемаяБазаПФР КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
	|ИЗ
	|	ВТИсчисленоПоЗЛпоВидамТарифа КАК ИсчисленоПоЗЛпоВидамТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносовПоМесяцамИТарифам КАК ИтогоДоходыВзносовПоМесяцамИТарифам
	|		ПО ИсчисленоПоЗЛпоВидамТарифа.МесяцОтчетногоПериода = ИтогоДоходыВзносовПоМесяцамИТарифам.Период
	|			И ИсчисленоПоЗЛпоВидамТарифа.ФизЛицо = ИтогоДоходыВзносовПоМесяцамИТарифам.ФизЛицо
	|			И ИсчисленоПоЗЛпоВидамТарифа.ВидТарифаСтраховыхВзносов = ИтогоДоходыВзносовПоМесяцамИТарифам.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ДоходыВзносовПоТипамДоговора
	|		ПО ИсчисленоПоЗЛпоВидамТарифа.МесяцОтчетногоПериода = ДоходыВзносовПоТипамДоговора.Период
	|			И ИсчисленоПоЗЛпоВидамТарифа.ФизЛицо = ДоходыВзносовПоТипамДоговора.ФизЛицо
	|			И ИсчисленоПоЗЛпоВидамТарифа.ВидТарифаСтраховыхВзносов = ДоходыВзносовПоТипамДоговора.ВидТарифаСтраховыхВзносов
	|			И (ДоходыВзносовПоТипамДоговора.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ГражданскоПравовой))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоЗЛ.ФизЛицо,
	|	ИсчисленоПоЗЛ.ТипДоговора,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыВзносов.ОблагаемаяБазаПФР = ДоходыВзносов.СуммаПревысившаяПредел
	|					И ДоходыВзносов.СуммаПревысившаяПредел <> 0
	|				ТОГДА 0
	|			ИНАЧЕ ИсчисленоПоЗЛ.ПФРСтраховаяОборот - ЕСТЬNULL(ДоходыВзносов.ИсчисленоПФРССуммПревышения, 0)
	|		КОНЕЦ) КАК ПФРСтраховая,
	|	СУММА(ИсчисленоПоЗЛ.ПФРНакопительнаяОборот) КАК ПФРНакопительная
	|ПОМЕСТИТЬ ВТНачисленоЗаОтчетныйПериодФормирования
	|ИЗ
	|	ВТИсчисленоПоЗЛпоВидамТарифаТипуДоговора КАК ИсчисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ДоходыВзносов
	|		ПО ИсчисленоПоЗЛ.ФизЛицо = ДоходыВзносов.ФизЛицо
	|			И ИсчисленоПоЗЛ.МесяцОтчетногоПериода = ДоходыВзносов.Период
	|			И ИсчисленоПоЗЛ.ВидТарифаСтраховыхВзносов = ДоходыВзносов.ВидТарифаСтраховыхВзносов
	|			И ИсчисленоПоЗЛ.ТипДоговора = ДоходыВзносов.ТипДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (ГОД(ИсчисленоПоЗЛ.ГодОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|			И ИсчисленоПоЗЛ.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО ИсчисленоПоЗЛ.МесяцОтчетногоПериода = Гражданство.Период
	|			И ИсчисленоПоЗЛ.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И (ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц),
	|	ИсчисленоПоЗЛ.ФизЛицо,
	|	ИсчисленоПоЗЛ.ТипДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяОборот) КАК ПФРСтраховаяПриход,
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяОборот) КАК ПФРНакопительнаяПриход
	|ПОМЕСТИТЬ ВТВсегоНачислено
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|		РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК РасчетыПоСтраховымВзносамОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ДоходыВзносов.ОблагаемаяБазаПФР = ДоходыВзносов.СуммаПревысившаяПредел
	|					И ДоходыВзносов.СуммаПревысившаяПредел <> 0
	|				ТОГДА -ЕСТЬNULL(ИсчисленоВзносов.ПФРСтраховаяОборот, 0)
	|			ИНАЧЕ -ДоходыВзносов.ИсчисленоПФРССуммПревышения
	|		КОНЕЦ,
	|		0
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДоходыВзносов.Период КАК Период,
	|			ДоходыВзносов.ФизЛицо КАК ФизЛицо,
	|			СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) КАК ОблагаемаяБазаПФР,
	|			СУММА(ДоходыВзносов.ИсчисленоПФРССуммПревышения) КАК ИсчисленоПФРССуммПревышения,
	|			СУММА(ДоходыВзносов.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|			ДоходыВзносов.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
	|		ИЗ
	|			ВТДоходыВзносов КАК ДоходыВзносов
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДоходыВзносов.Период,
	|			ДоходыВзносов.ФизЛицо,
	|			ДоходыВзносов.ВидТарифаСтраховыхВзносов) КАК ДоходыВзносов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоЗЛпоВидамТарифа КАК ИсчисленоВзносов
	|			ПО ДоходыВзносов.Период = ИсчисленоВзносов.МесяцОтчетногоПериода
	|				И ДоходыВзносов.ФизЛицо = ИсчисленоВзносов.ФизЛицо
	|				И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ИсчисленоВзносов.ВидТарифаСтраховыхВзносов) КАК РасчетыПоСтраховымВзносамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяРасход КАК ПФРСтраховаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяРасход КАК ПФРНакопительнаяРасход,
	|	""Уплата"" КАК ВидСтроки
	|ПОМЕСТИТЬ ВТВсегоУплачено
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			&ОтчетныйПериод,
	|			&КонецПериодаУплаты,
	|			,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И МесяцРасчетногоПериода >= &ДатаЗаменыЕСН
	|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОстатки.ПФРСтраховаяОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -РасчетыПоСтраховымВзносамОстатки.ПФРСтраховаяОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОстатки.ПФРНакопительнаяОстаток > 0
	|			ТОГДА 0
	|		ИНАЧЕ -РасчетыПоСтраховымВзносамОстатки.ПФРНакопительнаяОстаток
	|	КОНЕЦ,
	|	""Переплата""
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|			&ОтчетныйПериод,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И МесяцРасчетногоПериода >= &ДатаЗаменыЕСН
	|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод)
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод,
	|	ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой) КАК ТипДоговора
	|ПОМЕСТИТЬ ВТПринятоУплаты
	|ИЗ
	|	ВТПринятоВПФР КАК ПринятоВПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
	|		ПО ПринятоВПФР.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|	И ПринятоВПФР.ОтчетныйПериодПерсучетаПФР < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод)
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипДоговора
	|ИЗ
	|	ВТПринятоВПФР КАК ПринятоВПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2013 КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПачкаДокументовСЗВ_6_4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
	|		ПО ПринятоВПФР.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|	И ПринятоВПФР.ОтчетныйПериодПерсучетаПФР >= &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод)
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипДоговора
	|ИЗ
	|	ВТПринятоВПФР КАК ПринятоВПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2014 КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПачкаДокументовСЗВ_6_4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
	|		ПО ПринятоВПФР.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|	И ПринятоВПФР.ОтчетныйПериодПерсучетаПФР >= &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод)
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод,
	|	ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
	|ИЗ
	|	ВТПринятоВПФР КАК ПринятоВПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2013 КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
	|		ПО ПринятоВПФР.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|	И ПринятоВПФР.ОтчетныйПериодПерсучетаПФР < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод)
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод,
	|	ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
	|ИЗ
	|	ВТПринятоВПФР КАК ПринятоВПФР
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2014 КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
	|		ПО ПринятоВПФР.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|	И ПринятоВПФР.ОтчетныйПериодПерсучетаПФР < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятоУплаты.ОтчетныйПериод КАК ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КорректируемыйПериод)
	|			ТОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц,
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ПОМЕСТИТЬ ВТДокументыКорректировки
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияПринятыеПФР КАК Корректировки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ПО Корректировки.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ПО ПринятоУплаты.ОтчетныйПериод < Корректировки.ОтчетныйПериодПерсучетаПФР
	|			И (&ОтчетныйПериод > Корректировки.ОтчетныйПериодПерсучетаПФР)
	|			И (Корректировки.Организация = &Организация)
	|			И (Корректировки.ОтчетныйПериодПерсучетаПФР < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ В (ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ), ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ))
	|	И НЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятоУплаты.ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КорректируемыйПериод)
	|			ТОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ,
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияПринятыеПФР КАК Корректировки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2013 КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ПО Корректировки.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ПО ПринятоУплаты.ОтчетныйПериод < Корректировки.ОтчетныйПериодПерсучетаПФР
	|			И (&ОтчетныйПериод > Корректировки.ОтчетныйПериодПерсучетаПФР)
	|			И (Корректировки.Организация = &Организация)
	|			И (Корректировки.ОтчетныйПериодПерсучетаПФР >= &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ В (ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ), ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ))
	|	И НЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятоУплаты.ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА &ОтчетныйГод = ГОД(ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КорректируемыйПериод)
	|			ТОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		КОГДА ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
	|		ИНАЧЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц
	|	КОНЕЦ,
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияПринятыеПФР КАК Корректировки
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2014 КАК ПередачаСЗВ4вПФРПачкиДокументов
	|			ПО Корректировки.КомплектДокументов = ПередачаСЗВ4вПФРПачкиДокументов.Ссылка
	|		ПО ПринятоУплаты.ОтчетныйПериод < Корректировки.ОтчетныйПериодПерсучетаПФР
	|			И (&ОтчетныйПериод > Корректировки.ОтчетныйПериодПерсучетаПФР)
	|			И (Корректировки.Организация = &Организация)
	|			И (Корректировки.ОтчетныйПериодПерсучетаПФР >= &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ТарифыСтавокОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ГОД(ТарифыСтавокОрганизации.МесяцОтчетногоПериода) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|				И ТарифыСтавокОрганизации.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО (&ОтчетныйПериод = ТарифыСтавокОрганизации.МесяцОтчетногоПериода)
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ В (ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ), ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ))
	|	И (ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка ССЫЛКА Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4
	|			ИЛИ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка ССЫЛКА Документ.ПачкаДокументовСЗВ_6_4)
	|	И НЕ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЧЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖЭС), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПЭС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОписаниеДокумента.ОтчетныйПериод,
	|	ОписаниеДокумента.ФизЛицо,
	|	ОписаниеДокумента.КатегорияЗастрахованныхЛиц,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|					ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|				ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоСтраховая
	|		ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.УплаченоСтраховая
	|	КОНЕЦ КАК УплаченоСтраховая,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|					ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|				ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.УплаченоНакопительная
	|		ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.УплаченоНакопительная
	|	КОНЕЦ КАК УплаченоНакопительная,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|					ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|				ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоСтраховая
	|		ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.НачисленоСтраховая
	|	КОНЕЦ КАК НачисленоСтраховая,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|					ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|				ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.ТипСведенийСЗВ
	|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
	|			ТОГДА 0
	|		КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|			ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.НачисленоНакопительная
	|		ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.НачисленоНакопительная
	|	КОНЕЦ КАК НачисленоНакопительная,
	|	ВЫБОР
	|		КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
	|		ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.ТипДоговора
	|	КОНЕЦ КАК ТипДоговора
	|ПОМЕСТИТЬ ВТКорректировкиПринятыеПФР
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПринятоУплаты.ОтчетныйПериод КАК ОтчетныйПериод,
	|		ПринятоУплаты.ФизЛицо КАК ФизЛицо,
	|		МАКСИМУМ(ЕСТЬNULL(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод, ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.ОтчетныйПериод)) КАК ОтчетныйПериодКорректировки,
	|		ПринятоУплаты.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц
	|	ИЗ
	|		ВТПринятоУплаты КАК ПринятоУплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыКорректировки КАК Корректировки
	|			ПО ПринятоУплаты.ОтчетныйПериод = Корректировки.ОтчетныйПериод
	|				И ПринятоУплаты.КатегорияЗастрахованныхЛиц = Корректировки.КатегорияЗастрахованныхЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|			ПО ПринятоУплаты.ОтчетныйПериод = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|				И ПринятоУплаты.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|				И (Корректировки.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПачкаДокументовСЗВ_6_4.РаботникиОрганизации КАК ПачкаДокументовСЗВ_6_4РаботникиОрганизации
	|			ПО ПринятоУплаты.ОтчетныйПериод = ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|				И ПринятоУплаты.ФизЛицо = ПачкаДокументовСЗВ_6_4РаботникиОрганизации.ФизЛицо
	|				И (Корректировки.ДокументПачка = ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка)
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ПринятоУплаты.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|					ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|				ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.ФизЛицо
	|			КОНЕЦ ЕСТЬ НЕ NULL 
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПринятоУплаты.ОтчетныйПериод,
	|		ПринятоУплаты.ФизЛицо,
	|		ПринятоУплаты.КатегорияЗастрахованныхЛиц) КАК ОписаниеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыКорректировки КАК Корректировки
	|		ПО ОписаниеДокумента.ОтчетныйПериод = Корректировки.ОтчетныйПериод
	|			И ОписаниеДокумента.КатегорияЗастрахованныхЛиц = Корректировки.КатегорияЗастрахованныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|		ПО ОписаниеДокумента.ОтчетныйПериод = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|			И ОписаниеДокумента.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|			И ОписаниеДокумента.ОтчетныйПериодКорректировки = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ОтчетныйПериод
	|			И (Корректировки.ДокументПачка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПачкаДокументовСЗВ_6_4.РаботникиОрганизации КАК ПачкаДокументовСЗВ_6_4РаботникиОрганизации
	|		ПО ОписаниеДокумента.ОтчетныйПериод = ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.КорректируемыйПериод
	|			И ОписаниеДокумента.ФизЛицо = ПачкаДокументовСЗВ_6_4РаботникиОрганизации.ФизЛицо
	|			И ОписаниеДокумента.ОтчетныйПериодКорректировки = ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка.ОтчетныйПериод
	|			И (Корректировки.ДокументПачка = ПачкаДокументовСЗВ_6_4РаботникиОрганизации.Ссылка)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОписаниеДокумента.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|				ТОГДА СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|			ИНАЧЕ ПачкаДокументовСЗВ_6_4РаботникиОрганизации.ФизЛицо
	|		КОНЕЦ ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПринятоУплаты.ФизЛицо,
	|	ПринятоУплаты.КатегорияЗастрахованныхЛиц,
	|	ПринятоУплаты.ТипДоговора,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.УплаченоНакопительная, ПринятоУплаты.УплаченоНакопительная)) КАК УплаченоНакопительная,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.УплаченоСтраховая, ПринятоУплаты.УплаченоСтраховая)) КАК УплаченоСтраховая,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.НачисленоНакопительная, ПринятоУплаты.НачисленоНакопительная)) КАК НачисленоНакопительная,
	|	СУММА(ЕСТЬNULL(КорректировкиПринятыеПФР.НачисленоСтраховая, ПринятоУплаты.НачисленоСтраховая)) КАК НачисленоСтраховая
	|ПОМЕСТИТЬ ВТУплатыПринятыеПФР
	|ИЗ
	|	ВТПринятоУплаты КАК ПринятоУплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКорректировкиПринятыеПФР КАК КорректировкиПринятыеПФР
	|		ПО ПринятоУплаты.ФизЛицо = КорректировкиПринятыеПФР.ФизЛицо
	|			И ПринятоУплаты.ОтчетныйПериод = КорректировкиПринятыеПФР.ОтчетныйПериод
	|			И ПринятоУплаты.КатегорияЗастрахованныхЛиц = КорректировкиПринятыеПФР.КатегорияЗастрахованныхЛиц
	|			И ПринятоУплаты.ТипДоговора = КорректировкиПринятыеПФР.ТипДоговора
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятоУплаты.ФизЛицо,
	|	ПринятоУплаты.КатегорияЗастрахованныхЛиц,
	|	ПринятоУплаты.ТипДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаСПереплатой
	|ИЗ
	|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
	|
	|СГРУППИРОВАТЬ ПО
	|	УплатыПринятыеПФР.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	(СУММА(УплатыПринятыеПФР.НачисленоНакопительная) < СУММА(УплатыПринятыеПФР.УплаченоНакопительная)
	|		ИЛИ СУММА(УплатыПринятыеПФР.НачисленоСтраховая) < СУММА(УплатыПринятыеПФР.УплаченоСтраховая))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаСЗадолженностью
	|ИЗ
	|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
	|
	|СГРУППИРОВАТЬ ПО
	|	УплатыПринятыеПФР.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	(СУММА(УплатыПринятыеПФР.НачисленоНакопительная) > СУММА(УплатыПринятыеПФР.УплаченоНакопительная)
	|		ИЛИ СУММА(УплатыПринятыеПФР.НачисленоСтраховая) > СУММА(УплатыПринятыеПФР.УплаченоСтраховая))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо,
	|	УплатыПринятыеПФР.КатегорияЗастрахованныхЛиц,
	|	УплатыПринятыеПФР.ТипДоговора,
	|	УплатыПринятыеПФР.НачисленоНакопительная - УплатыПринятыеПФР.УплаченоНакопительная КАК Накопительная,
	|	УплатыПринятыеПФР.НачисленоСтраховая - УплатыПринятыеПФР.УплаченоСтраховая КАК Страховая
	|ПОМЕСТИТЬ ВТНедоуплаченоЗаПрошлыеПериоды
	|ИЗ
	|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
	|ГДЕ
	|	УплатыПринятыеПФР.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.ФизЛицо
	|			ИЗ
	|				ВТФизлицаСЗадолженностью КАК ФизЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) КАК Накопительная,
	|	ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) КАК Страховая,
	|	ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) КАК ПФРСтраховаяПриход,
	|	ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) КАК ПФРНакопительнаяПриход,
	|	ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) КАК ПФРСтраховаяРасход,
	|	ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) КАК ПФРНакопительнаяРасход,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) > ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ((ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0)) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентТекущегоПериодаСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) > ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ((ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) - ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0)) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентТекущегоПериодаНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) < ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентПрошлыхПериодовСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) < ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА 100000
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) * 100000 / (ВЫРАЗИТЬ(ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) КАК ЧИСЛО(25, 6))) КАК ЧИСЛО(20, 6))
	|	КОНЕЦ КАК КоэффициентПрошлыхПериодовНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|			ТОГДА ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПрошлыеПериоды.Страховая, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0)
	|	КОНЕЦ КАК УчтеноУплатыСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) > ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|			ТОГДА ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПрошлыеПериоды.Накопительная, 0) + ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0)
	|	КОНЕЦ КАК УчтеноУплатыНакопительная
	|ПОМЕСТИТЬ ВТКоэффициентыУплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		1 КАК Поле) КАК СтрокаЗапроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоНачислено КАК ВсегоНачислено
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВсегоУплачено.ПФРСтраховаяРасход) КАК ПФРСтраховаяРасход,
	|			СУММА(ВсегоУплачено.ПФРНакопительнаяРасход) КАК ПФРНакопительнаяРасход
	|		ИЗ
	|			ВТВсегоУплачено КАК ВсегоУплачено) КАК ВсегоУплачено
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(НедоуплаченоЗаПрошлыеПериоды.Накопительная) КАК Накопительная,
	|			СУММА(НедоуплаченоЗаПрошлыеПериоды.Страховая) КАК Страховая
	|		ИЗ
	|			ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды) КАК ПрошлыеПериоды
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо,
	|	Начислено.КатегорияЗастрахованныхЛиц,
	|	МАКСИМУМ(Начислено.ТипДоговора) КАК ТипДоговора
	|ПОМЕСТИТЬ ВТКатегорииНачисленийТекущегоПериода
	|ИЗ
	|	(ВЫБРАТЬ
	|		Начислено.ФизЛицо КАК ФизЛицо,
	|		МАКСИМУМ(Начислено.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|		Начислено.ТипДоговора КАК ТипДоговора
	|	ИЗ
	|		ВТНачисленоЗаОтчетныйПериодФормирования КАК Начислено
	|	ГДЕ
	|		(Начислено.ПФРНакопительная <> 0
	|				ИЛИ Начислено.ПФРСтраховая <> 0)
	|		И НЕ Начислено.КатегорияЗастрахованныхЛиц В (&МассивКатегорийИностранцев)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Начислено.ФизЛицо,
	|		Начислено.ТипДоговора) КАК Начислено
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо,
	|	Начислено.КатегорияЗастрахованныхЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УплатыПринятыеПФР.ФизЛицо,
	|	УплатыПринятыеПФР.КатегорияЗастрахованныхЛиц,
	|	УплатыПринятыеПФР.ТипДоговора,
	|	УплатыПринятыеПФР.Накопительная,
	|	УплатыПринятыеПФР.Страховая
	|ПОМЕСТИТЬ ВТЗадолженностьПрошлогоПериода
	|ИЗ
	|	ВТНедоуплаченоЗаПрошлыеПериоды КАК УплатыПринятыеПФР
	|ГДЕ
	|	НЕ УплатыПринятыеПФР.ФизЛицо В
	|				(ВЫБРАТЬ
	|					ФизЛица.ФизЛицо
	|				ИЗ
	|					ВТКатегорииНачисленийТекущегоПериода КАК ФизЛица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо,
	|	Начислено.КатегорияЗастрахованныхЛиц,
	|	МАКСИМУМ(Начислено.ТипДоговора) КАК ТипДоговора
	|ПОМЕСТИТЬ ВТКатегорииНачисленийПрошлогоПериода
	|ИЗ
	|	(ВЫБРАТЬ
	|		Начислено.ФизЛицо КАК ФизЛицо,
	|		МАКСИМУМ(Начислено.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|		Начислено.ТипДоговора КАК ТипДоговора
	|	ИЗ
	|		ВТЗадолженностьПрошлогоПериода КАК Начислено
	|	ГДЕ
	|		(Начислено.Накопительная <> 0
	|				ИЛИ Начислено.Страховая <> 0)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Начислено.ФизЛицо,
	|		Начислено.ТипДоговора) КАК Начислено
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо,
	|	Начислено.КатегорияЗастрахованныхЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НедоуплаченоЗаПрошлыеПериоды.ФизЛицо КАК ФизЛицо,
	|	КатегорииНачисленийТекущегоПериода.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	КатегорииНачисленийТекущегоПериода.ТипДоговора КАК ТипДоговора,
	|	СУММА(НедоуплаченоЗаПрошлыеПериоды.Накопительная) * КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная / 100000 КАК УплаченоНакопительная,
	|	СУММА(НедоуплаченоЗаПрошлыеПериоды.Страховая) * КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая / 100000 КАК УплаченоСтраховая,
	|	0 КАК НачисленоСтраховая,
	|	0 КАК НачисленоНакопительная,
	|	""Прошлые периоды"" КАК ВидСтроки
	|ПОМЕСТИТЬ ВТРасчетСумм
	|ИЗ
	|	ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКатегорииНачисленийТекущегоПериода КАК КатегорииНачисленийТекущегоПериода
	|		ПО НедоуплаченоЗаПрошлыеПериоды.ФизЛицо = КатегорииНачисленийТекущегоПериода.ФизЛицо
	|ГДЕ
	|	(НедоуплаченоЗаПрошлыеПериоды.Накопительная <> 0
	|			ИЛИ НедоуплаченоЗаПрошлыеПериоды.Страховая <> 0)
	|	И НедоуплаченоЗаПрошлыеПериоды.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.ФизЛицо
	|			ИЗ
	|				ВТКатегорииНачисленийТекущегоПериода КАК ФизЛица)
	|
	|СГРУППИРОВАТЬ ПО
	|	НедоуплаченоЗаПрошлыеПериоды.ФизЛицо,
	|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная,
	|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая,
	|	КатегорииНачисленийТекущегоПериода.КатегорияЗастрахованныхЛиц,
	|	КатегорииНачисленийТекущегоПериода.ТипДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадолженностьПрошлогоПериода.ФизЛицо,
	|	КатегорииНачисленийПрошлогоПериода.КатегорияЗастрахованныхЛиц,
	|	КатегорииНачисленийПрошлогоПериода.ТипДоговора,
	|	СУММА(ЗадолженностьПрошлогоПериода.Накопительная) * КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная / 100000,
	|	СУММА(ЗадолженностьПрошлогоПериода.Страховая) * КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая / 100000,
	|	0,
	|	0,
	|	""Прошлые периоды""
	|ИЗ
	|	ВТЗадолженностьПрошлогоПериода КАК ЗадолженностьПрошлогоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКатегорииНачисленийПрошлогоПериода КАК КатегорииНачисленийПрошлогоПериода
	|		ПО ЗадолженностьПрошлогоПериода.ФизЛицо = КатегорииНачисленийПрошлогоПериода.ФизЛицо
	|ГДЕ
	|	(ЗадолженностьПрошлогоПериода.Накопительная <> 0
	|			ИЛИ ЗадолженностьПрошлогоПериода.Страховая <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадолженностьПрошлогоПериода.ФизЛицо,
	|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная,
	|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая,
	|	КатегорииНачисленийПрошлогоПериода.КатегорияЗастрахованныхЛиц,
	|	КатегорииНачисленийПрошлогоПериода.ТипДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачисленоПоЗЛ.ФизЛицо,
	|	НачисленоПоЗЛ.КатегорияЗастрахованныхЛиц,
	|	НачисленоПоЗЛ.ТипДоговора,
	|	НачисленоПоЗЛ.ПФРНакопительная * КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная / 100000,
	|	НачисленоПоЗЛ.ПФРСтраховая * КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая / 100000,
	|	НачисленоПоЗЛ.ПФРСтраховая,
	|	НачисленоПоЗЛ.ПФРНакопительная,
	|	""Текущий период""
	|ИЗ
	|	ВТНачисленоЗаОтчетныйПериодФормирования КАК НачисленоПоЗЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	(НачисленоПоЗЛ.ПФРНакопительная <> 0
	|			ИЛИ НачисленоПоЗЛ.ПФРСтраховая <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Доходы.ФизЛицо,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц),
	|	Доходы.ТипДоговора,
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(Доходы.ОблагаемаяБазаПФР * (РазмерыТарифныхСтавок.ПФР - ВЫБОР
	|			КОГДА Доходы.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ) / 100 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(Доходы.ОблагаемаяБазаПФР * ВЫБОР
	|			КОГДА Доходы.ГодРождения < 1967
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|				ТОГДА 0
	|			КОГДА Доходы.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|				ТОГДА 0
	|			ИНАЧЕ РазмерыТарифныхСтавок.ПФРНакопительная
	|		КОНЕЦ / 100 КАК ЧИСЛО(15, 2)),
	|	""Текущий период""
	|ИЗ
	|	(ВЫБРАТЬ
	|		Доходы.ФизЛицо КАК ФизЛицо,
	|		Доходы.ТипДоговора КАК ТипДоговора,
	|		Доходы.ГодРождения КАК ГодРождения,
	|		Доходы.ВидЗастрахованногоЛица КАК ВидЗастрахованногоЛица,
	|		Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		СУММА(Доходы.ОблагаемаяБазаПФР - Доходы.СуммаПревысившаяПредел) КАК ОблагаемаяБазаПФР
	|	ИЗ
	|		ВТДоходыВзносов КАК Доходы
	|	ГДЕ
	|		Доходы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Доходы.ГодРождения,
	|		Доходы.ФизЛицо,
	|		Доходы.ВидЗастрахованногоЛица,
	|		Доходы.ВидТарифаСтраховыхВзносов,
	|		Доходы.ТипДоговора) КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|		ПО (РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО (&ОтчетныйГод МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|			И Доходы.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И Доходы.ВидЗастрахованногоЛица = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Уплачено.УчтеноУплатыСтраховая КАК Страховая,
	|	Уплачено.УчтеноУплатыНакопительная КАК Накопительная
	|ИЗ
	|	ВТКоэффициентыУплаты КАК Уплачено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоСтраховая КАК ЧИСЛО(15, 2))), 0) КАК Страховая,
	|	ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоНакопительная КАК ЧИСЛО(15, 2))), 0) КАК Накопительная
	|ИЗ
	|	ВТРасчетСумм КАК РасчетныеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
	|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	РасчетныеДанные.ТипДоговора,
	|	СУММА(РасчетныеДанные.УплаченоНакопительная) КАК УплаченоНакопительная,
	|	СУММА(РасчетныеДанные.УплаченоСтраховая) КАК УплаченоСтраховая,
	|	СУММА(РасчетныеДанные.НачисленоСтраховая) КАК НачисленоСтраховая,
	|	СУММА(РасчетныеДанные.НачисленоНакопительная) КАК НачисленоНакопительная
	|ИЗ
	|	ВТРасчетСумм КАК РасчетныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетныеДанные.ФизЛицо,
	|	РасчетныеДанные.КатегорияЗастрахованныхЛиц,
	|	РасчетныеДанные.ТипДоговора
	|
	|ИМЕЮЩИЕ
	|	(СУММА(РасчетныеДанные.УплаченоНакопительная) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.УплаченоСтраховая) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.НачисленоСтраховая) <> 0
	|		ИЛИ СУММА(РасчетныеДанные.НачисленоНакопительная) <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	Результаты = Запрос.ВыполнитьПакет();
	ВсегоЗапросов = Результаты.Количество();
	РезультатЗапроса = Результаты[ВсегоЗапросов - 1].Выгрузить();
	Распределено = Результаты[ВсегоЗапросов - 2].Выбрать();
	Распределено.Следующий();
	Зарегистрировано = Результаты[ВсегоЗапросов - 3].Выбрать();
	Зарегистрировано.Следующий();
	
	Если Зарегистрировано.Страховая <> Распределено.Страховая Или Зарегистрировано.Накопительная <> Распределено.Накопительная Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
		|	РасчетныеДанные.ТипДоговора,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(РасчетныеДанные.УплаченоНакопительная) КАК УплаченоНакопительная,
		|	СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоНакопительная КАК ЧИСЛО(15, 2))) КАК Итог
		|ИЗ
		|	ВТРасчетСумм КАК РасчетныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетныеДанные.ФизЛицо,
		|	РасчетныеДанные.ТипДоговора,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетныеДанные.УплаченоНакопительная) <> 0 Или
		|	СУММА(РасчетныеДанные.НачисленоНакопительная) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
		|	РасчетныеДанные.ТипДоговора,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	СУММА(РасчетныеДанные.УплаченоСтраховая) КАК УплаченоСтраховая,
		|	СУММА(ВЫРАЗИТЬ(РасчетныеДанные.УплаченоСтраховая КАК ЧИСЛО(15, 2))) КАК Итог
		|ИЗ
		|	ВТРасчетСумм КАК РасчетныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетныеДанные.ФизЛицо,
		|	РасчетныеДанные.ТипДоговора,
		|	РасчетныеДанные.КатегорияЗастрахованныхЛиц
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетныеДанные.УплаченоСтраховая) <> 0 Или
		|	СУММА(РасчетныеДанные.НачисленоСтраховая) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо";
		
		Результаты = Запрос.ВыполнитьПакет();
		ВсегоЗапросов = Результаты.Количество();
		СтруктураПоиска = Новый Структура("ФизЛицо,КатегорияЗастрахованныхЛиц,ТипДоговора"); 
		Если Зарегистрировано.Страховая <> Распределено.Страховая Тогда
			Расхождение = Зарегистрировано.Страховая - Распределено.Страховая;
			ВременнаяТаблица = Результаты[ВсегоЗапросов - 1].Выгрузить();
			ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"УплаченоСтраховая", ВременнаяТаблица.Итог("Итог") + Расхождение, 2, "ФизЛицо,КатегорияЗастрахованныхЛиц,ТипДоговора");
			Для каждого СтрокаТЧ Из ВременнаяТаблица Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
				РезультатЗапроса.НайтиСтроки(СтруктураПоиска)[0].УплаченоСтраховая = СтрокаТЧ.УплаченоСтраховая;
			КонецЦикла;
		КонецЕсли;
		Если Зарегистрировано.Накопительная <> Распределено.Накопительная Тогда
			Расхождение = Зарегистрировано.Накопительная - Распределено.Накопительная;
			ВременнаяТаблица = Результаты[ВсегоЗапросов - 2].Выгрузить();
			ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"УплаченоНакопительная", ВременнаяТаблица.Итог("Итог") + Расхождение, 2, "ФизЛицо,КатегорияЗастрахованныхЛиц,ТипДоговора");
			Для каждого СтрокаТЧ Из ВременнаяТаблица Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
				РезультатЗапроса.НайтиСтроки(СтруктураПоиска)[0].УплаченоНакопительная = СтрокаТЧ.УплаченоНакопительная;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из РезультатЗапроса Цикл
		СтрокаТЧ.УплаченоСтраховая = Окр(СтрокаТЧ.УплаченоСтраховая, 2);
		СтрокаТЧ.УплаченоНакопительная = Окр(СтрокаТЧ.УплаченоНакопительная, 2);
	КонецЦикла;
	
	Если МассивФизлиц <> Неопределено Тогда
		Запрос.УстановитьПараметр("РезультатЗапроса", РезультатЗапроса);
		Запрос.УстановитьПараметр("МассивФизлиц", МассивФизлиц);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетСумм.ФизЛицо КАК ФизЛицо,
		|	РасчетСумм.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	РасчетСумм.ТипДоговора КАК ТипДоговора,
		|	РасчетСумм.УплаченоНакопительная,
		|	РасчетСумм.УплаченоСтраховая,
		|	РасчетСумм.НачисленоСтраховая,
		|	РасчетСумм.НачисленоНакопительная
		|ПОМЕСТИТЬ ВТРезультатЗапроса
		|ИЗ
		|	&РезультатЗапроса КАК РасчетСумм
		|ГДЕ
		|	РасчетСумм.ФизЛицо В(&МассивФизлиц)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатЗапроса.ФизЛицо КАК ФизЛицо,
		|	РезультатЗапроса.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	РезультатЗапроса.ТипДоговора КАК ТипДоговора,
		|	РезультатЗапроса.УплаченоНакопительная,
		|	РезультатЗапроса.УплаченоСтраховая,
		|	РезультатЗапроса.НачисленоСтраховая,
		|	РезультатЗапроса.НачисленоНакопительная
		|ИЗ
		|	ВТРезультатЗапроса КАК РезультатЗапроса
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизЛицо,
		|	КатегорияЗастрахованныхЛиц";
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если КомментироватьРасчет Тогда
		Запрос.УстановитьПараметр("РезультатЗапроса", РезультатЗапроса);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетСумм.ФизЛицо,
		|	РасчетСумм.ТипДоговора КАК ТипДоговора,
		|	РасчетСумм.КатегорияЗастрахованныхЛиц,
		|	РасчетСумм.УплаченоНакопительная,
		|	РасчетСумм.УплаченоСтраховая,
		|	РасчетСумм.НачисленоСтраховая,
		|	РасчетСумм.НачисленоНакопительная
		|ПОМЕСТИТЬ ВТРасчетСуммСПодгонкой
		|ИЗ
		|	&РезультатЗапроса КАК РасчетСумм";
		Запрос.Выполнить();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоэффициентыУплаты.Накопительная,
		|	КоэффициентыУплаты.Страховая,
		|	КоэффициентыУплаты.ПФРСтраховаяПриход,
		|	КоэффициентыУплаты.ПФРНакопительнаяПриход,
		|	КоэффициентыУплаты.ПФРСтраховаяРасход КАК ВсегоУплаченоСтраховая,
		|	КоэффициентыУплаты.ПФРНакопительнаяРасход КАК ВсегоУплаченоНакопительная,
		|	ЕСТЬNULL(Уплата.ПФРСтраховаяРасход, 0) КАК ЗачтенаПереплатаСтраховая,
		|	ЕСТЬNULL(Уплата.ПФРНакопительнаяРасход, 0) КАК ЗачтенаПереплатаНакопительная,
		|	КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая,
		|	КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная,
		|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая,
		|	КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|ИЗ
		|	ВТКоэффициентыУплаты КАК КоэффициентыУплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ВсегоУплачено.ПФРСтраховаяРасход) КАК ПФРСтраховаяРасход,
		|			СУММА(ВсегоУплачено.ПФРНакопительнаяРасход) КАК ПФРНакопительнаяРасход
		|		ИЗ
		|			ВТВсегоУплачено КАК ВсегоУплачено
		|		ГДЕ
		|			ВсегоУплачено.ВидСтроки = ""Переплата"") КАК Уплата
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НедоуплаченоЗаПрошлыеПериоды.ФизЛицо.Наименование КАК ФИО,
		|	НедоуплаченоЗаПрошлыеПериоды.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	НедоуплаченоЗаПрошлыеПериоды.ТипДоговора КАК ТипДоговора,
		|	НедоуплаченоЗаПрошлыеПериоды.Накопительная,
		|	НедоуплаченоЗаПрошлыеПериоды.Страховая
		|ИЗ
		|	ВТНедоуплаченоЗаПрошлыеПериоды КАК НедоуплаченоЗаПрошлыеПериоды
		|ГДЕ
		|	(НедоуплаченоЗаПрошлыеПериоды.Накопительная > 0
		|			ИЛИ НедоуплаченоЗаПрошлыеПериоды.Страховая > 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	КатегорияЗастрахованныхЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСПодгонкой.ВидСтроки КАК Период,
		|	ДанныеСПодгонкой.ФизЛицо КАК ФизЛицо,
		|	ДанныеСПодгонкой.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	ДанныеСПодгонкой.ТипДоговора КАК ТипДоговора,
		|	СУММА(ДанныеСПодгонкой.УплаченоНакопительная) КАК УплаченоНакопительная,
		|	СУММА(ДанныеСПодгонкой.УплаченоСтраховая) КАК УплаченоСтраховая,
		|	СУММА(ДанныеСПодгонкой.НачисленоСтраховая) КАК НачисленоСтраховая,
		|	СУММА(ДанныеСПодгонкой.НачисленоНакопительная) КАК НачисленоНакопительная,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая
		|	КОНЕЦ КАК КоэффициентУплатыСтраховая,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|	КОНЕЦ КАК КоэффициентУплатыНакопительная
		|ИЗ
		|	(ВЫБРАТЬ
		|		""Текущий период"" КАК ВидСтроки,
		|		РасчетСумм.ФизЛицо КАК ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|		РасчетСумм.ТипДоговора КАК ТипДоговора,
		|		-РасчетСумм.УплаченоНакопительная КАК УплаченоНакопительная,
		|		-РасчетСумм.УплаченоСтраховая КАК УплаченоСтраховая,
		|		-РасчетСумм.НачисленоСтраховая КАК НачисленоСтраховая,
		|		-РасчетСумм.НачисленоНакопительная КАК НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСумм КАК РасчетСумм
		|	ГДЕ
		|		РасчетСумм.ВидСтроки = ""Прошлые периоды""
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		""Текущий период"",
		|		РасчетСумм.ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц,
		|		РасчетСумм.ТипДоговора,
		|		РасчетСумм.УплаченоНакопительная,
		|		РасчетСумм.УплаченоСтраховая,
		|		РасчетСумм.НачисленоСтраховая,
		|		РасчетСумм.НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСуммСПодгонкой КАК РасчетСумм
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетСумм.ВидСтроки,
		|		РасчетСумм.ФизЛицо,
		|		РасчетСумм.КатегорияЗастрахованныхЛиц,
		|		РасчетСумм.ТипДоговора,
		|		РасчетСумм.УплаченоНакопительная,
		|		РасчетСумм.УплаченоСтраховая,
		|		РасчетСумм.НачисленоСтраховая,
		|		РасчетСумм.НачисленоНакопительная
		|	ИЗ
		|		ВТРасчетСумм КАК РасчетСумм
		|	ГДЕ
		|		РасчетСумм.ВидСтроки = ""Прошлые периоды"") КАК ДанныеСПодгонкой
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыУплаты КАК КоэффициентыУплаты
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеСПодгонкой.ВидСтроки,
		|	ДанныеСПодгонкой.ФизЛицо,
		|	ДанныеСПодгонкой.КатегорияЗастрахованныхЛиц,
		|	ДанныеСПодгонкой.ТипДоговора,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаСтраховая
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовСтраховая
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДанныеСПодгонкой.ВидСтроки = ""Текущий период""
		|			ТОГДА КоэффициентыУплаты.КоэффициентТекущегоПериодаНакопительная
		|		ИНАЧЕ КоэффициентыУплаты.КоэффициентПрошлыхПериодовНакопительная
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипДоговора,
		|	КатегорияЗастрахованныхЛиц,
		|	ФизЛицо,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УплатыПринятыеПФР.ФизЛицо.Наименование КАК ФИО,
		|	УплатыПринятыеПФР.ТипДоговора КАК ТипДоговора,
		|	УплатыПринятыеПФР.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	ВЫБОР
		|		КОГДА УплатыПринятыеПФР.УплаченоНакопительная > УплатыПринятыеПФР.НачисленоНакопительная
		|			ТОГДА УплатыПринятыеПФР.УплаченоНакопительная - УплатыПринятыеПФР.НачисленоНакопительная
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Накопительная,
		|	ВЫБОР
		|		КОГДА УплатыПринятыеПФР.УплаченоСтраховая > УплатыПринятыеПФР.НачисленоСтраховая
		|			ТОГДА УплатыПринятыеПФР.УплаченоСтраховая - УплатыПринятыеПФР.НачисленоСтраховая
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Страховая
		|ИЗ
		|	ВТУплатыПринятыеПФР КАК УплатыПринятыеПФР
		|ГДЕ
		|	УплатыПринятыеПФР.ФизЛицо В
		|			(ВЫБРАТЬ
		|				ФизЛица.ФизЛицо
		|			ИЗ
		|				ВТФизлицаСПереплатой КАК ФизЛица)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО,
		|	КатегорияЗастрахованныхЛиц";
		
		РезультатыДляКомментирования = Запрос.ВыполнитьПакет();
		ТЗИтоги = РезультатыДляКомментирования[0].Выгрузить();
		ТЗПрошлыеПериоды = РезультатыДляКомментирования[1].Выгрузить();
		ТЗПрошлыеПериоды.Колонки.КатегорияЗастрахованныхЛиц.Заголовок = "Категория ЗЛ";
		ТЗПрошлыеПериоды.Колонки.ТипДоговора.Заголовок = "Тип договора";
		ТЗСотрудников = РезультатыДляКомментирования[2].Выгрузить();
		ТЗСотрудников.Колонки.НачисленоСтраховая.Заголовок = "Начислено";
		ТЗСотрудников.Колонки.КоэффициентУплатыСтраховая.Заголовок = "Коэффициент уплаты";
		ТЗСотрудников.Колонки.УплаченоСтраховая.Заголовок = "Уплачено";
		ТЗСотрудников.Колонки.НачисленоНакопительная.Заголовок = "Начислено";
		ТЗСотрудников.Колонки.КоэффициентУплатыНакопительная.Заголовок = "Коэффициент уплаты";
		ТЗСотрудников.Колонки.УплаченоНакопительная.Заголовок = "Уплачено";
		Для каждого СтрокаТЗ Из ТЗСотрудников Цикл
		    СтрокаТЗ.КоэффициентУплатыСтраховая = Формат(СтрокаТЗ.КоэффициентУплатыСтраховая / 100000,"ЧДЦ=10; ЧН=-");
		    СтрокаТЗ.КоэффициентУплатыНакопительная = Формат(СтрокаТЗ.КоэффициентУплатыНакопительная / 100000,"ЧДЦ=10; ЧН=-");
		КонецЦикла;
		ТЗПереплаты = РезультатыДляКомментирования[3].Выгрузить();
		ТЗПереплаты.Колонки.КатегорияЗастрахованныхЛиц.Заголовок = "Категория ЗЛ";
		ТЗПереплаты.Колонки.ТипДоговора.Заголовок = "Тип договора";
		
		ДанныеКомментирования.Итоги = ТЗИтоги;
		ДанныеКомментирования.ПрошлыеПериоды = ТЗПрошлыеПериоды;
		ДанныеКомментирования.РасчетСотрудников = ТЗСотрудников;
		ДанныеКомментирования.Переплаты = ТЗПереплаты;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Возврат РезультатЗапроса;
	
КонецФункции


Функция ДанныеОСтажеИВзносах(ДатаАктуальности, ОтчетныйПериод, Организация, МассивФизлиц = Неопределено, КомментироватьРасчет = Ложь, ДанныеКомментирования = Неопределено, ВРазрезеТипаДоговора = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НеОтбиратьФизлиц", Не ЗначениеЗаполнено(МассивФизлиц));
	Запрос.УстановитьПараметр("ТаблицаВзносов",	ДанныеОВзносахПоКатегориям(ДатаАктуальности, ОтчетныйПериод, ОтчетныйПериод, Организация, МассивФизлиц, КомментироватьРасчет, ДанныеКомментирования));
	Если МассивФизлиц = Неопределено Тогда
		МассивФизлиц = Новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивФизлиц", МассивФизлиц);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СуммыВзносов.ФизЛицо КАК ФизЛицо,
	|	СуммыВзносов.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	СуммыВзносов.ТипДоговора КАК ТипДоговора,
	|	СуммыВзносов.НачисленоНакопительная,
	|	СуммыВзносов.НачисленоСтраховая,
	|	СуммыВзносов.УплаченоСтраховая,
	|	СуммыВзносов.УплаченоНакопительная
	|ПОМЕСТИТЬ ВТСуммыВзносов
	|ИЗ
	|	&ТаблицаВзносов КАК СуммыВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц,
	|	ТипДоговора";
	Если Не ВРазрезеТипаДоговора Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"СуммыВзносов.ТипДоговора","ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ПустаяСсылка)");
	КонецЕсли;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиОСтаже.ФизЛицо КАК ФизЛицо,
	|	ЗаписиОСтаже.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	ЗаписиОСтаже.ТипДоговора КАК ТипДоговора,
	|	ЗаписиОСтаже.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|	ЗаписиОСтаже.ТретийПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ОсобыеУсловияТруда,
	|	ЗаписиОСтаже.КодПозицииСписка,
	|	ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ОснованиеВыслугиЛет,
	|	ЗаписиОСтаже.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ЗаписиОСтаже.ФизЛицо.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	РегистрСведений.ЗаписиОСтажеДляСЗВ4 КАК ЗаписиОСтаже
	|ГДЕ
	|	ЗаписиОСтаже.ОтчетныйПериод = &ОтчетныйПериод
	|	И ЗаписиОСтаже.ОбособленноеПодразделение = &Организация
	|	И (&НеОтбиратьФизлиц
	|			ИЛИ ЗаписиОСтаже.ФизЛицо В (&МассивФизлиц))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц,
	|	ТипДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ПОМЕСТИТЬ ВТФИО
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			&ДатаАктуальности,
	|			ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизЛица КАК Лица
	|			
	|				ОБЪЕДИНИТЬ ВСЕ
	|			
	|				ВЫБРАТЬ
	|					Лица.ФизЛицо
	|				ИЗ
	|					ВТСуммыВзносов КАК Лица)) КАК ФИОФизЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиОСтаже.ФизЛицо КАК ФизЛицо,
	|	ЗаписиОСтаже.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	ЗаписиОСтаже.ТипДоговора,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаписиОСтаже.ОсобыеУсловияТруда <> ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЛьготыПоУсловиямТруда,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаписиОСтаже.ОсобыеУсловияТруда = ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|					И (ЗаписиОСтаже.ОснованиеВыслугиЛет <> ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)
	|						ИЛИ ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа <> ЗНАЧЕНИЕ(Справочник.ОснованияИсчисляемогоТрудовогоСтажа.ПустаяСсылка))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЛьготыПоВыслуге,
	|	МАКСИМУМ(ЗаписиОСтаже.ТерриториальныеУсловия.Код) КАК ТерриториальныеУсловия
	|ПОМЕСТИТЬ ВТФизЛицаСЗВ61
	|ИЗ
	|	ВТФизЛица КАК ЗаписиОСтаже
	|ГДЕ
	|	(ЗаписиОСтаже.ОсобыеУсловияТруда <> ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ТерриториальныеУсловия <> ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ОснованиеВыслугиЛет <> ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа <> ЗНАЧЕНИЕ(Справочник.ОснованияИсчисляемогоТрудовогоСтажа.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ТретийПараметрИсчисляемогоСтажа <> """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписиОСтаже.КатегорияЗастрахованныхЛиц,
	|	ЗаписиОСтаже.ТипДоговора,
	|	ЗаписиОСтаже.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаписиОСтаже.ОсобыеУсловияТруда) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизЛица.ФизЛицо КАК ФизЛицо,
	|	ФизЛица.ФизЛицо.Наименование КАК Наименование,
	|	ФизЛица.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ФизЛица.ТипДоговора КАК ТипДоговора,
	|	ФизЛица.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	ФизЛица.КатегорияЗастрахованныхЛиц.Порядок КАК ПорядокКатегорий
	|ПОМЕСТИТЬ ВТФизлицаПоКатегориямЗЛ
	|ИЗ
	|	ВТФизЛица КАК ФизЛица
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсчисленоПоКатегориямЗЛ.ФизЛицо,
	|	ИсчисленоПоКатегориямЗЛ.ФизЛицо.Наименование,
	|	ИсчисленоПоКатегориямЗЛ.ФизЛицо.СтраховойНомерПФР,
	|	ИсчисленоПоКатегориямЗЛ.ТипДоговора,
	|	ИсчисленоПоКатегориямЗЛ.КатегорияЗастрахованныхЛиц,
	|	ИсчисленоПоКатегориямЗЛ.КатегорияЗастрахованныхЛиц.Порядок
	|ИЗ
	|	ВТСуммыВзносов КАК ИсчисленоПоКатегориямЗЛ
	|ГДЕ
	|	(ИсчисленоПоКатегориямЗЛ.НачисленоНакопительная > 0
	|			ИЛИ ИсчисленоПоКатегориямЗЛ.НачисленоСтраховая > 0
	|			ИЛИ ИсчисленоПоКатегориямЗЛ.УплаченоСтраховая > 0
	|			ИЛИ ИсчисленоПоКатегориямЗЛ.УплаченоНакопительная > 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц,
	|	ТипДоговора";
	Запрос.Выполнить();
	
	Если ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
		
		// адреса для информирования заполняем только в том случае, когда они изменились по сравнению с последними
		// передававшимися в ПФР
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо КАК ФизЛицо,
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка,
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Дата,
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.АдресДляИнформирования,
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ЗаполненПринятымиСведениями
		|ПОМЕСТИТЬ ВТПереданныеВПФРДокументы
		|ИЗ
		|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
		|ГДЕ
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.АдресДляИнформирования <> """"
		|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Организация = &Организация
		|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Проведен
		|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ПринятоВПФР
		|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Дата <= &ДатаАктуальности
		|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо В
		|			(ВЫБРАТЬ
		|				ФизЛица.ФизЛицо
		|			ИЗ
		|				ВТФизЛица КАК ФизЛица)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДатыДокументов.ФизЛицо КАК ФизЛицо,
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.АдресДляИнформирования КАК АдресДляИнформирования
		|ПОМЕСТИТЬ ВТПереданныеВПФРАдреса
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДатыДокументов.ФизЛицо КАК ФизЛицо,
		|		МАКСИМУМ(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка) КАК Ссылка
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ДатыДокументов.Дата КАК Дата,
		|			ДатыДокументов.ФизЛицо КАК ФизЛицо,
		|			МАКСИМУМ(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ЗаполненПринятымиСведениями) КАК ЗаполненПринятымиСведениями
		|		ИЗ
		|			(ВЫБРАТЬ
		|				МАКСИМУМ(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Дата) КАК Дата,
		|				СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо КАК ФизЛицо
		|			ИЗ
		|				ВТПереданныеВПФРДокументы КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
		|			
		|			СГРУППИРОВАТЬ ПО
		|				СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо) КАК ДатыДокументов
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТПереданныеВПФРДокументы КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
		|				ПО ДатыДокументов.Дата = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Дата
		|					И ДатыДокументов.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ДатыДокументов.Дата,
		|			ДатыДокументов.ФизЛицо) КАК ДатыДокументов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПереданныеВПФРДокументы КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
		|			ПО ДатыДокументов.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
		|				И ДатыДокументов.Дата = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Дата
		|				И ДатыДокументов.ЗаполненПринятымиСведениями = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ЗаполненПринятымиСведениями
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДатыДокументов.ФизЛицо) КАК ДатыДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПереданныеВПФРДокументы КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
		|		ПО ДатыДокументов.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
		|			И ДатыДокументов.Ссылка = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизЛица.ФизЛицо КАК ФизЛицо,
		|	ФизЛица.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	ФизЛица.ТипДоговора КАК ТипДоговора,
		|	ФизЛица.ПорядокКатегорий КАК ПорядокКатегорий,
		|	ЕСТЬNULL(ФизЛицаСЗВ61.ЛьготыПоУсловиямТруда, ЛОЖЬ) КАК ЛьготыПоУсловиямТруда,
		|	ЕСТЬNULL(ФизЛицаСЗВ61.ЛьготыПоВыслуге, ЛОЖЬ) КАК ЛьготыПоВыслуге,
		|	ФизЛица.Наименование КАК Наименование,
		|	ФизЛица.СтраховойНомерПФР,
		|	ВЫБОР
		|		КОГДА ФизЛица.СтраховойНомерПФР = """"
		|			ТОГДА ИСТИНА
		|		КОГДА ФизЛица.СтраховойНомерПФР = ""   -   -      ""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НетСтраховогоНомера,
		|	ВЫБОР
		|		КОГДА ФизЛицаСЗВ61.ФизЛицо ЕСТЬ НЕ NULL 
		|			ТОГДА ""СЗВ-6-1""
		|		ИНАЧЕ ""СЗВ-6-2""
		|	КОНЕЦ КАК ТипФормДокументов,
		|	ВЫБОР
		|		КОГДА ПереданныеВПФРАдреса.АдресДляИнформирования ЕСТЬ NULL 
		|			ТОГДА ВЫБОР
		|					КОГДА АдресаДляИнформирования.Поле1 ЕСТЬ НЕ NULL 
		|						ТОГДА "","" + АдресаДляИнформирования.Поле1 + "","" + АдресаДляИнформирования.Поле2 + "","" + АдресаДляИнформирования.Поле3 + "","" + АдресаДляИнформирования.Поле4 + "","" + АдресаДляИнформирования.Поле5 + "","" + АдресаДляИнформирования.Поле6 + "","" + АдресаДляИнформирования.Поле7 + "","" + АдресаДляИнформирования.Поле8 + "","" + АдресаДляИнформирования.Поле9 + "","" + ВЫБОР
		|								КОГДА АдресаДляИнформирования.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|									ТОГДА ""дом""
		|								ИНАЧЕ ""владение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаДляИнформирования.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|									ТОГДА ""корпус""
		|								ИНАЧЕ ""строение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаДляИнформирования.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|									ТОГДА ""кв.""
		|								ИНАЧЕ ""оф.""
		|							КОНЕЦ
		|					КОГДА АдресаФактические.Поле1 ЕСТЬ НЕ NULL 
		|						ТОГДА "","" + АдресаФактические.Поле1 + "","" + АдресаФактические.Поле2 + "","" + АдресаФактические.Поле3 + "","" + АдресаФактические.Поле4 + "","" + АдресаФактические.Поле5 + "","" + АдресаФактические.Поле6 + "","" + АдресаФактические.Поле7 + "","" + АдресаФактические.Поле8 + "","" + АдресаФактические.Поле9 + "","" + ВЫБОР
		|								КОГДА АдресаФактические.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|									ТОГДА ""дом""
		|								ИНАЧЕ ""владение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаФактические.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|									ТОГДА ""корпус""
		|								ИНАЧЕ ""строение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаФактические.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|									ТОГДА ""кв.""
		|								ИНАЧЕ ""оф.""
		|							КОНЕЦ
		|					КОГДА АдресаРегистрации.Поле1 ЕСТЬ НЕ NULL 
		|						ТОГДА "","" + АдресаРегистрации.Поле1 + "","" + АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 + "","" + ВЫБОР
		|								КОГДА АдресаРегистрации.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|									ТОГДА ""дом""
		|								ИНАЧЕ ""владение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаРегистрации.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|									ТОГДА ""корпус""
		|								ИНАЧЕ ""строение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаРегистрации.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|									ТОГДА ""кв.""
		|								ИНАЧЕ ""оф.""
		|							КОНЕЦ
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		КОГДА ВЫБОР
		|				КОГДА АдресаДляИнформирования.Поле1 ЕСТЬ НЕ NULL 
		|					ТОГДА "","" + АдресаДляИнформирования.Поле1 + "","" + АдресаДляИнформирования.Поле2 + "","" + АдресаДляИнформирования.Поле3 + "","" + АдресаДляИнформирования.Поле4 + "","" + АдресаДляИнформирования.Поле5 + "","" + АдресаДляИнформирования.Поле6 + "","" + АдресаДляИнформирования.Поле7 + "","" + АдресаДляИнформирования.Поле8 + "","" + АдресаДляИнформирования.Поле9 + "","" + ВЫБОР
		|							КОГДА АдресаДляИнформирования.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|								ТОГДА ""дом""
		|							ИНАЧЕ ""владение""
		|						КОНЕЦ + "","" + ВЫБОР
		|							КОГДА АдресаДляИнформирования.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|								ТОГДА ""корпус""
		|							ИНАЧЕ ""строение""
		|						КОНЕЦ + "","" + ВЫБОР
		|							КОГДА АдресаДляИнформирования.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|								ТОГДА ""кв.""
		|							ИНАЧЕ ""оф.""
		|						КОНЕЦ
		|				КОГДА АдресаФактические.Поле1 ЕСТЬ НЕ NULL 
		|					ТОГДА "","" + АдресаФактические.Поле1 + "","" + АдресаФактические.Поле2 + "","" + АдресаФактические.Поле3 + "","" + АдресаФактические.Поле4 + "","" + АдресаФактические.Поле5 + "","" + АдресаФактические.Поле6 + "","" + АдресаФактические.Поле7 + "","" + АдресаФактические.Поле8 + "","" + АдресаФактические.Поле9 + "","" + ВЫБОР
		|							КОГДА АдресаФактические.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|								ТОГДА ""дом""
		|							ИНАЧЕ ""владение""
		|						КОНЕЦ + "","" + ВЫБОР
		|							КОГДА АдресаФактические.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|								ТОГДА ""корпус""
		|							ИНАЧЕ ""строение""
		|						КОНЕЦ + "","" + ВЫБОР
		|							КОГДА АдресаФактические.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|								ТОГДА ""кв.""
		|							ИНАЧЕ ""оф.""
		|						КОНЕЦ
		|				КОГДА АдресаРегистрации.Поле1 ЕСТЬ НЕ NULL 
		|					ТОГДА "","" + АдресаРегистрации.Поле1 + "","" + АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 + "","" + ВЫБОР
		|							КОГДА АдресаРегистрации.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|								ТОГДА ""дом""
		|							ИНАЧЕ ""владение""
		|						КОНЕЦ + "","" + ВЫБОР
		|							КОГДА АдресаРегистрации.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|								ТОГДА ""корпус""
		|							ИНАЧЕ ""строение""
		|						КОНЕЦ + "","" + ВЫБОР
		|							КОГДА АдресаРегистрации.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|								ТОГДА ""кв.""
		|							ИНАЧЕ ""оф.""
		|						КОНЕЦ
		|				ИНАЧЕ """"
		|			КОНЕЦ <> ПереданныеВПФРАдреса.АдресДляИнформирования
		|			ТОГДА ВЫБОР
		|					КОГДА АдресаДляИнформирования.Поле1 ЕСТЬ НЕ NULL 
		|						ТОГДА "","" + АдресаДляИнформирования.Поле1 + "","" + АдресаДляИнформирования.Поле2 + "","" + АдресаДляИнформирования.Поле3 + "","" + АдресаДляИнформирования.Поле4 + "","" + АдресаДляИнформирования.Поле5 + "","" + АдресаДляИнформирования.Поле6 + "","" + АдресаДляИнформирования.Поле7 + "","" + АдресаДляИнформирования.Поле8 + "","" + АдресаДляИнформирования.Поле9 + "","" + ВЫБОР
		|								КОГДА АдресаДляИнформирования.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|									ТОГДА ""дом""
		|								ИНАЧЕ ""владение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаДляИнформирования.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|									ТОГДА ""корпус""
		|								ИНАЧЕ ""строение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаДляИнформирования.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|									ТОГДА ""кв.""
		|								ИНАЧЕ ""оф.""
		|							КОНЕЦ
		|					КОГДА АдресаФактические.Поле1 ЕСТЬ НЕ NULL 
		|						ТОГДА "","" + АдресаФактические.Поле1 + "","" + АдресаФактические.Поле2 + "","" + АдресаФактические.Поле3 + "","" + АдресаФактические.Поле4 + "","" + АдресаФактические.Поле5 + "","" + АдресаФактические.Поле6 + "","" + АдресаФактические.Поле7 + "","" + АдресаФактические.Поле8 + "","" + АдресаФактические.Поле9 + "","" + ВЫБОР
		|								КОГДА АдресаФактические.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|									ТОГДА ""дом""
		|								ИНАЧЕ ""владение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаФактические.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|									ТОГДА ""корпус""
		|								ИНАЧЕ ""строение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаФактические.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|									ТОГДА ""кв.""
		|								ИНАЧЕ ""оф.""
		|							КОНЕЦ
		|					КОГДА АдресаРегистрации.Поле1 ЕСТЬ НЕ NULL 
		|						ТОГДА "","" + АдресаРегистрации.Поле1 + "","" + АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + "","" + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + "","" + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 + "","" + ВЫБОР
		|								КОГДА АдресаРегистрации.ТипДома В (ЗНАЧЕНИЕ(Перечисление.ТипыДомов.Дом), ЗНАЧЕНИЕ(Перечисление.ТипыДомов.ПустаяСсылка))
		|									ТОГДА ""дом""
		|								ИНАЧЕ ""владение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаРегистрации.ТипКорпуса В (ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.Корпус), ЗНАЧЕНИЕ(Перечисление.ТипыКорпусов.ПустаяСсылка))
		|									ТОГДА ""корпус""
		|								ИНАЧЕ ""строение""
		|							КОНЕЦ + "","" + ВЫБОР
		|								КОГДА АдресаРегистрации.ТипКвартиры В (ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.Квартира), ЗНАЧЕНИЕ(Перечисление.ТипыКвартир.ПустаяСсылка))
		|									ТОГДА ""кв.""
		|								ИНАЧЕ ""оф.""
		|							КОНЕЦ
		|					ИНАЧЕ """"
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК АдресДляИнформирования,
		|	ЕСТЬNULL(ФИО.Фамилия, """") КАК Фамилия,
		|	ЕСТЬNULL(ФИО.Имя, """") КАК Имя,
		|	ЕСТЬNULL(ФИО.Отчество, """") КАК Отчество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоСтраховая, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоСтраховая, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачисленоСтраховая,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоНакопительная, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоНакопительная, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачисленоНакопительная,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоСтраховая, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоСтраховая, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УплаченоСтраховая,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоНакопительная, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоНакопительная, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УплаченоНакопительная,
		|	ФизЛицаСЗВ61.ТерриториальныеУсловия КАК ТерриториальныеУсловия
		|ИЗ
		|	ВТФизлицаПоКатегориямЗЛ КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСЗВ61 КАК ФизЛицаСЗВ61
		|		ПО ФизЛица.ФизЛицо = ФизЛицаСЗВ61.ФизЛицо
		|			И ФизЛица.КатегорияЗастрахованныхЛиц = ФизЛицаСЗВ61.КатегорияЗастрахованныхЛиц
		|			И ФизЛица.ТипДоговора = ФизЛицаСЗВ61.ТипДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
		|		ПО ФизЛица.ФизЛицо = АдресаФактические.Объект
		|			И (АдресаФактические.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресФизЛица))
		|			И (АдресаФактические.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
		|		ПО ФизЛица.ФизЛицо = АдресаРегистрации.Объект
		|			И (АдресаРегистрации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
		|			И (АдресаРегистрации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаДляИнформирования
		|		ПО ФизЛица.ФизЛицо = АдресаДляИнформирования.Объект
		|			И (АдресаДляИнформирования.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнформАдресФизЛица))
		|			И (АдресаДляИнформирования.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПереданныеВПФРАдреса КАК ПереданныеВПФРАдреса
		|		ПО ФизЛица.ФизЛицо = ПереданныеВПФРАдреса.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИО КАК ФИО
		|		ПО ФизЛица.ФизЛицо = ФИО.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыВзносов КАК ИсчисленоПоЗЛ
		|		ПО ФизЛица.ФизЛицо = ИсчисленоПоЗЛ.ФизЛицо
		|			И ФизЛица.КатегорияЗастрахованныхЛиц = ИсчисленоПоЗЛ.КатегорияЗастрахованныхЛиц
		|			И ФизЛица.ТипДоговора = ИсчисленоПоЗЛ.ТипДоговора
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипФормДокументов,
		|	ТипДоговора,
		|	ПорядокКатегорий,
		|	ТерриториальныеУсловия,
		|	ЛьготыПоУсловиямТруда,
		|	ЛьготыПоВыслуге,
		|	Наименование,
		|	ФизЛицо";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФизЛица.ФизЛицо КАК ФизЛицо,
		|	ФизЛица.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	ФизЛица.ТипДоговора КАК ТипДоговора,
		|	ФизЛица.ПорядокКатегорий КАК ПорядокКатегорий,
		|	ЕСТЬNULL(ФизЛицаСЗВ61.ЛьготыПоУсловиямТруда, ЛОЖЬ) КАК ЛьготыПоУсловиямТруда,
		|	ЕСТЬNULL(ФизЛицаСЗВ61.ЛьготыПоВыслуге, ЛОЖЬ) КАК ЛьготыПоВыслуге,
		|	ФизЛица.Наименование КАК Наименование,
		|	ФизЛица.СтраховойНомерПФР,
		|	ВЫБОР
		|		КОГДА ФизЛица.СтраховойНомерПФР = """"
		|			ТОГДА ИСТИНА
		|		КОГДА ФизЛица.СтраховойНомерПФР = ""   -   -      ""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НетСтраховогоНомера,
		|	""СЗВ-6-4"" КАК ТипФормДокументов,
		|	ЕСТЬNULL(ФИО.Фамилия, """") КАК Фамилия,
		|	ЕСТЬNULL(ФИО.Имя, """") КАК Имя,
		|	ЕСТЬNULL(ФИО.Отчество, """") КАК Отчество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоСтраховая, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоСтраховая, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачисленоСтраховая,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоНакопительная, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоНакопительная, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НачисленоНакопительная,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоСтраховая, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоСтраховая, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УплаченоСтраховая,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоНакопительная, 0) > 0
		|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоНакопительная, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК УплаченоНакопительная,
		|	ЕСТЬNULL(ФизЛицаСЗВ61.ТерриториальныеУсловия,"""") КАК ТерриториальныеУсловия
		|ИЗ
		|	ВТФизлицаПоКатегориямЗЛ КАК ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСЗВ61 КАК ФизЛицаСЗВ61
		|		ПО ФизЛица.ФизЛицо = ФизЛицаСЗВ61.ФизЛицо
		|			И ФизЛица.КатегорияЗастрахованныхЛиц = ФизЛицаСЗВ61.КатегорияЗастрахованныхЛиц
		|			И ФизЛица.ТипДоговора = ФизЛицаСЗВ61.ТипДоговора
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИО КАК ФИО
		|		ПО ФизЛица.ФизЛицо = ФИО.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыВзносов КАК ИсчисленоПоЗЛ
		|		ПО ФизЛица.ФизЛицо = ИсчисленоПоЗЛ.ФизЛицо
		|			И ФизЛица.КатегорияЗастрахованныхЛиц = ИсчисленоПоЗЛ.КатегорияЗастрахованныхЛиц
		|			И ФизЛица.ТипДоговора = ИсчисленоПоЗЛ.ТипДоговора
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипДоговора,
		|	ПорядокКатегорий,
		|	ТерриториальныеУсловия,
		|	ЛьготыПоУсловиямТруда,
		|	ЛьготыПоВыслуге,
		|	Наименование,
		|	ФизЛицо";
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // ДанныеОСтажеИВзносах()


Процедура СоздатьВТДанныеОДоходахЗаОтчетныеПериоды2013(МенеджерВременныхТаблиц, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора)
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(МенеджерВременныхТаблиц);
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(МенеджерВременныхТаблиц);
	РасчетСтраховыхВзносов.ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(МенеджерВременныхТаблиц);
	
	ДатаС = ПервыйОтчетныйПериод;
	ДатаПо = Мин(ДатаСозданияДокументов,ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПоследнийОтчетныйПериод));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("ОтчетныйГод", Год(ДатаС));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ДатаС));
	Запрос.УстановитьПараметр("Начало", ДатаС);
	Запрос.УстановитьПараметр("Окончание", ДатаПо);
	Запрос.УстановитьПараметр("ДатаНовойРедакцииЗакона212", ПроведениеРасчетов.ДатаРасширенияПеречняЛьготныхТарифовСтраховыхВзносов());
	Запрос.УстановитьПараметр("ДатаСтрахованияВременноПребывающих", ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов());
	Запрос.УстановитьПараметр("КатегорияЗастрахованныхЛиц", ОтборПоКатегорииЗастрахованныхЛиц);
	Запрос.УстановитьПараметр("ТипДоговора", ОтборПоТипуДоговора);
	Запрос.УстановитьПараметр("БезОтбораПоКатегорииЗастрахованныхЛиц", Не ЗначениеЗаполнено(ОтборПоКатегорииЗастрахованныхЛиц));
	Запрос.УстановитьПараметр("БезОтбораПоТипуДоговора", Не ЗначениеЗаполнено(ОтборПоТипуДоговора));
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());
	Запрос.УстановитьПараметр("НеучитываемыеВидыДохода", РасчетСтраховыхВзносов.НеучитываемыеВидыДохода());
	
	МассивВидовДохода = Новый Массив;
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.Матпомощь);
	Запрос.УстановитьПараметр("ВидыДохода", МассивВидовДохода);
	
	ДтНачМесяца = НачалоГода(ДатаС);
	ТекстПериодов = "ВЫБРАТЬ
	|	&НачалоГода КАК Период
	|ПОМЕСТИТЬ ВТПериоды";
	ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	Пока ДтНачМесяца <= ДатаПо Цикл
		ТекстПериодов =  ТекстПериодов + "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ("+Формат(ДтНачМесяца, "ДФ=yyyy")+", "+Месяц(ДтНачМесяца)+", 1) КАК Период
		|";
		ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	КонецЦИкла;
	Запрос.Текст = ТекстПериодов;
	Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(МассивФизлиц) Тогда
		Запрос.УстановитьПараметр("ФизЛица", МассивФизлиц);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка В(&ФизЛица)";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
		|			,
		|			,
		|			МЕСЯЦ,
		|			Организация = &ГоловнаяОрганизация
		|				И ОбособленноеПодразделение = &ОбособленноеПодразделение
		|				И (ДатаПолученияДохода МЕЖДУ &Начало И &Окончание)
		|				И НЕ ВидДохода В (&НеучитываемыеВидыДохода)
		|				И НЕ ВидДохода В (&НестрахуемыеВидыДохода)) КАК СтраховыеВзносыСведенияОДоходахОбороты";
	КонецЕсли;
	Запрос.Выполнить();
	
	ОсновнойТекст = 
	"ВЫБРАТЬ
	|	ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних.РазмерПФР КАК Размер
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.СрезПоследних(&Окончание, ) КАК ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК ПериодРегистрации,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК ПериодРегистрации,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО (КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ) >= СведенияОбИнвалидностиФизлиц.Период)
	|	ГДЕ
	|		СведенияОбИнвалидностиФизлиц.Физлицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизлица КАК Лица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК ПериодРегистрации,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию,
	|	ГражданствоФизЛиц.ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО (КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ) >= ГражданствоФизЛиц.Период)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизлица КАК Лица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлица КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
	|				И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|	ГДЕ
	|		Периоды.Период >= &ДатаСтрахованияВременноПребывающих
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		СписокСотрудников.ФизЛицо) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Организация,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода < &ДатаНовойРедакцииЗакона212
	|			ТОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОблагаетсяЕНВД,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СУММА(СтраховыеВзносыСведенияОДоходах.Результат) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходах.Скидка) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Лица.ФизЛицо КАК ФизЛицо
	|			ИЗ
	|				ВТФизлица КАК Лица)
	|	И СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &НачалоГода И &Окончание
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода В (&НеучитываемыеВидыДохода)
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Организация,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода < &ДатаНовойРедакцииЗакона212
	|			ТОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		КОГДА ВидыДеятельности.ТолькоДоходыФармацевтов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА ВидыДеятельности.ТолькоДоходыМоряков
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТТарифыОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Периоды.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода В (&ВидыДохода)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ГражданскоПравовой)
	|	КОНЕЦ КАК ТипДоговора,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот КАК Результат,
	|	ВЫБОР
	|		КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаПенсию, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|			ТОГДА 0
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаемаяБазаПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы))
	|				И ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами)
	|		ИНАЧЕ ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ))
	|	КОНЕЦ КАК ВидЗастрахованногоЛица,
	|	Гражданство.ВидЗастрахованногоЛица КАК ИсходныйВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТДоходыПоТарифам
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.ПериодРегистрации
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.ПериодРегистрации
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыОрганизации КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &ОтчетныйГод)
	|ГДЕ
	|	НЕ СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Физлица.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Физлица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.ПериодРегистрации
	|				ТОГДА СведенияОДоходах.ОблагаемаяБазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоТарифам КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.ПериодРегистрации КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ТипДоговора,
	|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыПоТарифам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ПериодРегистрации,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ТипДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ТипДоговора) КАК ТипДоговора
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ОбособленноеПодразделение,
	|		СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ЗаМесяц,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.ТипДоговора
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|				И БазаЗаМесяцПоОбособленным.ТипДоговора = ОбособленноеПодразделениеДляОкругления.ТипДоговора
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Превышение.ТипДоговора
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|	ОбособленноеПодразделениеДляОкругления.ТипДоговора
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|	ОбособленноеПодразделениеДляОкругления.ТипДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.ПериодРегистрации,
	|	ДоходыВзносов.ТипДоговора,
	|	СУММА(ДоходыВзносов.Результат) КАК НачисленоВсего,
	|	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) - ВЫБОР
	|		КОГДА ДоходыВзносов.ПериодРегистрации < &ДатаСтрахованияВременноПребывающих
	|			ТОГДА МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|			ТОГДА 0
	|		ИНАЧЕ МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел)
	|	КОНЕЦ КАК ОблагаемаяБазаПФР,
	|	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) - МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК ОблагаетсяВзносамиДоПредельнойВеличины,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|			ТОГДА МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА ДоходыВзносов.ОблагаемаяБазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА ДоходыВзносов.ОблагаемаяБазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТДоходыПоТарифамИДоговорам
	|ИЗ
	|	ВТДоходыПоТарифам КАК ДоходыВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО ДоходыВзносов.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И ДоходыВзносов.ОбособленноеПодразделение = ПревышениеДоходаПФР.ОбособленноеПодразделение
	|			И ДоходыВзносов.ПериодРегистрации = ПревышениеДоходаПФР.Период
	|			И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И ДоходыВзносов.ТипДоговора = ПревышениеДоходаПФР.ТипДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО ДоходыВзносов.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &ОтчетныйГод)
	|ГДЕ
	|	ДоходыВзносов.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|	И НЕ ДоходыВзносов.ВидДохода В (&НестрахуемыеВидыДохода)
	|	И НЕ ДоходыВзносов.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|	И ДоходыВзносов.ПериодРегистрации МЕЖДУ &Начало И &Окончание
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ТипДоговора,
	|	ДоходыВзносов.ПериодРегистрации,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыВзносов.ФизЛицо КАК ФизЛицо,
	|	ДоходыВзносов.ПериодРегистрации КАК Период,
	|	МЕСЯЦ(ДоходыВзносов.ПериодРегистрации) КАК Месяц,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ПериодРегистрации < &ДатаСтрахованияВременноПребывающих
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		ИНАЧЕ ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц)
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц,
	|	ДоходыВзносов.ТипДоговора,
	|	СУММА(ДоходыВзносов.НачисленоВсего) КАК НачисленоВсего,
	|	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) КАК ОблагаемаяБазаПФР,
	|	СУММА(ДоходыВзносов.ОблагаетсяВзносамиДоПредельнойВеличины) КАК ОблагаетсяВзносамиДоПредельнойВеличины,
	|	СУММА(ДоходыВзносов.ОблагаетсяВзносамиСвышеПредельнойВеличины) КАК ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	СУММА(ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах
	|ПОМЕСТИТЬ ВТДоходыПоКатегориямДоговорам
	|ИЗ
	|	ВТДоходыПоТарифамИДоговорам КАК ДоходыВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО ДоходыВзносов.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|			И (ГОД(ДоходыВзносов.ПериодРегистрации) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И ДоходыВзносов.ИсходныйВидЗастрахованногоЛица = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ТипДоговора,
	|	ДоходыВзносов.ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ПериодРегистрации < &ДатаСтрахованияВременноПребывающих
	|			ТОГДА СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
	|		ИНАЧЕ ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ФизЛицо КАК ФизЛицо,
	|	Доходы.Месяц КАК Месяц,
	|	ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка) КАК КлассУсловийТруда,
	|	СУММА(Доходы.НачисленоВсего) КАК Заработок,
	|	0 КАК ПоДоговорамГПХДоПредельнойВеличины,
	|	СУММА(Доходы.ОблагаемаяБазаПФР) КАК ОблагаетсяВзносами,
	|	СУММА(Доходы.ОблагаетсяВзносамиДоПредельнойВеличины) КАК ОблагаетсяВзносамиДоПредельнойВеличины,
	|	СУММА(Доходы.ОблагаетсяВзносамиСвышеПредельнойВеличины) КАК ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	СУММА(Доходы.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(Доходы.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Доходы.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	Доходы.ТипДоговора КАК ТипДоговора
	|ПОМЕСТИТЬ ВТСведенияОЗаработке
	|ИЗ
	|	ВТДоходыПоКатегориямДоговорам КАК Доходы
	|ГДЕ
	|	(&БезОтбораПоКатегорииЗастрахованныхЛиц
	|			ИЛИ Доходы.КатегорияЗастрахованныхЛиц = &КатегорияЗастрахованныхЛиц)
	|	И (&БезОтбораПоТипуДоговора
	|			ИЛИ Доходы.ТипДоговора = &ТипДоговора)
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ФизЛицо,
	|	Доходы.Месяц,
	|	Доходы.КатегорияЗастрахованныхЛиц,
	|	Доходы.ТипДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТФизлица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПредельнаяВеличина
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТИнвалиды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТГражданство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПревышениеДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствиеТарифаКатегории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствиеВидаЗастрахованныхКатегории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТарифыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТФизлицаБезОблагаемойБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДоходыПоТарифам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаНарастающимИтогом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаПревышенияДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТМаксБазаЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбособленноеПодразделениеМаксБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДоходыПоТарифамИДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДоходыПоКатегориямДоговорам";
	
	Запрос.Текст = СтрЗаменить(ОсновнойТекст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТДанныеОДоходахЗаОтчетныеПериоды2014(МенеджерВременныхТаблиц, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора, УчитыватьОпоздавшиеДанные)
	
	Если ПервыйОтчетныйПериод < РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда
		СоздатьВТДанныеОДоходахЗаОтчетныеПериоды2013(МенеджерВременныхТаблиц, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора);
		Возврат
	КонецЕсли;
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(МенеджерВременныхТаблиц);
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(МенеджерВременныхТаблиц);
	РасчетСтраховыхВзносов.ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(МенеджерВременныхТаблиц);
	
	ДатаС = ПервыйОтчетныйПериод;
	ДатаПо = Мин(ДатаСозданияДокументов,ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПоследнийОтчетныйПериод));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("ОтчетныйГод", Год(ДатаС));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ДатаС));
	Запрос.УстановитьПараметр("Начало", ДатаС);
	Запрос.УстановитьПараметр("Окончание", ДатаПо);
	Запрос.УстановитьПараметр("ДатаАктуальности", Макс(ДатаСозданияДокументов,ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПоследнийОтчетныйПериод)));
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());
	Запрос.УстановитьПараметр("НеучитываемыеВидыДохода", РасчетСтраховыхВзносов.НеучитываемыеВидыДохода());
	
	МассивВидовДохода = Новый Массив;
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.Матпомощь);
	Запрос.УстановитьПараметр("ВидыДоходаТрудовогоДоговора", МассивВидовДохода);
	
	ДтНачМесяца = НачалоГода(ДатаС);
	ТекстПериодов = "ВЫБРАТЬ
	|	&НачалоГода КАК НачалоМесяцаРасчетногоПериода
	|ПОМЕСТИТЬ ВТПериоды";
	ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	Пока ДтНачМесяца <= ДатаПо Цикл
		ТекстПериодов =  ТекстПериодов + "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ("+Формат(ДтНачМесяца, "ДФ=yyyy")+", "+Месяц(ДтНачМесяца)+", 1) КАК Период
		|";
		ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	КонецЦИкла;
	Запрос.Текст = ТекстПериодов;
	Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(МассивФизлиц) Тогда
		Запрос.УстановитьПараметр("ФизЛица", МассивФизлиц);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка В(&ФизЛица)";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
		|			,
		|			,
		|			МЕСЯЦ,
		|			Организация = &ГоловнаяОрганизация
		|				И ОбособленноеПодразделение = &ОбособленноеПодразделение
		|				И (ДатаПолученияДохода МЕЖДУ &Начало И &Окончание)
		|				И НЕ ВидДохода В (&НеучитываемыеВидыДохода)
		|				И НЕ ВидДохода В (&НестрахуемыеВидыДохода)) КАК СтраховыеВзносыСведенияОДоходахОбороты";
	КонецЕсли;
	Запрос.Выполнить();
	
	ОсновнойТекст = 
	"ВЫБРАТЬ
	|	ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних.РазмерПФР КАК Размер
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.СрезПоследних(&Окончание, ) КАК ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.Период КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.НачалоМесяцаРасчетногоПериода КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО (КОНЕЦПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) >= СведенияОбИнвалидностиФизлиц.Период)
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		СведенияОбИнвалидностиФизлиц.Физлицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизлица КАК Лица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.НачалоМесяцаРасчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.ПериодРегистра = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.Период КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию,
	|	ГражданствоФизЛиц.ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.НачалоМесяцаРасчетногоПериода КАК Период,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО (КОНЕЦПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) >= ГражданствоФизЛиц.Период)
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизлица КАК Лица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.НачалоМесяцаРасчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлица КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.НачалоМесяцаРасчетногоПериода >= ВременноПребывающие.Период
	|				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
	|				И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|				И (&УсловиеВключенияДанных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.НачалоМесяцаРасчетногоПериода,
	|		СписокСотрудников.ФизЛицо) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Организация,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)
	|		ИНАЧЕ СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|	КОНЕЦ КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СУММА(СтраховыеВзносыСведенияОДоходах.РезультатОборот) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходах.СкидкаОборот) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|		ИНАЧЕ СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда
	|	КОНЕЦ КАК КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВИсходнуюФорму
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			,
	|			&ДатаАктуальности,
	|			МЕСЯЦ,
	|			Физлицо В
	|					(ВЫБРАТЬ
	|						Лица.ФизЛицо КАК ФизЛицо
	|					ИЗ
	|						ВТФизлица КАК Лица)
	|				И (ДатаПолученияДохода МЕЖДУ &НачалоГода И &Окончание)
	|				И НЕ ВидДохода В (&НеучитываемыеВидыДохода)
	|				И Организация = &ГоловнаяОрганизация) КАК СтраховыеВзносыСведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Организация,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		КОГДА ВидыДеятельности.ТолькоДоходыФармацевтов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА ВидыДеятельности.ТолькоДоходыМоряков
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТТарифыОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.НачалоМесяцаРасчетногоПериода КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.НачалоМесяцаРасчетногоПериода >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|				И (&УсловиеВключенияДанных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.НачалоМесяцаРасчетногоПериода,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Периоды.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода В (&ВидыДоходаТрудовогоДоговора)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТрудовойДоговор,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы))
	|				И ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСДолгосрочнымиДоговорами)
	|		ИНАЧЕ ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ))
	|	КОНЕЦ КАК ВидЗастрахованногоЛица,
	|	Гражданство.ВидЗастрахованногоЛица КАК ИсходныйВидЗастрахованногоЛица,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот КАК Результат,
	|	ВЫБОР
	|		КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаПенсию, ЛОЖЬ)
	|				И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|			ТОГДА 0
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаемаяБазаПФР
	|ПОМЕСТИТЬ ВТДоходыПоТарифам
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыОрганизации КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &ОтчетныйГод)
	|ГДЕ
	|	НЕ СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Физлица.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Физлица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.ОблагаемаяБазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоТарифам КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, ГОД) И Периоды.НачалоМесяцаРасчетногоПериода)
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.НачалоМесяцаРасчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыПоТарифам КАК СведенияОДоходах
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		СведенияОДоходах.ЭтоТрудовойДоговор КАК ЭтоТрудовойДоговор,
	|		СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму) КАК ВключатьВИсходнуюФорму
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|			СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|			СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			СведенияОДоходах.ЭтоТрудовойДоговор КАК ЭтоТрудовойДоговор,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.КлассУсловийТруда) КАК КлассУсловийТруда
	|		ИЗ
	|			(ВЫБРАТЬ
	|				СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|				СведенияОДоходах.Период КАК Период,
	|				СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|				СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|				СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|				МАКСИМУМ(БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор) КАК ЭтоТрудовойДоговор
	|			ИЗ
	|				(ВЫБРАТЬ
	|					СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|					СведенияОДоходах.Период КАК Период,
	|					СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|					МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов,
	|					СведенияОДоходах.ЗаМесяц КАК ЗаМесяц
	|				ИЗ
	|					(ВЫБРАТЬ
	|						СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|						СведенияОДоходах.Период КАК Период,
	|						СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|						МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|					ИЗ
	|						ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|							ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|							ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|								И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|								И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|					
	|					СГРУППИРОВАТЬ ПО
	|						СведенияОДоходах.ФизЛицо,
	|						СведенияОДоходах.Период,
	|						СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|						ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|							И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|							И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|							И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|				
	|				СГРУППИРОВАТЬ ПО
	|					СведенияОДоходах.ФизЛицо,
	|					СведенияОДоходах.Период,
	|					СведенияОДоходах.ОбособленноеПодразделение,
	|					СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|					ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|						И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|						И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|						И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СведенияОДоходах.ФизЛицо,
	|				СведенияОДоходах.Период,
	|				СведенияОДоходах.ЗаМесяц,
	|				СведенияОДоходах.ОбособленноеПодразделение,
	|				СведенияОДоходах.ВидТарифаСтраховыхВзносов) КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|					И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|					И СведенияОДоходах.ЭтоТрудовойДоговор = БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяц,
	|			СведенияОДоходах.ЭтоТрудовойДоговор,
	|			СведенияОДоходах.ОбособленноеПодразделение,
	|			СведенияОДоходах.ВидТарифаСтраховыхВзносов) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|				И СведенияОДоходах.ЭтоТрудовойДоговор = БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор
	|				И СведенияОДоходах.КлассУсловийТруда = БазаЗаМесяцПоОбособленным.КлассУсловийТруда
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение,
	|		СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|		СведенияОДоходах.ЭтоТрудовойДоговор,
	|		СведенияОДоходах.КлассУсловийТруда) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			И СведенияОДоходах.ЭтоТрудовойДоговор = БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор
	|			И СведенияОДоходах.КлассУсловийТруда = БазаЗаМесяцПоОбособленным.КлассУсловийТруда
	|			И СведенияОДоходах.ВключатьВИсходнуюФорму = БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СведенияОДоходах.КлассУсловийТруда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.КлассУсловийТруда,
	|	БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму,
	|	БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор,
	|	БазаЗаМесяцПоОбособленным.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|				И БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор = ОбособленноеПодразделениеДляОкругления.ЭтоТрудовойДоговор
	|				И БазаЗаМесяцПоОбособленным.КлассУсловийТруда = ОбособленноеПодразделениеДляОкругления.КлассУсловийТруда
	|				И БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму = ОбособленноеПодразделениеДляОкругления.ВключатьВИсходнуюФорму
	|				И БазаЗаМесяцПоОбособленным.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ОбособленноеПодразделениеДляОкругления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Превышение.КлассУсловийТруда,
	|	Превышение.ЭтоТрудовойДоговор,
	|	Превышение.ВключатьВИсходнуюФорму,
	|	Превышение.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|	ОбособленноеПодразделениеДляОкругления.КлассУсловийТруда,
	|	ОбособленноеПодразделениеДляОкругления.ЭтоТрудовойДоговор,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВИсходнуюФорму,
	|	ОбособленноеПодразделениеДляОкругления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|	ОбособленноеПодразделениеДляОкругления.КлассУсловийТруда,
	|	ОбособленноеПодразделениеДляОкругления.ЭтоТрудовойДоговор,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВИсходнуюФорму,
	|	ОбособленноеПодразделениеДляОкругления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.ОбособленноеПодразделение,
	|	ДоходыВзносов.ЭтоТрудовойДоговор,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДоходыВзносов.КлассУсловийТруда КАК КлассУсловийТруда,
	|	ДоходыВзносов.ВключатьВИсходнуюФорму,
	|	СУММА(ДоходыВзносов.Результат) КАК Результат,
	|	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) КАК ОблагаемаяБазаПФР
	|ПОМЕСТИТЬ ВТДоходыПоТарифамИДоговорам
	|ИЗ
	|	ВТДоходыПоТарифам КАК ДоходыВзносов
	|ГДЕ
	|	ДоходыВзносов.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|	И НЕ ДоходыВзносов.ВидДохода В (&НестрахуемыеВидыДохода)
	|	И НЕ ДоходыВзносов.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|	И ДоходыВзносов.Период МЕЖДУ &Начало И &Окончание
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.ЭтоТрудовойДоговор,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	ДоходыВзносов.ВключатьВИсходнуюФорму,
	|	ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДоходыВзносов.КлассУсловийТруда,
	|	ДоходыВзносов.ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.Результат КАК НачисленоВсего,
	|	ДоходыВзносов.ОблагаемаяБазаПФР - ПревышениеДоходаПФР.СуммаПревысившаяПредел КАК ОблагаетсяВзносамиДоПредельнойВеличины,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ЭтоТрудовойДоговор
	|			ТОГДА 0
	|		ИНАЧЕ ДоходыВзносов.ОблагаемаяБазаПФР - ПревышениеДоходаПФР.СуммаПревысившаяПредел
	|	КОНЕЦ КАК ПоДоговорамГПХДоПредельнойВеличины,
	|	ПревышениеДоходаПФР.СуммаПревысившаяПредел КАК ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|			ТОГДА ДоходыВзносов.ОблагаемаяБазаПФР
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|			ТОГДА ДоходыВзносов.ОблагаемаяБазаПФР
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	ДоходыВзносов.КлассУсловийТруда КАК КлассУсловийТруда,
	|	ДоходыВзносов.ВключатьВИсходнуюФорму
	|ПОМЕСТИТЬ ВТДоходыСУчетомПревышения
	|ИЗ
	|	ВТДоходыПоТарифамИДоговорам КАК ДоходыВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО ДоходыВзносов.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И ДоходыВзносов.ОбособленноеПодразделение = ПревышениеДоходаПФР.ОбособленноеПодразделение
	|			И ДоходыВзносов.Период = ПревышениеДоходаПФР.Период
	|			И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И ДоходыВзносов.ЭтоТрудовойДоговор = ПревышениеДоходаПФР.ЭтоТрудовойДоговор
	|			И ДоходыВзносов.КлассУсловийТруда = ПревышениеДоходаПФР.КлассУсловийТруда
	|			И ДоходыВзносов.ВключатьВИсходнуюФорму = ПревышениеДоходаПФР.ВключатьВИсходнуюФорму
	|			И ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ПревышениеДоходаПФР.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ПустаяСсылка) КАК ТипДоговора,
	|	0 КАК ОблагаетсяВзносами,
	|	СУММА(СведенияОДоходах.НачисленоВсего) КАК Заработок,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиДоПредельнойВеличины) КАК ОблагаетсяВзносамиДоПредельнойВеличины,
	|	СУММА(СведенияОДоходах.ПоДоговорамГПХДоПредельнойВеличины) КАК ПоДоговорамГПХДоПредельнойВеличины,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиСвышеПредельнойВеличины) КАК ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах
	|ПОМЕСТИТЬ ВТСведенияОЗаработке
	|ИЗ
	|	ВТДоходыСУчетомПревышения КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО СведенияОДоходах.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|			И (ГОД(СведенияОДоходах.Период) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И СведенияОДоходах.ИсходныйВидЗастрахованногоЛица = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	МЕСЯЦ(СведенияОДоходах.Период),
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТФизлица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПредельнаяВеличина
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТИнвалиды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТГражданство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПревышениеДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствиеТарифаКатегории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствиеВидаЗастрахованныхКатегории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТарифыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТФизлицаБезОблагаемойБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДоходыПоТарифам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаНарастающимИтогом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаПревышенияДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТМаксБазаЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбособленноеПодразделениеМаксБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДоходыПоТарифамИДоговорам";
	
	Если УчитыватьОпоздавшиеДанные Тогда
		ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&ВключатьВИсходнуюФорму", "ИСТИНА");
		СтрокаЗамены = "ДатаРегистрацииИзменений <= &ДатаАктуальности";
	Иначе	
		ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&ВключатьВИсходнуюФорму", "СведенияОДоходах.ВключатьВИсходнуюФорму");
		СтрокаЗамены = "НАЧАЛОПЕРИОДА(Период, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(ДатаРегистрацииИзменений, КВАРТАЛ)
	|					ИЛИ ДатаРегистрацииИзменений <= КОНЕЦПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, КВАРТАЛ)";
	КонецЕсли;
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&УсловиеВключенияДанных", СтрокаЗамены);
	
	Запрос.Текст = СтрЗаменить(ОсновнойТекст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТДанныеОДоходахЗаОтчетныеПериоды(МенеджерВременныхТаблиц, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора, УчитыватьОпоздавшиеДанные)
	
	Если ПервыйОтчетныйПериод < РасчетСтраховыхВзносов.ДатаСтрахованияВсехВременноПребывающих() Тогда
		СоздатьВТДанныеОДоходахЗаОтчетныеПериоды2014(МенеджерВременныхТаблиц, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора, УчитыватьОпоздавшиеДанные);
		Возврат
	КонецЕсли;
	
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(МенеджерВременныхТаблиц);
	ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(МенеджерВременныхТаблиц, Год(ПоследнийОтчетныйПериод));
	РасчетСтраховыхВзносов.ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(МенеджерВременныхТаблиц);
	
	ДатаС = ПервыйОтчетныйПериод;
	ДатаПо = Мин(ДатаСозданияДокументов,ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПоследнийОтчетныйПериод));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("ОтчетныйГод", Год(ДатаС));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ДатаС));
	Запрос.УстановитьПараметр("Начало", ДатаС);
	Запрос.УстановитьПараметр("Окончание", ДатаПо);
	Запрос.УстановитьПараметр("ДатаАктуальности", Макс(ДатаСозданияДокументов,ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПоследнийОтчетныйПериод)));
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());
	Запрос.УстановитьПараметр("НеучитываемыеВидыДохода", РасчетСтраховыхВзносов.НеучитываемыеВидыДохода());
	
	МассивВидовДохода = Новый Массив;
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.Матпомощь);
	Запрос.УстановитьПараметр("ВидыДоходаТрудовогоДоговора", МассивВидовДохода);
	
	ДтНачМесяца = НачалоГода(ДатаС);
	ТекстПериодов = "ВЫБРАТЬ
	|	&НачалоГода КАК НачалоМесяцаРасчетногоПериода
	|ПОМЕСТИТЬ ВТПериоды";
	ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	Пока ДтНачМесяца <= ДатаПо Цикл
		ТекстПериодов =  ТекстПериодов + "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ("+Формат(ДтНачМесяца, "ДФ=yyyy")+", "+Месяц(ДтНачМесяца)+", 1) КАК Период
		|";
		ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
	КонецЦИкла;
	Запрос.Текст = ТекстПериодов;
	Запрос.Выполнить();
	
	Если ЗначениеЗаполнено(МассивФизлиц) Тогда
		Запрос.УстановитьПараметр("ФизЛица", МассивФизлиц);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка В(&ФизЛица)";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
		|			,
		|			,
		|			МЕСЯЦ,
		|			Организация = &ГоловнаяОрганизация
		|				И ОбособленноеПодразделение = &ОбособленноеПодразделение
		|				И (ДатаПолученияДохода МЕЖДУ &Начало И &Окончание)
		|				И НЕ ВидДохода В (&НеучитываемыеВидыДохода)
		|				И НЕ ВидДохода В (&НестрахуемыеВидыДохода)) КАК СтраховыеВзносыСведенияОДоходахОбороты";
	КонецЕсли;
	Запрос.Выполнить();
	
	ОсновнойТекст = 
	"ВЫБРАТЬ
	|	ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних.РазмерПФР КАК Размер
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.СрезПоследних(&Окончание, ) КАК ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.Период КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ГражданствоФизЛиц.ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.НачалоМесяцаРасчетногоПериода КАК Период,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО (КОНЕЦПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) >= ГражданствоФизЛиц.Период)
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизлица КАК Лица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.НачалоМесяцаРасчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Организация,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)
	|		ИНАЧЕ СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|	КОНЕЦ КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СУММА(СтраховыеВзносыСведенияОДоходах.РезультатОборот) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходах.СкидкаОборот) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|		ИНАЧЕ СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда
	|	КОНЕЦ КАК КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВИсходнуюФорму
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			,
	|			&ДатаАктуальности,
	|			МЕСЯЦ,
	|			Физлицо В
	|					(ВЫБРАТЬ
	|						Лица.ФизЛицо КАК ФизЛицо
	|					ИЗ
	|						ВТФизлица КАК Лица)
	|				И (ДатаПолученияДохода МЕЖДУ &НачалоГода И &Окончание)
	|				И НЕ ВидДохода В (&НеучитываемыеВидыДохода)
	|				И Организация = &ГоловнаяОрганизация) КАК СтраховыеВзносыСведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Организация,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомФармацевта
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыФармацевтов,
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоДоходыМоряков,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Периоды.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		КОГДА ВидыДеятельности.ТолькоДоходыФармацевтов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА ВидыДеятельности.ТолькоДоходыМоряков
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТТарифыОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.НачалоМесяцаРасчетногоПериода КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.НачалоМесяцаРасчетногоПериода >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|				И (&УсловиеВключенияДанных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.НачалоМесяцаРасчетногоПериода,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Периоды.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода В (&ВидыДоходаТрудовогоДоговора)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоТрудовойДоговор,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ЕСТЬNULL(Гражданство.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) КАК ВидЗастрахованногоЛица,
	|	Гражданство.ВидЗастрахованногоЛица КАК ИсходныйВидЗастрахованногоЛица,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот КАК Результат,
	|	ВЫБОР
	|		КОГДА Гражданство.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА 0
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаемаяБазаПФР
	|ПОМЕСТИТЬ ВТДоходыПоТарифам
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыОрганизации КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &ОтчетныйГод)
	|ГДЕ
	|	НЕ СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Физлица.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Физлица)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.ОблагаемаяБазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоТарифам КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, ГОД) И Периоды.НачалоМесяцаРасчетногоПериода)
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.НачалоМесяцаРасчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыПоТарифам КАК СведенияОДоходах
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		СведенияОДоходах.ЭтоТрудовойДоговор КАК ЭтоТрудовойДоговор,
	|		СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму) КАК ВключатьВИсходнуюФорму
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|			СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|			СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			СведенияОДоходах.ЭтоТрудовойДоговор КАК ЭтоТрудовойДоговор,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.КлассУсловийТруда) КАК КлассУсловийТруда
	|		ИЗ
	|			(ВЫБРАТЬ
	|				СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|				СведенияОДоходах.Период КАК Период,
	|				СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|				СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|				СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|				МАКСИМУМ(БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор) КАК ЭтоТрудовойДоговор
	|			ИЗ
	|				(ВЫБРАТЬ
	|					СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|					СведенияОДоходах.Период КАК Период,
	|					СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|					МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов,
	|					СведенияОДоходах.ЗаМесяц КАК ЗаМесяц
	|				ИЗ
	|					(ВЫБРАТЬ
	|						СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|						СведенияОДоходах.Период КАК Период,
	|						СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|						МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|					ИЗ
	|						ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|							ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|							ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|								И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|								И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|					
	|					СГРУППИРОВАТЬ ПО
	|						СведенияОДоходах.ФизЛицо,
	|						СведенияОДоходах.Период,
	|						СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|						ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|						ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|							И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|							И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|							И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|				
	|				СГРУППИРОВАТЬ ПО
	|					СведенияОДоходах.ФизЛицо,
	|					СведенияОДоходах.Период,
	|					СведенияОДоходах.ОбособленноеПодразделение,
	|					СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|					ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|						И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|						И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|						И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СведенияОДоходах.ФизЛицо,
	|				СведенияОДоходах.Период,
	|				СведенияОДоходах.ЗаМесяц,
	|				СведенияОДоходах.ОбособленноеПодразделение,
	|				СведенияОДоходах.ВидТарифаСтраховыхВзносов) КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|					И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|					И СведенияОДоходах.ЭтоТрудовойДоговор = БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяц,
	|			СведенияОДоходах.ЭтоТрудовойДоговор,
	|			СведенияОДоходах.ОбособленноеПодразделение,
	|			СведенияОДоходах.ВидТарифаСтраховыхВзносов) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|				И СведенияОДоходах.ЭтоТрудовойДоговор = БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор
	|				И СведенияОДоходах.КлассУсловийТруда = БазаЗаМесяцПоОбособленным.КлассУсловийТруда
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение,
	|		СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|		СведенияОДоходах.ЭтоТрудовойДоговор,
	|		СведенияОДоходах.КлассУсловийТруда) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			И СведенияОДоходах.ЭтоТрудовойДоговор = БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор
	|			И СведенияОДоходах.КлассУсловийТруда = БазаЗаМесяцПоОбособленным.КлассУсловийТруда
	|			И СведенияОДоходах.ВключатьВИсходнуюФорму = БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ЭтоТрудовойДоговор,
	|	СведенияОДоходах.ВключатьВИсходнуюФорму,
	|	СведенияОДоходах.КлассУсловийТруда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.КлассУсловийТруда,
	|	БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму,
	|	БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор,
	|	БазаЗаМесяцПоОбособленным.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|				И БазаЗаМесяцПоОбособленным.ЭтоТрудовойДоговор = ОбособленноеПодразделениеДляОкругления.ЭтоТрудовойДоговор
	|				И БазаЗаМесяцПоОбособленным.КлассУсловийТруда = ОбособленноеПодразделениеДляОкругления.КлассУсловийТруда
	|				И БазаЗаМесяцПоОбособленным.ВключатьВИсходнуюФорму = ОбособленноеПодразделениеДляОкругления.ВключатьВИсходнуюФорму
	|				И БазаЗаМесяцПоОбособленным.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ОбособленноеПодразделениеДляОкругления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Превышение.КлассУсловийТруда,
	|	Превышение.ЭтоТрудовойДоговор,
	|	Превышение.ВключатьВИсходнуюФорму,
	|	Превышение.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|	ОбособленноеПодразделениеДляОкругления.КлассУсловийТруда,
	|	ОбособленноеПодразделениеДляОкругления.ЭтоТрудовойДоговор,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВИсходнуюФорму,
	|	ОбособленноеПодразделениеДляОкругления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|	ОбособленноеПодразделениеДляОкругления.КлассУсловийТруда,
	|	ОбособленноеПодразделениеДляОкругления.ЭтоТрудовойДоговор,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВИсходнуюФорму,
	|	ОбособленноеПодразделениеДляОкругления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.ОбособленноеПодразделение,
	|	ДоходыВзносов.ЭтоТрудовойДоговор,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДоходыВзносов.КлассУсловийТруда КАК КлассУсловийТруда,
	|	ДоходыВзносов.ВключатьВИсходнуюФорму,
	|	СУММА(ДоходыВзносов.Результат) КАК Результат,
	|	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) КАК ОблагаемаяБазаПФР
	|ПОМЕСТИТЬ ВТДоходыПоТарифамИДоговорам
	|ИЗ
	|	ВТДоходыПоТарифам КАК ДоходыВзносов
	|ГДЕ
	|	ДоходыВзносов.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|	И НЕ ДоходыВзносов.ВидДохода В (&НестрахуемыеВидыДохода)
	|	И НЕ ДоходыВзносов.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|	И ДоходыВзносов.Период МЕЖДУ &Начало И &Окончание
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.ЭтоТрудовойДоговор,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	ДоходыВзносов.ВключатьВИсходнуюФорму,
	|	ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДоходыВзносов.КлассУсловийТруда,
	|	ДоходыВзносов.ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыВзносов.ФизЛицо,
	|	ДоходыВзносов.ИсходныйВидЗастрахованногоЛица,
	|	ДоходыВзносов.Период,
	|	ДоходыВзносов.Результат КАК НачисленоВсего,
	|	ДоходыВзносов.ОблагаемаяБазаПФР - ПревышениеДоходаПФР.СуммаПревысившаяПредел КАК ОблагаетсяВзносамиДоПредельнойВеличины,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ЭтоТрудовойДоговор
	|			ТОГДА 0
	|		ИНАЧЕ ДоходыВзносов.ОблагаемаяБазаПФР - ПревышениеДоходаПФР.СуммаПревысившаяПредел
	|	КОНЕЦ КАК ПоДоговорамГПХДоПредельнойВеличины,
	|	ПревышениеДоходаПФР.СуммаПревысившаяПредел КАК ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|			ТОГДА ДоходыВзносов.ОблагаемаяБазаПФР
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВЫБОР
	|		КОГДА ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|			ТОГДА ДоходыВзносов.ОблагаемаяБазаПФР
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
	|	ДоходыВзносов.КлассУсловийТруда КАК КлассУсловийТруда,
	|	ДоходыВзносов.ВключатьВИсходнуюФорму
	|ПОМЕСТИТЬ ВТДоходыСУчетомПревышения
	|ИЗ
	|	ВТДоходыПоТарифамИДоговорам КАК ДоходыВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО ДоходыВзносов.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И ДоходыВзносов.ОбособленноеПодразделение = ПревышениеДоходаПФР.ОбособленноеПодразделение
	|			И ДоходыВзносов.Период = ПревышениеДоходаПФР.Период
	|			И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И ДоходыВзносов.ЭтоТрудовойДоговор = ПревышениеДоходаПФР.ЭтоТрудовойДоговор
	|			И ДоходыВзносов.КлассУсловийТруда = ПревышениеДоходаПФР.КлассУсловийТруда
	|			И ДоходыВзносов.ВключатьВИсходнуюФорму = ПревышениеДоходаПФР.ВключатьВИсходнуюФорму
	|			И ДоходыВзносов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ПревышениеДоходаПФР.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц) КАК КатегорияЗастрахованныхЛиц,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ПустаяСсылка) КАК ТипДоговора,
	|	0 КАК ОблагаетсяВзносами,
	|	СУММА(СведенияОДоходах.НачисленоВсего) КАК Заработок,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиДоПредельнойВеличины) КАК ОблагаетсяВзносамиДоПредельнойВеличины,
	|	СУММА(СведенияОДоходах.ПоДоговорамГПХДоПредельнойВеличины) КАК ПоДоговорамГПХДоПредельнойВеличины,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиСвышеПредельнойВеличины) КАК ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах
	|ПОМЕСТИТЬ ВТСведенияОЗаработке
	|ИЗ
	|	ВТДоходыСУчетомПревышения КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|		ПО СведенияОДоходах.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|			И (ГОД(СведенияОДоходах.Период) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
	|		ПО (СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц)
	|			И СведенияОДоходах.ИсходныйВидЗастрахованногоЛица = СоответствиеВидаЗастрахованныхКатегории.ВидЗастрахованныхЛиц
	|ГДЕ
	|	&ВключатьВИсходнуюФорму
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	МЕСЯЦ(СведенияОДоходах.Период),
	|	ЕСТЬNULL(СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц, СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПериоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТФизлица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПредельнаяВеличина
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТГражданство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПревышениеДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствиеТарифаКатегории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСоответствиеВидаЗастрахованныхКатегории
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТарифыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТФизлицаБезОблагаемойБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДоходыПоТарифам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаНарастающимИтогом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаПревышенияДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТМаксБазаЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбособленноеПодразделениеМаксБазы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДоходыПоТарифамИДоговорам";
	
	Если УчитыватьОпоздавшиеДанные Тогда
		ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&ВключатьВИсходнуюФорму", "ИСТИНА");
		СтрокаЗамены = "ДатаРегистрацииИзменений <= &ДатаАктуальности";
	Иначе	
		ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&ВключатьВИсходнуюФорму", "СведенияОДоходах.ВключатьВИсходнуюФорму");
		СтрокаЗамены = "НАЧАЛОПЕРИОДА(Период, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(ДатаРегистрацииИзменений, КВАРТАЛ)
	|					ИЛИ ДатаРегистрацииИзменений <= КОНЕЦПЕРИОДА(Периоды.НачалоМесяцаРасчетногоПериода, КВАРТАЛ)";
	КонецЕсли;
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&УсловиеВключенияДанных", СтрокаЗамены);
	
	Запрос.Текст = СтрЗаменить(ОсновнойТекст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ДанныеОДоходахЗаОтчетныеПериоды(ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц = Неопределено, ОтборПоКатегорииЗастрахованныхЛиц = Неопределено, ОтборПоТипуДоговора = Неопределено, УчитыватьОпоздавшиеДанные = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаСозданияДокументов);
	СоздатьВТДанныеОДоходахЗаОтчетныеПериоды(Запрос.МенеджерВременныхТаблиц, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора, УчитыватьОпоздавшиеДанные); 	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ПОМЕСТИТЬ ВТФИО
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			&ДатаАктуальности,
	|			ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТСведенияОЗаработке КАК Лица)) КАК ФИОФизЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Доходы.ФизЛицо.СтраховойНомерПФР = """"
	|			ТОГДА ИСТИНА
	|		КОГДА Доходы.ФизЛицо.СтраховойНомерПФР = ""   -   -      ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетСтраховогоНомера,
	|	Доходы.ФизЛицо КАК ФизЛицо,
	|	Доходы.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	Доходы.Месяц КАК Месяц,
	|	Доходы.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	Доходы.ТипДоговора КАК ТипДоговора,
	|	Доходы.КлассУсловийТруда,
	|	Доходы.Заработок,
	|	Доходы.ОблагаетсяВзносами,
	|	Доходы.ОблагаетсяВзносамиДоПредельнойВеличины,
	|	Доходы.ПоДоговорамГПХДоПредельнойВеличины,
	|	Доходы.ОблагаетсяВзносамиСвышеПредельнойВеличины,
	|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Доходы.ФизЛицо.Наименование КАК Порядок,
	|	Доходы.ФизЛицо.Наименование КАК Наименование,
	|	ФИО.Фамилия,
	|	ФИО.Имя,
	|	ФИО.Отчество
	|ИЗ
	|	ВТСведенияОЗаработке КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИО КАК ФИО
	|		ПО Доходы.ФизЛицо = ФИО.ФизЛицо";
	
	Если ПоследнийОтчетныйПериод >= '20140101' Тогда // требуется еще одна колонка в данных
		Если УчитыватьОпоздавшиеДанные Или НачалоКвартала(ПоследнийОтчетныйПериод) < ПроцедурыПерсонифицированногоУчета.ДатаВводаФормыРСВ_1за2015год() Тогда
			// копируем те же самые данные для подсчета строк "итого с начала года"
			ТекстЗапросаОбъединения =   
			"ВЫБРАТЬ
			|	Доходы.НетСтраховогоНомера,
			|	Доходы.ФизЛицо КАК ФизЛицо,
			|	Доходы.СтраховойНомерПФР,
			|	Доходы.Месяц КАК Месяц,
			|	Доходы.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
			|	Доходы.ТипДоговора КАК ТипДоговора,
			|	Доходы.КлассУсловийТруда,
			|	Доходы.Заработок,
			|	Доходы.ОблагаетсяВзносами,
			|	Доходы.ОблагаетсяВзносамиДоПредельнойВеличины,
			|	Доходы.ПоДоговорамГПХДоПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиСвышеПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	Доходы.Порядок КАК Порядок,
			|	Доходы.Наименование,
			|	Доходы.Фамилия,
			|	Доходы.Имя,
			|	Доходы.Отчество,
			|	ЛОЖЬ КАК ДляИтоговыхСтрок
			|ИЗ
			|	ВТДоходы КАК Доходы
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.НетСтраховогоНомера,
			|	Доходы.ФизЛицо,
			|	Доходы.СтраховойНомерПФР,
			|	Доходы.Месяц,
			|	Доходы.КатегорияЗастрахованныхЛиц,
			|	Доходы.ТипДоговора,
			|	Доходы.КлассУсловийТруда,
			|	Доходы.Заработок,
			|	Доходы.ОблагаетсяВзносами,
			|	Доходы.ОблагаетсяВзносамиДоПредельнойВеличины,
			|	Доходы.ПоДоговорамГПХДоПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиСвышеПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	Доходы.Порядок,
			|	Доходы.Наименование,
			|	Доходы.Фамилия,
			|	Доходы.Имя,
			|	Доходы.Отчество,
			|	ИСТИНА
			|ИЗ
			|	ВТДоходы КАК Доходы";
		Иначе	
			// данные для подсчета строк "итого с начала года" рассчитываем отдельно - с учетом исправлений
			Запрос.УстановитьПараметр("ВременнаяТаблица", ДанныеОДоходахЗаОтчетныеПериоды(ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора, Истина).Выгрузить());
			ТекстЗапросаОбъединения =   
			"ВЫБРАТЬ
			|	Доходы.НетСтраховогоНомера,
			|	Доходы.ФизЛицо КАК ФизЛицо,
			|	Доходы.СтраховойНомерПФР,
			|	Доходы.Месяц КАК Месяц,
			|	Доходы.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
			|	Доходы.ТипДоговора КАК ТипДоговора,
			|	Доходы.КлассУсловийТруда,
			|	Доходы.Заработок,
			|	Доходы.ОблагаетсяВзносами,
			|	Доходы.ОблагаетсяВзносамиДоПредельнойВеличины,
			|	Доходы.ПоДоговорамГПХДоПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиСвышеПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	Доходы.Порядок КАК Порядок,
			|	Доходы.Наименование,
			|	Доходы.Фамилия,
			|	Доходы.Имя,
			|	Доходы.Отчество,
			|	Доходы.ДляИтоговыхСтрок
			|ПОМЕСТИТЬ ВТДоходыСИсправлениями
			|ИЗ
			|	&ВременнаяТаблица КАК Доходы
			|ГДЕ
			|	Доходы.ДляИтоговыхСтрок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Доходы.НетСтраховогоНомера,
			|	Доходы.ФизЛицо КАК ФизЛицо,
			|	Доходы.СтраховойНомерПФР,
			|	Доходы.Месяц КАК Месяц,
			|	Доходы.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
			|	Доходы.ТипДоговора КАК ТипДоговора,
			|	Доходы.КлассУсловийТруда,
			|	Доходы.Заработок,
			|	Доходы.ОблагаетсяВзносами,
			|	Доходы.ОблагаетсяВзносамиДоПредельнойВеличины,
			|	Доходы.ПоДоговорамГПХДоПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиСвышеПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	Доходы.Порядок КАК Порядок,
			|	Доходы.Наименование,
			|	Доходы.Фамилия,
			|	Доходы.Имя,
			|	Доходы.Отчество,
			|	ЛОЖЬ КАК ДляИтоговыхСтрок
			|ИЗ
			|	ВТДоходы КАК Доходы
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Доходы.НетСтраховогоНомера,
			|	Доходы.ФизЛицо,
			|	Доходы.СтраховойНомерПФР,
			|	Доходы.Месяц,
			|	Доходы.КатегорияЗастрахованныхЛиц,
			|	Доходы.ТипДоговора,
			|	Доходы.КлассУсловийТруда,
			|	Доходы.Заработок,
			|	Доходы.ОблагаетсяВзносами,
			|	Доходы.ОблагаетсяВзносамиДоПредельнойВеличины,
			|	Доходы.ПоДоговорамГПХДоПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиСвышеПредельнойВеличины,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,
			|	Доходы.ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,
			|	Доходы.Порядок,
			|	Доходы.Наименование,
			|	Доходы.Фамилия,
			|	Доходы.Имя,
			|	Доходы.Отчество,
			|	Доходы.ДляИтоговыхСтрок
			|ИЗ
			|	ВТДоходыСИсправлениями КАК Доходы";
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ФИО.Отчество", "ФИО.Отчество" + Символы.ПС + "ПОМЕСТИТЬ ВТДоходы" + Символы.ПС) + ";" + Символы.ПС + ТекстЗапросаОбъединения;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС +
	"УПОРЯДОЧИТЬ ПО
	|	КатегорияЗастрахованныхЛиц,
	|	ТипДоговора,
	|	Порядок,
	|	ФизЛицо,
	|	Месяц";

	Возврат Запрос.Выполнить();
	
КонецФункции 

Функция ДанныеОДоходах(ОтчетныйГод, Организация, ДатаСозданияДокументов, МассивФизлиц = Неопределено, ОтборПоКатегорииЗастрахованныхЛиц = Неопределено, ОтборПоТипуДоговора = Неопределено) Экспорт
	
	ДатаС = Дата(ОтчетныйГод, 1, 1);
	Возврат ДанныеОДоходахЗаОтчетныеПериоды(ДатаС, КонецГода(ДатаС), Организация, ДатаСозданияДокументов, МассивФизлиц, ОтборПоКатегорииЗастрахованныхЛиц, ОтборПоТипуДоговора)
	
КонецФункции 


Процедура ПрочитатьСведенияПринятыеПФР(Организация, ОтчетныйПериод, ПринятоПФР, ИменаПрошлыхПачек, МассивПрошлыхПериодов, ЕстьДоступКНачислениям = Истина) Экспорт
	
	МассивПрошлыхПериодов = Новый Массив;
	ПринятоПФР.Очистить();
	
	Если Не ЕстьДоступКНачислениям Или Организация.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод",	ОтчетныйПериод);
	Запрос.УстановитьПараметр("ДатаЗаменыЕСН", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СведенияПринятыеПФР.КомплектДокументов КАК Пачка,
	|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР КАК ОтчетныйПериод,
	|	СведенияПринятыеПФР.КомплектДокументов.НомерПачки КАК НомерПачки
	|ИЗ
	|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
	|ГДЕ
	|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
	|	И СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4ВПФР.ПустаяСсылка)
	|	И СведенияПринятыеПФР.Организация = &Организация
	|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР >= &ДатаЗаменыЕСН
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетныйПериод УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР КАК ОтчетныйПериодПерсучетаПФР
	|ИЗ
	|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
	|ГДЕ
	|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
	|	И СведенияПринятыеПФР.Организация = &Организация
	|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР >= &ДатаЗаменыЕСН
	|	И СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4ВПФР.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода < ДАТАВРЕМЯ(2010, 7, 1)
	|			ТОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, ГОД)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода < ДАТАВРЕМЯ(2011, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, КВАРТАЛ)
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода >= &ДатаЗаменыЕСН
	|	И СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода < &ОтчетныйПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2010, 7, 1)
	|			ТОГДА НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, ГОД)
	|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2011, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, КВАРТАЛ)
	|	КОНЕЦ
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
	|ГДЕ
	|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации >= &ДатаЗаменыЕСН
	|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < &ОтчетныйПериод
	|	И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетныйПериодПерсучетаПФР";
	
	Результаты = Запрос.ВыполнитьПакет();
	Выборка = Результаты[0].Выбрать();
	
	ИменаПрошлыхПачек = "";
	МассивПачек = Новый Массив;
	НачальныйПериод = ОтчетныйПериод;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПринятоПФР.Добавить(), Выборка);
		МассивПачек.Добавить(Выборка.Пачка);
		Если Не ПустаяСтрока(ИменаПрошлыхПачек) Тогда
			ИменаПрошлыхПачек = ИменаПрошлыхПачек + ", ";
		КонецЕсли;
		ИменаПрошлыхПачек = ИменаПрошлыхПачек + "№ " + СокрЛП(Выборка.НомерПачки) + " за " + ПроцедурыПерсонифицированногоУчета.ОписаниеОтчетногоПериодаДляПоказа(Выборка.ОтчетныйПериод);
		НачальныйПериод = Выборка.ОтчетныйПериод;
	КонецЦикла;
	
	Если Не Результаты[1].Пустой() Тогда
		Выборка = Результаты[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивПрошлыхПериодов.Добавить(Выборка.ОтчетныйПериодПерсучетаПФР);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ОтчетыРСВ1ЗаОтчетныйПериод(Организация, ОтчетныйПериод) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйОтчет.Ссылка,
	|	РегламентированныйОтчет.ДанныеОтчета,
	|	РегламентированныйОтчет.ДатаНачала,
	|	РегламентированныйОтчет.ДатаОкончания,
	|	РегламентированныйОтчет.Дата КАК Дата
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|ГДЕ
	|	РегламентированныйОтчет.Организация = &Организация
	|	И РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРСВ1""
	|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
	|	И (НЕ РегламентированныйОтчет.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОкончания", НачалоДня(ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод)));
	ИмяРаздела = "ПолеТабличногоДокументаТитульный";
	ИмяПоля = "НомерКорректировки1";
	Выборка = Запрос.Выполнить().Выбрать();
	СоответствиеОтчетов = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Данные = Выборка.ДанныеОтчета.Получить();
		Корректировка = Неопределено;
		Значение = Неопределено;
		Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("ПоказателиОтчета",Значение) Тогда
			Данные = Значение;
			Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство(ИмяРаздела,Значение) Тогда
				Данные = Значение;
				Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство(ИмяПоля,Значение) Тогда
					Корректировка = Данные.НомерКорректировки1 + Данные.НомерКорректировки2 + Данные.НомерКорректировки3
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Корректировка) Тогда // отчет не содержит понятных нам данных
			Продолжить;
		КонецЕсли;
		ОписаниеОтчета = ?(Корректировка = "000","Исходный (от " + Формат(Выборка.Дата,"ДФ=yyyy-MM-dd") + ")","Корректирующий № " + Корректировка + " (от " + Формат(Выборка.Дата,"ДФ=yyyy-MM-dd") + ")") 
					+ " за " + ПредставлениеПериода(НачалоДня(Выборка.ДатаНачала), КонецДня(Выборка.ДатаОкончания), "ФП = Истина");
		СоответствиеОтчетов.Вставить(Выборка.Ссылка, ОписаниеОтчета);
	КонецЦикла;
	
	Возврат СоответствиеОтчетов

КонецФункции // ОтчетыРСВ1ЗаОтчетныйПериод()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ с 2014 года

////////////////////////////////////////////////////////////////////////////////

Функция ДанныеОФактеНачисленияВзносов(ОтчетныйПериод, Организация, ТаблицаФизлиц) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ТаблицаФизлиц", ТаблицаФизлиц);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.ФизЛицо,
	|	ФизическиеЛица.ДатаСоставления
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	&ТаблицаФизлиц КАК ФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличиныЕНВД) КАК ПФРНаОПС,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК ПФРПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленныеОбороты
	|ГДЕ
	|	СтраховыеВзносыИсчисленныеОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыИсчисленныеОбороты.Организация = &ГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|	И СтраховыеВзносыИсчисленныеОбороты.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизическиеЛица.ФизЛицо
	|			ИЗ
	|				ВТФизЛица КАК ФизическиеЛица)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыходящиеНаПенсию.ФизЛицо,
	|	ЕСТЬNULL(СУММА(ИсчисленоПоЗЛ.ПФРНаОПС), 0) КАК ПФРНаОПС,
	|	ЕСТЬNULL(СУММА(ИсчисленоПоЗЛ.ПФРПоДополнительномуТарифу), 0) КАК ПФРПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТНачисленоЗаОтчетныйПериодФормирования
	|ИЗ
	|	ВТФизЛица КАК ВыходящиеНаПенсию
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|		ПО ВыходящиеНаПенсию.ДатаСоставления > ИсчисленоПоЗЛ.МесяцОтчетногоПериода
	|			И ВыходящиеНаПенсию.ФизЛицо = ИсчисленоПоЗЛ.ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыходящиеНаПенсию.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетныеДанные.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА РасчетныеДанные.ПФРНаОПС > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачисленоНаОПС,
	|	ВЫБОР
	|		КОГДА РасчетныеДанные.ПФРПоДополнительномуТарифу > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НачисленоПоДополнительнымТарифам
	|ИЗ
	|	ВТНачисленоЗаОтчетныйПериодФормирования КАК РасчетныеДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

////////////////////////////////////////////////////////////////////////////////

Функция ДанныеОВзносахПоСуммарномуТарифу(ОтчетныйПериод, Организация, МассивФизлиц = Неопределено, ДатаСозданияДокументов = Неопределено, УчитыватьОпоздавшиеДанные = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод));
	Запрос.УстановитьПараметр("ДатаСозданияДокументов", ?(Не ЗначениеЗаполнено(ДатаСозданияДокументов), ОбщегоНазначенияЗК.ПолучитьРабочуюДату(), ДатаСозданияДокументов));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличиныЕНВД) КАК НачисленоСтраховая
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленныеОбороты
	|ГДЕ
	|	СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|	И СтраховыеВзносыИсчисленныеОбороты.Период <= &ДатаСозданияДокументов
	|	И СтраховыеВзносыИсчисленныеОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыИсчисленныеОбороты.ФизЛицо В(&МассивФизлиц)
	|	И &УсловиеВключенияДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличиныЕНВД) <> 0";
	
	Если УчитыватьОпоздавшиеДанные Тогда
		СтрокаЗамены = "ИСТИНА";
	Иначе	
		СтрокаЗамены = "ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|				ТОГДА ЛОЖЬ
	|			КОГДА СтраховыеВзносыИсчисленныеОбороты.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|				ТОГДА ЛОЖЬ
	|			КОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.Период, КВАРТАЛ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВключенияДанных", СтрокаЗамены);
	Если ЗначениеЗаполнено(МассивФизлиц) Тогда
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("МассивФизлиц", МассивФизлиц)
	Иначе 
		Запрос.Текст = СтрЗаменить(ТекстЗапроса,"И СтраховыеВзносыИсчисленныеОбороты.ФизЛицо В(&МассивФизлиц)","")
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Функция ДанныеДляЗаполненияСтажа_2014(ОбособленноеПодразделение, ДатаНачалаПериодаЗаполнения, ДатаОкончанияПериодаЗаполнения, СписокФизЛиц = Неопределено, ВыделятьСтажПоДоговорамГПХ = Ложь, ДатаСозданияДокументов = Неопределено, УчитыватьОпоздавшиеДанные = Истина) Экспорт
	
	ДатаОкончанияПериода = КонецДня(ДатаОкончанияПериодаЗаполнения);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СписокФизЛиц",				СписокФизЛиц);
	Запрос.УстановитьПараметр("ДатаАктуальности",			?(Не ЗначениеЗаполнено(ДатаСозданияДокументов), ОбщегоНазначенияЗК.ПолучитьРабочуюДату(), ДатаСозданияДокументов));
	Запрос.УстановитьПараметр("ОтчетныйПериод",				ДатаНачалаПериодаЗаполнения);
	Запрос.УстановитьПараметр("НачалоГода",					ДатаНачалаПериодаЗаполнения);
	Запрос.УстановитьПараметр("КонецГода",					ДатаОкончанияПериода);
	Запрос.УстановитьПараметр("НачалоСледующегоГода",		ДатаОкончанияПериода + 1);
	Запрос.УстановитьПараметр("АДМИНИСТР",					?(ДатаНачалаПериодаЗаполнения  < ПроцедурыПерсонифицированногоУчета.ДатаОтменыОтсутствияАДМИНИСТР(), Справочники.ПараметрыИсчисляемогоСтраховогоСтажа2014.АДМИНИСТР, Справочники.ПараметрыИсчисляемогоСтраховогоСтажа2014.НЕОПЛ));
	Запрос.УстановитьПараметр("Организация",				ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("НеИсключатьРаботающихВСтудотряде", Не ПроцедурыУправленияПерсоналом.ЗначениеУчетнойПолитикиПоПерсоналуВсехОрганизаций(глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации"), "ИспользуетсяТрудРаботающихВСтудотряде"));
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",		ОбщегоНазначенияЗК.ГоловнаяОрганизация(ОбособленноеПодразделение));
	Запрос.УстановитьПараметр("ТерриториальныеУсловия",		ОбщегоНазначенияЗК.ПолучитьЗначениеРеквизита(ОбособленноеПодразделение,"ТерриториальныеУсловияПФР"));
	Запрос.УстановитьПараметр("НеОтбиратьДанныеПоФизлицу",	СписокФизЛиц = Неопределено);
	Запрос.УстановитьПараметр("ПарамИсчСПравомНаДосрочнуюПенсию", ПроцедурыПерсонифицированногоУчета.ПараметрыИсчисляемогоСтажаПредусматривающиеПравоНаДосрочнуюПенсию());
	Запрос.Параметры.ПарамИсчСПравомНаДосрочнуюПенсию.Добавить(Справочники.ПараметрыИсчисляемогоСтраховогоСтажа2014.ПустаяСсылка());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ОБЩЕСТ) КАК ВидСтажа,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТПриоритетыВидовСтажа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ПРОСТОЙ),
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.СДКРОВ),
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.УЧОТПУСК),
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДОПВЫХ),
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДЛДЕТИ),
	|	6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ОТСТРАН),
	|	7
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ОтпускБезСохраненияЗарплаты),
	|	8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ЧАЭС),
	|	9
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.НЕОПЛ),
	|	10
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.Дети),
	|	11
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВременнаяНетрудоспособность),
	|	12
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.Декрет),
	|	13
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДЛОТПУСК),
	|	14
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВАХТА),
	|	15
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.КВАЛИФ),
	|	16
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.МЕДНЕТРУД),
	|	17
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.МЕСЯЦ),
	|	18
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВключаетсяВСтраховойСтаж),
	|	19
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВключаетсяВСтажДляДосрочногоНазначенияПенсии),
	|	20
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.Декрет) КАК ВидСтажа,
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДЕКРЕТ) КАК ПараметрИсчисляемогоСтраховогоСтажа
	|ПОМЕСТИТЬ ВТСоответствиеВидовСтажаПараметрамИсчисления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.Дети),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДЕТИ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВременнаяНетрудоспособность),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ВРНЕТРУД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДЛОТПУСК),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДЛОТПУСК)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВАХТА),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ВАХТА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.КВАЛИФ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.КВАЛИФ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.МЕДНЕТРУД),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.МЕДНЕТРУД)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.МЕСЯЦ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ОБЩЕСТ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ОБЩЕСТ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ПРОСТОЙ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ПРОСТОЙ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.СДКРОВ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.СДКРОВ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.УЧОТПУСК),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.УЧОТПУСК)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДОПВЫХ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДОПВЫХ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДЛДЕТИ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДЛДЕТИ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ОТСТРАН),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ОТСТРАН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ОтпускБезСохраненияЗарплаты),
	|	&АДМИНИСТР
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ЧАЭС),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ЧАЭС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.НЕОПЛ),
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.НЕОПЛ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаботникиОрганизацииСрезПоследних.Сотрудник,
	|	РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК Физлицо,
	|	&НачалоГода КАК ДатаС,
	|	РаботникиОрганизацииСрезПоследних.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА &НачалоГода >= РаботникиОрганизацииСрезПоследних.ПериодЗавершения
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА &НачалоГода >= РаботникиОрганизацииСрезПоследних.ПериодЗавершения
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.Должность
	|	КОНЕЦ КАК Должность,
	|	ВЫБОР
	|		КОГДА &НачалоГода >= РаботникиОрганизацииСрезПоследних.ПериодЗавершения
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ГрафикРаботыЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ГрафикРаботы
	|	КОНЕЦ КАК ГрафикРаботы,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодЗавершения,
	|	ВЫБОР
	|		КОГДА &НачалоГода >= РаботникиОрганизацииСрезПоследних.ПериодЗавершения
	|				И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА РаботникиОрганизацииСрезПоследних.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизацииСрезПоследних.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВТДатыДвижений
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&НачалоГода,
	|			Организация = &ГоловнаяОрганизация
	|				И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|				И (&НеИсключатьРаботающихВСтудотряде
	|					ИЛИ НЕ Сотрудник.ЯвляетсяСтудентомРаботающимВСтудотряде)
	|				И &ПервоеДополнительноеУсловие
	|				И (&НеОтбиратьДанныеПоФизлицу
	|					ИЛИ Сотрудник.ФизЛицо В (&СписокФизЛиц))) КАК РаботникиОрганизацииСрезПоследних
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &НачалоГода >= РаботникиОрганизацииСрезПоследних.ПериодЗавершения
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	И ВЫБОР
	|			КОГДА &НачалоГода >= РаботникиОрганизацииСрезПоследних.ПериодЗавершения
	|					И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
	|			ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
	|		КОНЕЦ = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизации.Сотрудник,
	|	РаботникиОрганизации.Сотрудник.Физлицо,
	|	РаботникиОрганизации.Период,
	|	РаботникиОрганизации.Организация,
	|	РаботникиОрганизации.ПодразделениеОрганизации,
	|	РаботникиОрганизации.Должность,
	|	РаботникиОрганизации.ГрафикРаботы,
	|	РаботникиОрганизации.ПериодЗавершения,
	|	РаботникиОрганизации.ЗанимаемыхСтавок
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|ГДЕ
	|	(&НеОтбиратьДанныеПоФизлицу
	|			ИЛИ РаботникиОрганизации.Сотрудник.Физлицо В (&СписокФизЛиц))
	|	И РаботникиОрганизации.Организация = &ГоловнаяОрганизация
	|	И РаботникиОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	И (&НеИсключатьРаботающихВСтудотряде
	|			ИЛИ НЕ РаботникиОрганизации.Сотрудник.ЯвляетсяСтудентомРаботающимВСтудотряде)
	|	И &ВтороеДополнительноеУсловие
	|	И РаботникиОрганизации.ОбособленноеПодразделение = &Организация
	|	И РаботникиОрганизации.Период > &НачалоГода
	|	И РаботникиОрганизации.Период < &НачалоСледующегоГода
	|	И РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Работники.Сотрудник,
	|	Работники.Сотрудник.Физлицо,
	|	Работники.ПериодЗавершения,
	|	Работники.Организация,
	|	Работники.ПодразделениеОрганизацииЗавершения,
	|	Работники.ДолжностьЗавершения,
	|	Работники.ГрафикРаботыЗавершения,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	|	Работники.ЗанимаемыхСтавокЗавершения
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК Работники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
	|		ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
	|			И (ПериодыПерекрытия.Период > Работники.Период)
	|			И (ПериодыПерекрытия.Организация = &ГоловнаяОрганизация)
	|			И Работники.Сотрудник = ПериодыПерекрытия.Сотрудник
	|ГДЕ
	|	Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И Работники.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	И (&НеИсключатьРаботающихВСтудотряде
	|			ИЛИ НЕ Работники.Сотрудник.ЯвляетсяСтудентомРаботающимВСтудотряде)
	|	И (&НеОтбиратьДанныеПоФизлицу
	|			ИЛИ Работники.Сотрудник.Физлицо В (&СписокФизЛиц))
	|	И Работники.Организация = &ГоловнаяОрганизация
	|	И &ТретьеДополнительноеУсловие
	|	И Работники.ОбособленноеПодразделениеЗавершения = &Организация
	|	И Работники.ПричинаИзмененияСостоянияЗавершения <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	И Работники.ПериодЗавершения > &НачалоГода
	|	И Работники.ПериодЗавершения < &НачалоСледующегоГода
	|	И ПериодыПерекрытия.Период ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыДвижений.Сотрудник КАК Сотрудник,
	|	ПериодыДвижений.ФизЛицо КАК ФизЛицо,
	|	ПериодыДвижений.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ПериодыДвижений.Должность КАК Должность,
	|	ПериодыДвижений.ГрафикРаботы,
	|	ПериодыДвижений.ЗанимаемыхСтавок,
	|	ПериодыДвижений.ДатаС,
	|	ПериодыДвижений.ДатаПо,
	|	ПериодыДвижений.ПериодЗавершения,
	|	ДатыУвольнения.ПричинаИзмененияСостояния
	|ПОМЕСТИТЬ ВТПериодыДвижений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДатыНазначений1.Сотрудник КАК Сотрудник,
	|		ДатыНазначений1.Физлицо КАК ФизЛицо,
	|		ДатыНазначений1.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|		ДатыНазначений1.Должность КАК Должность,
	|		ДатыНазначений1.ГрафикРаботы КАК ГрафикРаботы,
	|		ДатыНазначений1.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|		ДатыНазначений1.ДатаС КАК ДатаС,
	|		ВЫБОР
	|			КОГДА ДатыНазначений1.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ВЫБОР
	|						КОГДА ЕСТЬNULL(МИНИМУМ(ДатыНазначений2.Период), &НачалоСледующегоГода) > ДатыНазначений1.ПериодЗавершения
	|							ТОГДА ДатыНазначений1.ПериодЗавершения
	|						ИНАЧЕ ЕСТЬNULL(МИНИМУМ(ДатыНазначений2.Период), &НачалоСледующегоГода)
	|					КОНЕЦ
	|			ИНАЧЕ ЕСТЬNULL(МИНИМУМ(ДатыНазначений2.Период), &НачалоСледующегоГода)
	|		КОНЕЦ КАК ДатаПо,
	|		ДатыНазначений1.ПериодЗавершения КАК ПериодЗавершения
	|	ИЗ
	|		ВТДатыДвижений КАК ДатыНазначений1
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДатыНазначений2
	|			ПО ДатыНазначений1.Сотрудник = ДатыНазначений2.Сотрудник
	|				И (ДатыНазначений2.Организация = &ГоловнаяОрганизация)
	|				И (ДатыНазначений2.Период > ДатыНазначений1.ДатаС)
	|				И (ДатыНазначений2.Период < &НачалоСледующегоГода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДатыНазначений1.Сотрудник,
	|		ДатыНазначений1.Физлицо,
	|		ДатыНазначений1.ПодразделениеОрганизации,
	|		ДатыНазначений1.Должность,
	|		ДатыНазначений1.ГрафикРаботы,
	|		ДатыНазначений1.ДатаС,
	|		ДатыНазначений1.ПериодЗавершения,
	|		ДатыНазначений1.ЗанимаемыхСтавок) КАК ПериодыДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ДатыУвольнения
	|		ПО ПериодыДвижений.Сотрудник = ДатыУвольнения.Сотрудник
	|			И (ДатыУвольнения.Организация = &ГоловнаяОрганизация)
	|			И ПериодыДвижений.ДатаПо = ДатыУвольнения.Период
	|			И (ДатыУвольнения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПодразделениеОрганизации,
	|	Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыНазначений.Сотрудник КАК Сотрудник,
	|	ПериодыНазначений.ФизЛицо КАК ФизЛицо,
	|	ПериодыНазначений.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	ПериодыНазначений.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|	ПериодыНазначений.Должность КАК Должность,
	|	ПериодыНазначений.КодПозицииСписка КАК КодПозицииСписка,
	|	ПериодыНазначений.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|	ПериодыНазначений.ГрафикРаботы КАК ГрафикРаботы,
	|	ПериодыНазначений.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|	ПериодыНазначений.ДатаС КАК ДатаС,
	|	ЕСТЬNULL(ШР.ОсобыеУсловияТруда, ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)) КАК ОсобыеУсловияТруда
	|ПОМЕСТИТЬ ВТНачалаПериодовПостоянства
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПериодыНазначений.Сотрудник КАК Сотрудник,
	|		ПериодыНазначений.Физлицо КАК ФизЛицо,
	|		ПериодыНазначений.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|		ВЫБОР
	|			КОГДА ПериодыНазначений.ПодразделениеОрганизации.КодПоОКТМО = """"
	|					И ПериодыНазначений.ПодразделениеОрганизации.КодПоОКАТО = """"
	|				ТОГДА &ТерриториальныеУсловия
	|			ИНАЧЕ ПериодыНазначений.ПодразделениеОрганизации.ТерриториальныеУсловияПФР
	|		КОНЕЦ КАК ТерриториальныеУсловия,
	|		ПериодыНазначений.Должность КАК Должность,
	|		ПериодыНазначений.Должность.КодПозицииСписка КАК КодПозицииСписка,
	|		ПериодыНазначений.Должность.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|		ПериодыНазначений.ГрафикРаботы КАК ГрафикРаботы,
	|		ПериодыНазначений.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|		ПериодыНазначений.ДатаС КАК ДатаС,
	|		МАКСИМУМ(ШР.Период) КАК Период
	|	ИЗ
	|		ВТДатыДвижений КАК ПериодыНазначений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШР
	|			ПО ПериодыНазначений.ПодразделениеОрганизации = ШР.ПодразделениеОрганизации
	|				И ПериодыНазначений.Должность = ШР.Должность
	|				И (ШР.Период <= ПериодыНазначений.ДатаС)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПериодыНазначений.Сотрудник,
	|		ПериодыНазначений.Физлицо,
	|		ПериодыНазначений.ПодразделениеОрганизации,
	|		ПериодыНазначений.Должность,
	|		ПериодыНазначений.Должность.КодПозицииСписка,
	|		ПериодыНазначений.Должность.ОснованиеВыслугиЛет,
	|		ПериодыНазначений.ГрафикРаботы,
	|		ПериодыНазначений.ДатаС,
	|		ПериодыНазначений.ЗанимаемыхСтавок,
	|		ВЫБОР
	|			КОГДА ПериодыНазначений.ПодразделениеОрганизации.КодПоОКТМО = """"
	|					И ПериодыНазначений.ПодразделениеОрганизации.КодПоОКАТО = """"
	|				ТОГДА &ТерриториальныеУсловия
	|			ИНАЧЕ ПериодыНазначений.ПодразделениеОрганизации.ТерриториальныеУсловияПФР
	|		КОНЕЦ) КАК ПериодыНазначений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШР
	|		ПО ПериодыНазначений.ПодразделениеОрганизации = ШР.ПодразделениеОрганизации
	|			И ПериодыНазначений.Должность = ШР.Должность
	|			И (ШР.Период = ПериодыНазначений.Период)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПериодыНазначений.Сотрудник,
	|	ПериодыНазначений.ФизЛицо,
	|	ПериодыНазначений.ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА ПериодыНазначений.ПодразделениеОрганизации.КодПоОКТМО = """"
	|				И ПериодыНазначений.ПодразделениеОрганизации.КодПоОКАТО = """"
	|			ТОГДА &ТерриториальныеУсловия
	|		ИНАЧЕ ПериодыНазначений.ПодразделениеОрганизации.ТерриториальныеУсловияПФР
	|	КОНЕЦ,
	|	ПериодыНазначений.Должность,
	|	ПериодыНазначений.Должность.КодПозицииСписка,
	|	ПериодыНазначений.Должность.ОснованиеВыслугиЛет,
	|	ПериодыНазначений.ГрафикРаботы,
	|	ПериодыНазначений.ЗанимаемыхСтавок,
	|	ШР.Период,
	|	ШР.ОсобыеУсловияТруда
	|ИЗ
	|	ВТПериодыДвижений КАК ПериодыНазначений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШР
	|		ПО ПериодыНазначений.ПодразделениеОрганизации = ШР.ПодразделениеОрганизации
	|			И ПериодыНазначений.Должность = ШР.Должность
	|			И (ШР.Период > ПериодыНазначений.ДатаС)
	|			И (ШР.Период < ПериодыНазначений.ДатаПо
	|				ИЛИ ШР.Период = ПериодыНазначений.ДатаПо
	|					И ПериодыНазначений.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыПостоянства.Сотрудник КАК Сотрудник,
	|	ПериодыПостоянства.ФизЛицо КАК ФизЛицо,
	|	ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ПустаяСсылка) КАК ТретийПараметрИсчисляемогоСтажа,
	|	&Организация КАК ОбособленноеПодразделение,
	|	&ОтчетныйПериод КАК ОтчетныйПериод,
	|	ПериодыПостоянства.ТерриториальныеУсловия,
	|	ПериодыПостоянства.Должность,
	|	ПериодыПостоянства.ОсобыеУсловияТруда,
	|	ПериодыПостоянства.ГрафикРаботы,
	|	ПериодыПостоянства.ЗанимаемыхСтавок,
	|	ПериодыПостоянства.КодПозицииСписка,
	|	ЕСТЬNULL(ПериодыПостоянства.ОснованиеВыслугиЛет, ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)) КАК ОснованиеВыслугиЛет,
	|	ПериодыПостоянства.НазначениеС КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА ПериодыПостоянства.НазначениеПо = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ПериодыПостоянства.НазначениеПо, ДЕНЬ, -1)
	|	КОНЕЦ КАК ДатаОкончанияПериода
	|ПОМЕСТИТЬ ВТКадровыеПериоды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НачалаПериодов.Сотрудник КАК Сотрудник,
	|		НачалаПериодов.ФизЛицо КАК ФизЛицо,
	|		НачалаПериодов.Должность КАК Должность,
	|		НачалаПериодов.ГрафикРаботы КАК ГрафикРаботы,
	|		НачалаПериодов.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|		НачалаПериодов.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|		НачалаПериодов.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|		НачалаПериодов.КодПозицииСписка КАК КодПозицииСписка,
	|		НачалаПериодов.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|		НачалаПериодов.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
	|		НачалаПериодов.ДатаС КАК НазначениеС,
	|		ЕСТЬNULL(МИНИМУМ(ОкончанияПериодов.ДатаС), &НачалоСледующегоГода) КАК НазначениеПо
	|	ИЗ
	|		ВТНачалаПериодовПостоянства КАК НачалаПериодов
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				РаботникиОрганизации.Сотрудник КАК Сотрудник,
	|				РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
	|				РаботникиОрганизации.Период КАК ДатаС
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|			ГДЕ
	|				РаботникиОрганизации.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|				И (&НеИсключатьРаботающихВСтудотряде
	|						ИЛИ НЕ РаботникиОрганизации.Сотрудник.ЯвляетсяСтудентомРаботающимВСтудотряде)
	|				И (&НеОтбиратьДанныеПоФизлицу
	|						ИЛИ РаботникиОрганизации.Сотрудник.Физлицо В (&СписокФизЛиц))
	|				И РаботникиОрганизации.Организация = &ГоловнаяОрганизация
	|				И РаботникиОрганизации.Период > &НачалоГода
	|				И РаботникиОрганизации.Период < &НачалоСледующегоГода
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Работники.Сотрудник,
	|				Работники.Сотрудник.Физлицо,
	|				Работники.ПериодЗавершения
	|			ИЗ
	|				РегистрСведений.РаботникиОрганизаций КАК Работники
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПериодыПерекрытия
	|					ПО (ПериодыПерекрытия.Период <= Работники.ПериодЗавершения)
	|						И (ПериодыПерекрытия.Период > Работники.Период)
	|						И Работники.Сотрудник = ПериодыПерекрытия.Сотрудник
	|						И (ПериодыПерекрытия.Организация = &ГоловнаяОрганизация)
	|			ГДЕ
	|				Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И Работники.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|				И (&НеИсключатьРаботающихВСтудотряде
	|						ИЛИ НЕ Работники.Сотрудник.ЯвляетсяСтудентомРаботающимВСтудотряде)
	|				И (&НеОтбиратьДанныеПоФизлицу
	|						ИЛИ Работники.Сотрудник.Физлицо В (&СписокФизЛиц))
	|				И Работники.Организация = &ГоловнаяОрганизация
	|				И ПериодыПерекрытия.Период ЕСТЬ NULL 
	|				И Работники.ПериодЗавершения > &НачалоГода
	|				И Работники.ПериодЗавершения < &НачалоСледующегоГода
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ПериодыНазначений.Сотрудник,
	|				ПериодыНазначений.ФизЛицо,
	|				ШР.Период
	|			ИЗ
	|				ВТПериодыДвижений КАК ПериодыНазначений
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШР
	|					ПО ПериодыНазначений.ПодразделениеОрганизации = ШР.ПодразделениеОрганизации
	|						И ПериодыНазначений.Должность = ШР.Должность
	|						И (ШР.Период > ПериодыНазначений.ДатаС)
	|						И (ШР.Период <= ПериодыНазначений.ДатаПо)) КАК ОкончанияПериодов
	|			ПО НачалаПериодов.Сотрудник = ОкончанияПериодов.Сотрудник
	|				И НачалаПериодов.ДатаС < ОкончанияПериодов.ДатаС
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НачалаПериодов.Сотрудник,
	|		НачалаПериодов.ФизЛицо,
	|		НачалаПериодов.ПодразделениеОрганизации,
	|		НачалаПериодов.ТерриториальныеУсловия,
	|		НачалаПериодов.Должность,
	|		НачалаПериодов.ГрафикРаботы,
	|		НачалаПериодов.ДатаС,
	|		НачалаПериодов.ЗанимаемыхСтавок,
	|		НачалаПериодов.КодПозицииСписка,
	|		НачалаПериодов.ОснованиеВыслугиЛет,
	|		НачалаПериодов.ОсобыеУсловияТруда) КАК ПериодыПостоянства
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря
	|ПОМЕСТИТЬ ВТДатыПериода
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоГода И &КонецГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Организация КАК Организация,
	|	Начисления.ФизЛицо КАК ФизЛицо,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	Начисления.Сторно КАК Сторно,
	|	Начисления.ВидРасчета.ВидСтажаПерсУчета2014 КАК ВидСтажа
	|ПОМЕСТИТЬ ВТФПД
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ФактическийПериодДействия(
	|			ПериодДействия МЕЖДУ &НачалоГода И &КонецГода
	|				И Организация = &ГоловнаяОрганизация
	|				И (&НеОтбиратьДанныеПоФизлицу
	|					ИЛИ Сотрудник.Физлицо В (&СписокФизЛиц))
	|				И Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТДатыДвижений.Сотрудник
	|					ИЗ
	|						ВТДатыДвижений)) КАК Начисления
	|ГДЕ
	|	Начисления.ВидРасчета.ВидСтажаПерсУчета2014 <> ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	ВидРасчета,
	|	ПериодДействияНачало,
	|	ПериодДействияКонец,
	|	Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Организация КАК Организация,
	|	Начисления.ФизЛицо КАК ФизЛицо,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	ДатыПериода.ДатаКалендаря КАК ПериодДействияНачало,
	|	ДатыПериода.ДатаКалендаря КАК ПериодДействияКонец,
	|	Начисления.Сторно КАК Сторно,
	|	Начисления.ВидСтажа КАК ВидСтажа
	|ПОМЕСТИТЬ ВТНеСторнированныеНачисления
	|ИЗ
	|	ВТДатыПериода КАК ДатыПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФПД КАК Начисления
	|		ПО (ДатыПериода.ДатаКалендаря МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	ВидРасчета,
	|	ПериодДействияНачало,
	|	ПериодДействияКонец,
	|	Сторно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.ФизЛицо КАК ФизЛицо,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	Начисления.ВидСтажа КАК ВидСтажа
	|ПОМЕСТИТЬ ВТНачисленияСУчетомСторнирования
	|ИЗ
	|	ВТНеСторнированныеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеСторнированныеНачисления КАК ТСторно
	|		ПО (ТСторно.Организация = Начисления.Организация)
	|			И (ТСторно.Сотрудник = Начисления.Сотрудник)
	|			И (ТСторно.ВидРасчета = Начисления.ВидРасчета)
	|			И (ТСторно.Сторно)
	|			И (ТСторно.ПериодДействияНачало МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|			И (ТСторно.ПериодДействияКонец МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|ГДЕ
	|	ТСторно.ВидРасчета ЕСТЬ NULL 
	|	И НЕ Начисления.Сторно
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Начисления.ФизЛицо,
	|	Начисления.Сотрудник,
	|	Начисления.ВидРасчета,
	|	Начисления.ПериодДействияНачало,
	|	Начисления.ПериодДействияКонец,
	|	Начисления.ВидСтажа
	|ИЗ
	|	(ВЫБРАТЬ
	|		Начисления.ФизЛицо КАК ФизЛицо,
	|		Начисления.Сотрудник КАК Сотрудник,
	|		Начисления.ВидРасчета КАК ВидРасчета,
	|		Начисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|		Начисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|		Начисления.ВидСтажа КАК ВидСтажа,
	|		СУММА(ВЫБОР
	|				КОГДА Начисления.Сторно
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ) КАК СуммаСторно
	|	ИЗ
	|		ВТНеСторнированныеНачисления КАК Начисления
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Начисления.ФизЛицо,
	|		Начисления.Сотрудник,
	|		Начисления.ВидРасчета,
	|		Начисления.ПериодДействияНачало,
	|		Начисления.ПериодДействияКонец,
	|		Начисления.ВидСтажа) КАК Начисления
	|ГДЕ
	|	Начисления.СуммаСторно > 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Начисления.ФизЛицо,
	|	Начисления.Сотрудник,
	|	Начисления.ВидРасчета,
	|	ВЫБОР
	|		КОГДА ТСторно.ПериодДействияНачало = Начисления.ПериодДействияНачало
	|			ТОГДА ВЫБОР
	|					КОГДА ТСторно.ПериодДействияКонец = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|						ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ТСторно.ПериодДействияКонец, СЕКУНДА, 1)
	|				КОНЕЦ
	|		ИНАЧЕ Начисления.ПериодДействияНачало
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТСторно.ПериодДействияНачало = Начисления.ПериодДействияНачало
	|			ТОГДА Начисления.ПериодДействияКонец
	|		КОГДА ТСторно.ПериодДействияНачало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ТСторно.ПериодДействияНачало, СЕКУНДА, -1)
	|	КОНЕЦ,
	|	Начисления.ВидСтажа
	|ИЗ
	|	ВТНеСторнированныеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеСторнированныеНачисления КАК ТСторно
	|		ПО Начисления.Организация = ТСторно.Организация
	|			И Начисления.Сотрудник = ТСторно.Сотрудник
	|			И Начисления.ВидРасчета = ТСторно.ВидРасчета
	|			И (ТСторно.Сторно)
	|			И (ТСторно.ПериодДействияНачало МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|			И (ТСторно.ПериодДействияКонец МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|			И (НЕ(ТСторно.ПериодДействияНачало = Начисления.ПериодДействияНачало
	|					И ТСторно.ПериодДействияКонец = Начисления.ПериодДействияКонец))
	|ГДЕ
	|	ТСторно.ВидРасчета ЕСТЬ НЕ NULL 
	|	И НЕ Начисления.Сторно
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Начисления.ФизЛицо,
	|	Начисления.Сотрудник,
	|	Начисления.ВидРасчета,
	|	ВЫБОР
	|		КОГДА ТСторно.ПериодДействияКонец = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ТСторно.ПериодДействияКонец, СЕКУНДА, 1)
	|	КОНЕЦ,
	|	Начисления.ПериодДействияКонец,
	|	Начисления.ВидСтажа
	|ИЗ
	|	ВТНеСторнированныеНачисления КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНеСторнированныеНачисления КАК ТСторно
	|		ПО (ТСторно.Организация = Начисления.Организация)
	|			И (ТСторно.Сотрудник = Начисления.Сотрудник)
	|			И (ТСторно.ВидРасчета = Начисления.ВидРасчета)
	|			И (ТСторно.Сторно)
	|			И (ТСторно.ПериодДействияНачало МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|			И (ТСторно.ПериодДействияКонец МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец)
	|			И (НЕ(ТСторно.ПериодДействияНачало = Начисления.ПериодДействияНачало
	|					И ТСторно.ПериодДействияКонец = Начисления.ПериодДействияКонец))
	|			И (ТСторно.ПериодДействияНачало > Начисления.ПериодДействияНачало)
	|			И (ТСторно.ПериодДействияКонец < Начисления.ПериодДействияКонец)
	|ГДЕ
	|	НЕ ТСторно.ВидРасчета ЕСТЬ NULL 
	|	И НЕ Начисления.Сторно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ВидРасчета,
	|	ПериодДействияНачало,
	|	ПериодДействияКонец,
	|	ВидСтажа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Начисления.ПериодДействияНачало >= КадровыеПериоды.ДатаНачалаПериода
	|			ТОГДА Начисления.ПериодДействияНачало
	|		ИНАЧЕ КадровыеПериоды.ДатаНачалаПериода
	|	КОНЕЦ КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА Начисления.ПериодДействияКонец <= КадровыеПериоды.ДатаОкончанияПериода
	|			ТОГДА Начисления.ПериодДействияКонец
	|		ИНАЧЕ КадровыеПериоды.ДатаОкончанияПериода
	|	КОНЕЦ КАК ДатаОкончанияПериода,
	|	Начисления.ВидСтажа КАК ВидСтажа,
	|	КадровыеПериоды.ФизЛицо КАК ФизЛицо,
	|	КадровыеПериоды.Сотрудник КАК Сотрудник,
	|	КадровыеПериоды.ОбособленноеПодразделение,
	|	КадровыеПериоды.ОтчетныйПериод
	|ПОМЕСТИТЬ ВТОплаченныеПериодыРаботы
	|ИЗ
	|	ВТКадровыеПериоды КАК КадровыеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачисленияСУчетомСторнирования КАК Начисления
	|		ПО КадровыеПериоды.Сотрудник = Начисления.Сотрудник
	|			И (Начисления.ПериодДействияНачало МЕЖДУ КадровыеПериоды.ДатаНачалаПериода И КадровыеПериоды.ДатаОкончанияПериода
	|				ИЛИ Начисления.ПериодДействияКонец МЕЖДУ КадровыеПериоды.ДатаНачалаПериода И КадровыеПериоды.ДатаОкончанияПериода)
	|			И (Начисления.ВидСтажа <> ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияСУчетомСторнирования КАК ПовторныеНачисления
	|		ПО КадровыеПериоды.ФизЛицо = ПовторныеНачисления.ФизЛицо
	|			И (ПовторныеНачисления.ПериодДействияНачало = Начисления.ПериодДействияНачало)
	|			И (ПовторныеНачисления.ПериодДействияКонец = Начисления.ПериодДействияКонец)
	|			И (ПовторныеНачисления.ВидСтажа <> Начисления.ВидСтажа)
	|			И (ПовторныеНачисления.ВидСтажа <> ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ПустаяСсылка))
	|ГДЕ
	|	НЕ((Начисления.ВидСтажа = ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.НеВключаетсяВСтраховойСтаж)
	|				ИЛИ Начисления.ВидСтажа = ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДЛДЕТИ))
	|				И ЕСТЬNULL(ПовторныеНачисления.ВидСтажа, """") = ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ДЕТИ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтдельноСтоящиеПериоды.ФизЛицо,
	|	ОтдельноСтоящиеПериоды.Сотрудник,
	|	ОтдельноСтоящиеПериоды.ВидСтажа,
	|	ОтдельноСтоящиеПериоды.ОбособленноеПодразделение,
	|	ОтдельноСтоящиеПериоды.ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА ПересеченияПериодов.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА ОтдельноСтоящиеПериоды.ДатаНачалаПериода
	|		ИНАЧЕ ПересеченияПериодов.ДатаНачалаПериода
	|	КОНЕЦ КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА ПересеченияПериодов.ФизЛицо ЕСТЬ NULL 
	|			ТОГДА ОтдельноСтоящиеПериоды.ДатаОкончанияПериода
	|		ИНАЧЕ ПересеченияПериодов.ДатаОкончанияПериода
	|	КОНЕЦ КАК ДатаОкончанияПериода
	|ПОМЕСТИТЬ ВТОтредактированныеОплаченныеПериоды
	|ИЗ
	|	ВТОплаченныеПериодыРаботы КАК ОтдельноСтоящиеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВЫБОР
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 1
	|					ТОГДА ПересекающиеПериоды.ДатаНачалаПериода
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 2
	|						И ПересекающиеПериоды.ДатаОкончанияПериода > ИсходныеПериоды.ДатаОкончанияПериода
	|					ТОГДА ИсходныеПериоды.ДатаОкончанияПериода
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 2
	|						И ПересекающиеПериоды.ДатаОкончанияПериода <= ИсходныеПериоды.ДатаОкончанияПериода
	|					ТОГДА ИсходныеПериоды.ДатаНачалаПериода
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 3
	|						И ПересекающиеПериоды.ДатаОкончанияПериода > ИсходныеПериоды.ДатаОкончанияПериода
	|					ТОГДА ИсходныеПериоды.ДатаНачалаПериода
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 3
	|						И ПересекающиеПериоды.ДатаОкончанияПериода <= ИсходныеПериоды.ДатаОкончанияПериода
	|					ТОГДА ПересекающиеПериоды.ДатаОкончанияПериода
	|			КОНЕЦ КАК ДатаНачалаПериода,
	|			ВЫБОР
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 1
	|					ТОГДА ИсходныеПериоды.ДатаНачалаПериода
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 2
	|					ТОГДА ПересекающиеПериоды.ДатаОкончанияПериода
	|				КОГДА ПересекающиеПериоды.НомерИнтервала = 3
	|					ТОГДА ИсходныеПериоды.ДатаОкончанияПериода
	|			КОНЕЦ КАК ДатаОкончанияПериода,
	|			ИсходныеПериоды.ВидСтажа КАК ВидСтажа,
	|			ИсходныеПериоды.Сотрудник КАК Сотрудник,
	|			ИсходныеПериоды.ФизЛицо КАК ФизЛицо,
	|			ИсходныеПериоды.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|			ИсходныеПериоды.ОтчетныйПериод КАК ОтчетныйПериод
	|		ИЗ
	|			ВТОплаченныеПериодыРаботы КАК ИсходныеПериоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ОплаченныеПериоды1.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|					ОплаченныеПериоды1.ДатаОкончанияПериода КАК ДатаОкончанияПериода,
	|					ОплаченныеПериоды1.ВидСтажа КАК ВидСтажа,
	|					ОплаченныеПериоды1.Сотрудник КАК Сотрудник,
	|					ОплаченныеПериоды1.ФизЛицо КАК ФизЛицо,
	|					ОплаченныеПериоды1.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|					ОплаченныеПериоды1.ОтчетныйПериод КАК ОтчетныйПериод,
	|					1 КАК НомерИнтервала
	|				ИЗ
	|					ВТОплаченныеПериодыРаботы КАК ОплаченныеПериоды1
	|				
	|				ОБЪЕДИНИТЬ
	|				
	|				ВЫБРАТЬ
	|					ОплаченныеПериоды2.ДатаНачалаПериода,
	|					ОплаченныеПериоды2.ДатаОкончанияПериода,
	|					ОплаченныеПериоды2.ВидСтажа,
	|					ОплаченныеПериоды2.Сотрудник,
	|					ОплаченныеПериоды2.ФизЛицо,
	|					ОплаченныеПериоды2.ОбособленноеПодразделение,
	|					ОплаченныеПериоды2.ОтчетныйПериод,
	|					2
	|				ИЗ
	|					ВТОплаченныеПериодыРаботы КАК ОплаченныеПериоды2
	|				
	|				ОБЪЕДИНИТЬ
	|				
	|				ВЫБРАТЬ
	|					ОплаченныеПериоды3.ДатаНачалаПериода,
	|					ОплаченныеПериоды3.ДатаОкончанияПериода,
	|					ОплаченныеПериоды3.ВидСтажа,
	|					ОплаченныеПериоды3.Сотрудник,
	|					ОплаченныеПериоды3.ФизЛицо,
	|					ОплаченныеПериоды3.ОбособленноеПодразделение,
	|					ОплаченныеПериоды3.ОтчетныйПериод,
	|					3
	|				ИЗ
	|					ВТОплаченныеПериодыРаботы КАК ОплаченныеПериоды3) КАК ПересекающиеПериоды
	|				ПО ИсходныеПериоды.ВидСтажа = ПересекающиеПериоды.ВидСтажа
	|					И ИсходныеПериоды.Сотрудник = ПересекающиеПериоды.Сотрудник
	|					И ИсходныеПериоды.ОбособленноеПодразделение = ПересекающиеПериоды.ОбособленноеПодразделение
	|					И ИсходныеПериоды.ОтчетныйПериод = ПересекающиеПериоды.ОтчетныйПериод
	|					И ИсходныеПериоды.ДатаНачалаПериода > ПересекающиеПериоды.ДатаНачалаПериода
	|					И ИсходныеПериоды.ДатаНачалаПериода < ПересекающиеПериоды.ДатаОкончанияПериода) КАК ПересеченияПериодов
	|		ПО ОтдельноСтоящиеПериоды.ВидСтажа = ПересеченияПериодов.ВидСтажа
	|			И ОтдельноСтоящиеПериоды.Сотрудник = ПересеченияПериодов.Сотрудник
	|			И ОтдельноСтоящиеПериоды.ОбособленноеПодразделение = ПересеченияПериодов.ОбособленноеПодразделение
	|			И ОтдельноСтоящиеПериоды.ОтчетныйПериод = ПересеченияПериодов.ОтчетныйПериод
	|			И ОтдельноСтоящиеПериоды.ДатаНачалаПериода <= ПересеченияПериодов.ДатаНачалаПериода
	|			И ОтдельноСтоящиеПериоды.ДатаОкончанияПериода >= ПересеченияПериодов.ДатаОкончанияПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НефильтрованныеДниСтажа.ДатаКалендаря,
	|	ВЫБОР
	|		КОГДА НефильтрованныеДниСтажа.ДатаКалендаря = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НефильтрованныеДниСтажа.ДатаКалендаря, ДЕНЬ, 1)
	|	КОНЕЦ КАК СледующаяДатаКалендаря,
	|	ВЫБОР
	|		КОГДА НефильтрованныеДниСтажа.ДатаКалендаря = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(НефильтрованныеДниСтажа.ДатаКалендаря, ДЕНЬ, -1)
	|	КОНЕЦ КАК ПредыдущаяДатаКалендаря,
	|	МИНИМУМ(НефильтрованныеДниСтажа.ПараметрИсчисляемогоСтраховогоСтажа) КАК ТретийПараметрИсчисляемогоСтажа,
	|	НефильтрованныеДниСтажа.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|	НефильтрованныеДниСтажа.Сотрудник КАК Сотрудник,
	|	НефильтрованныеДниСтажа.ФизЛицо КАК ФизЛицо,
	|	НефильтрованныеДниСтажа.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	НефильтрованныеДниСтажа.ОтчетныйПериод КАК ОтчетныйПериод,
	|	НефильтрованныеДниСтажа.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
	|	НефильтрованныеДниСтажа.КодПозицииСписка КАК КодПозицииСписка,
	|	НефильтрованныеДниСтажа.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|	НефильтрованныеДниСтажа.ЗанимаемыхСтавок,
	|	НефильтрованныеДниСтажа.СтавокДляТерриториальныхУсловий,
	|	НефильтрованныеДниСтажа.Должность.ЗамещениеГосударственныхМуниципальныхДолжностей КАК ЗамещениеГосударственныхМуниципальныхДолжностей,
	|	НефильтрованныеДниСтажа.Должность
	|ПОМЕСТИТЬ ВТДниСтажаДоОбработкиПараметровИсчСтажа
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НефильтрованныеДниСтажа.ДатаКалендаря КАК ДатаКалендаря,
	|		ВЫБОР
	|			КОГДА НефильтрованныеДниСтажа.ГрафикРаботы.НеполныйРабочийДень
	|				ТОГДА НефильтрованныеДниСтажа.ЗанимаемыхСтавок
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СтавокДляТерриториальныхУсловий,
	|		ВЫБОР
	|			КОГДА ПриоритетыВидовСтажа.ВидСтажа = ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВключаетсяВСтраховойСтаж)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.ПустаяСсылка)
	|			ИНАЧЕ НефильтрованныеДниСтажа.ТерриториальныеУсловия
	|		КОНЕЦ КАК ТерриториальныеУсловия,
	|		НефильтрованныеДниСтажа.Сотрудник КАК Сотрудник,
	|		НефильтрованныеДниСтажа.ФизЛицо КАК ФизЛицо,
	|		НефильтрованныеДниСтажа.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		НефильтрованныеДниСтажа.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|		НефильтрованныеДниСтажа.ОтчетныйПериод КАК ОтчетныйПериод,
	|		ВЫБОР
	|			КОГДА НефильтрованныеДниСтажа.ГрафикРаботы.НеполныйРабочийДень
	|					ИЛИ ПриоритетыВидовСтажа.ВидСтажа = ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВключаетсяВСтраховойСтаж)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|			ИНАЧЕ НефильтрованныеДниСтажа.ОсобыеУсловияТруда
	|		КОНЕЦ КАК ОсобыеУсловияТруда,
	|		ВЫБОР
	|			КОГДА НефильтрованныеДниСтажа.ГрафикРаботы.НеполныйРабочийДень
	|					ИЛИ ПриоритетыВидовСтажа.ВидСтажа = ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВключаетсяВСтраховойСтаж)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения.ПустаяСсылка)
	|			ИНАЧЕ НефильтрованныеДниСтажа.КодПозицииСписка
	|		КОНЕЦ КАК КодПозицииСписка,
	|		ВЫБОР
	|			КОГДА ПриоритетыВидовСтажа.ВидСтажа = ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.ВключаетсяВСтраховойСтаж)
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)
	|			ИНАЧЕ НефильтрованныеДниСтажа.ОснованиеВыслугиЛет
	|		КОНЕЦ КАК ОснованиеВыслугиЛет,
	|		ЕСТЬNULL(СоответствиеВидовСтажаПараметрамИсчисления.ПараметрИсчисляемогоСтраховогоСтажа, ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ПустаяСсылка)) КАК ПараметрИсчисляемогоСтраховогоСтажа,
	|		НефильтрованныеДниСтажа.Должность КАК Должность
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря,
	|			КадровыеПериоды.ФизЛицо КАК ФизЛицо,
	|			КадровыеПериоды.Сотрудник КАК Сотрудник,
	|			КадровыеПериоды.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|			КадровыеПериоды.ОтчетныйПериод КАК ОтчетныйПериод,
	|			КадровыеПериоды.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|			КадровыеПериоды.ОсобыеУсловияТруда КАК ОсобыеУсловияТруда,
	|			КадровыеПериоды.ГрафикРаботы КАК ГрафикРаботы,
	|			КадровыеПериоды.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
	|			КадровыеПериоды.КодПозицииСписка КАК КодПозицииСписка,
	|			КадровыеПериоды.ОснованиеВыслугиЛет КАК ОснованиеВыслугиЛет,
	|			МАКСИМУМ(ПриоритетыВидовСтажа.Приоритет) КАК ПорядковыйНомерВидаСтажа,
	|			КадровыеПериоды.Должность КАК Должность
	|		ИЗ
	|			ВТДатыПериода КАК РегламентированныйПроизводственныйКалендарь
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеПериоды КАК КадровыеПериоды
	|				ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ КадровыеПериоды.ДатаНачалаПериода И КадровыеПериоды.ДатаОкончанияПериода)
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОтредактированныеОплаченныеПериоды КАК ОтредактированныеОплаченныеПериоды
	|					ЛЕВОЕ СОЕДИНЕНИЕ ВТПриоритетыВидовСтажа КАК ПриоритетыВидовСтажа
	|					ПО ОтредактированныеОплаченныеПериоды.ВидСтажа = ПриоритетыВидовСтажа.ВидСтажа
	|				ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ ОтредактированныеОплаченныеПериоды.ДатаНачалаПериода И ОтредактированныеОплаченныеПериоды.ДатаОкончанияПериода)
	|					И (ОтредактированныеОплаченныеПериоды.Сотрудник = КадровыеПериоды.Сотрудник)
	|					И (ОтредактированныеОплаченныеПериоды.ОбособленноеПодразделение = КадровыеПериоды.ОбособленноеПодразделение)
	|		ГДЕ
	|			ЕСТЬNULL(КадровыеПериоды.Сотрудник, ОтредактированныеОплаченныеПериоды.Сотрудник) ЕСТЬ НЕ NULL 
	|			И ЕСТЬNULL(ОтредактированныеОплаченныеПериоды.ВидСтажа, """") <> ЗНАЧЕНИЕ(Перечисление.ВидыСтажаПерсУчета2014.НеВключаетсяВСтраховойСтаж)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|			КадровыеПериоды.ФизЛицо,
	|			КадровыеПериоды.Сотрудник,
	|			КадровыеПериоды.ОбособленноеПодразделение,
	|			КадровыеПериоды.ОтчетныйПериод,
	|			КадровыеПериоды.ТерриториальныеУсловия,
	|			КадровыеПериоды.ОсобыеУсловияТруда,
	|			КадровыеПериоды.ГрафикРаботы,
	|			КадровыеПериоды.ЗанимаемыхСтавок,
	|			КадровыеПериоды.КодПозицииСписка,
	|			КадровыеПериоды.ОснованиеВыслугиЛет,
	|			КадровыеПериоды.Должность) КАК НефильтрованныеДниСтажа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПриоритетыВидовСтажа КАК ПриоритетыВидовСтажа
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидовСтажаПараметрамИсчисления КАК СоответствиеВидовСтажаПараметрамИсчисления
	|				ПО ПриоритетыВидовСтажа.ВидСтажа = СоответствиеВидовСтажаПараметрамИсчисления.ВидСтажа
	|			ПО НефильтрованныеДниСтажа.ПорядковыйНомерВидаСтажа = ПриоритетыВидовСтажа.Приоритет
	|	ГДЕ
	|		НефильтрованныеДниСтажа.Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК НефильтрованныеДниСтажа
	|
	|СГРУППИРОВАТЬ ПО
	|	НефильтрованныеДниСтажа.ОтчетныйПериод,
	|	НефильтрованныеДниСтажа.Сотрудник,
	|	НефильтрованныеДниСтажа.ФизЛицо,
	|	НефильтрованныеДниСтажа.ДатаКалендаря,
	|	НефильтрованныеДниСтажа.ТерриториальныеУсловия,
	|	НефильтрованныеДниСтажа.ОбособленноеПодразделение,
	|	НефильтрованныеДниСтажа.ОсобыеУсловияТруда,
	|	НефильтрованныеДниСтажа.КодПозицииСписка,
	|	НефильтрованныеДниСтажа.ОснованиеВыслугиЛет,
	|	НефильтрованныеДниСтажа.ЗанимаемыхСтавок,
	|	НефильтрованныеДниСтажа.СтавокДляТерриториальныхУсловий,
	|	НефильтрованныеДниСтажа.Должность,
	|	НефильтрованныеДниСтажа.Должность.ЗамещениеГосударственныхМуниципальныхДолжностей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыПоследнихЗаписей.Должность,
	|	ПериодыПоследнихЗаписей.ДатаКалендаря,
	|	КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда
	|ПОМЕСТИТЬ ВТКлассыУсловийТрудаПоДолжностям
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НачалаПериодовПостоянства.Должность КАК Должность,
	|		НачалаПериодовПостоянства.ДатаКалендаря КАК ДатаКалендаря,
	|		МАКСИМУМ(КлассыУсловийТрудаПоДолжностям.Период) КАК Период
	|	ИЗ
	|		ВТДниСтажаДоОбработкиПараметровИсчСтажа КАК НачалаПериодовПостоянства
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
	|			ПО НачалаПериодовПостоянства.Должность = КлассыУсловийТрудаПоДолжностям.Должность
	|				И НачалаПериодовПостоянства.ДатаКалендаря >= КлассыУсловийТрудаПоДолжностям.Период
	|				И (&УсловиеВключенияДанных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НачалаПериодовПостоянства.Должность,
	|		НачалаПериодовПостоянства.ДатаКалендаря) КАК ПериодыПоследнихЗаписей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
	|		ПО ПериодыПоследнихЗаписей.Должность = КлассыУсловийТрудаПоДолжностям.Должность
	|			И ПериодыПоследнихЗаписей.Период = КлассыУсловийТрудаПоДолжностям.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ДатаКалендаря,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.СледующаяДатаКалендаря,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ПредыдущаяДатаКалендаря КАК ПредыдущаяДатаКалендаря,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ТретийПараметрИсчисляемогоСтажа,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ЗамещениеГосударственныхМуниципальныхДолжностей,
	|	ВЫБОР
	|		КОГДА НЕ ДниСтажаДоОбработкиПараметровИсчСтажа.ТретийПараметрИсчисляемогоСтажа В (&ПарамИсчСПравомНаДосрочнуюПенсию)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.ПустаяСсылка)
	|		ИНАЧЕ ДниСтажаДоОбработкиПараметровИсчСтажа.ТерриториальныеУсловия
	|	КОНЕЦ КАК ТерриториальныеУсловия,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.Сотрудник КАК Сотрудник,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ФизЛицо КАК ФизЛицо,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ОтчетныйПериод КАК ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА ДниСтажаДоОбработкиПараметровИсчСтажа.ОсобыеУсловияТруда В (ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.Ст27_3), ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.Ст27_4))
	|				И ДниСтажаДоОбработкиПараметровИсчСтажа.ФизЛицо.Пол = ЗНАЧЕНИЕ(Перечисление.ПолФизическихЛиц.Мужской)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|		КОГДА НЕ ДниСтажаДоОбработкиПараметровИсчСтажа.ТретийПараметрИсчисляемогоСтажа В (&ПарамИсчСПравомНаДосрочнуюПенсию)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|		КОГДА ДниСтажаДоОбработкиПараметровИсчСтажа.ОсобыеУсловияТруда = ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.Ст28_СЕВ)
	|			ТОГДА ДниСтажаДоОбработкиПараметровИсчСтажа.ОсобыеУсловияТруда
	|		КОГДА ЕСТЬNULL(КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|		ИНАЧЕ ДниСтажаДоОбработкиПараметровИсчСтажа.ОсобыеУсловияТруда
	|	КОНЕЦ КАК ОсобыеУсловияТруда,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения.ПустаяСсылка)
	|		КОГДА НЕ ДниСтажаДоОбработкиПараметровИсчСтажа.ТретийПараметрИсчисляемогоСтажа В (&ПарамИсчСПравомНаДосрочнуюПенсию)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения.ПустаяСсылка)
	|		ИНАЧЕ ДниСтажаДоОбработкиПараметровИсчСтажа.КодПозицииСписка
	|	КОНЕЦ КАК КодПозицииСписка,
	|	ВЫБОР
	|		КОГДА НЕ ДниСтажаДоОбработкиПараметровИсчСтажа.ТретийПараметрИсчисляемогоСтажа В (&ПарамИсчСПравомНаДосрочнуюПенсию)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)
	|		КОГДА ДниСтажаДоОбработкиПараметровИсчСтажа.ОснованиеВыслугиЛет В (ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст27_11ВП), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст27_11ГР), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст27_12), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст27_14), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст27_15), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст28_СП), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.САМОЛЕТ))
	|				И ЕСТЬNULL(КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный), ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)
	|		ИНАЧЕ ДниСтажаДоОбработкиПараметровИсчСтажа.ОснованиеВыслугиЛет
	|	КОНЕЦ КАК ОснованиеВыслугиЛет,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.ЗанимаемыхСтавок,
	|	ДниСтажаДоОбработкиПараметровИсчСтажа.СтавокДляТерриториальныхУсловий
	|ПОМЕСТИТЬ ВТДниСтажа2014
	|ИЗ
	|	ВТДниСтажаДоОбработкиПараметровИсчСтажа КАК ДниСтажаДоОбработкиПараметровИсчСтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКлассыУсловийТрудаПоДолжностям КАК КлассыУсловийТрудаПоДолжностям
	|		ПО ДниСтажаДоОбработкиПараметровИсчСтажа.ДатаКалендаря = КлассыУсловийТрудаПоДолжностям.ДатаКалендаря
	|			И ДниСтажаДоОбработкиПараметровИсчСтажа.Должность = КлассыУсловийТрудаПоДолжностям.Должность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетныйПериод,
	|	ОбособленноеПодразделение,
	|	ФизЛицо,
	|	ПредыдущаяДатаКалендаря,
	|	ТерриториальныеУсловия,
	|	ОсобыеУсловияТруда,
	|	КодПозицииСписка,
	|	ОснованиеВыслугиЛет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДниСтажаПредварительно.ФизЛицо,
	|	ДниСтажаПредварительно.ДатаКалендаря КАК Период
	|ИЗ
	|	ВТДниСтажа2014 КАК ДниСтажаПредварительно
	|ГДЕ
	|	ДниСтажаПредварительно.ТретийПараметрИсчисляемогоСтажа = ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДЛОТПУСК)";
	
	Если УчитыватьОпоздавшиеДанные Тогда
		СтрокаЗамены = "ДатаРегистрацииИзменений <= &ДатаАктуальности";
	Иначе	
		СтрокаЗамены = "НАЧАЛОПЕРИОДА(Период, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(ДатаРегистрацииИзменений, КВАРТАЛ)
	|					ИЛИ ДатаРегистрацииИзменений <= КОНЕЦПЕРИОДА(НачалаПериодовПостоянства.ДатаКалендаря, КВАРТАЛ)";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеВключенияДанных", СтрокаЗамены);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И &ПервоеДополнительноеУсловие",ПроцедурыПерсонифицированногоУчетаПереопределяемый.СЗВ4_ПолучитьДополнительныеУсловияДляСотрудников());
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И &ВтороеДополнительноеУсловие",ПроцедурыПерсонифицированногоУчетаПереопределяемый.СЗВ4_ПолучитьДополнительныеУсловияДляСотрудников("РаботникиОрганизации."));
	Запрос.Текст = 	СтрЗаменить(ТекстЗапроса,"И &ТретьеДополнительноеУсловие",ПроцедурыПерсонифицированногоУчетаПереопределяемый.СЗВ4_ПолучитьДополнительныеУсловияДляСотрудников("Работники."));
	
	ИсключаемыеОснованияВыслугиЛет = ПроцедурыПерсонифицированногоУчета.ИсключаемыеДляДлительногоОтпускОснованияВыслугиЛет();
	ИсключаемыеОснованияВыслугиЛет.Добавить(Справочники.ОснованияВыслугиЛет.ПустаяСсылка());
	Запрос.УстановитьПараметр("ИсключаемыеДляДлительногоОтпускОснованияВыслугиЛет", ИсключаемыеОснованияВыслугиЛет);
	Запрос.УстановитьПараметр("ФактНачисленияВзносов", ДанныеОФактеНачисленияВзносовЗаПериоды(ОбособленноеПодразделение, Запрос.Выполнить().Выгрузить()));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФактНачисленияВзносов.ФизЛицо,
	|	ФактНачисленияВзносов.Период,
	|	ФактНачисленияВзносов.ПФРНаОПС,
	|	ФактНачисленияВзносов.ПФРПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТФактНачисленияВзносов
	|ИЗ
	|	&ФактНачисленияВзносов КАК ФактНачисленияВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДниСтажаПредварительно.ДатаКалендаря,
	|	ДниСтажаПредварительно.СледующаяДатаКалендаря,
	|	ДниСтажаПредварительно.ПредыдущаяДатаКалендаря КАК ПредыдущаяДатаКалендаря,
	|	ВЫБОР
	|		КОГДА ДниСтажаПредварительно.ТретийПараметрИсчисляемогоСтажа <> ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДЛОТПУСК)
	|			ТОГДА ДниСтажаПредварительно.ТретийПараметрИсчисляемогоСтажа
	|		КОГДА ЕСТЬNULL(ФактНачисленияВзносов.ПФРПоДополнительномуТарифу, ЛОЖЬ) = ЛОЖЬ
	|				И НЕ(ДниСтажаПредварительно.ОсобыеУсловияТруда = ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|						И ДниСтажаПредварительно.ОснованиеВыслугиЛет В (&ИсключаемыеДляДлительногоОтпускОснованияВыслугиЛет))
	|			ТОГДА ДниСтажаПредварительно.ТретийПараметрИсчисляемогоСтажа
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПараметрыИсчисляемогоСтраховогоСтажа2014.ПустаяСсылка)
	|	КОНЕЦ КАК ТретийПараметрИсчисляемогоСтажа,
	|	ДниСтажаПредварительно.ЗамещениеГосударственныхМуниципальныхДолжностей,
	|	ДниСтажаПредварительно.ТерриториальныеУсловия,
	|	ДниСтажаПредварительно.Сотрудник КАК Сотрудник,
	|	ДниСтажаПредварительно.ФизЛицо КАК ФизЛицо,
	|	ДниСтажаПредварительно.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ДниСтажаПредварительно.ОтчетныйПериод КАК ОтчетныйПериод,
	|	ДниСтажаПредварительно.ОсобыеУсловияТруда,
	|	ДниСтажаПредварительно.КодПозицииСписка,
	|	ДниСтажаПредварительно.ОснованиеВыслугиЛет,
	|	ДниСтажаПредварительно.ЗанимаемыхСтавок,
	|	ДниСтажаПредварительно.СтавокДляТерриториальныхУсловий
	|ПОМЕСТИТЬ ВТДниСтажа
	|ИЗ
	|	ВТДниСтажа2014 КАК ДниСтажаПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФактНачисленияВзносов КАК ФактНачисленияВзносов
	|		ПО ДниСтажаПредварительно.ФизЛицо = ФактНачисленияВзносов.ФизЛицо
	|			И ДниСтажаПредварительно.ДатаКалендаря = ФактНачисленияВзносов.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетныйПериод,
	|	ОбособленноеПодразделение,
	|	ФизЛицо,
	|	ПредыдущаяДатаКалендаря,
	|	ДниСтажаПредварительно.ТерриториальныеУсловия,
	|	ДниСтажаПредварительно.ОсобыеУсловияТруда,
	|	ДниСтажаПредварительно.КодПозицииСписка,
	|	ДниСтажаПредварительно.ОснованиеВыслугиЛет";
	Запрос.Выполнить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТекущийДень.ДатаКалендаря КАК НачалоПериода,
	|	ТекущийДень.ТретийПараметрИсчисляемогоСтажа,
	|	ТекущийДень.ЗамещениеГосударственныхМуниципальныхДолжностей,
	|	ТекущийДень.ТерриториальныеУсловия,
	|	ТекущийДень.ФизЛицо КАК ФизЛицо,
	|	ТекущийДень.ОбособленноеПодразделение,
	|	ТекущийДень.ОтчетныйПериод,
	|	ТекущийДень.ОсобыеУсловияТруда,
	|	ТекущийДень.КодПозицииСписка,
	|	ТекущийДень.ОснованиеВыслугиЛет,
	|	ТекущийДень.ЗанимаемыхСтавок,
	|	ТекущийДень.СтавокДляТерриториальныхУсловий
	|ПОМЕСТИТЬ ВТНачалаПериодов
	|ИЗ
	|	ВТДниСтажа КАК ТекущийДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДниСтажа КАК ПредыдущийДень
	|		ПО ТекущийДень.ДатаКалендаря = ПредыдущийДень.СледующаяДатаКалендаря
	|			И ТекущийДень.ТерриториальныеУсловия = ПредыдущийДень.ТерриториальныеУсловия
	|			И ТекущийДень.ТретийПараметрИсчисляемогоСтажа = ПредыдущийДень.ТретийПараметрИсчисляемогоСтажа
	|			И ТекущийДень.ЗамещениеГосударственныхМуниципальныхДолжностей = ПредыдущийДень.ЗамещениеГосударственныхМуниципальныхДолжностей
	|			И ТекущийДень.ФизЛицо = ПредыдущийДень.ФизЛицо
	|			И ТекущийДень.ОбособленноеПодразделение = ПредыдущийДень.ОбособленноеПодразделение
	|			И ТекущийДень.ОтчетныйПериод = ПредыдущийДень.ОтчетныйПериод
	|			И ТекущийДень.ОсобыеУсловияТруда = ПредыдущийДень.ОсобыеУсловияТруда
	|			И ТекущийДень.КодПозицииСписка = ПредыдущийДень.КодПозицииСписка
	|			И ТекущийДень.ОснованиеВыслугиЛет = ПредыдущийДень.ОснованиеВыслугиЛет
	|			И ТекущийДень.ЗанимаемыхСтавок = ПредыдущийДень.ЗанимаемыхСтавок
	|			И ТекущийДень.СтавокДляТерриториальныхУсловий = ПредыдущийДень.СтавокДляТерриториальныхУсловий
	|ГДЕ
	|	ПредыдущийДень.ФизЛицо ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийДень.ДатаКалендаря КАК ОкончаниеПериода,
	|	ТекущийДень.ТретийПараметрИсчисляемогоСтажа,
	|	ТекущийДень.ЗамещениеГосударственныхМуниципальныхДолжностей,
	|	ТекущийДень.ТерриториальныеУсловия,
	|	ТекущийДень.ФизЛицо КАК ФизЛицо,
	|	ТекущийДень.ОбособленноеПодразделение,
	|	ТекущийДень.ОтчетныйПериод,
	|	ТекущийДень.ОсобыеУсловияТруда,
	|	ТекущийДень.КодПозицииСписка,
	|	ТекущийДень.ОснованиеВыслугиЛет,
	|	ТекущийДень.ЗанимаемыхСтавок,
	|	ТекущийДень.СтавокДляТерриториальныхУсловий
	|ПОМЕСТИТЬ ВТОкончанияПериодов
	|ИЗ
	|	ВТДниСтажа КАК ТекущийДень
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДниСтажа КАК СледующийДень
	|		ПО ТекущийДень.ДатаКалендаря = СледующийДень.ПредыдущаяДатаКалендаря
	|			И ТекущийДень.ТерриториальныеУсловия = СледующийДень.ТерриториальныеУсловия
	|			И ТекущийДень.ТретийПараметрИсчисляемогоСтажа = СледующийДень.ТретийПараметрИсчисляемогоСтажа
	|			И ТекущийДень.ЗамещениеГосударственныхМуниципальныхДолжностей = СледующийДень.ЗамещениеГосударственныхМуниципальныхДолжностей
	|			И ТекущийДень.ФизЛицо = СледующийДень.ФизЛицо
	|			И ТекущийДень.ОбособленноеПодразделение = СледующийДень.ОбособленноеПодразделение
	|			И ТекущийДень.ОтчетныйПериод = СледующийДень.ОтчетныйПериод
	|			И ТекущийДень.ОсобыеУсловияТруда = СледующийДень.ОсобыеУсловияТруда
	|			И ТекущийДень.КодПозицииСписка = СледующийДень.КодПозицииСписка
	|			И ТекущийДень.ОснованиеВыслугиЛет = СледующийДень.ОснованиеВыслугиЛет
	|			И ТекущийДень.ЗанимаемыхСтавок = СледующийДень.ЗанимаемыхСтавок
	|			И ТекущийДень.СтавокДляТерриториальныхУсловий = СледующийДень.СтавокДляТерриториальныхУсловий
	|ГДЕ
	|	СледующийДень.ФизЛицо ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачалаПериодов.ФизЛицо КАК ФизЛицо,
	|	НачалаПериодов.НачалоПериода КАК ДатаНачалаПериода,
	|	ЕСТЬNULL(МИНИМУМ(ОкончанияПериодов.ОкончаниеПериода), НачалаПериодов.НачалоПериода) КАК ДатаОкончанияПериода,
	|	НачалаПериодов.ОсобыеУсловияТруда,
	|	НачалаПериодов.КодПозицииСписка,
	|	НачалаПериодов.ТретийПараметрИсчисляемогоСтажа,
	|	НачалаПериодов.ЗамещениеГосударственныхМуниципальныхДолжностей,
	|	НачалаПериодов.ОснованиеВыслугиЛет,
	|	НачалаПериодов.ТерриториальныеУсловия,
	|	ВЫБОР
	|		КОГДА НачалаПериодов.ТерриториальныеУсловия В (ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.МКС), ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.МКСР), ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.РКС), ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.РКСМ))
	|			ТОГДА НачалаПериодов.СтавокДляТерриториальныхУсловий
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПараметрТерриториальныхУсловий,
	|	ВЫБОР
	|		КОГДА НачалаПериодов.ОснованиеВыслугиЛет В (ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст28_ПД), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст28_СМХР), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст28_СМ), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст28_ГДХР), ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.Ст28_ГД))
	|			ТОГДА НачалаПериодов.ЗанимаемыхСтавок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТретийПараметрВыслугиЛет
	|ИЗ
	|	ВТНачалаПериодов КАК НачалаПериодов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОкончанияПериодов КАК ОкончанияПериодов
	|		ПО НачалаПериодов.ТерриториальныеУсловия = ОкончанияПериодов.ТерриториальныеУсловия
	|			И НачалаПериодов.ТретийПараметрИсчисляемогоСтажа = ОкончанияПериодов.ТретийПараметрИсчисляемогоСтажа
	|			И НачалаПериодов.ЗамещениеГосударственныхМуниципальныхДолжностей = ОкончанияПериодов.ЗамещениеГосударственныхМуниципальныхДолжностей
	|			И НачалаПериодов.ФизЛицо = ОкончанияПериодов.ФизЛицо
	|			И НачалаПериодов.ОбособленноеПодразделение = ОкончанияПериодов.ОбособленноеПодразделение
	|			И НачалаПериодов.ОтчетныйПериод = ОкончанияПериодов.ОтчетныйПериод
	|			И НачалаПериодов.ОсобыеУсловияТруда = ОкончанияПериодов.ОсобыеУсловияТруда
	|			И НачалаПериодов.КодПозицииСписка = ОкончанияПериодов.КодПозицииСписка
	|			И НачалаПериодов.ОснованиеВыслугиЛет = ОкончанияПериодов.ОснованиеВыслугиЛет
	|			И НачалаПериодов.НачалоПериода <= ОкончанияПериодов.ОкончаниеПериода
	|			И НачалаПериодов.ЗанимаемыхСтавок = ОкончанияПериодов.ЗанимаемыхСтавок
	|			И НачалаПериодов.СтавокДляТерриториальныхУсловий = ОкончанияПериодов.СтавокДляТерриториальныхУсловий
	|
	|СГРУППИРОВАТЬ ПО
	|	НачалаПериодов.НачалоПериода,
	|	НачалаПериодов.ТерриториальныеУсловия,
	|	НачалаПериодов.ТретийПараметрИсчисляемогоСтажа,
	|	НачалаПериодов.ЗамещениеГосударственныхМуниципальныхДолжностей,
	|	НачалаПериодов.ФизЛицо,
	|	НачалаПериодов.КодПозицииСписка,
	|	НачалаПериодов.ОсобыеУсловияТруда,
	|	НачалаПериодов.ОснованиеВыслугиЛет,
	|	НачалаПериодов.ЗанимаемыхСтавок,
	|	НачалаПериодов.СтавокДляТерриториальныхУсловий
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	ДатаНачалаПериода";
	
	//
	ПериодыДоговоровТекст = 
	"ВЫБРАТЬ 
	|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо КАК Физлицо,
	|	&ОтчетныйПериод КАК ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.КодПоОКТМО, """") = """"
	|				И ЕСТЬNULL(ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.КодПоОКАТО, """") = """"
	|			ТОГДА &ТерриториальныеУсловия
	|		ИНАЧЕ ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.ТерриториальныеУсловияПФР
	|	КОНЕЦ КАК ТерриториальныеУсловия,
	|	ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка) КАК ОсобыеУсловияТруда,
	|	"""" КАК КодПозицииСписка,
	|	ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка) КАК ОснованиеВыслугиЛет,
	|	ВЫБОР
	|		КОГДА ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала < &НачалоГода
	|			ТОГДА &НачалоГода
	|		ИНАЧЕ ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала
	|	КОНЕЦ КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания < &НачалоСледующегоГода
	|			ТОГДА ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания
	|		ИНАЧЕ &КонецГода
	|	КОНЕЦ КАК ДатаОкончанияПериода
	|ИЗ
	|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|ГДЕ
	|	ДоговорНаВыполнениеРаботСФизЛицом.Организация = &Организация
	|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &КонецГода
	|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &НачалоГода
	|	И (&НеОтбиратьДанныеПоФизлицу
	|			ИЛИ ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо В (&СписокФизЛиц))
	|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|	И (&НеИсключатьРаботающихВСтудотряде
	|			ИЛИ НЕ ДоговорНаВыполнениеРаботСФизЛицом.ЗаключенСоСтудентомРаботающимВСтудотряде)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Физлицо,
	|	ДатаОкончанияПериода,
	|	ДатаНачалаПериода";
	
	Запрос.Текст = ТекстЗапроса;
	ТаблицаСтажа = Запрос.Выполнить().Выгрузить();
	ТаблицаСтажа.Индексы.Добавить("ФизЛицо");
	
	// Удалим из таблицы стажа незначимые записи:
	//  - если по физлицу имеется 2 непрерывных записи с одинаковыми условиями труда, то объединим данные записи 
	Н = ТаблицаСтажа.Количество() - 1;
	Пока Н > 0 Цикл
		
		ТекущаяЗапись = ТаблицаСтажа[Н];
		ПредшествующаяЗапись = ТаблицаСтажа[Н-1];
		
		Если ТекущаяЗапись.ФизЛицо = ПредшествующаяЗапись.ФизЛицо // если совпадает физлицо
			И (ТекущаяЗапись.ДатаНачалаПериода = КонецДня(ПредшествующаяЗапись.ДатаОкончанияПериода)+1
			ИЛИ КонецДня(ТекущаяЗапись.ДатаНачалаПериода) = КонецДня(ПредшествующаяЗапись.ДатаОкончанияПериода)) // если записи непрерывны (идут друг за другом по времени)
			// и совпадают параметры стажа
			И ТекущаяЗапись.ОсобыеУсловияТруда = ПредшествующаяЗапись.ОсобыеУсловияТруда
			И СокрЛП(ТекущаяЗапись.КодПозицииСписка) = СокрЛП(ПредшествующаяЗапись.КодПозицииСписка)
			И ТекущаяЗапись.ОснованиеВыслугиЛет = ПредшествующаяЗапись.ОснованиеВыслугиЛет
			И ТекущаяЗапись.ТерриториальныеУсловия = ПредшествующаяЗапись.ТерриториальныеУсловия
			И ТекущаяЗапись.ПараметрТерриториальныхУсловий = ПредшествующаяЗапись.ПараметрТерриториальныхУсловий
			И ТекущаяЗапись.ТретийПараметрИсчисляемогоСтажа = ПредшествующаяЗапись.ТретийПараметрИсчисляемогоСтажа
			И ТекущаяЗапись.ЗамещениеГосударственныхМуниципальныхДолжностей = ПредшествующаяЗапись.ЗамещениеГосударственныхМуниципальныхДолжностей
			И ТекущаяЗапись.ТретийПараметрВыслугиЛет = ПредшествующаяЗапись.ТретийПараметрВыслугиЛет
			Тогда
			// объединим записи в одну
			ПредшествующаяЗапись.ДатаОкончанияПериода = ТекущаяЗапись.ДатаОкончанияПериода;
			ТаблицаСтажа.Удалить(ТекущаяЗапись);
		КонецЕсли;
		Н = Н - 1;
	КонецЦикла;
	ТаблицаСтажа.Сортировать("ФизЛицо,ДатаНачалаПериода");
	
	Запрос.Текст = ПериодыДоговоровТекст;
	ТаблицаСтажаПоДоговорам = Запрос.Выполнить().Выгрузить();
	
	Н = ТаблицаСтажаПоДоговорам.Количество() - 1;
	Пока Н > 0 Цикл
		
		ТекущаяЗапись = ТаблицаСтажаПоДоговорам[Н];
		ПредшествующаяЗапись = ТаблицаСтажаПоДоговорам[Н-1];
		
		Если ТекущаяЗапись.ФизЛицо = ПредшествующаяЗапись.ФизЛицо // если совпадает физлицо
			И ТекущаяЗапись.ДатаНачалаПериода <= КонецДня(ПредшествующаяЗапись.ДатаОкончанияПериода)+1 // если записи идут друг за другом или пересекаются 
			Тогда
			// объединим записи в одну
			ПредшествующаяЗапись.ДатаОкончанияПериода = Макс(ТекущаяЗапись.ДатаОкончанияПериода, ПредшествующаяЗапись.ДатаОкончанияПериода); 
			ПредшествующаяЗапись.ДатаНачалаПериода = Мин(ТекущаяЗапись.ДатаНачалаПериода, ПредшествующаяЗапись.ДатаНачалаПериода); 
			ТаблицаСтажаПоДоговорам.Удалить(ТекущаяЗапись);
		КонецЕсли;
		Н = Н - 1;
	КонецЦикла;
	
	ТаблицаСтажаПоДоговорам.Сортировать("ФизЛицо,ДатаНачалаПериода");
	Если ВыделятьСтажПоДоговорамГПХ Тогда
		ТаблицаСтажаПоДоговорам.Колонки.Добавить("ТретийПараметрИсчисляемогоСтажа", Новый ОписаниеТипов("СправочникСсылка.ПараметрыИсчисляемогоСтраховогоСтажа2014"));
		ТаблицаСтажаПоДоговорам.ЗаполнитьЗначения(Справочники.ПараметрыИсчисляемогоСтраховогоСтажа2014.ДОГОВОР, "ТретийПараметрИсчисляемогоСтажа");
		ВременнаяТаблица = ТаблицаСтажа.СкопироватьКолонки();
		ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(ТаблицаСтажаПоДоговорам, ВременнаяТаблица);
		ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(ТаблицаСтажа, ВременнаяТаблица);
		ТаблицаСтажа = ВременнаяТаблица;
	Иначе
		ПредшествующееФизЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
		МассивСтрок = Новый Массив;
		СтрокСтажа = 0;
		СтруктураПоиска = Новый Структура("ФизЛицо");
		Н = ТаблицаСтажаПоДоговорам.Количество();
		Пока Н > 0 Цикл
			
			ТекущаяЗапись = ТаблицаСтажаПоДоговорам[Н - 1];
			
			Если ТекущаяЗапись.ФизЛицо <> ПредшествующееФизЛицо Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПоиска,ТекущаяЗапись);
				МассивСтрок = ТаблицаСтажа.НайтиСтроки(СтруктураПоиска);
				ПредшествующееФизЛицо = ТекущаяЗапись.ФизЛицо;
			КонецЕсли;
			
			СтрокСтажа = МассивСтрок.Количество();
			Если СтрокСтажа = 0 Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаСтажа.Добавить(),ТекущаяЗапись);
				Н = Н - 1;
				Продолжить;
			КонецЕсли;
			
			ДатаНачалаПериода = НачалоДня(ТекущаяЗапись.ДатаНачалаПериода);
			ДатаОкончанияПериода = КонецДня(ТекущаяЗапись.ДатаОкончанияПериода);
			
			Для Сч = 1 По СтрокСтажа Цикл
				
				СтрокаСтажа = МассивСтрок[СтрокСтажа - Сч];
				ДатаНачалаСтрокиСтажа = НачалоДня(СтрокаСтажа.ДатаНачалаПериода);
				ДатаОкончанияСтрокиСтажа = КонецДня(СтрокаСтажа.ДатаОкончанияПериода);
				
				Если ДатаНачалаСтрокиСтажа > ДатаОкончанияПериода Тогда
				ИначеЕсли ДатаНачалаСтрокиСтажа > ДатаНачалаПериода Тогда
					Если ДатаОкончанияСтрокиСтажа < ДатаОкончанияПериода Тогда
						НоваяСтрока = ТаблицаСтажа.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяЗапись);
						НоваяСтрока.ДатаНачалаПериода = ДатаОкончанияСтрокиСтажа + 1;
						НоваяСтрока.ДатаОкончанияПериода = ДатаОкончанияПериода;
					КонецЕсли;
					ДатаОкончанияПериода = НачалоДня(СтрокаСтажа.ДатаНачалаПериода - 1);
				Иначе
					Если ДатаОкончанияСтрокиСтажа >= ДатаНачалаПериода Тогда
						ДатаНачалаПериода = ДатаОкончанияСтрокиСтажа + 1;
					КонецЕсли;
					Прервать;
				КонецЕсли;
				МассивСтрок.Удалить(СтрокСтажа - Сч);
			КонецЦикла;
			
			Если ДатаОкончанияПериода >= ДатаНачалаПериода Тогда
				НоваяСтрока = ТаблицаСтажа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяЗапись);
				НоваяСтрока.ДатаНачалаПериода = ДатаНачалаПериода;
				НоваяСтрока.ДатаОкончанияПериода = ДатаОкончанияПериода;
			КонецЕсли;
			
			Н = Н - 1;
		КонецЦикла;
		
		ТаблицаСтажа.Сортировать("ФизЛицо,ДатаНачалаПериода");
		
		Н = ТаблицаСтажа.Количество() - 1;
		Пока Н > 0 Цикл
			
			ТекущаяЗапись = ТаблицаСтажа[Н];
			ПредшествующаяЗапись = ТаблицаСтажа[Н-1];
			
			Если ТекущаяЗапись.ФизЛицо = ПредшествующаяЗапись.ФизЛицо // если совпадает физлицо
				И (ТекущаяЗапись.ДатаНачалаПериода = КонецДня(ПредшествующаяЗапись.ДатаОкончанияПериода)+1 
				ИЛИ КонецДня(ТекущаяЗапись.ДатаНачалаПериода) = КонецДня(ПредшествующаяЗапись.ДатаОкончанияПериода)) // если записи непрерывны (идут друг за другом по времени)
				// и совпадают параметры стажа
				И ТекущаяЗапись.ОсобыеУсловияТруда = ПредшествующаяЗапись.ОсобыеУсловияТруда
				И СокрЛП(ТекущаяЗапись.КодПозицииСписка) = СокрЛП(ПредшествующаяЗапись.КодПозицииСписка)
				И ТекущаяЗапись.ОснованиеВыслугиЛет = ПредшествующаяЗапись.ОснованиеВыслугиЛет
				И ТекущаяЗапись.ТерриториальныеУсловия = ПредшествующаяЗапись.ТерриториальныеУсловия
				И ТекущаяЗапись.ПараметрТерриториальныхУсловий = ПредшествующаяЗапись.ПараметрТерриториальныхУсловий
				И ТекущаяЗапись.ТретийПараметрИсчисляемогоСтажа = ПредшествующаяЗапись.ТретийПараметрИсчисляемогоСтажа
				И ТекущаяЗапись.ЗамещениеГосударственныхМуниципальныхДолжностей = ПредшествующаяЗапись.ЗамещениеГосударственныхМуниципальныхДолжностей
				И ТекущаяЗапись.ТретийПараметрВыслугиЛет = ПредшествующаяЗапись.ТретийПараметрВыслугиЛет
				Тогда
				// объединим записи в одну
				ПредшествующаяЗапись.ДатаОкончанияПериода = ТекущаяЗапись.ДатаОкончанияПериода;
				ТаблицаСтажа.Удалить(ТекущаяЗапись);
			КонецЕсли;
			Н = Н - 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаСтажа;
	
КонецФункции

Функция ДанныеЗастрахованныхЛиц2014(ФизЛица, Организация, ОтчетныйПериод, ДатаАктуальности) Экспорт

	ДатаС = ОтчетныйПериод;
	ДатаПо = Мин(ДатаАктуальности,ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("ФизЛица", ФизЛица);
	Запрос.УстановитьПараметр("Начало", ДатаС);
	Запрос.УстановитьПараметр("Окончание", ДатаПо);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("ДатаСтрахованияВременноПребывающих", ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов());
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());
	Запрос.УстановитьПараметр("НеучитываемыеВидыДохода", РасчетСтраховыхВзносов.НеучитываемыеВидыДохода());
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(ДатаС);
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачалоМесяца(КонецМесяца),"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = Месяц(ДатаС) По Месяц(ДатаПо) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачалоМесяца(КонецМесяца),"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизЛица.Ссылка КАК ФизЛицо,
	|	ФизЛица.Наименование,
	|	ФизЛица.СтраховойНомерПФР,
	|	ВЫБОР
	|		КОГДА ФизЛица.СтраховойНомерПФР = """"
	|			ТОГДА ИСТИНА
	|		КОГДА ФизЛица.СтраховойНомерПФР = ""   -   -      ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетСтраховогоНомера
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Ссылка В(&ФизЛица)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ПОМЕСТИТЬ ВТФИО
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			&ДатаАктуальности,
	|			ФизЛицо В
	|				(ВЫБРАТЬ
	|					ФизЛица.ФизЛицо
	|				ИЗ
	|					ВТФизЛица КАК ФизЛица)) КАК ФИОФизЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеВидыДохода)
	|				ТОГДА СведенияОДоходах.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъектНестрахуемых,
	|	СУММА(СведенияОДоходах.Результат) КАК ВесьОбъект,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТСоставДоходов
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Лица.ФизЛицо КАК ФизЛицо
	|			ИЗ
	|				ВТФизлица КАК Лица)
	|	И НЕ СведенияОДоходах.ВидДохода В (&НеучитываемыеВидыДохода)
	|	И СведенияОДоходах.Организация = &ГоловнаяОрганизация
	|	И СведенияОДоходах.ДатаПолученияДохода МЕЖДУ &Начало И &Окончание
	|	И СведенияОДоходах.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СведенияОДоходах.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	НЕ ГражданствоФизЛиц.НеИмеетПравоНаПенсию КАК ИмеетПравоНаСтрахование
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО (КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ) >= ГражданствоФизЛиц.Период)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизлица КАК Лица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Период,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= Периоды.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛица КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО (КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ) >= ВременноПребывающие.Период)
	|				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
	|				И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|	ГДЕ
	|		Периоды.Период >= &ДатаСтрахованияВременноПребывающих
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		СписокСотрудников.ФизЛицо) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &ГоловнаяОрганизация)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.ФизЛицо,
	|	ТаблицаФизлиц.Наименование,
	|	ТаблицаФизлиц.СтраховойНомерПФР,
	|	ТаблицаФизлиц.НетСтраховогоНомера,
	|	ЕСТЬNULL(ФИО.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ФИО.Отчество, """") КАК Отчество,
	|	ЕСТЬNULL(ФИО.Фамилия, """") КАК Фамилия,
	|	ЛОЖЬ КАК СотрудникУволен
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИО КАК ФИО
	|		ПО ТаблицаФизлиц.ФизЛицо = ФИО.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоставДоходов КАК СоставДоходов
	|		ПО (Периоды.Период = СоставДоходов.Период)
	|			И ТаблицаФизлиц.ФизЛицо = СоставДоходов.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО (Периоды.Период = Гражданство.Период)
	|			И ТаблицаФизлиц.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО (Периоды.Период = ПринятыеПоДолгосрочнымДоговорам.Период)
	|			И ТаблицаФизлиц.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|ГДЕ
	|	(ЕСТЬNULL(Гражданство.ИмеетПравоНаСтрахование, ИСТИНА)
	|			ИЛИ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ))
	|	И (ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) = 0
	|			ИЛИ ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) <> ЕСТЬNULL(СоставДоходов.ОбъектНестрахуемых, 0))";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ДанныеЗастрахованныхЛиц(ФизЛица, Организация, ОтчетныйПериод, ДатаАктуальности) Экспорт

	Если ОтчетныйПериод < РасчетСтраховыхВзносов.ДатаСтрахованияВсехВременноПребывающих() Тогда
		Возврат ДанныеЗастрахованныхЛиц2014(ФизЛица, Организация, ОтчетныйПериод, ДатаАктуальности)
	КонецЕсли;
	
	ДатаС = ОтчетныйПериод;
	ДатаПо = Мин(ДатаАктуальности,ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("ФизЛица", ФизЛица);
	Запрос.УстановитьПараметр("Начало", ДатаС);
	Запрос.УстановитьПараметр("Окончание", ДатаПо);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("НестрахуемыеВидыДохода", ПроцедурыПерсонифицированногоУчета.НестрахуемыеВидыДохода());
	Запрос.УстановитьПараметр("НеучитываемыеВидыДохода", РасчетСтраховыхВзносов.НеучитываемыеВидыДохода());
	Запрос.УстановитьПараметр("ДоговорыЗЛ", ПроцедурыУправленияПерсоналомПереопределяемый.СписокДоговоровФормыВыбораСотрудника(2));
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(ДатаС);
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачалоМесяца(КонецМесяца),"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = Месяц(ДатаС) По Месяц(ДатаПо) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(НачалоМесяца(КонецМесяца),"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизЛица.Ссылка КАК ФизЛицо,
	|	ФизЛица.Наименование,
	|	ФизЛица.СтраховойНомерПФР,
	|	ВЫБОР
	|		КОГДА ФизЛица.СтраховойНомерПФР = """"
	|			ТОГДА ИСТИНА
	|		КОГДА ФизЛица.СтраховойНомерПФР = ""   -   -      ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетСтраховогоНомера
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Ссылка В(&ФизЛица)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ПОМЕСТИТЬ ВТФИО
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			&ДатаАктуальности,
	|			ФизЛицо В
	|				(ВЫБРАТЬ
	|					ФизЛица.ФизЛицо
	|				ИЗ
	|					ВТФизЛица КАК ФизЛица)) КАК ФИОФизЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода В (&НестрахуемыеВидыДохода)
	|				ТОГДА СведенияОДоходах.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОбъектНестрахуемых,
	|	СУММА(СведенияОДоходах.Результат) КАК ВесьОбъект,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТСоставДоходов
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Лица.ФизЛицо КАК ФизЛицо
	|			ИЗ
	|				ВТФизлица КАК Лица)
	|	И НЕ СведенияОДоходах.ВидДохода В (&НеучитываемыеВидыДохода)
	|	И СведенияОДоходах.Организация = &ГоловнаяОрганизация
	|	И СведенияОДоходах.ДатаПолученияДохода МЕЖДУ &Начало И &Окончание
	|	И СведенияОДоходах.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СведенияОДоходах.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахование
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО (КОНЕЦПЕРИОДА(Периоды.Период, МЕСЯЦ) >= ГражданствоФизЛиц.Период)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизлица КАК Лица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиОрганизаций.Физлицо,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СотрудникиОрганизаций.ДатаУвольнения > &Окончание
	|				ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИНАЧЕ СотрудникиОрганизаций.ДатаУвольнения
	|		КОНЕЦ) КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|ГДЕ
	|	СотрудникиОрганизаций.Организация = &ГоловнаяОрганизация
	|	И СотрудникиОрганизаций.Физлицо В
	|			(ВЫБРАТЬ
	|				Лица.ФизЛицо КАК ФизЛицо
	|			ИЗ
	|				ВТФизлица КАК Лица)
	|	И СотрудникиОрганизаций.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)
	|	И СотрудникиОрганизаций.ВидДоговора В(&ДоговорыЗЛ)
	|	И СотрудникиОрганизаций.ДатаПриемаНаРаботу <= &Окончание
	|	И (СотрудникиОрганизаций.ДатаУвольнения >= &Начало
	|			ИЛИ СотрудникиОрганизаций.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиОрганизаций.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.ФизЛицо,
	|	ТаблицаФизлиц.Наименование,
	|	ТаблицаФизлиц.СтраховойНомерПФР,
	|	ТаблицаФизлиц.НетСтраховогоНомера,
	|	ЕСТЬNULL(ФИО.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ФИО.Отчество, """") КАК Отчество,
	|	ЕСТЬNULL(ФИО.Фамилия, """") КАК Фамилия,
	|	ВЫБОР
	|		КОГДА Сотрудники.ДатаУвольнения ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		КОГДА Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СотрудникУволен
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИО КАК ФИО
	|		ПО ТаблицаФизлиц.ФизЛицо = ФИО.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоставДоходов КАК СоставДоходов
	|		ПО (Периоды.Период = СоставДоходов.Период)
	|			И ТаблицаФизлиц.ФизЛицо = СоставДоходов.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО (Периоды.Период = Гражданство.Период)
	|			И ТаблицаФизлиц.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК Сотрудники
	|		ПО ТаблицаФизлиц.ФизЛицо = Сотрудники.Физлицо
	|ГДЕ
	|	ЕСТЬNULL(Гражданство.ИмеетПравоНаСтрахование, ИСТИНА)
	|	И (ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) = 0
	|			ИЛИ ЕСТЬNULL(СоставДоходов.ВесьОбъект, 0) <> ЕСТЬNULL(СоставДоходов.ОбъектНестрахуемых, 0))";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

////////////////////////////////////////////////////////////////////////////////

// Фозвращает таблицу с данныеми о факте начисления взносов физическим лицаз за периоды
//
// Параметры:
//		Организация   - СправочникСсылка.Организации - организация
//		ТаблицаФизлиц - ТаблицаЗначений - таблица с физлицами:
// 	                      * ФизЛицо - СправочникСсылка.ФизическиеЛица
// 	                      * Период  - Дата - месяц, в котором необходимо проверить факт начисления взносов
//
// Возвращаемое значение:
//		ТаблицаЗначений - таблица значений с колонками:
// 	        * ФизЛицо - СправочникСсылка.ФизическиеЛица
// 	        * Период  - Дата - месяц, в котором необходимо проверить факт начисления взносов
//			* ПФРНаОПС						- Булево - отражает факт начисления фзносов на ОПС
//			* ПФРПоДополнительномуТарифу	- Булево - отражает факт начисления фзносов по дополнительным тарифам
//
Функция ДанныеОФактеНачисленияВзносовЗаПериоды(Организация, ТаблицаФизлиц) Экспорт
	
	Если ТаблицаФизлиц.Количество() = 0 Тогда
		ПустойРезультат = ТаблицаФизлиц.СкопироватьКолонки();
		ПустойРезультат.Колонки.Добавить("ПФРНаОПС", Новый ОписаниеТипов("Булево"));
		ПустойРезультат.Колонки.Добавить("ПФРПоДополнительномуТарифу", Новый ОписаниеТипов("Булево"));
		Возврат ПустойРезультат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ТаблицаФизлиц", ТаблицаФизлиц);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.ФизЛицо,
	|	ФизическиеЛица.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(ФизическиеЛица.Период, МЕСЯЦ) КАК Месяц
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	&ТаблицаФизлиц КАК ФизическиеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленныеОбороты.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленныеОбороты.ПФРДоПредельнойВеличиныЕНВД) КАК ПФРНаОПС,
	|	СУММА(СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленныеОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК ПФРПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленныеОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ФизическиеЛица
	|		ПО СтраховыеВзносыИсчисленныеОбороты.ФизЛицо = ФизическиеЛица.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ) = ФизическиеЛица.Месяц)
	|ГДЕ
	|	СтраховыеВзносыИсчисленныеОбороты.ОбособленноеПодразделение = &Организация
	|	И СтраховыеВзносыИсчисленныеОбороты.Организация = &ГоловнаяОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.ДатаПолученияДохода, МЕСЯЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛица.ФизЛицо КАК ФизЛицо,
	|	ФизическиеЛица.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.ПФРНаОПС, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПФРНаОПС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.ПФРПоДополнительномуТарифу, 0) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПФРПоДополнительномуТарифу
	|ИЗ
	|	ВТФизЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|		ПО ФизическиеЛица.ФизЛицо = ИсчисленоПоЗЛ.ФизЛицо
	|			И ФизическиеЛица.Месяц = ИсчисленоПоЗЛ.МесяцОтчетногоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	Период";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

