
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СчетФактураВыданный = НайтиСчетФактуру(ПараметрКоманды);
	Если ЗначениеЗаполнено(СчетФактураВыданный) Тогда
		ПараметрыФормы = Новый Структура("Ключ", СчетФактураВыданный);
		ОткрытьФорму("Документ.СчетФактураВыданный.Форма.ФормаДокументаУправляемая", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
		Возврат;
	КонецЕсли;
	//Не нашли счет фактуру
	СтрокаСообщения = Нстр("ru = 'Счет-фактура еще не создан. Новый счет-фактуру можно создать на основании.'");
	Предупреждение(СтрокаСообщения);
КонецПроцедуры

&НаСервере
Функция НайтиСчетФактуру(ДокументСсылка)
	Возврат УчетНДС.НайтиПодчиненныйСчетФактуру(ДокументСсылка, "СчетФактураВыданный");
КонецФункции

