#Если ТолстыйКлиентОбычноеПриложение Тогда
	
Функция ДанныеТребованияОПредставленииПоясненийКДекларацииНДС(Требование) Экспорт
	
	Возврат КонтекстЭДО.ДанныеТребованияОПредставленииПоясненийКДекларацииНДС(Требование);
	
КонецФункции

Функция НаименованиеДокументаРеализацииПолномочий(Требование, ПриложенияТребования = Неопределено) Экспорт
	
	Наименование 	= "";
	Номер 			= СокрЛП(СтрЗаменить(Требование.НомерДокумента, "номер", ""));
	
	Если Требование.ВидДокумента = Перечисления.ВидыНалоговыхДокументов.ТребованиеОПредставленииПоясненийКДекларацииНДС Тогда
		
		Если ВТребованииЕстьXMLФайл(ПриложенияТребования) Тогда
			Наименование = НСтр("ru = 'Требование %Номер% от %Дата% о представлении пояснений к декларации по НДС %ПредставлениеДекларации%'");
			Наименование = СтрЗаменить(Наименование, "%ПредставлениеДекларации%", ПредставлениеДекларации(Требование, ПриложенияТребования));
		Иначе
			Наименование = НСтр("ru = 'Требование %Номер% от %Дата% о представлении пояснений'");
		КонецЕсли;
		
		Наименование = СтрЗаменить(Наименование, "%Номер%", Номер);
		Наименование = СтрЗаменить(Наименование, "%Дата%", Формат(Требование.ДатаДокумента, "ДЛФ=D"));
		
	Иначе
		Наименование = Строка(Требование.ВидДокумента) + " № " + Номер + " от " + Формат(Требование.ДатаДокумента, "ДЛФ=D");
	КонецЕсли;
	
	Возврат Наименование;
		
КонецФункции

Функция ВТребованииЕстьXMLФайл(ПриложенияТребования)

	Для Каждого Приложение Из ПриложенияТребования Цикл
		Если ВРег(Прав(Приложение.ИмяФайла, 3)) = "XML" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;

КонецФункции

Функция ПредставлениеДекларации(Требование, ПриложенияТребования = Неопределено) Экспорт
	
	// Добавляем сведения по декларации, если удается их получить
	СвойстваДекларации = КонтекстЭДО.СвойстваДекларацииИзФайлаТребованияОПредставленииПоясненийКДекларацииНДС(Требование, ПриложенияТребования);
	
	Представление = "";
	Если СвойстваДекларации <> Неопределено Тогда
		
		Представление = НСтр("ru = 'за %Период% %Год% г.%Уточнение%'");
		Представление = СтрЗаменить(Представление, "%Период%", НРег(СвойстваДекларации.Период));
		Представление = СтрЗаменить(Представление, "%Год%", СвойстваДекларации.Год);
		
		Если СвойстваДекларации.НомерКорректировки = 0 Тогда
			Уточнение = "";
		Иначе
			Уточнение = НСтр("ru = ' (К/%НомерУточнения%)'");
			Уточнение = СтрЗаменить(Уточнение, "%НомерУточнения%", Строка(СвойстваДекларации.НомерКорректировки));
		КонецЕсли;
		
		Представление = СтрЗаменить(Представление, "%Уточнение%", Уточнение);
		
	КонецЕсли;
	
	Возврат Представление;
		
КонецФункции

// Функция - Возвращает ответы с незавершенным документооборотом и
// 	и ответы с документооборотом, завершенным успешно.
//
// Параметры:
//  Требование	 - ДокументСсылка
// Возвращаемое значение:
//  Массив - ответы
Функция ОтправленныеОтветыНаТребованиеПоясненийКДекларацииНДС(Требование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоясненияКДекларацииПоНДС.Ссылка
		|ПОМЕСТИТЬ ВсеОтветы
		|ИЗ
		|	Документ.ПоясненияКДекларацииПоНДС КАК ПоясненияКДекларацииПоНДС
		|ГДЕ
		|	ПоясненияКДекларацииПоНДС.Требование = &ТребованиеСсылка
		|	И ПоясненияКДекларацииПоНДС.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦиклыОбмена.Ссылка,
		|	ЦиклыОбмена.Предмет
		|ПОМЕСТИТЬ ЦиклыОбменаОтветов
		|ИЗ
		|	Справочник.ЦиклыОбмена КАК ЦиклыОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОтветы КАК ВсеОтветы
		|		ПО ЦиклыОбмена.Предмет = ВсеОтветы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦиклыОбменаОтветов.Предмет КАК Ответ
		|ПОМЕСТИТЬ ОтправленныеОтветы
		|ИЗ
		|	Документ.ТранспортноеСообщение КАК ТранспортноеСообщение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЦиклыОбменаОтветов КАК ЦиклыОбменаОтветов
		|		ПО ТранспортноеСообщение.ЦиклОбмена = ЦиклыОбменаОтветов.Ссылка
		|ГДЕ
		|	ТранспортноеСообщение.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыТранспортныхСообщений.ПредставлениеНП)
		|	И ТранспортноеСообщение.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТранспортноеСообщение.Ссылка КАК ТранспортноеСообщение,
		|	ЦиклыОбменаОтветов.Предмет КАК Ответ,
		|	ТранспортноеСообщение.ПротоколСОшибкой
		|ПОМЕСТИТЬ ТранспортныеСообщенияСРезультатамиПриема
		|ИЗ
		|	Документ.ТранспортноеСообщение КАК ТранспортноеСообщение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЦиклыОбменаОтветов КАК ЦиклыОбменаОтветов
		|		ПО ТранспортноеСообщение.ЦиклОбмена = ЦиклыОбменаОтветов.Ссылка
		|ГДЕ
		|	ТранспортноеСообщение.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыТранспортныхСообщений.РезультатПриемаПредставлениеНО)
		|	И ТранспортноеСообщение.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТранспортныеСообщенияСРезультатамиПриема.Ответ
		|ПОМЕСТИТЬ ОтветыНеПринятые
		|ИЗ
		|	ТранспортныеСообщенияСРезультатамиПриема КАК ТранспортныеСообщенияСРезультатамиПриема
		|ГДЕ
		|	ТранспортныеСообщенияСРезультатамиПриема.ПротоколСОшибкой = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТранспортныеСообщенияСРезультатамиПриема.ТранспортноеСообщение,
		|	ТранспортныеСообщенияСРезультатамиПриема.Ответ
		|ПОМЕСТИТЬ ТранспортныеСообщенияУспешноПринятые
		|ИЗ
		|	ТранспортныеСообщенияСРезультатамиПриема КАК ТранспортныеСообщенияСРезультатамиПриема
		|ГДЕ
		|	ТранспортныеСообщенияСРезультатамиПриема.ПротоколСОшибкой = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтправленныеОтветы.Ответ
		|ПОМЕСТИТЬ ОтправленныеБезОшибочных
		|ИЗ
		|	ОтправленныеОтветы КАК ОтправленныеОтветы
		|ГДЕ
		|	НЕ ОтправленныеОтветы.Ответ В
		|				(ВЫБРАТЬ
		|					ОтветыНеПринятые.Ответ
		|				ИЗ
		|					ОтветыНеПринятые КАК ОтветыНеПринятые)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтправленныеБезОшибочных.Ответ
		|ИЗ
		|	ОтправленныеБезОшибочных КАК ОтправленныеБезОшибочных
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТранспортныеСообщенияУспешноПринятые.Ответ
		|ИЗ
		|	ТранспортныеСообщенияУспешноПринятые КАК ТранспортныеСообщенияУспешноПринятые";

	Запрос.УстановитьПараметр("ТребованиеСсылка", Требование);

	МассивОтветов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ответ");

	Возврат МассивОтветов;
	
КонецФункции

#КонецЕсли