
//Получает параметры формы для отрытия записи регистра
//
Функция ПолучитьПараметрыОткрытияФормыЗаписиПредметаСделки(ПредметСделки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПредметСделки) Тогда
		Возврат(Неопределено);
	КонецЕсли;
	
	ПараметрыПредметСделки = РегистрыСведений.ПредметыКонтролируемыхСделок.СоздатьНаборЗаписей();
	ПараметрыПредметСделки.Отбор.ПредметСделки.Значение = ПредметСделки;
	ПараметрыПредметСделки.Отбор.ПредметСделки.Использование = Истина;
	ПараметрыПредметСделки.Прочитать();
	Если ПараметрыПредметСделки.Количество() > 0 Тогда
		ПараметрыФормы = Новый Структура("Ключ",
			РегистрыСведений.ПредметыКонтролируемыхСделок.СоздатьКлючЗаписи(Новый Структура("ПредметСделки", ПредметСделки)));
	Иначе
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ПредметСделки", ПредметСделки));
		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДоступностьКлючевыхЗаписей",Ложь);
	
	Возврат(ПараметрыФормы);
	
КонецФункции
