/////////////////////////////////////////////////////////////////////
//
// Адаптационный модуль. Поддержка вызовов новой фуункциональности
//
/////////////////////////////////////////////////////////////////////

Функция ОбъектПоЭлементуФормы(Элемент)
	
	Попытка
		Родитель = Элемент.Родитель;
		Пока ТипЗнч(Родитель) <> Тип("УправляемаяФорма") Цикл
			Родитель = Родитель.Родитель;
		КонецЦикла;
		
		Возврат Родитель.Объект;
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции // ОбъектПоЭлементуФормы()

// Открывает подходящую форму контактной информации для редактирования или просмотра.
//
//  Параметры:
//      Параметры    - Произвольный - результат функции ПараметрыФормыКонтактнойИнформации.
//      Владелец     - Произвольный - параметр для открываемой формы.
//      Оповещение   - ОписаниеОповещения - для обработки закрытия формы.
//
//  Возвращаемое значение:
//   УправляемаяФорма - необходимая форма.
//
Функция ОткрытьФормуКонтактнойИнформации(Параметры, Владелец = Неопределено, Оповещение = Неопределено) Экспорт
	
	Если Параметры.Заголовок = НСтр("ru='Адрес'") Тогда
		ФормаАдреса = Обработки.РедактированиеКонтактнойИнформации.ПолучитьФорму("ФормаЗаписиАдреса");
		ФормаАдреса.НачальноеЗначениеВыбора = РегламентированнаяОтчетность.РазложитьАдрес(Параметры.Представление);
		
		Если ФормаАдреса.НачальноеЗначениеВыбора <> Неопределено Тогда
			ФормаАдреса.НачальноеЗначениеВыбора.Регион = ФормаАдреса.НачальноеЗначениеВыбора.Регион;
		КонецЕсли;
		
		Если ФормаАдреса.ОткрытьМодально() Тогда
			Адрес = СокрЛП(ФормаАдреса.КодСтраны) + ","
			+ СокрЛП(ФормаАдреса.Поле1) + ","
			+ СокрЛП(ФормаАдреса.КодРегиона) + ","
			+ СокрЛП(ФормаАдреса.Поле3) + ","
			+ СокрЛП(ФормаАдреса.Поле4) + ","
			+ СокрЛП(ФормаАдреса.Поле5) + ","
			+ СокрЛП(ФормаАдреса.Поле6) + ","
			+ СокрЛП(ФормаАдреса.Поле7) + ","
			+ СокрЛП(ФормаАдреса.Поле8) + ","
			+ СокрЛП(ФормаАдреса.Поле9) + ","
			+ СокрЛП(ФормаАдреса.ТипДома)    + ","
			+ СокрЛП(ФормаАдреса.ТипКорпуса)    + ","
			+ СокрЛП(ФормаАдреса.ТипКвартиры)    + ",";
			
			Возврат Адрес;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции