Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если РегламентированнаяОтчетность.КонтекстЭДОЛокальный() <> Неопределено Тогда
		РегламентированнаяОтчетность.КонтекстЭДОЛокальный().ПередЗаписьюОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если РегламентированнаяОтчетность.КонтекстЭДОЛокальный() <> Неопределено Тогда
		РегламентированнаяОтчетность.КонтекстЭДОЛокальный().ПриЗаписиОбъекта(ЭтотОбъект, Отказ);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(СообщениеОснование)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Если РегламентированнаяОтчетность.КонтекстЭДОЛокальный() <> Неопределено Тогда
		РегламентированнаяОтчетность.КонтекстЭДОЛокальный().ОбработкаЗаполненияОбъекта(ЭтотОбъект, СообщениеОснование);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры