Процедура ЗаполнитьРегистрПоумолчанию() Экспорт

	ОбрабатываемыеБизнесПроцессы = Новый Массив();
	ОбрабатываемыеБизнесПроцессы.Добавить("ЗакрытиеМесяца");
	ОбрабатываемыеБизнесПроцессы.Добавить("РасчетНДС");
	ОбрабатываемыеБизнесПроцессы.Добавить("ЗакрытиеМесяцаУСНДоходыМинусРасходы");
	ТочкиМаршрутаБизнесПроцесса = БизнесПроцессЗакрытиеМесяца.ПолучитьТочкиМаршрутаЗакрытияМесяцаИРасчетаНДС(ОбрабатываемыеБизнесПроцессы);

	
	Макет = РегистрыСведений.ДокументыРегламентныхОпераций.ПолучитьМакет("СоставРегистраПоумолчанию");
	ОбластьСписок = Макет.Области.Найти("Список");
	
	Если ОбластьСписок <> Неопределено Тогда
		ОбластьСписок = Макет.ПолучитьОбласть("Список");
		Для Каждого ТочкаМаршрута ИЗ ТочкиМаршрутаБизнесПроцесса Цикл
			
			ОбластьТочкаМаршрута = ОбластьСписок.НайтиТекст(ТочкаМаршрута.Имя,,,Истина,Истина,,Истина);
			Если ОбластьТочкаМаршрута = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ИмяОбласти = Лев(ОбластьТочкаМаршрута.Имя,СтрДлина(ОбластьТочкаМаршрута.Имя)-1) + "2";
			НовЗапись = Добавить();
			НовЗапись.ТочкаМаршрута = ТочкаМаршрута;
			НовЗапись.ТипДокумента = СокрЛП(ОбластьСписок.Область(ИмяОбласти).Текст);
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры //ЗаполнитьРегистрПоумолчанию

Процедура ПередЗаписью(Отказ, Замещение)
	
	 Для каждого Запись Из ЭтотОбъект Цикл
	 
	 	Если ПустаяСтрока(Запись.ТипДокумента) И Запись.ТипДокумента <> ""  Тогда
			Запись.ТипДокумента = "";
		КонецЕсли;
		
	 КонецЦикла; 
	
КонецПроцедуры
