
Процедура ЗаполнитьДатуЗаключения() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГосударственныеКонтракты.Ссылка,
	|	ГосударственныеКонтракты.ГодЗаключения КАК ГодЗаключения
	|ИЗ
	|	Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОпределенияПоставщиков КАК СпособыОпределенияПоставщиков
	|		ПО ГосударственныеКонтракты.УдалитьИнформацияОЗакупке = СпособыОпределенияПоставщиков.Код
	|ГДЕ
	|	ГосударственныеКонтракты.ДатаЗаключения = ДАТАВРЕМЯ(1, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.ДатаЗаключения = Дата(Выборка.ГодЗаключения, 1, 1);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьСпособОпределенияПоставщика() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГосударственныеКонтракты.Ссылка,
	|	СпособыОпределенияПоставщиков.Ссылка КАК СпособОпределенияПоставщика
	|ИЗ
	|	Справочник.ГосударственныеКонтракты КАК ГосударственныеКонтракты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОпределенияПоставщиков КАК СпособыОпределенияПоставщиков
	|		ПО ГосударственныеКонтракты.УдалитьИнформацияОЗакупке = СпособыОпределенияПоставщиков.Код
	|ГДЕ
	|	ГосударственныеКонтракты.СпособОпределенияПоставщика.Ссылка ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.СпособОпределенияПоставщика = Выборка.СпособОпределенияПоставщика;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
	КонецЦикла;
КонецПроцедуры
