////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ВывестиРезультатЗапросаВДеревоПоказателей(УзелТаблицы, РезультатЗапроса)
	
	КолонкиРезультата = РезультатЗапроса.Колонки;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Для Каждого Колонка из КолонкиРезультата Цикл
			Если Лев(Колонка.Имя,3) = "П00" Тогда
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТаблицы, Колонка.Имя, ?(Не ЗначениеЗаполнено(Выборка[Колонка.Имя]),0,Выборка[Колонка.Имя]));
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 

КонецПроцедуры

Процедура ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздела, ТаблицаДанных)
	
	КолонкиРезультата = ТаблицаДанных.Колонки;
	
	СтрокаДанных = ТаблицаДанных[0];
	Для Каждого Колонка из КолонкиРезультата Цикл
		Если Лев(Колонка.Имя,3) = "П00" Тогда
			ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздела, Колонка.Имя, ?(Не ЗначениеЗаполнено(СтрокаДанных[Колонка.Имя]),0,СтрокаДанных[Колонка.Имя]));
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ВывестиТаблицуДанныхВДеревоПоказателей(УзелРаздела, ТаблицаДанных, ИмяМногострочнойЧасти = "")

	КолонкиРезультата = ТаблицаДанных.Колонки;
	
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		УзелТаблицы = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздела, ИмяМногострочнойЧасти);
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТаблицы, ИмяМногострочнойЧасти + "01", ТаблицаДанных.Индекс(СтрокаДанных) + 1);
		Для Каждого Колонка из КолонкиРезультата Цикл
			Если Лев(Колонка.Имя,3) = "П00" Тогда
				Значение = СтрокаДанных[Колонка.Имя];
				Если Значение = Null Или Значение = Неопределено Тогда
					Значение = 0
				КонецЕсли;
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТаблицы, Колонка.Имя, Значение);
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьСтрокуВДеревеДанныхДляЗаполнения(Узел, Имя, Значение = Неопределено)
	
	НовСтр = Узел.Строки.Добавить();
	НовСтр.Имя = Имя;
	НовСтр.Значение = Значение;
	Возврат НовСтр;
	
КонецФункции

// преобразование в массив рассчитывает на то, что дерево показателей является двухуровневым: 
// строки разделов содержат только строки показателей
Функция МассивЗначенийДерева(ДеревоПоказателей)

	МассивСтрокДерева = Новый Массив;
	Для Каждого Строка Из ДеревоПоказателей.Строки Цикл
		
		ТаблицаПоказателей = Новый ТаблицаЗначений;
		ТаблицаПоказателей.Колонки.Добавить("Имя");
		ТаблицаПоказателей.Колонки.Добавить("Значение");
		
		Для каждого СтрокаПоказателя Из Строка.Строки Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПоказателей.Добавить(), СтрокаПоказателя);
		КонецЦикла;
		
		МассивСтрокДерева.Добавить(Новый Структура("ИмяРаздела,ТаблицаПоказателей", Строка.Имя, ТаблицаПоказателей))
		
	КонецЦикла;

	Возврат МассивСтрокДерева
	
КонецФункции 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ

Функция БылоИзменениеТарифаЗаднимЧислом(Организация, ДатаКонцаПериодаОтчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамКонецОтчетногоПериода", КонецДня(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПрименяемыеТарифыСтраховыхВзносов.Организация
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК ПрименяемыеТарифыСтраховыхВзносов
	|ГДЕ
	|	ПрименяемыеТарифыСтраховыхВзносов.Организация = &парамГоловнаяОрганизация
	|	И ПрименяемыеТарифыСтраховыхВзносов.Период МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений <= &парамКонецОтчетногоПериода
	|	И НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносов.Период, КВАРТАЛ) < НАЧАЛОПЕРИОДА(ПрименяемыеТарифыСтраховыхВзносов.ДатаРегистрацииИзменений, КВАРТАЛ)";
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	
	Возврат Месяц(ДатаКонцаПериодаОтчета) > 3 И Не Запрос.Выполнить().Пустой();

КонецФункции 


Функция ЗначенияПоказателей_РСВ1_2016Кв1(ПараметрыОтчета)
	
	ДеревоПоказателей = Новый ДеревоЗначений;
	ДеревоПоказателей.Колонки.Добавить("Имя");
	ДеревоПоказателей.Колонки.Добавить("Значение");
	
	ПустоеДерево = ДеревоПоказателей.Скопировать();
		
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаОкончанияПериода;
	Организация = ПараметрыОтчета.Организация;

	СоответствиеКодовТарифа = Новый Соответствие;
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕСХН, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ITОрганизации, "06");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство, "07");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов, "08");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СМИ, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково, "10");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляФармацевтовАптек, "11");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации, "12");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации, "13");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ, "15");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СельХозПроизводители, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент, "16");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму, "23");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития, "24");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентПортаВладивосток, "25");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны, "36");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕНВД, "53");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим, "52");
	
	МассивЗапросов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РасчетСтраховыхВзносов.ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамКонецОтчетногоПериода", КонецДня(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамНачалоОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.НачалоОтчетногоПериодаПерсучета(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамГод", Год(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("Месяц1", Месяц(ДатаКонцаПериодаОтчета) - 2);
	Запрос.УстановитьПараметр("Месяц2", Месяц(ДатаКонцаПериодаОтчета) - 1);
	Запрос.УстановитьПараметр("Месяц3", Месяц(ДатаКонцаПериодаОтчета));
	// Все данные отчета берутся по обособленному подразделению (указанной организации)
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("парамДатаПереходаНаВзносы", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ДоговорыЗЛ", ПроцедурыУправленияПерсоналомПереопределяемый.СписокДоговоровФормыВыбораСотрудника(2));
	Запрос.УстановитьПараметр("БылоИзменениеТарифаЗаднимЧислом", БылоИзменениеТарифаЗаднимЧислом(Организация, ДатаКонцаПериодаОтчета));
	// ----------------------------------------------------------------------------------
	// ТЕКСТЫ ЗАПРОСОВ
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ДатаКонцаПериодаОтчета));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК КонецМесяцаРасчетногоПериода ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ДатаКонцаПериодаОтчета) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	ОсновнойТекст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.РезультатОборот) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.СкидкаОборот) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходахОбороты.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			,
	|			&парамКонецОтчетногоПериода,
	|			МЕСЯЦ,
	|			ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|				И Организация = &парамГоловнаяОрганизация) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходахОбороты.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(СрезПоследнихДат.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьОсновнымТарифом, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.КонецМесяцаРасчетногоПериода КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|				И (УчетнаяПолитикаНалоговыйУчет.ДатаРегистрацииИзменений <= &парамКонецОтчетногоПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.КонецМесяцаРасчетногоПериода,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК СрезПоследнихДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО СрезПоследнихДат.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И СрезПоследнихДат.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО (НАЧАЛОПЕРИОДА(СрезПоследнихДат.Период, МЕСЯЦ) = ВидыДеятельности.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВРазделы2,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличины) КАК ПФРСтраховаяОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличиныЕНВД) КАК ПФРСтраховаяЕНВДОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМС) КАК ФФОМСОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМСЕНВД) КАК ФФОМСЕНВДОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСПревышения) КАК ПФРСПревышения,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД) КАК ПФРСПревышенияЕНВД
	|ПОМЕСТИТЬ ВТВзносыИсчисленные
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|		ПО (НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) = ВидыТарифныхСтавокОрганизаций.Период)
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Период <= &парамКонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыИсчисленные.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленные.ФизЛицо
	|ИЗ
	|	ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеИмеетПравоНаСтрахованиеФОМС,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеИмеетПравоНаСтрахование
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= ГражданствоФизЛиц.Период
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.КонецМесяцаРасчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС,
	|	ТарифСтраховыхВзносов.ТФОМС,
	|	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
	|	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот,
	|	СтраховыеВзносыСведенияОДоходах.СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоВидамТарифа
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследнихДвижений.ПериодРегистрации КАК Период,
	|	ЕСТЬNULL(ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерПФР, 0) КАК РазмерПФР
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПредельнаяВеличинаБазыСтраховыхВзносов.Период) КАК Период,
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК ПериодРегистрации
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.КонецМесяцаРасчетногоПериода) КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|		ПО ДатыПоследнихДвижений.Период = ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) = СведенияОДоходах.Период
	|					И СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|			ПО СведенияОДоходах.Период = Гражданство.Период
	|				И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, ГОД) И Периоды.КонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.КонецМесяцаРасчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА Предел.РазмерПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО ОблагаемаяБаза.Период = Предел.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ВключатьВРазделы2,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СведенияОДоходах.Период = Гражданство.Период
	|			И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|ГДЕ
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВключатьВРазделы2) КАК ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.ЗаМесяц,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ОбособленноеПодразделение) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел * БазаЗаМесяцПоОбособленным.ЗаМесяц / ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВключатьВРазделы2,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|				И БазаЗаМесяцПоОбособленным.ВключатьВРазделы2 = ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	Превышение.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|ГДЕ
	|	Превышение.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения) КАК ГодРождения,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсего,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагается,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходыПоАвторским,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходыПоАвторскимОМС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СУММА(ВЫБОР
	|						КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|							ТОГДА 0
	|						КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|							ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|				ТОГДА 0
	|			ИНАЧЕ МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел)
	|		КОНЕЦ / 10 КАК ЧИСЛО(15, 2)) КАК ИсчисленоПФРССуммПревышения,
	|	МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТДоходыВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПревышениеДоходаПФР.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2 = ПревышениеДоходаПФР.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения),
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|ПОМЕСТИТЬ ВТДоходыВредныхВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Месяцы.ФизЛицо,
	|	Месяцы.ПериодРегистрации,
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов,
	|	Месяцы.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТПериодыОдногоТарифа
	|ИЗ
	|	(ВЫБРАТЬ
	|		БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|		БазаДляОтчета.Период КАК ПериодРегистрации,
	|		БазаДляОтчета.ВключатьВРазделы2 КАК ВключатьВРазделы2
	|	ИЗ
	|		ВТДоходыВзносов КАК БазаДляОтчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БазаДляОтчета.Период,
	|		БазаДляОтчета.ФизЛицо,
	|		БазаДляОтчета.ВключатьВРазделы2
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) = 1) КАК Месяцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО Месяцы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И Месяцы.ПериодРегистрации = БазаДляОтчета.Период
	|			И Месяцы.ВключатьВРазделы2 = БазаДляОтчета.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|	БазаДляОтчета.Период КАК ПериодРегистрации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТМесяцыОсобыхТарифов
	|ИЗ
	|	ВТДоходыВзносов КАК БазаДляОтчета
	|ГДЕ
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаДляОтчета.ФизЛицо,
	|	БазаДляОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ПериодРегистрации,
	|	БазаДляОтчета.ВключатьВРазделы2,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаПФР * РазмерыТарифныхСтавок.ПФР) КАК ПФРСтраховаяЗаПериод,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС) КАК ФОМСЗаПериод,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТПериодыДляРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТМесяцыОсобыхТарифов КАК ОсобыеТарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
	|		ПО ОсобыеТарифы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ОсобыеТарифы.ПериодРегистрации = БазаДляОтчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсобыеТарифы.ПериодРегистрации,
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек,
	|	БазаДляОтчета.ВключатьВРазделы2
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2,
	|	ТарифыПоДоходам.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаПФР * РазмерыТарифныхСтавок.ПФР / ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод
	|	КОНЕЦ КАК КоэффициентПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС / ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод
	|	КОНЕЦ КАК КоэффициентФОМС
	|ПОМЕСТИТЬ ВТКоэффициентыРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТПериодыДляРаспределенияВзносовПоТарифам КАК ПериодыДляРаспределенияВзносовПоТарифам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|		ПО (РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = БазаДляОтчета.Период
	|			И (БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2 = БазаДляОтчета.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ТарифыПоДоходам
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = ТарифыПоДоходам.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = ТарифыПоДоходам.Период
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2 = ТарифыПоДоходам.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ПериодРегистрации,
	|	Взносы.ФизЛицо,
	|	Взносы.ВидТарифаСтраховыхВзносов,
	|	Взносы.ВключатьВРазделы2,
	|	СУММА(Взносы.ПФРСтраховая) КАК ПФРСтраховая,
	|	СУММА(Взносы.ФФОМС) КАК ФФОМС,
	|	СУММА(Взносы.ПФРСПревышения) КАК ПФРСПревышения
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
	|		СтраховыеВзносыИсчисленные.ВключатьВРазделы2 КАК ВключатьВРазделы2,
	|		СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		СтраховыеВзносыИсчисленные.ПФРСтраховаяОборот КАК ПФРСтраховая,
	|		СтраховыеВзносыИсчисленные.ФФОМСОборот КАК ФФОМС,
	|		СтраховыеВзносыИсчисленные.ПФРСПревышения КАК ПФРСПревышения
	|	ИЗ
	|		ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, МЕСЯЦ),
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		СтраховыеВзносыИсчисленные.ВключатьВРазделы2,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|			ИНАЧЕ СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов
	|		КОНЕЦ,
	|		СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВДОборот,
	|		СтраховыеВзносыИсчисленные.ФФОМСЕНВДОборот,
	|		СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД
	|	ИЗ
	|		ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|			ПО СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|				И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)) КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.ПериодРегистрации,
	|	Взносы.ФизЛицо,
	|	Взносы.ВидТарифаСтраховыхВзносов,
	|	Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчетаВзносов.ПериодРегистрации КАК Период,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ДанныеУчетаВзносов.ВключатьВРазделы2,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|				КОНЕЦ
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА 0
	|							ИНАЧЕ 1
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРСПревышения КАК ЧИСЛО(15, 2))) КАК ПФРСПревышения,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРСтраховая КАК ЧИСЛО(15, 2))) КАК ПФРСтраховая,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ФФОМС КАК ЧИСЛО(15, 2))) КАК ФФОМС
	|ПОМЕСТИТЬ ВТВзносы
	|ИЗ
	|	ВТДанныеУчетаВзносов КАК ДанныеУчетаВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыОдногоТарифа КАК ПериодыОдногоТарифа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеПериодаОдногоТарифа
	|			ПО ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов = ОписаниеПериодаОдногоТарифа.ВидТарифа
	|				И (ОписаниеПериодаОдногоТарифа.РасчетныйПериод = &парамГод)
	|		ПО ДанныеУчетаВзносов.ФизЛицо = ПериодыОдногоТарифа.ФизЛицо
	|			И ДанныеУчетаВзносов.ПериодРегистрации = ПериодыОдногоТарифа.ПериодРегистрации
	|			И ДанныеУчетаВзносов.ВключатьВРазделы2 = ПериодыОдногоТарифа.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыРаспределенияВзносовПоТарифам КАК КоэффициентыРаспределенияВзносовПоТарифам
	|		ПО ДанныеУчетаВзносов.ФизЛицо = КоэффициентыРаспределенияВзносовПоТарифам.ФизЛицо
	|			И ДанныеУчетаВзносов.ПериодРегистрации = КоэффициентыРаспределенияВзносовПоТарифам.ПериодРегистрации
	|			И ДанныеУчетаВзносов.ВключатьВРазделы2 = КоэффициентыРаспределенияВзносовПоТарифам.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаВзносов.ПериодРегистрации,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|				КОНЕЦ
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	ДанныеУчетаВзносов.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы.Период,
	|	Доходы.ФизЛицо,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.СуммаПревысившаяПредел > 0
	|	И Доходы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизЛицо) КАК ВсегоФизлиц,
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаВсеМесяцы
	|ИЗ
	|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицаСПревышениемБазы.Период,
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы
	|ИЗ
	|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
	|	ЛицаСПревышениемБазы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Период,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаФОМС <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Период,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаВсеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаФОМС <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Основание,
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период КАК Период,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот), 0) КАК ВзносыОпасный,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот), 0) КАК ВзносыВредный4,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот), 0) КАК ВзносыВредный3,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот), 0) КАК ВзносыВредный2,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот), 0) КАК ВзносыВредный1
	|ПОМЕСТИТЬ ВТВзносыПоКлассамУсловий
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот), 0)
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Взносы.Основание
	|ПОМЕСТИТЬ ВТОснованияВзносов
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК Взносы
	|ГДЕ
	|	(Взносы.ВзносыОпасный > 0
	|			ИЛИ Взносы.ВзносыВредный1 > 0
	|			ИЛИ Взносы.ВзносыВредный2 > 0
	|			ИЛИ Взносы.ВзносыВредный3 > 0
	|			ИЛИ Взносы.ВзносыВредный4 > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Основание,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыОпасный > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный4 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный3 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный2 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный1 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный1,
	|	Взносы.Период
	|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период,
	|	Взносы.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзносыПоКлассамУсловий.Основание,
	|	ВзносыПоКлассамУсловий.ФизЛицо,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыОпасный) КАК ВзносыОпасный,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный4) КАК ВзносыВредный4,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный3) КАК ВзносыВредный3,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный2) КАК ВзносыВредный2,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный1) КАК ВзносыВредный1
	|ПОМЕСТИТЬ ВТВзносыЗаВесьПериод
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыПоКлассамУсловий.Основание,
	|	ВзносыПоКлассамУсловий.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыОпасный > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный4 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный3 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный2 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный1 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный1,
	|	Взносы.Основание
	|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыЗаВесьПериод КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыПоказателейСНачалаГодаПоФизлицам.ПФРСтраховая) КАК ПФРСтраховая,
	|	СУММА(ВЫБОР
	|			КОГДА ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную
	|				ТОГДА РасчетыПоказателейСНачалаГодаПоФизлицам.ПФРССуммПревышения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРССуммПревышения,
	|	СУММА(РасчетыПоказателейСНачалаГодаПоФизлицам.ФФОМС) КАК ФФОМС,
	|	РасчетыПоказателейСНачалаГодаПоФизлицам.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТРасчетПоказателейСНачалаГода
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(Доходы.НачисленоВсего, 0) - ЕСТЬNULL(Доходы.НеОблагается, 0) - ЕСТЬNULL(Доходы.РасходыПоАвторским, 0) - ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)) * РазмерыТарифныхСтавок.ПФР / 100 КАК ЧИСЛО(15, 2)) КАК ПФРСтраховая,
	|		ВЫРАЗИТЬ(СУММА(Доходы.СуммаПревысившаяПредел) / 10 КАК ЧИСЛО(15, 2)) КАК ПФРССуммПревышения,
	|		ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(Доходы.НачисленоВсегоФОМС, 0) - ЕСТЬNULL(Доходы.НеОблагаетсяФОМС, 0) - ЕСТЬNULL(Доходы.РасходыПоАвторскимОМС, 0)) * РазмерыТарифныхСтавок.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК ФФОМС,
	|		Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Доходы.ФизЛицо КАК ФизЛицо
	|	ИЗ
	|		ВТДоходыВзносов КАК Доходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|			ПО Доходы.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
	|	ГДЕ
	|		Доходы.ВключатьВРазделы2
	|		И &БылоИзменениеТарифаЗаднимЧислом
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Доходы.ВидТарифаСтраховыхВзносов,
	|		РазмерыТарифныхСтавок.ПФР,
	|		РазмерыТарифныхСтавок.ФФОМС,
	|		Доходы.ФизЛицо) КАК РасчетыПоказателейСНачалаГодаПоФизлицам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО РасчетыПоказателейСНачалаГодаПоФизлицам.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоказателейСНачалаГодаПоФизлицам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицОпасный, 0)) КАК П000240024503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный4, 0)) КАК П000240025103,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025104,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025105,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025106,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный3, 0)) КАК П000240025703,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025704,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025705,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025706,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный2, 0)) КАК П000240026303,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026304,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026305,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026306,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный1, 0)) КАК П000240026903,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026904,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026905,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026906,
	|	ОснованияВзносов.Основание
	|ИЗ
	|	ВТПериоды КАК МесяцыОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВзносов КАК ОснованияВзносов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|			ПО ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаВсеМесяцы.Основание
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Основание)
	|			И (МЕСЯЦ(МесяцыОтчета.КонецМесяцаРасчетногоПериода) = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
	|ГДЕ
	|	МЕСЯЦ(МесяцыОтчета.КонецМесяцаРасчетногоПериода) В (&Месяц1, &Месяц2, &Месяц3)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОснованияВзносов.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзносыФизлиц.Основание КАК Основание
	|ИЗ
	|	ВТОснованияВзносов КАК ВзносыФизлиц
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|ГДЕ
	|	(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	2
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|ГДЕ
	|	(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыОпасный), 0) КАК П000240024403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024406,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный4), 0) КАК П000240025003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025006,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный3), 0) КАК П000240025603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025606,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный2), 0) КАК П000240026203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026206,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный1), 0) КАК П000240026803,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026804,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026805,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026806,
	|	ВзносыФизлиц.Основание КАК Основание
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК ВзносыФизлиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный), 0) КАК П000240024003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный), 0) КАК П000240024103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024106,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4), 0) КАК П000240024603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024606,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4), 0) КАК П000240024703,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024704,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024705,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024706,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3), 0) КАК П000240025203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025206,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3), 0) КАК П000240025303,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025304,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025305,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025306,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2), 0) КАК П000240025803,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025804,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025805,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025806,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2), 0) КАК П000240025903,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025904,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025905,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025906,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1), 0) КАК П000240026403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026406,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1), 0) КАК П000240026503,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026504,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026505,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000240024503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024506,
	|	1 КАК Основание
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	2
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П000220022003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П000220022103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022106,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах), 0) КАК П000230023003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах), 0) КАК П000230023103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023106,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000220022503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000230023503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023506
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот), 0) КАК П000220022403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022406,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот), 0) КАК П000230023403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023406
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ВключатьВРазделы2
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсего), 0) КАК П000210020003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагается), 0) КАК П000210020103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020106,
	|	ЕСТЬNULL(СУММА(Доходы.РасходыПоАвторским), 0) КАК П000210020203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020206,
	|	ЕСТЬNULL(СУММА(Доходы.СуммаПревысившаяПредел), 0) КАК П000210020303,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020304,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020305,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020306,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоФОМС), 0) КАК П000210021003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяФОМС), 0) КАК П000210021103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021106,
	|	ЕСТЬNULL(СУММА(Доходы.РасходыПоАвторскимОМС), 0) КАК П000210021203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021206,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210020703,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020704,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020705,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020706,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиФОМСЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210021503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210021504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210021505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210021506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСПревышениемБазыЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210020803,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020804,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020805,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020806
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаВсеМесяцы КАК ЛицаСПревышениемБазыЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы КАК ЛицаСПревышениемБазыЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаВсеМесяцы КАК ЛицаСВзносамиЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаОтдельныеМесяцы КАК ЛицаСВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаВсеМесяцы КАК ЛицаСВзносамиФОМСЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы КАК ЛицаСВзносамиФОМСЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период
	|ГДЕ
	|	Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &БылоИзменениеТарифаЗаднимЧислом
	|				ТОГДА РасчетДляСтрокСНачалаГода.ПФРСтраховая
	|			ИНАЧЕ СУММА(ВзносыФизлиц.ПФРСтраховая)
	|		КОНЕЦ, 0) КАК П000210020503,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020504,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020505,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020506,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &БылоИзменениеТарифаЗаднимЧислом
	|				ТОГДА РасчетДляСтрокСНачалаГода.ПФРССуммПревышения
	|			ИНАЧЕ СУММА(ВзносыФизлиц.ПФРСПревышения)
	|		КОНЕЦ, 0) КАК П000210020603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРСПревышения
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРСПревышения
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРСПревышения
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020606,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &БылоИзменениеТарифаЗаднимЧислом
	|				ТОГДА РасчетДляСтрокСНачалаГода.ФФОМС
	|			ИНАЧЕ СУММА(ВзносыФизлиц.ФФОМС)
	|		КОНЕЦ, 0) КАК П000210021403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021406,
	|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов
	|ИЗ
	|	ВТВзносы КАК ВзносыФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетПоказателейСНачалаГода КАК РасчетДляСтрокСНачалаГода
	|		ПО ВзносыФизлиц.ВидТарифаСтраховыхВзносов = РасчетДляСтрокСНачалаГода.ВидТарифаСтраховыхВзносов
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетДляСтрокСНачалаГода.ПФРСтраховая,
	|	РасчетДляСтрокСНачалаГода.ПФРССуммПревышения,
	|	РасчетДляСтрокСНачалаГода.ФФОМС,
	|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов";
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&УсловиеВключенияДанных", 
		"(НАЧАЛОПЕРИОДА(Период, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(ДатаРегистрацииИзменений, КВАРТАЛ)
		|					ИЛИ ДатаРегистрацииИзменений <= КОНЕЦПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, КВАРТАЛ))");
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	

	РасчетыСФондамиТекст = 
	"ВЫБРАТЬ
	|	РасчетыПоСтраховымВзносамОбороты.Период КАК Период,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРПоСуммарномуТарифуРасход + РасчетыПоСтраховымВзносамОбороты.ПФРСПревышенияРасход КАК ПФРПоСуммарномуТарифуРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ФФОМСРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ТФОМСРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|ПОМЕСТИТЬ ВТРасчетыСФондом
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецОтчетногоПериода,
	|			Месяц,
	|			Организация = &парамОбособленноеПодразделение
	|				И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|				И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыСФондом.ПФРПоСуммарномуТарифуРасход) КАК П000100014003,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014103,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014203,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014303,
	|	СУММА(РасчетыСФондом.ПФРСтраховаяРасход) КАК П000100014004,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014104,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014204,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014304,
	|	СУММА(РасчетыСФондом.ПФРНакопительнаяРасход) КАК П000100014005,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014105,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014205,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014305,
	|	СУММА(РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход) КАК П000100014006,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014106,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014206,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014306,
	|	СУММА(РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход) КАК П000100014007,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014107,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014207,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014307,
	|	СУММА(РасчетыСФондом.ФФОМСРасход) + СУММА(РасчетыСФондом.ТФОМСРасход) КАК П000100014008,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014108,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014208,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014308
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом";
	
	ОстаткиНаНачалоПериодаТекст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Остатки.ПФРСтраховаяОстаток), 0) КАК Остаток
	|ПОМЕСТИТЬ ВТОстаткиПоСтраховойЧастиНаДатуОбъединения
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|			&парамНачалоГода,
	|			Организация = &парамОбособленноеПодразделение
	|				И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|				И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Остатки.П000100010003) КАК П000100010003,
	|	СУММА(Остатки.П000100010004) КАК П000100010004,
	|	СУММА(Остатки.П000100010005) КАК П000100010005,
	|	СУММА(Остатки.П000100010006) КАК П000100010006,
	|	СУММА(Остатки.П000100010007) КАК П000100010007,
	|	СУММА(Остатки.П000100010008) КАК П000100010008
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.ПФРПоСуммарномуТарифуОстаток + Остатки.ПФРСПревышенияОстаток КАК П000100010003,
	|		Остатки.ПФРСтраховаяОстаток КАК П000100010004,
	|		Остатки.ПФРНакопительнаяОстаток КАК П000100010005,
	|		Остатки.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОстаток КАК П000100010006,
	|		Остатки.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОстаток КАК П000100010007,
	|		Остатки.ФФОМСОстаток + Остатки.ТФОМСОстаток КАК П000100010008
	|	ИЗ
	|		РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|				&парамНачалоГода,
	|				Организация = &парамОбособленноеПодразделение
	|					И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|					И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток < 0
	|				ТОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток < 0
	|				ТОГДА -ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТОстаткиПоСтраховойЧастиНаДатуОбъединения КАК ОстаткиПоСтраховойЧастиНаДатуОбъединения) КАК Остатки";
	
	ЗастрахованныеЛицаТекст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗастрахованныеЛица.Физлицо) КАК КоличествоФизлиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК Физлицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&парамНачалоОтчетногоПериода,
	|				Организация = &парамГоловнаяОрганизация
	|					И Сотрудник.ВидДоговора В (&ДоговорыЗЛ)) КАК РаботникиОрганизацииСрезПоследних
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &парамНачалоОтчетногоПериода
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
	|			КОНЕЦ = &парамОбособленноеПодразделение
	|		И ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &парамНачалоОтчетногоПериода
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаботникиОрганизации.Сотрудник.Физлицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|	ГДЕ
	|		РаботникиОрганизации.Период МЕЖДУ &парамНачалоОтчетногоПериода И &парамКонецОтчетногоПериода
	|		И РаботникиОрганизации.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|		И РаботникиОрганизации.Организация = &парамГоловнаяОрганизация
	|		И РаботникиОрганизации.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|		И РаботникиОрганизации.Сотрудник.ВидДоговора В(&ДоговорыЗЛ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|				&парамНачалоОтчетногоПериода,
	|				&парамКонецОтчетногоПериода,
	|				,
	|				Организация = &парамГоловнаяОрганизация
	|					И ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И ВидДохода.ВходитВБазуПФР) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
	|	ИЗ
	|		Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|	ГДЕ
	|		ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамКонецОтчетногоПериода
	|		И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамНачалоОтчетногоПериода
	|		И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|		И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОбособленноеПодразделение) КАК ЗастрахованныеЛица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЗастрахованныеЛица.Физлицо.СтраховойНомерПФР = """"
	|				ТОГДА ЛОЖЬ
	|			КОГДА ЗастрахованныеЛица.Физлицо.СтраховойНомерПФР = ""   -   -      ""
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	ПерерасчетыТекст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) КАК Период,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ КАК П000400000102,
	|	ВЫБОР
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|			ТОГДА ""1""
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) <> 0
	|			ТОГДА ""2""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК П000400000103,
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода) КАК П000400000104,
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода) КАК П000400000105,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличиныЕНВД + СтраховыеВзносыИсчисленные.ПФРСПревышения + СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД) КАК П000400000106,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуСПревышения + СтраховыеВзносыИсчисленные.ПФРСПревышения + СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД) КАК П000400000107,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховая + СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД) КАК П000400000108,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховаяСПревышения) КАК П000400000109,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРНакопительная + СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД) КАК П000400000110,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК П000400000111,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК П000400000112,
	|	ВЫБОР
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|			ТОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4)
	|		ИНАЧЕ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4)
	|	КОНЕЦ КАК П000400000113,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМС + СтраховыеВзносыИсчисленные.ФФОМСЕНВД) КАК П000400000114
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.Период МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличиныЕНВД + СтраховыеВзносыИсчисленные.ПФРСПревышения  + СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуСПревышения + СтраховыеВзносыИсчисленные.ПФРСПревышения  + СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховая + СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховаяСПревышения) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРНакопительная + СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ФФОМС + СтраховыеВзносыИсчисленные.ФФОМСЕНВД) <> 0
	|		ИЛИ ВЫБОР
	|			КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|				ТОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4)
	|			ИНАЧЕ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4)
	|		КОНЕЦ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ,
	|	""2"",
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4),
	|	0
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.Период МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0 И
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	П000400000104,
	|	П000400000105,
	|	П000400000102,
	|	П000400000103";
	
	// -------------------------------------------------------------------------------
	// Вывод данных в отчет
	
	УзелТитульногоЛиста = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Титульный");
	УзелРаздел1 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел1");
	УзелРаздел2 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел21");
	УзелРаздел22 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел22");
	УзелРаздел24 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел24");
	
	// Титульный лист
	
	Отчет = Отчеты.СредняяЧисленностьРаботниковОрганизаций.Создать();
	ТаблицаСреднихЧисленостей = Отчет.ПолучитьТаблицуЧисленностей(Организация, НачалоГода(ДатаКонцаПериодаОтчета), ДатаКонцаПериодаОтчета, Ложь);
	Если ТаблицаСреднихЧисленостей.Количество() > 0 Тогда
		СтрокаТЗ = ТаблицаСреднихЧисленостей[0];
		Если СтрокаТЗ.СреднеСписочнаяЧисленность <> Null Тогда
			ЧисленностьРаботников = Формат(Окр(СтрокаТЗ.СреднеСписочнаяЧисленность),"ЧЦ=5; ЧДЦ=0; ЧГ=0");
			ВсегоЗнаков = СтрДлина(ЧисленностьРаботников);
			Для СчСимволов = 1 По ВсегоЗнаков Цикл
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "СрСписЧисл" + Строка(7 - СчСимволов), Сред(ЧисленностьРаботников, ВсегоЗнаков - СчСимволов + 1,1));
			КонецЦикла;
			Если ВсегоЗнаков < 6 Тогда
				Для СчСимволов = ВсегоЗнаков + 1 По 5 Цикл
					ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "СрСписЧисл" + Строка(7 - СчСимволов), "");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ЗастрахованныеЛицаТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	Если Выборка.Следующий() Тогда
		ЧисленностьЗастрахованныхЛиц = Формат(Выборка.КоличествоФизлиц,"ЧЦ=6; ЧДЦ=0; ЧГ=0");
		ВсегоЗнаков = СтрДлина(ЧисленностьЗастрахованныхЛиц);
		Для СчСимволов = 1 По ВсегоЗнаков Цикл
			ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "КолЗастрахованных" + Строка(7 - СчСимволов), Сред(ЧисленностьЗастрахованныхЛиц, ВсегоЗнаков - СчСимволов + 1,1));
		КонецЦикла;
		Если ВсегоЗнаков < 6 Тогда
			Для СчСимволов = ВсегоЗнаков + 1 По 6 Цикл
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "КолЗастрахованных" + Строка(7 - СчСимволов), "");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Раздел 1 
	
	Запрос.Текст = РасчетыСФондамиТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел1,Результат); 
	
	Запрос.Текст = ОстаткиНаНачалоПериодаТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
		ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел1,Результат); 
	
	// Раздел 2 
	
	Запрос.Текст = ОсновнойТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		МассивРезультатов = Запрос.ВыполнитьПакет();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	
	ВсегоЗапросов = МассивРезультатов.Количество();
	
	// Раздел 2.1 
	
	ВсеТарифы = МассивРезультатов[ВсегоЗапросов-3].Выгрузить();
	ТаблицаДоходов = МассивРезультатов[ВсегоЗапросов-2].Выгрузить();
	ТаблицаВзносов = МассивРезультатов[ВсегоЗапросов-1].Выгрузить();
	КоличествоТарифов = ВсеТарифы.Количество();
	ИндексПоследнейСтроки = КоличествоТарифов - 1;
	СтруктураПоиска = Новый Структура("ВидТарифаСтраховыхВзносов");
	
	Для каждого СтрокаРезультата Из ВсеТарифы Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРезультата);
		
		СтрокаДоходов = ТаблицаДоходов.Скопировать(СтруктураПоиска);
		СтрокаВзносов = ТаблицаВзносов.Скопировать(СтруктураПоиска);
		
		КодТарифа = СоответствиеКодовТарифа[СтрокаРезультата.ВидТарифаСтраховыхВзносов];
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел2, "П000210001001", Лев(КодТарифа,1));
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел2, "П000210001002", Прав(КодТарифа,1));
		
		Если СтрокаДоходов.Количество() = 0 и СтрокаВзносов.Количество() = 0 Тогда // по текущему тарифу нет данных
			Если КоличествоТарифов > 1 И ВсеТарифы.Индекс(СтрокаРезультата) = ИндексПоследнейСтроки Тогда
				ДеревоПоказателей.Строки.Удалить(УзелРаздел2)
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДоходов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел2, СтрокаДоходов)
		КонецЕсли;
		Если СтрокаВзносов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел2, СтрокаВзносов)
		КонецЕсли;
		
		// если применяемых в орг. тарифов больше 1, тогда создадим еще одну ветку для раздела 2
		Если ВсеТарифы.Индекс(СтрокаРезультата) < ИндексПоследнейСтроки Тогда  
			УзелРаздел2 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел21");
		КонецЕсли;
		
	КонецЦикла;
	
	// Разделы 2.2 и 2.3 
	
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел22,МассивРезультатов[ВсегоЗапросов-4]); 
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел22,МассивРезультатов[ВсегоЗапросов-5]); 
	
	// Раздел 2.4 
	
	ВсеОснования = МассивРезультатов[ВсегоЗапросов-8].Выгрузить();
	ТаблицаДоходов = МассивРезультатов[ВсегоЗапросов-6].Выгрузить();
	ТаблицаВзносов = МассивРезультатов[ВсегоЗапросов-7].Выгрузить();
	ТаблицаЧисленности = МассивРезультатов[ВсегоЗапросов-9].Выгрузить();
	КоличествоОснований = ВсеОснования.Количество();
	ИндексПоследнейСтроки = КоличествоОснований - 1;
	СтруктураПоиска = Новый Структура("Основание");
	
	Для каждого СтрокаРезультата Из ВсеОснования Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРезультата);
		
		СтрокаДоходов = ТаблицаДоходов.Скопировать(СтруктураПоиска);
		СтрокаВзносов = ТаблицаВзносов.Скопировать(СтруктураПоиска);
		СтрокаЧисленности = ТаблицаЧисленности.Скопировать(СтруктураПоиска);
		
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел24, "П000240001001", СтрокаРезультата.Основание);
		
		Если СтрокаДоходов.Количество() = 0 И СтрокаВзносов.Количество() = 0 И СтрокаЧисленности.Количество() = 0 Тогда // по текущему основанию нет данных
			Если КоличествоОснований > 1 И ВсеОснования.Индекс(СтрокаРезультата) = ИндексПоследнейСтроки Тогда
				ДеревоПоказателей.Строки.Удалить(УзелРаздел24)
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДоходов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаДоходов)
		КонецЕсли;
		Если СтрокаВзносов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаВзносов)
		КонецЕсли;
		Если СтрокаЧисленности.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаЧисленности)
		КонецЕсли;
		
		// если применяемых в орг. оснований больше 1, тогда создадим еще одну ветку для раздела 2.4
		Если ВсеОснования.Индекс(СтрокаРезультата) < ИндексПоследнейСтроки Тогда  
			УзелРаздел24 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел24");
		КонецЕсли;
		
	КонецЦикла;
	
	// Раздел 4
	
	Запрос.Текст = ПерерасчетыТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиТаблицуДанныхВДеревоПоказателей(ДеревоПоказателей, Результат.Выгрузить(), "П0004000001");
	
	Возврат МассивЗначенийДерева(ДеревоПоказателей);
	
КонецФункции 

Функция ЗначенияПоказателей_РСВ1_2015Кв1(ПараметрыОтчета) Экспорт 
	
	Если ПараметрыОтчета.ДатаОкончанияПериода >= РасчетСтраховыхВзносов.ДатаВыделенияВзносовНаОПСсСуммПревышенияПредельнойВеличины() Тогда
		Возврат ЗначенияПоказателей_РСВ1_2016Кв1(ПараметрыОтчета)	
	КонецЕсли;
	
	ДеревоПоказателей = Новый ДеревоЗначений;
	ДеревоПоказателей.Колонки.Добавить("Имя");
	ДеревоПоказателей.Колонки.Добавить("Значение");
	
	ПустоеДерево = ДеревоПоказателей.Скопировать();
		
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаОкончанияПериода;
	Организация = ПараметрыОтчета.Организация;

	СоответствиеКодовТарифа = Новый Соответствие;
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕСХН, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ITОрганизации, "06");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство, "07");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов, "08");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СМИ, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково, "10");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляФармацевтовАптек, "11");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации, "12");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации, "13");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ, "15");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СельХозПроизводители, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы, "01");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент, "16");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму, "23");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития, "24");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны, "36");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕНВД, "53");
	СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим, "52");
	
	МассивЗапросов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РасчетСтраховыхВзносов.ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамКонецОтчетногоПериода", КонецДня(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамНачалоОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.НачалоОтчетногоПериодаПерсучета(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамГод", Год(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("Месяц1", Месяц(ДатаКонцаПериодаОтчета) - 2);
	Запрос.УстановитьПараметр("Месяц2", Месяц(ДатаКонцаПериодаОтчета) - 1);
	Запрос.УстановитьПараметр("Месяц3", Месяц(ДатаКонцаПериодаОтчета));
	// Все данные отчета берутся по обособленному подразделению (указанной организации)
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("парамДатаПереходаНаВзносы", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ДоговорыЗЛ", ПроцедурыУправленияПерсоналомПереопределяемый.СписокДоговоровФормыВыбораСотрудника(2));
	Запрос.УстановитьПараметр("БылоИзменениеТарифаЗаднимЧислом", БылоИзменениеТарифаЗаднимЧислом(Организация, ДатаКонцаПериодаОтчета));
	// ----------------------------------------------------------------------------------
	// ТЕКСТЫ ЗАПРОСОВ
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ДатаКонцаПериодаОтчета));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК КонецМесяцаРасчетногоПериода ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ДатаКонцаПериодаОтчета) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	ОсновнойТекст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.РезультатОборот) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.СкидкаОборот) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходахОбороты.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			,
	|			&парамКонецОтчетногоПериода,
	|			МЕСЯЦ,
	|			ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|				И Организация = &парамГоловнаяОрганизация) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходахОбороты.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(СрезПоследнихДат.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.КонецМесяцаРасчетногоПериода КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|				И (УчетнаяПолитикаНалоговыйУчет.ДатаРегистрацииИзменений <= &парамКонецОтчетногоПериода)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.КонецМесяцаРасчетногоПериода,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК СрезПоследнихДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО СрезПоследнихДат.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И СрезПоследнихДат.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО (НАЧАЛОПЕРИОДА(СрезПоследнихДат.Период, МЕСЯЦ) = ВидыДеятельности.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВРазделы2,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу) КАК ПФРСтраховаяОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД) КАК ПФРСтраховаяЕНВДОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМС) КАК ФФОМСОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМСЕНВД) КАК ФФОМСЕНВДОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот
	|ПОМЕСТИТЬ ВТВзносыИсчисленные
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|		ПО (НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) = ВидыТарифныхСтавокОрганизаций.Период)
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Период <= &парамКонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыИсчисленные.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленные.ФизЛицо
	|ИЗ
	|	ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеИмеетПравоНаСтрахованиеФОМС,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеИмеетПравоНаСтрахование
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= ГражданствоФизЛиц.Период
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.КонецМесяцаРасчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС,
	|	ТарифСтраховыхВзносов.ТФОМС,
	|	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
	|	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот,
	|	СтраховыеВзносыСведенияОДоходах.СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоВидамТарифа
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследнихДвижений.ПериодРегистрации КАК Период,
	|	ЕСТЬNULL(ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерПФР, 0) КАК РазмерПФР
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПредельнаяВеличинаБазыСтраховыхВзносов.Период) КАК Период,
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК ПериодРегистрации
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.КонецМесяцаРасчетногоПериода) КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|		ПО ДатыПоследнихДвижений.Период = ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) = СведенияОДоходах.Период
	|					И СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|			ПО СведенияОДоходах.Период = Гражданство.Период
	|				И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, ГОД) И Периоды.КонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.КонецМесяцаРасчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА Предел.РазмерПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО ОблагаемаяБаза.Период = Предел.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ВключатьВРазделы2,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СведенияОДоходах.Период = Гражданство.Период
	|			И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|ГДЕ
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВключатьВРазделы2) КАК ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.ЗаМесяц,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ОбособленноеПодразделение) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел * БазаЗаМесяцПоОбособленным.ЗаМесяц / ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВключатьВРазделы2,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|				И БазаЗаМесяцПоОбособленным.ВключатьВРазделы2 = ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	Превышение.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|ГДЕ
	|	Превышение.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения) КАК ГодРождения,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсего,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагается,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходыПоАвторским,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходыПоАвторскимОМС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СУММА(ВЫБОР
	|						КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|							ТОГДА 0
	|						КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|							ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|				ТОГДА 0
	|			ИНАЧЕ МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел)
	|		КОНЕЦ / 10 КАК ЧИСЛО(15, 2)) КАК ИсчисленоПФРССуммПревышения,
	|	МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТДоходыВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПревышениеДоходаПФР.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2 = ПревышениеДоходаПФР.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения),
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|ПОМЕСТИТЬ ВТДоходыВредныхВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Месяцы.ФизЛицо,
	|	Месяцы.ПериодРегистрации,
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов,
	|	Месяцы.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТПериодыОдногоТарифа
	|ИЗ
	|	(ВЫБРАТЬ
	|		БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|		БазаДляОтчета.Период КАК ПериодРегистрации,
	|		БазаДляОтчета.ВключатьВРазделы2 КАК ВключатьВРазделы2
	|	ИЗ
	|		ВТДоходыВзносов КАК БазаДляОтчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БазаДляОтчета.Период,
	|		БазаДляОтчета.ФизЛицо,
	|		БазаДляОтчета.ВключатьВРазделы2
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) = 1) КАК Месяцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО Месяцы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И Месяцы.ПериодРегистрации = БазаДляОтчета.Период
	|			И Месяцы.ВключатьВРазделы2 = БазаДляОтчета.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|	БазаДляОтчета.Период КАК ПериодРегистрации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТМесяцыОсобыхТарифов
	|ИЗ
	|	ВТДоходыВзносов КАК БазаДляОтчета
	|ГДЕ
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаДляОтчета.ФизЛицо,
	|	БазаДляОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ПериодРегистрации,
	|	БазаДляОтчета.ВключатьВРазделы2,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаПФР * РазмерыТарифныхСтавок.ПФР) КАК ПФРСтраховаяЗаПериод,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС) КАК ФОМСЗаПериод,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТПериодыДляРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТМесяцыОсобыхТарифов КАК ОсобыеТарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
	|		ПО ОсобыеТарифы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ОсобыеТарифы.ПериодРегистрации = БазаДляОтчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсобыеТарифы.ПериодРегистрации,
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек,
	|	БазаДляОтчета.ВключатьВРазделы2
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2,
	|	ТарифыПоДоходам.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаПФР * РазмерыТарифныхСтавок.ПФР / ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод
	|	КОНЕЦ КАК КоэффициентПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС / ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод
	|	КОНЕЦ КАК КоэффициентФОМС
	|ПОМЕСТИТЬ ВТКоэффициентыРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТПериодыДляРаспределенияВзносовПоТарифам КАК ПериодыДляРаспределенияВзносовПоТарифам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|		ПО (РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = БазаДляОтчета.Период
	|			И (БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2 = БазаДляОтчета.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ТарифыПоДоходам
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = ТарифыПоДоходам.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = ТарифыПоДоходам.Период
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2 = ТарифыПоДоходам.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ПериодРегистрации,
	|	Взносы.ФизЛицо,
	|	Взносы.ВидТарифаСтраховыхВзносов,
	|	Взносы.ВключатьВРазделы2,
	|	СУММА(Взносы.ПФРСтраховая) КАК ПФРСтраховая,
	|	СУММА(Взносы.ФФОМС) КАК ФФОМС
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
	|		СтраховыеВзносыИсчисленные.ВключатьВРазделы2 КАК ВключатьВРазделы2,
	|		СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		СтраховыеВзносыИсчисленные.ПФРСтраховаяОборот КАК ПФРСтраховая,
	|		СтраховыеВзносыИсчисленные.ФФОМСОборот КАК ФФОМС
	|	ИЗ
	|		ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, МЕСЯЦ),
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		СтраховыеВзносыИсчисленные.ВключатьВРазделы2,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|			ИНАЧЕ СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов
	|		КОНЕЦ,
	|		СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВДОборот,
	|		СтраховыеВзносыИсчисленные.ФФОМСЕНВДОборот
	|	ИЗ
	|		ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|			ПО СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|				И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)) КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.ПериодРегистрации,
	|	Взносы.ФизЛицо,
	|	Взносы.ВидТарифаСтраховыхВзносов,
	|	Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчетаВзносов.ПериодРегистрации КАК Период,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ДанныеУчетаВзносов.ВключатьВРазделы2,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|				КОНЕЦ
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРСтраховая КАК ЧИСЛО(15, 2))) КАК ПФРСтраховая,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ФФОМС КАК ЧИСЛО(15, 2))) КАК ФФОМС
	|ПОМЕСТИТЬ ВТВзносы
	|ИЗ
	|	ВТДанныеУчетаВзносов КАК ДанныеУчетаВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыОдногоТарифа КАК ПериодыОдногоТарифа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеПериодаОдногоТарифа
	|			ПО ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов = ОписаниеПериодаОдногоТарифа.ВидТарифа
	|				И (ОписаниеПериодаОдногоТарифа.РасчетныйПериод = &парамГод)
	|		ПО ДанныеУчетаВзносов.ФизЛицо = ПериодыОдногоТарифа.ФизЛицо
	|			И ДанныеУчетаВзносов.ПериодРегистрации = ПериодыОдногоТарифа.ПериодРегистрации
	|			И ДанныеУчетаВзносов.ВключатьВРазделы2 = ПериодыОдногоТарифа.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыРаспределенияВзносовПоТарифам КАК КоэффициентыРаспределенияВзносовПоТарифам
	|		ПО ДанныеУчетаВзносов.ФизЛицо = КоэффициентыРаспределенияВзносовПоТарифам.ФизЛицо
	|			И ДанныеУчетаВзносов.ПериодРегистрации = КоэффициентыРаспределенияВзносовПоТарифам.ПериодРегистрации
	|			И ДанныеУчетаВзносов.ВключатьВРазделы2 = КоэффициентыРаспределенияВзносовПоТарифам.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаВзносов.ПериодРегистрации,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|				КОНЕЦ
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	ДанныеУчетаВзносов.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы.Период,
	|	Доходы.ФизЛицо,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.СуммаПревысившаяПредел > 0
	|	И Доходы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизЛицо) КАК ВсегоФизлиц,
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаВсеМесяцы
	|ИЗ
	|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицаСПревышениемБазы.Период,
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы
	|ИЗ
	|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
	|	ЛицаСПревышениемБазы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Период,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаФОМС <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Период,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиФОМСЗаВсеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаФОМС <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Основание,
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период КАК Период,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот), 0) КАК ВзносыОпасный,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот), 0) КАК ВзносыВредный4,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот), 0) КАК ВзносыВредный3,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот), 0) КАК ВзносыВредный2,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот), 0) КАК ВзносыВредный1
	|ПОМЕСТИТЬ ВТВзносыПоКлассамУсловий
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот), 0)
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Взносы.Основание
	|ПОМЕСТИТЬ ВТОснованияВзносов
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК Взносы
	|ГДЕ
	|	(Взносы.ВзносыОпасный > 0
	|			ИЛИ Взносы.ВзносыВредный1 > 0
	|			ИЛИ Взносы.ВзносыВредный2 > 0
	|			ИЛИ Взносы.ВзносыВредный3 > 0
	|			ИЛИ Взносы.ВзносыВредный4 > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Основание,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыОпасный > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный4 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный3 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный2 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный1 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный1,
	|	Взносы.Период
	|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период,
	|	Взносы.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзносыПоКлассамУсловий.Основание,
	|	ВзносыПоКлассамУсловий.ФизЛицо,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыОпасный) КАК ВзносыОпасный,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный4) КАК ВзносыВредный4,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный3) КАК ВзносыВредный3,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный2) КАК ВзносыВредный2,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный1) КАК ВзносыВредный1
	|ПОМЕСТИТЬ ВТВзносыЗаВесьПериод
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыПоКлассамУсловий.Основание,
	|	ВзносыПоКлассамУсловий.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыОпасный > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный4 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный3 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный2 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный1 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный1,
	|	Взносы.Основание
	|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыЗаВесьПериод КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыПоказателейСНачалаГодаПоФизлицам.ПФРСтраховая) КАК ПФРСтраховая,
	|	СУММА(ВЫБОР
	|			КОГДА ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную
	|				ТОГДА РасчетыПоказателейСНачалаГодаПоФизлицам.ПФРССуммПревышения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРССуммПревышения,
	|	СУММА(РасчетыПоказателейСНачалаГодаПоФизлицам.ФФОМС) КАК ФФОМС,
	|	РасчетыПоказателейСНачалаГодаПоФизлицам.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТРасчетПоказателейСНачалаГода
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(Доходы.НачисленоВсего, 0) - ЕСТЬNULL(Доходы.НеОблагается, 0) - ЕСТЬNULL(Доходы.РасходыПоАвторским, 0) - ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)) * РазмерыТарифныхСтавок.ПФР / 100 КАК ЧИСЛО(15, 2)) КАК ПФРСтраховая,
	|		ВЫРАЗИТЬ(СУММА(Доходы.СуммаПревысившаяПредел) / 10 КАК ЧИСЛО(15, 2)) КАК ПФРССуммПревышения,
	|		ВЫРАЗИТЬ(СУММА(ЕСТЬNULL(Доходы.НачисленоВсегоФОМС, 0) - ЕСТЬNULL(Доходы.НеОблагаетсяФОМС, 0) - ЕСТЬNULL(Доходы.РасходыПоАвторскимОМС, 0)) * РазмерыТарифныхСтавок.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК ФФОМС,
	|		Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Доходы.ФизЛицо КАК ФизЛицо
	|	ИЗ
	|		ВТДоходыВзносов КАК Доходы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|			ПО Доходы.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
	|	ГДЕ
	|		Доходы.ВключатьВРазделы2
	|		И &БылоИзменениеТарифаЗаднимЧислом
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Доходы.ВидТарифаСтраховыхВзносов,
	|		РазмерыТарифныхСтавок.ПФР,
	|		РазмерыТарифныхСтавок.ФФОМС,
	|		Доходы.ФизЛицо) КАК РасчетыПоказателейСНачалаГодаПоФизлицам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО РасчетыПоказателейСНачалаГодаПоФизлицам.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоказателейСНачалаГодаПоФизлицам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицОпасный, 0)) КАК П000240024503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный4, 0)) КАК П000240025103,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025104,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025105,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025106,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный3, 0)) КАК П000240025703,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025704,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025705,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025706,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный2, 0)) КАК П000240026303,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026304,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026305,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026306,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный1, 0)) КАК П000240026903,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026904,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026905,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026906,
	|	ОснованияВзносов.Основание
	|ИЗ
	|	ВТПериоды КАК МесяцыОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВзносов КАК ОснованияВзносов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|			ПО ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаВсеМесяцы.Основание
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Основание)
	|			И (МЕСЯЦ(МесяцыОтчета.КонецМесяцаРасчетногоПериода) = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
	|ГДЕ
	|	МЕСЯЦ(МесяцыОтчета.КонецМесяцаРасчетногоПериода) В (&Месяц1, &Месяц2, &Месяц3)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОснованияВзносов.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзносыФизлиц.Основание КАК Основание
	|ИЗ
	|	ВТОснованияВзносов КАК ВзносыФизлиц
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|ГДЕ
	|	(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	2
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|ГДЕ
	|	(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыОпасный), 0) КАК П000240024403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024406,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный4), 0) КАК П000240025003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025006,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный3), 0) КАК П000240025603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025606,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный2), 0) КАК П000240026203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026206,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный1), 0) КАК П000240026803,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026804,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026805,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026806,
	|	ВзносыФизлиц.Основание КАК Основание
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК ВзносыФизлиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный), 0) КАК П000240024003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный), 0) КАК П000240024103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024106,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4), 0) КАК П000240024603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024606,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4), 0) КАК П000240024703,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024704,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024705,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024706,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3), 0) КАК П000240025203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025206,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3), 0) КАК П000240025303,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025304,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025305,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025306,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2), 0) КАК П000240025803,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025804,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025805,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025806,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2), 0) КАК П000240025903,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025904,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025905,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025906,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1), 0) КАК П000240026403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026406,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1), 0) КАК П000240026503,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026504,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026505,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000240024503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024506,
	|	1 КАК Основание
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	2
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П000220022003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П000220022103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022106,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах), 0) КАК П000230023003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах), 0) КАК П000230023103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023106,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000220022503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000230023503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023506
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот), 0) КАК П000220022403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022406,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот), 0) КАК П000230023403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023406
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ВключатьВРазделы2
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсего), 0) КАК П000210020003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагается), 0) КАК П000210020103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020106,
	|	ЕСТЬNULL(СУММА(Доходы.РасходыПоАвторским), 0) КАК П000210020203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020206,
	|	ЕСТЬNULL(СУММА(Доходы.СуммаПревысившаяПредел), 0) КАК П000210020303,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020304,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020305,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020306,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоФОМС), 0) КАК П000210021003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяФОМС), 0) КАК П000210021103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021106,
	|	ЕСТЬNULL(СУММА(Доходы.РасходыПоАвторскимОМС), 0) КАК П000210021203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021206,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210020703,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020704,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020705,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020706,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиФОМСЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210021503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210021504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210021505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210021506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСПревышениемБазыЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210020803,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020804,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020805,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020806
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаВсеМесяцы КАК ЛицаСПревышениемБазыЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы КАК ЛицаСПревышениемБазыЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаВсеМесяцы КАК ЛицаСВзносамиЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаОтдельныеМесяцы КАК ЛицаСВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаВсеМесяцы КАК ЛицаСВзносамиФОМСЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиФОМСЗаОтдельныеМесяцы КАК ЛицаСВзносамиФОМСЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСВзносамиФОМСЗаОтдельныеМесяцы.Период
	|ГДЕ
	|	Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &БылоИзменениеТарифаЗаднимЧислом
	|				ТОГДА РасчетДляСтрокСНачалаГода.ПФРСтраховая
	|			ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|								И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|							ТОГДА 0
	|						ИНАЧЕ ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|					КОНЕЦ)
	|		КОНЕЦ, 0) КАК П000210020503,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020504,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020505,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020506,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &БылоИзменениеТарифаЗаднимЧислом
	|				ТОГДА РасчетДляСтрокСНачалаГода.ПФРССуммПревышения
	|			ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|								И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|							ТОГДА ВзносыФизлиц.ПФРСтраховая
	|						ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|					КОНЕЦ)
	|		КОНЕЦ, 0) КАК П000210020603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) <> &Месяц1
	|					ТОГДА 0
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|			КОНЕЦ), 0) КАК П000210020604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) <> &Месяц2
	|					ТОГДА 0
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|			КОНЕЦ), 0) КАК П000210020605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) <> &Месяц3
	|					ТОГДА 0
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|			КОНЕЦ), 0) КАК П000210020606,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА &БылоИзменениеТарифаЗаднимЧислом
	|				ТОГДА РасчетДляСтрокСНачалаГода.ФФОМС
	|			ИНАЧЕ СУММА(ВзносыФизлиц.ФФОМС)
	|		КОНЕЦ, 0) КАК П000210021403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021406,
	|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов
	|ИЗ
	|	ВТВзносы КАК ВзносыФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК Доходы
	|		ПО ВзносыФизлиц.Период = Доходы.Период
	|			И ВзносыФизлиц.ФизЛицо = Доходы.ФизЛицо
	|			И ВзносыФизлиц.ВключатьВРазделы2 = Доходы.ВключатьВРазделы2
	|			И ВзносыФизлиц.ВидТарифаСтраховыхВзносов = Доходы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетПоказателейСНачалаГода КАК РасчетДляСтрокСНачалаГода
	|		ПО ВзносыФизлиц.ВидТарифаСтраховыхВзносов = РасчетДляСтрокСНачалаГода.ВидТарифаСтраховыхВзносов
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов,
	|	РасчетДляСтрокСНачалаГода.ПФРСтраховая,
	|	РасчетДляСтрокСНачалаГода.ПФРССуммПревышения,
	|	РасчетДляСтрокСНачалаГода.ФФОМС";
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&УсловиеВключенияДанных", 
		"(НАЧАЛОПЕРИОДА(Период, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(ДатаРегистрацииИзменений, КВАРТАЛ)
		|					ИЛИ ДатаРегистрацииИзменений <= КОНЕЦПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, КВАРТАЛ))");
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	

	РасчетыСФондамиТекст = 
	"ВЫБРАТЬ
	|	РасчетыПоСтраховымВзносамОбороты.Период КАК Период,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРПоСуммарномуТарифуРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ФФОМСРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ТФОМСРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|ПОМЕСТИТЬ ВТРасчетыСФондом
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецОтчетногоПериода,
	|			Месяц,
	|			Организация = &парамОбособленноеПодразделение
	|				И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|				И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыСФондом.ПФРПоСуммарномуТарифуРасход) КАК П000100014003,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014103,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014203,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014303,
	|	СУММА(РасчетыСФондом.ПФРСтраховаяРасход) КАК П000100014004,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014104,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014204,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014304,
	|	СУММА(РасчетыСФондом.ПФРНакопительнаяРасход) КАК П000100014005,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014105,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014205,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014305,
	|	СУММА(РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход) КАК П000100014006,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014106,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014206,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014306,
	|	СУММА(РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход) КАК П000100014007,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014107,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014207,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014307,
	|	СУММА(РасчетыСФондом.ФФОМСРасход) + СУММА(РасчетыСФондом.ТФОМСРасход) КАК П000100014008,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014108,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014208,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014308
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом";
	
	ОстаткиНаНачалоПериодаТекст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Остатки.ПФРСтраховаяОстаток), 0) КАК Остаток
	|ПОМЕСТИТЬ ВТОстаткиПоСтраховойЧастиНаДатуОбъединения
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|			&парамНачалоГода,
	|			Организация = &парамОбособленноеПодразделение
	|				И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|				И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Остатки.П000100010003) КАК П000100010003,
	|	СУММА(Остатки.П000100010004) КАК П000100010004,
	|	СУММА(Остатки.П000100010005) КАК П000100010005,
	|	СУММА(Остатки.П000100010006) КАК П000100010006,
	|	СУММА(Остатки.П000100010007) КАК П000100010007,
	|	СУММА(Остатки.П000100010008) КАК П000100010008
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.ПФРПоСуммарномуТарифуОстаток КАК П000100010003,
	|		Остатки.ПФРСтраховаяОстаток КАК П000100010004,
	|		Остатки.ПФРНакопительнаяОстаток КАК П000100010005,
	|		Остатки.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОстаток КАК П000100010006,
	|		Остатки.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОстаток КАК П000100010007,
	|		Остатки.ФФОМСОстаток + Остатки.ТФОМСОстаток КАК П000100010008
	|	ИЗ
	|		РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|				&парамНачалоГода,
	|				Организация = &парамОбособленноеПодразделение
	|					И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|					И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток < 0
	|				ТОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток < 0
	|				ТОГДА -ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТОстаткиПоСтраховойЧастиНаДатуОбъединения КАК ОстаткиПоСтраховойЧастиНаДатуОбъединения) КАК Остатки";
	
	ЗастрахованныеЛицаТекст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗастрахованныеЛица.Физлицо) КАК КоличествоФизлиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК Физлицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&парамНачалоОтчетногоПериода,
	|				Организация = &парамГоловнаяОрганизация
	|					И Сотрудник.ВидДоговора В (&ДоговорыЗЛ)) КАК РаботникиОрганизацииСрезПоследних
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &парамНачалоОтчетногоПериода
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
	|			КОНЕЦ = &парамОбособленноеПодразделение
	|		И ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &парамНачалоОтчетногоПериода
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаботникиОрганизации.Сотрудник.Физлицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|	ГДЕ
	|		РаботникиОрганизации.Период МЕЖДУ &парамНачалоОтчетногоПериода И &парамКонецОтчетногоПериода
	|		И РаботникиОрганизации.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|		И РаботникиОрганизации.Организация = &парамГоловнаяОрганизация
	|		И РаботникиОрганизации.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|		И РаботникиОрганизации.Сотрудник.ВидДоговора В(&ДоговорыЗЛ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|				&парамНачалоОтчетногоПериода,
	|				&парамКонецОтчетногоПериода,
	|				,
	|				Организация = &парамГоловнаяОрганизация
	|					И ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И ВидДохода.ВходитВБазуПФР) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
	|	ИЗ
	|		Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|	ГДЕ
	|		ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамКонецОтчетногоПериода
	|		И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамНачалоОтчетногоПериода
	|		И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|		И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОбособленноеПодразделение) КАК ЗастрахованныеЛица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЗастрахованныеЛица.Физлицо.СтраховойНомерПФР = """"
	|				ТОГДА ЛОЖЬ
	|			КОГДА ЗастрахованныеЛица.Физлицо.СтраховойНомерПФР = ""   -   -      ""
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	ПерерасчетыТекст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) КАК Период,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ КАК П000400000102,
	|	ВЫБОР
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|			ТОГДА ""1""
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) <> 0
	|			ТОГДА ""2""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК П000400000103,
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода) КАК П000400000104,
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода) КАК П000400000105,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД) КАК П000400000106,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуСПревышения) КАК П000400000107,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховая + СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД) КАК П000400000108,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховаяСПревышения) КАК П000400000109,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРНакопительная + СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД) КАК П000400000110,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК П000400000111,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК П000400000112,
	|	ВЫБОР
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|			ТОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4)
	|		ИНАЧЕ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4)
	|	КОНЕЦ КАК П000400000113,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМС + СтраховыеВзносыИсчисленные.ФФОМСЕНВД) КАК П000400000114
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.Период МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуСПревышения) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховая + СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховаяСПревышения) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРНакопительная + СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ФФОМС + СтраховыеВзносыИсчисленные.ФФОМСЕНВД) <> 0
	|		ИЛИ ВЫБОР
	|			КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|				ТОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4)
	|			ИНАЧЕ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4)
	|		КОНЕЦ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ,
	|	""2"",
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4),
	|	0
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.Период МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ДляИсправленияОшибок)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""4""
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0 И
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	П000400000104,
	|	П000400000105,
	|	П000400000102,
	|	П000400000103";
	
	// -------------------------------------------------------------------------------
	// Вывод данных в отчет
	
	УзелТитульногоЛиста = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Титульный");
	УзелРаздел1 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел1");
	УзелРаздел2 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел21");
	УзелРаздел22 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел22");
	УзелРаздел24 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел24");
	
	// Титульный лист
	
	Отчет = Отчеты.СредняяЧисленностьРаботниковОрганизаций.Создать();
	ТаблицаСреднихЧисленостей = Отчет.ПолучитьТаблицуЧисленностей(Организация, НачалоГода(ДатаКонцаПериодаОтчета), ДатаКонцаПериодаОтчета, Ложь);
	Если ТаблицаСреднихЧисленостей.Количество() > 0 Тогда
		СтрокаТЗ = ТаблицаСреднихЧисленостей[0];
		Если СтрокаТЗ.СреднеСписочнаяЧисленность <> Null Тогда
			ЧисленностьРаботников = Формат(Окр(СтрокаТЗ.СреднеСписочнаяЧисленность),"ЧЦ=5; ЧДЦ=0; ЧГ=0");
			ВсегоЗнаков = СтрДлина(ЧисленностьРаботников);
			Для СчСимволов = 1 По ВсегоЗнаков Цикл
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "СрСписЧисл" + Строка(7 - СчСимволов), Сред(ЧисленностьРаботников, ВсегоЗнаков - СчСимволов + 1,1));
			КонецЦикла;
			Если ВсегоЗнаков < 6 Тогда
				Для СчСимволов = ВсегоЗнаков + 1 По 5 Цикл
					ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "СрСписЧисл" + Строка(7 - СчСимволов), "");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ЗастрахованныеЛицаТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	Если Выборка.Следующий() Тогда
		ЧисленностьЗастрахованныхЛиц = Формат(Выборка.КоличествоФизлиц,"ЧЦ=6; ЧДЦ=0; ЧГ=0");
		ВсегоЗнаков = СтрДлина(ЧисленностьЗастрахованныхЛиц);
		Для СчСимволов = 1 По ВсегоЗнаков Цикл
			ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "КолЗастрахованных" + Строка(7 - СчСимволов), Сред(ЧисленностьЗастрахованныхЛиц, ВсегоЗнаков - СчСимволов + 1,1));
		КонецЦикла;
		Если ВсегоЗнаков < 6 Тогда
			Для СчСимволов = ВсегоЗнаков + 1 По 6 Цикл
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "КолЗастрахованных" + Строка(7 - СчСимволов), "");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Раздел 1 
	
	Запрос.Текст = РасчетыСФондамиТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел1,Результат); 
	
	Запрос.Текст = ОстаткиНаНачалоПериодаТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
		ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел1,Результат); 
	
	// Раздел 2 
	
	Запрос.Текст = ОсновнойТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		МассивРезультатов = Запрос.ВыполнитьПакет();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	
	ВсегоЗапросов = МассивРезультатов.Количество();
	
	// Раздел 2.1 
	
	ВсеТарифы = МассивРезультатов[ВсегоЗапросов-3].Выгрузить();
	ТаблицаДоходов = МассивРезультатов[ВсегоЗапросов-2].Выгрузить();
	ТаблицаВзносов = МассивРезультатов[ВсегоЗапросов-1].Выгрузить();
	КоличествоТарифов = ВсеТарифы.Количество();
	ИндексПоследнейСтроки = КоличествоТарифов - 1;
	СтруктураПоиска = Новый Структура("ВидТарифаСтраховыхВзносов");
	
	Для каждого СтрокаРезультата Из ВсеТарифы Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРезультата);
		
		СтрокаДоходов = ТаблицаДоходов.Скопировать(СтруктураПоиска);
		СтрокаВзносов = ТаблицаВзносов.Скопировать(СтруктураПоиска);
		
		КодТарифа = СоответствиеКодовТарифа[СтрокаРезультата.ВидТарифаСтраховыхВзносов];
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел2, "П000210001001", Лев(КодТарифа,1));
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел2, "П000210001002", Прав(КодТарифа,1));
		
		Если СтрокаДоходов.Количество() = 0 и СтрокаВзносов.Количество() = 0 Тогда // по текущему тарифу нет данных
			Если КоличествоТарифов > 1 И ВсеТарифы.Индекс(СтрокаРезультата) = ИндексПоследнейСтроки Тогда
				ДеревоПоказателей.Строки.Удалить(УзелРаздел2)
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДоходов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел2, СтрокаДоходов)
		КонецЕсли;
		Если СтрокаВзносов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел2, СтрокаВзносов)
		КонецЕсли;
		
		// если применяемых в орг. тарифов больше 1, тогда создадим еще одну ветку для раздела 2
		Если ВсеТарифы.Индекс(СтрокаРезультата) < ИндексПоследнейСтроки Тогда  
			УзелРаздел2 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел21");
		КонецЕсли;
		
	КонецЦикла;
	
	// Разделы 2.2 и 2.3 
	
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел22,МассивРезультатов[ВсегоЗапросов-4]); 
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел22,МассивРезультатов[ВсегоЗапросов-5]); 
	
	// Раздел 2.4 
	
	ВсеОснования = МассивРезультатов[ВсегоЗапросов-8].Выгрузить();
	ТаблицаДоходов = МассивРезультатов[ВсегоЗапросов-6].Выгрузить();
	ТаблицаВзносов = МассивРезультатов[ВсегоЗапросов-7].Выгрузить();
	ТаблицаЧисленности = МассивРезультатов[ВсегоЗапросов-9].Выгрузить();
	КоличествоОснований = ВсеОснования.Количество();
	ИндексПоследнейСтроки = КоличествоОснований - 1;
	СтруктураПоиска = Новый Структура("Основание");
	
	Для каждого СтрокаРезультата Из ВсеОснования Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРезультата);
		
		СтрокаДоходов = ТаблицаДоходов.Скопировать(СтруктураПоиска);
		СтрокаВзносов = ТаблицаВзносов.Скопировать(СтруктураПоиска);
		СтрокаЧисленности = ТаблицаЧисленности.Скопировать(СтруктураПоиска);
		
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел24, "П000240001001", СтрокаРезультата.Основание);
		
		Если СтрокаДоходов.Количество() = 0 И СтрокаВзносов.Количество() = 0 И СтрокаЧисленности.Количество() = 0 Тогда // по текущему основанию нет данных
			Если КоличествоОснований > 1 И ВсеОснования.Индекс(СтрокаРезультата) = ИндексПоследнейСтроки Тогда
				ДеревоПоказателей.Строки.Удалить(УзелРаздел24)
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДоходов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаДоходов)
		КонецЕсли;
		Если СтрокаВзносов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаВзносов)
		КонецЕсли;
		Если СтрокаЧисленности.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаЧисленности)
		КонецЕсли;
		
		// если применяемых в орг. оснований больше 1, тогда создадим еще одну ветку для раздела 2.4
		Если ВсеОснования.Индекс(СтрокаРезультата) < ИндексПоследнейСтроки Тогда  
			УзелРаздел24 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел24");
		КонецЕсли;
		
	КонецЦикла;
	
	// Раздел 4
	
	Запрос.Текст = ПерерасчетыТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиТаблицуДанныхВДеревоПоказателей(ДеревоПоказателей, Результат.Выгрузить(), "П0004000001");
	
	Возврат МассивЗначенийДерева(ДеревоПоказателей);
	
КонецФункции 

Функция ЗначенияПоказателей_РСВ1_2014Кв1(ПараметрыОтчета) Экспорт 
	
	ДеревоПоказателей = Новый ДеревоЗначений;
	ДеревоПоказателей.Колонки.Добавить("Имя");
	ДеревоПоказателей.Колонки.Добавить("Значение");
	
	ПустоеДерево = ДеревоПоказателей.Скопировать();
		
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаОкончанияПериода;
	Организация = ПараметрыОтчета.Организация;
    Если Год(ДатаКонцаПериодаОтчета) = 2014 Тогда
		СоответствиеКодовТарифа = Новый Соответствие;
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов, "03");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕСХН, "04");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ITОрганизации, "06");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство, "07");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов, "08");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СМИ, "09");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково, "10");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляФармацевтовАптек, "11");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации, "12");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации, "13");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ, "15");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СельХозПроизводители, "18");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы, "19");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент, "16");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны, "36");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму, "23");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития, "24");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕНВД, "53");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим, "52");
	Иначе
		СоответствиеКодовТарифа = Новый Соответствие;
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕСХН, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ITОрганизации, "06");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство, "07");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов, "08");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СМИ, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково, "10");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляФармацевтовАптек, "11");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации, "12");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации, "13");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ, "15");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.СельХозПроизводители, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы, "01");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент, "16");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму, "23");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития, "24");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны, "36");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.ЕНВД, "53");
		СоответствиеКодовТарифа.Вставить(Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим, "52");
	КонецЕсли;
	
	МассивЗапросов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РасчетСтраховыхВзносов.ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамКонецОтчетногоПериода", КонецДня(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамНачалоОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.НачалоОтчетногоПериодаПерсучета(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("парамДалекаяДата", ДобавитьМесяц(НачалоГода(ДатаКонцаПериодаОтчета), 1200));
	Запрос.УстановитьПараметр("парамГод", Год(ДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("Месяц1", Месяц(ДатаКонцаПериодаОтчета) - 2);
	Запрос.УстановитьПараметр("Месяц2", Месяц(ДатаКонцаПериодаОтчета) - 1);
	Запрос.УстановитьПараметр("Месяц3", Месяц(ДатаКонцаПериодаОтчета));
	// Все данные отчета берутся по обособленному подразделению (указанной организации)
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ОбщегоНазначенияЗК.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("парамДатаПереходаНаВзносы", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР", РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР());
	Запрос.УстановитьПараметр("ДатаСтрахованияВсехВременноПребывающих", РасчетСтраховыхВзносов.ДатаСтрахованияВсехВременноПребывающих());
	Запрос.УстановитьПараметр("ДоговорыЗЛ", ПроцедурыУправленияПерсоналомПереопределяемый.СписокДоговоровФормыВыбораСотрудника(2));
	
	// ----------------------------------------------------------------------------------
	// ТЕКСТЫ ЗАПРОСОВ
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ДатаКонцаПериодаОтчета));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК КонецМесяцаРасчетногоПериода ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ДатаКонцаПериодаОтчета) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	ОсновнойТекст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.РезультатОборот) КАК РезультатОборот,
	|	СУММА(СтраховыеВзносыСведенияОДоходахОбороты.СкидкаОборот) КАК СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходахОбороты.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			,
	|			&парамКонецОтчетногоПериода,
	|			МЕСЯЦ,
	|			ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|				И Организация = &парамГоловнаяОрганизация) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА НЕ СтраховыеВзносыСведенияОДоходахОбороты.ПоАктуПроверки
	|				И НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходахОбороты.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.РезультатОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(СрезПоследнихДат.Период, МЕСЯЦ) КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.КонецМесяцаРасчетногоПериода КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|				И (&УсловиеВключенияДанных)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.КонецМесяцаРасчетногоПериода,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК СрезПоследнихДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО СрезПоследнихДат.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И СрезПоследнихДат.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО (НАЧАЛОПЕРИОДА(СрезПоследнихДат.Период, МЕСЯЦ) = ВидыДеятельности.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьВРазделы2,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу) КАК ПФРСтраховаяОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД) КАК ПФРСтраховаяЕНВДОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМС) КАК ФФОМСОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМСЕНВД) КАК ФФОМСЕНВДОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот
	|ПОМЕСТИТЬ ВТВзносыИсчисленные
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|		ПО (НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ) = ВидыТарифныхСтавокОрганизаций.Период)
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Период <= &парамКонецОтчетногоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыИсчисленные.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ЛОЖЬ
	|		КОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТСведенияОДоходах КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизЛицаОрганизаций
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленные.ФизЛицо
	|ИЗ
	|	ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК Организации)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность,
	|	СведенияОбИнвалидностиФизлиц.ДатаВыдачи,
	|	СведенияОбИнвалидностиФизлиц.СрокДействияСправки
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК ПериодРегистрации,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= СведенияОбИнвалидностиФизлиц.Период
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		СведенияОбИнвалидностиФизлиц.Физлицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.КонецМесяцаРасчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК Период,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеИмеетПравоНаСтрахованиеФОМС,
	|	ВЫБОР
	|		КОГДА СрезПоследнихДат.ПериодРегистрации < &ДатаСтрахованияВсехВременноПребывающих
	|			ТОГДА ГражданствоФизЛиц.НеИмеетПравоНаПенсию
	|		КОГДА ГражданствоФизЛиц.ВидЗастрахованногоЛица В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеИмеетПравоНаСтрахование
	|ПОМЕСТИТЬ ВТГражданство
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК ПериодРегистрации,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= ГражданствоФизЛиц.Период
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.КонецМесяцаРасчетногоПериода) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
	|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.Период КАК ПериодРегистрации,
	|	СрезПоследнихДат.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения <= СрезПоследнихДат.Период
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаОрганизаций КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= ВременноПребывающие.Период
	|				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
	|				И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|				И (&УсловиеВключенияДанных)
	|	ГДЕ
	|		Периоды.КонецМесяцаРасчетногоПериода < &ДатаСтрахованияВсехВременноПребывающих
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.КонецМесяцаРасчетногоПериода,
	|		СписокСотрудников.ФизЛицо) КАК СрезПоследнихДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО СрезПоследнихДат.ПериодРегистра = ВременноПребывающие.Период
	|			И СрезПоследнихДат.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС,
	|	ТарифСтраховыхВзносов.ТФОМС,
	|	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф,
	|	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|ПОМЕСТИТЬ ВТРазмерыТарифныхСтавок
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				И СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.РезультатОборот,
	|	СтраховыеВзносыСведенияОДоходах.СкидкаОборот,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТСведенияОДоходахПоВидамТарифа
	|ИЗ
	|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавок
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|	И НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследнихДвижений.ПериодРегистрации КАК Период,
	|	ЕСТЬNULL(ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерФОМС, 0) КАК РазмерФОМС,
	|	ЕСТЬNULL(ПредельнаяВеличинаБазыСтраховыхВзносов.РазмерПФР, 0) КАК РазмерПФР
	|ПОМЕСТИТЬ ВТПредельнаяВеличина
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПредельнаяВеличинаБазыСтраховыхВзносов.Период) КАК Период,
	|		НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК ПериодРегистрации
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|			ПО Периоды.КонецМесяцаРасчетногоПериода >= ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.КонецМесяцаРасчетногоПериода) КАК ДатыПоследнихДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов КАК ПредельнаяВеличинаБазыСтраховыхВзносов
	|		ПО ДатыПоследнихДвижений.Период = ПредельнаяВеличинаБазыСтраховыхВзносов.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) = СведенияОДоходах.Период
	|					И СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаГодФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, МЕСЯЦ) = СведенияОДоходах.Период
	|					И СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФОМС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|			ПО СведенияОДоходах.Период = Гражданство.Период
	|				И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|			ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|				И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, ГОД) И Периоды.КонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.КонецМесяцаРасчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА Предел.РазмерПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГод - Предел.РазмерПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.РазмерПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА Предел.РазмерФОМС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГодФОМС - Предел.РазмерФОМС >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГодФОМС - Предел.РазмерФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - Предел.РазмерФОМС >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - Предел.РазмерФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПределФОМС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
	|		ПО ОблагаемаяБаза.Период = Предел.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ВключатьВРазделы2,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФОМС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО СведенияОДоходах.Период = Инвалиды.Период
	|			И СведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СведенияОДоходах.Период = Гражданство.Период
	|			И СведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|			И СведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|ГДЕ
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	СведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФОМС) КАК ЗаМесяцФОМС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВключатьВРазделы2) КАК ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.ЗаМесяц,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ОбособленноеПодразделение) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел * БазаЗаМесяцПоОбособленным.ЗаМесяц / ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВключатьВРазделы2,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|				И БазаЗаМесяцПоОбособленным.ВключатьВРазделы2 = ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	Превышение.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|ГДЕ
	|	Превышение.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВключатьВРазделы2) КАК ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФОМС
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.ЗаМесяцФОМС КАК ЗаМесяцФОМС,
	|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|	ИЗ
	|		(ВЫБРАТЬ
	|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|			СведенияОДоходах.Период КАК Период,
	|			СведенияОДоходах.ЗаМесяцФОМС КАК ЗаМесяцФОМС,
	|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|					И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СведенияОДоходах.ФизЛицо,
	|			СведенияОДоходах.Период,
	|			СведенияОДоходах.ЗаМесяцФОМС) КАК СведенияОДоходах
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|				И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
	|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОДоходах.ФизЛицо,
	|		СведенияОДоходах.Период,
	|		СведенияОДоходах.ОбособленноеПодразделение,
	|		СведенияОДоходах.ЗаМесяцФОМС) КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
	|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
	|			И СведенияОДоходах.ВидТарифаСтраховыхВзносов = БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФОМС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС * БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС / ОблагаемаяБаза.ЗаМесяцФОМС КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВключатьВРазделы2,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо КАК ФизЛицо,
	|	Превышение.Период КАК Период,
	|	Превышение.СуммаПревысившаяПредел,
	|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	Превышение.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТПревышениеДоходаФОМС
	|ИЗ
	|	ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|ГДЕ
	|	Превышение.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	СУММА(Превышение.СуммаПревысившаяПредел),
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|ИЗ
	|	(ВЫБРАТЬ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПределФОМС
	|	ИЗ
	|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Превышение.ФизЛицо,
	|	Превышение.Период,
	|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|	ОбособленноеПодразделениеДляОкругления.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения) КАК ГодРождения,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсего,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагается,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенкаПрокуроров)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОблагаемаяБазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходыПоАвторским,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахованиеФОМС, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеОткрытия)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеАудиовизуальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеДругиеМузыкальныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеЛитературныеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеМузыкальноСценическиеПроизведение)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеНаучныеТруды)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеСкульптуры)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеГрафическиеПроизведения)
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода = ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.АвторскиеИсполнениеПроизведений)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходыПоАвторскимОМС,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СУММА(ВЫБОР
	|						КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|								И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|							ТОГДА 0
	|						КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|							ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|				ТОГДА 0
	|			ИНАЧЕ МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел)
	|		КОНЕЦ / 10 КАК ЧИСЛО(15, 2)) КАК ИсчисленоПФРССуммПревышения,
	|	МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	МАКСИМУМ(ПревышениеДоходаФОМС.СуммаПревысившаяПредел) КАК СуммаПревысившаяПределФОМС
	|ПОМЕСТИТЬ ВТДоходыВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПревышениеДоходаПФР.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2 = ПревышениеДоходаПФР.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФОМС КАК ПревышениеДоходаФОМС
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПревышениеДоходаФОМС.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПревышениеДоходаФОМС.ФизЛицо
	|			И СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФОМС.ВидТарифаСтраховыхВзносов
	|			И СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2 = ПревышениеДоходаФОМС.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидТарифаСтраховыхВзносов,
	|	ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную,
	|	ГОД(СтраховыеВзносыСведенияОДоходах.ФизЛицо.ДатаРождения),
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			ИНАЧЕ СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|		КОНЕЦ) КАК НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|				ТОГДА 0
	|			КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаСтрахование, ЛОЖЬ)
	|					И НЕ ЕСТЬNULL(ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор, ЛОЖЬ)
	|				ТОГДА 0
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.СкидкаОборот
	|			КОГДА НЕ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|ПОМЕСТИТЬ ВТДоходыВредныхВзносов
	|ИЗ
	|	ВТСведенияОДоходахПоВидамТарифа КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.Период
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|		ПО СтраховыеВзносыСведенияОДоходах.Период = ПринятыеПоДолгосрочнымДоговорам.ПериодРегистрации
	|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Организации.ФизЛицо
	|			ИЗ
	|				ВТФизЛицаОрганизаций КАК Организации)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Месяцы.ФизЛицо,
	|	Месяцы.ПериодРегистрации,
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов,
	|	Месяцы.ВключатьВРазделы2
	|ПОМЕСТИТЬ ВТПериодыОдногоТарифа
	|ИЗ
	|	(ВЫБРАТЬ
	|		БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|		БазаДляОтчета.Период КАК ПериодРегистрации,
	|		БазаДляОтчета.ВключатьВРазделы2 КАК ВключатьВРазделы2
	|	ИЗ
	|		ВТДоходыВзносов КАК БазаДляОтчета
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БазаДляОтчета.Период,
	|		БазаДляОтчета.ФизЛицо,
	|		БазаДляОтчета.ВключатьВРазделы2
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) = 1) КАК Месяцы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО Месяцы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И Месяцы.ПериодРегистрации = БазаДляОтчета.Период
	|			И Месяцы.ВключатьВРазделы2 = БазаДляОтчета.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазаДляОтчета.ФизЛицо КАК ФизЛицо,
	|	БазаДляОтчета.Период КАК ПериодРегистрации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТМесяцыОсобыхТарифов
	|ИЗ
	|	ВТДоходыВзносов КАК БазаДляОтчета
	|ГДЕ
	|	БазаДляОтчета.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|
	|СГРУППИРОВАТЬ ПО
	|	БазаДляОтчета.ФизЛицо,
	|	БазаДляОтчета.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ПериодРегистрации,
	|	БазаДляОтчета.ВключатьВРазделы2,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаПФР * РазмерыТарифныхСтавок.ПФР) КАК ПФРСтраховаяЗаПериод,
	|	СУММА(БазаДляОтчета.ОблагаемаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС) КАК ФОМСЗаПериод,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек
	|ПОМЕСТИТЬ ВТПериодыДляРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТМесяцыОсобыхТарифов КАК ОсобыеТарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|			ПО БазаДляОтчета.ВидТарифаСтраховыхВзносов = РазмерыТарифныхСтавок.ВидТарифа
	|		ПО ОсобыеТарифы.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ОсобыеТарифы.ПериодРегистрации = БазаДляОтчета.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсобыеТарифы.ПериодРегистрации,
	|	ОсобыеТарифы.ФизЛицо,
	|	ОсобыеТарифы.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
	|	ОсобыеТарифы.ВыделятьТарифДляФармацевтовАптек,
	|	БазаДляОтчета.ВключатьВРазделы2
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БазаДляОтчета.ВидТарифаСтраховыхВзносов) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации,
	|	ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2,
	|	ТарифыПоДоходам.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаПФР * РазмерыТарифныхСтавок.ПФР / ПериодыДляРаспределенияВзносовПоТарифам.ПФРСтраховаяЗаПериод
	|	КОНЕЦ КАК КоэффициентПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод = 0
	|			ТОГДА 0
	|		ИНАЧЕ БазаДляОтчета.ОблагаемаяБазаФОМС * РазмерыТарифныхСтавок.ФФОМС / ПериодыДляРаспределенияВзносовПоТарифам.ФОМСЗаПериод
	|	КОНЕЦ КАК КоэффициентФОМС
	|ПОМЕСТИТЬ ВТКоэффициентыРаспределенияВзносовПоТарифам
	|ИЗ
	|	ВТПериодыДляРаспределенияВзносовПоТарифам КАК ПериодыДляРаспределенияВзносовПоТарифам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
	|		ПО (РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ РазмерыТарифныхСтавок.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК БазаДляОтчета
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = БазаДляОтчета.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = БазаДляОтчета.Период
	|			И (БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляЧленовЭкипажейМорскихСудовПодФлагомРФ
	|				ИЛИ БазаДляОтчета.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|					И ПериодыДляРаспределенияВзносовПоТарифам.ВыделятьТарифДляФармацевтовАптек)
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2 = БазаДляОтчета.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК ТарифыПоДоходам
	|		ПО ПериодыДляРаспределенияВзносовПоТарифам.ФизЛицо = ТарифыПоДоходам.ФизЛицо
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ПериодРегистрации = ТарифыПоДоходам.Период
	|			И ПериодыДляРаспределенияВзносовПоТарифам.ВключатьВРазделы2 = ТарифыПоДоходам.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ПериодРегистрации,
	|	Взносы.ФизЛицо,
	|	Взносы.ВидТарифаСтраховыхВзносов,
	|	Взносы.ВключатьВРазделы2,
	|	СУММА(Взносы.ПФРСтраховая) КАК ПФРСтраховая,
	|	СУММА(Взносы.ФФОМС) КАК ФФОМС
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
	|		СтраховыеВзносыИсчисленные.ВключатьВРазделы2 КАК ВключатьВРазделы2,
	|		СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		СтраховыеВзносыИсчисленные.ПФРСтраховаяОборот КАК ПФРСтраховая,
	|		СтраховыеВзносыИсчисленные.ФФОМСОборот КАК ФФОМС
	|	ИЗ
	|		ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, МЕСЯЦ),
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		СтраховыеВзносыИсчисленные.ВключатьВРазделы2,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|			ИНАЧЕ СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов
	|		КОНЕЦ,
	|		СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВДОборот,
	|		СтраховыеВзносыИсчисленные.ФФОМСЕНВДОборот
	|	ИЗ
	|		ВТВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|			ПО СтраховыеВзносыИсчисленные.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|				И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					Организации.ФизЛицо
	|				ИЗ
	|					ВТФизЛицаОрганизаций КАК Организации)) КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.ПериодРегистрации,
	|	Взносы.ФизЛицо,
	|	Взносы.ВидТарифаСтраховыхВзносов,
	|	Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеУчетаВзносов.ПериодРегистрации КАК Период,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ДанныеУчетаВзносов.ВключатьВРазделы2,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|				КОНЕЦ
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентПФРСтраховая
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ПФРСтраховая КАК ЧИСЛО(15, 2))) КАК ПФРСтраховая,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА 1
	|				КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|					ТОГДА ВЫБОР
	|							КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек))
	|								ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
	|							ИНАЧЕ 1 - КоэффициентыРаспределенияВзносовПоТарифам.КоэффициентФОМС
	|						КОНЕЦ
	|				ИНАЧЕ 1
	|			КОНЕЦ * ДанныеУчетаВзносов.ФФОМС КАК ЧИСЛО(15, 2))) КАК ФФОМС
	|ПОМЕСТИТЬ ВТВзносы
	|ИЗ
	|	ВТДанныеУчетаВзносов КАК ДанныеУчетаВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ДанныеУчетаВзносов.ПериодРегистрации = Инвалиды.Период
	|			И ДанныеУчетаВзносов.ФизЛицо = Инвалиды.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГод)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыОдногоТарифа КАК ПериодыОдногоТарифа
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеПериодаОдногоТарифа
	|			ПО ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов = ОписаниеПериодаОдногоТарифа.ВидТарифа
	|				И (ОписаниеПериодаОдногоТарифа.РасчетныйПериод = &парамГод)
	|		ПО ДанныеУчетаВзносов.ФизЛицо = ПериодыОдногоТарифа.ФизЛицо
	|			И ДанныеУчетаВзносов.ПериодРегистрации = ПериодыОдногоТарифа.ПериодРегистрации
	|			И ДанныеУчетаВзносов.ВключатьВРазделы2 = ПериодыОдногоТарифа.ВключатьВРазделы2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыРаспределенияВзносовПоТарифам КАК КоэффициентыРаспределенияВзносовПоТарифам
	|		ПО ДанныеУчетаВзносов.ФизЛицо = КоэффициентыРаспределенияВзносовПоТарифам.ФизЛицо
	|			И ДанныеУчетаВзносов.ПериодРегистрации = КоэффициентыРаспределенияВзносовПоТарифам.ПериодРегистрации
	|			И ДанныеУчетаВзносов.ВключатьВРазделы2 = КоэффициентыРаспределенияВзносовПоТарифам.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеУчетаВзносов.ПериодРегистрации,
	|	ДанныеУчетаВзносов.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОписаниеПериодаОдногоТарифа.ЗаменятьТарифНаЕНВД, ЛОЖЬ)
	|							И ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
	|						ТОГДА ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|					ИНАЧЕ ПериодыОдногоТарифа.ВидТарифаСтраховыхВзносов
	|				КОНЕЦ
	|		КОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов ЕСТЬ НЕ NULL 
	|			ТОГДА КоэффициентыРаспределенияВзносовПоТарифам.ВидТарифаСтраховыхВзносов
	|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
	|				И ЕСТЬNULL(ОписаниеТарифов.ВыделятьДоходыИнвалидов, ЛОЖЬ)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		ИНАЧЕ ДанныеУчетаВзносов.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	ДанныеУчетаВзносов.ВключатьВРазделы2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы.Период,
	|	Доходы.ФизЛицо,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.СуммаПревысившаяПредел > 0
	|	И Доходы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизЛицо) КАК ВсегоФизлиц,
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаВсеМесяцы
	|ИЗ
	|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛицаСПревышениемБазы.Период,
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛицаСПревышениемБазы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы
	|ИЗ
	|	ВТЛицаСПревышениемБазы КАК ЛицаСПревышениемБазы
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛицаСПревышениемБазы.ВидТарифаСтраховыхВзносов,
	|	ЛицаСПревышениемБазы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Взносы.ФизЛицо) КАК ВсегоФизлиц
	|ПОМЕСТИТЬ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыИсчисленные КАК Взносы
	|ГДЕ
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот <> 0
	|	И Взносы.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.Период,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаОтдельныеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.Период,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Доходы.ФизЛицо) КАК ВсегоФизлиц,
	|	Доходы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТЛицаСВзносамиЗаВсеМесяцы
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ОблагаемаяБазаПФР <> 0
	|	И Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Основание,
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период КАК Период,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот), 0) КАК ВзносыОпасный,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот), 0) КАК ВзносыВредный4,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот), 0) КАК ВзносыВредный3,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот), 0) КАК ВзносыВредный2,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот), 0) КАК ВзносыВредный1
	|ПОМЕСТИТЬ ВТВзносыПоКлассамУсловий
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот), 0),
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот), 0)
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ФизЛицо,
	|	ВзносыФизлиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Взносы.Основание
	|ПОМЕСТИТЬ ВТОснованияВзносов
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК Взносы
	|ГДЕ
	|	(Взносы.ВзносыОпасный > 0
	|			ИЛИ Взносы.ВзносыВредный1 > 0
	|			ИЛИ Взносы.ВзносыВредный2 > 0
	|			ИЛИ Взносы.ВзносыВредный3 > 0
	|			ИЛИ Взносы.ВзносыВредный4 > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Основание,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыОпасный > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный4 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный3 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный2 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный1 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный1,
	|	Взносы.Период
	|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Период,
	|	Взносы.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзносыПоКлассамУсловий.Основание,
	|	ВзносыПоКлассамУсловий.ФизЛицо,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыОпасный) КАК ВзносыОпасный,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный4) КАК ВзносыВредный4,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный3) КАК ВзносыВредный3,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный2) КАК ВзносыВредный2,
	|	СУММА(ВзносыПоКлассамУсловий.ВзносыВредный1) КАК ВзносыВредный1
	|ПОМЕСТИТЬ ВТВзносыЗаВесьПериод
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК ВзносыПоКлассамУсловий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыПоКлассамУсловий.Основание,
	|	ВзносыПоКлассамУсловий.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыОпасный > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицОпасный,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный4 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный4,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный3 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный3,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный2 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный2,
	|	СУММА(ВЫБОР
	|			КОГДА Взносы.ВзносыВредный1 > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоФизлицВредный1,
	|	Взносы.Основание
	|ПОМЕСТИТЬ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы
	|ИЗ
	|	ВТВзносыЗаВесьПериод КАК Взносы
	|
	|СГРУППИРОВАТЬ ПО
	|	Взносы.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицОпасный, 0)) КАК П000240024503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицОпасный, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный4, 0)) КАК П000240025103,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025104,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025105,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный4, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025106,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный3, 0)) КАК П000240025703,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025704,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025705,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный3, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240025706,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный2, 0)) КАК П000240026303,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026304,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026305,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный2, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026306,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлицВредный1, 0)) КАК П000240026903,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026904,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026905,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлицВредный1, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240026906,
	|	ОснованияВзносов.Основание
	|ИЗ
	|	ВТПериоды КАК МесяцыОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОснованияВзносов КАК ОснованияВзносов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|			ПО ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаВсеМесяцы.Основание
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиПоКлассамУсловийТрудаЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО (ОснованияВзносов.Основание = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Основание)
	|			И (МЕСЯЦ(МесяцыОтчета.КонецМесяцаРасчетногоПериода) = МЕСЯЦ(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период))
	|ГДЕ
	|	МЕСЯЦ(МесяцыОтчета.КонецМесяцаРасчетногоПериода) В (&Месяц1, &Месяц2, &Месяц3)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОснованияВзносов.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзносыФизлиц.Основание КАК Основание
	|ИЗ
	|	ВТОснованияВзносов КАК ВзносыФизлиц
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|ГДЕ
	|	(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	2
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|ГДЕ
	|	(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыОпасный), 0) КАК П000240024403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024406,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный4), 0) КАК П000240025003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025006,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный3), 0) КАК П000240025603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025606,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный2), 0) КАК П000240026203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026206,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ВзносыВредный1), 0) КАК П000240026803,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026804,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026805,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ВзносыВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026806,
	|	ВзносыФизлиц.Основание КАК Основание
	|ИЗ
	|	ВТВзносыПоКлассамУсловий КАК ВзносыФизлиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный), 0) КАК П000240024003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный), 0) КАК П000240024103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024106,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4), 0) КАК П000240024603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024606,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4), 0) КАК П000240024703,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024704,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024705,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240024706,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3), 0) КАК П000240025203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025206,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3), 0) КАК П000240025303,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025304,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025305,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025306,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2), 0) КАК П000240025803,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025804,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025805,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025806,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2), 0) КАК П000240025903,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025904,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025905,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240025906,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1), 0) КАК П000240026403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026406,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1), 0) КАК П000240026503,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026504,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026505,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000240026506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000240024503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000240024506,
	|	1 КАК Основание
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	2
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П000220022003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах), 0) КАК П000220022103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаПодземныхИВредныхРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022106,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах), 0) КАК П000230023003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах), 0) КАК П000230023103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяЗаЗанятыхНаТяжелыхИПрочихРаботах
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023106,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000220022503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000220022506,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000230023503,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023504,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023505,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000230023506
	|ИЗ
	|	ВТДоходыВредныхВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаВсеМесяцы КАК ЛицаСВреднымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаВсеМесяцы КАК ЛицаСТяжелымиВзносамиЗаВсеМесяцы
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВреднымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСВреднымиВзносамиЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы КАК ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.Период = ЛицаСТяжелымиВзносамиЗаОтдельныеМесяцы.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот), 0) КАК П000220022403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000220022406,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот), 0) КАК П000230023403,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023404,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023405,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000230023406
	|ИЗ
	|	ВТВзносыИсчисленные КАК ВзносыФизлиц
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|ГДЕ
	|	Доходы.ВключатьВРазделы2
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доходы.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсего), 0) КАК П000210020003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсего
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагается), 0) КАК П000210020103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагается
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020106,
	|	ЕСТЬNULL(СУММА(Доходы.РасходыПоАвторским), 0) КАК П000210020203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.РасходыПоАвторским
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020206,
	|	ЕСТЬNULL(СУММА(Доходы.СуммаПревысившаяПредел), 0) КАК П000210020303,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020304,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020305,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.СуммаПревысившаяПредел
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020306,
	|	ЕСТЬNULL(СУММА(Доходы.НачисленоВсегоФОМС), 0) КАК П000210021003,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021004,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021005,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НачисленоВсегоФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021006,
	|	ЕСТЬNULL(СУММА(Доходы.НеОблагаетсяФОМС), 0) КАК П000210021103,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021104,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021105,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.НеОблагаетсяФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021106,
	|	ЕСТЬNULL(СУММА(Доходы.РасходыПоАвторскимОМС), 0) КАК П000210021203,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021204,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021205,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.РасходыПоАвторскимОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021206,
	|	ЕСТЬNULL(СУММА(Доходы.СуммаПревысившаяПределФОМС), 0) КАК П000210021303,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|					ТОГДА Доходы.СуммаПревысившаяПределФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021304,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|					ТОГДА Доходы.СуммаПревысившаяПределФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021305,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|					ТОГДА Доходы.СуммаПревысившаяПределФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021306,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСВзносамиЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210020703,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020704,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020705,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСВзносамиЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020706,
	|	МАКСИМУМ(ЕСТЬNULL(ЛицаСПревышениемБазыЗаВсеМесяцы.ВсегоФизлиц, 0)) КАК П000210020803,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц1
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020804,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц2
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020805,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА МЕСЯЦ(Доходы.Период) = &Месяц3
	|				ТОГДА ЕСТЬNULL(ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВсегоФизлиц, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000210020806
	|ИЗ
	|	ВТДоходыВзносов КАК Доходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаВсеМесяцы КАК ЛицаСПревышениемБазыЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаВсеМесяцы КАК ЛицаСВзносамиЗаВсеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаВсеМесяцы.ВидТарифаСтраховыхВзносов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСПревышениемБазыЗаОтдельныеМесяцы КАК ЛицаСПревышениемБазыЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСПревышениемБазыЗаОтдельныеМесяцы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛицаСВзносамиЗаОтдельныеМесяцы КАК ЛицаСВзносамиЗаОтдельныеМесяцы
	|		ПО Доходы.ВидТарифаСтраховыхВзносов = ЛицаСВзносамиЗаОтдельныеМесяцы.ВидТарифаСтраховыхВзносов
	|			И Доходы.Период = ЛицаСВзносамиЗаОтдельныеМесяцы.Период
	|ГДЕ
	|	Доходы.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	Доходы.ВидТарифаСтраховыхВзносов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА 0
	|				ИНАЧЕ ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|			КОНЕЦ), 0) КАК П000210020503,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020504,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020505,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА 0
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая - ЕСТЬNULL(Доходы.ИсчисленоПФРССуммПревышения, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210020506,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|			КОНЕЦ), 0) КАК П000210020603,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) <> &Месяц1
	|					ТОГДА 0
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|			КОНЕЦ), 0) КАК П000210020604,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) <> &Месяц2
	|					ТОГДА 0
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|			КОНЕЦ), 0) КАК П000210020605,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(Доходы.Период) <> &Месяц3
	|					ТОГДА 0
	|				КОГДА ЕСТЬNULL(Доходы.ОблагаемаяБазаПФР, 0) = ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0)
	|						И ЕСТЬNULL(Доходы.СуммаПревысившаяПредел, 0) <> 0
	|					ТОГДА ВзносыФизлиц.ПФРСтраховая
	|				ИНАЧЕ Доходы.ИсчисленоПФРССуммПревышения
	|			КОНЕЦ), 0) КАК П000210020606,
	|	ЕСТЬNULL(СУММА(ВзносыФизлиц.ФФОМС), 0) КАК П000210021503,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц1
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021504,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц2
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021505,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА МЕСЯЦ(ВзносыФизлиц.Период) = &Месяц3
	|					ТОГДА ВзносыФизлиц.ФФОМС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК П000210021506,
	|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов
	|ИЗ
	|	ВТВзносы КАК ВзносыФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыВзносов КАК Доходы
	|		ПО ВзносыФизлиц.Период = Доходы.Период
	|			И ВзносыФизлиц.ФизЛицо = Доходы.ФизЛицо
	|			И ВзносыФизлиц.ВключатьВРазделы2 = Доходы.ВключатьВРазделы2
	|			И ВзносыФизлиц.ВидТарифаСтраховыхВзносов = Доходы.ВидТарифаСтраховыхВзносов
	|ГДЕ
	|	ВзносыФизлиц.ВключатьВРазделы2
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзносыФизлиц.ВидТарифаСтраховыхВзносов";
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "&УсловиеВключенияДанных", 
		"(НАЧАЛОПЕРИОДА(Период, КВАРТАЛ) >= НАЧАЛОПЕРИОДА(ДатаРегистрацииИзменений, КВАРТАЛ)
		|					ИЛИ ДатаРегистрацииИзменений <= КОНЕЦПЕРИОДА(Периоды.КонецМесяцаРасчетногоПериода, КВАРТАЛ))");
	
	ОсновнойТекст = СтрЗаменить(ОсновнойТекст, "РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	

	РасчетыСФондамиТекст = 
	"ВЫБРАТЬ
	|	РасчетыПоСтраховымВзносамОбороты.Период КАК Период,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРПоСуммарномуТарифуРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ФФОМСРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ТФОМСРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход,
	|	РасчетыПоСтраховымВзносамОбороты.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|ПОМЕСТИТЬ ВТРасчетыСФондом
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецОтчетногоПериода,
	|			Месяц,
	|			Организация = &парамОбособленноеПодразделение
	|				И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|				И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыСФондом.ПФРПоСуммарномуТарифуРасход) КАК П000100014003,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014103,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014203,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРПоСуммарномуТарифуРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014303,
	|	СУММА(РасчетыСФондом.ПФРСтраховаяРасход) КАК П000100014004,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014104,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014204,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРСтраховаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014304,
	|	СУММА(РасчетыСФондом.ПФРНакопительнаяРасход) КАК П000100014005,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014105,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014205,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРНакопительнаяРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014305,
	|	СУММА(РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход) КАК П000100014006,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014106,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014206,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014306,
	|	СУММА(РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход) КАК П000100014007,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014107,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014207,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014307,
	|	СУММА(РасчетыСФондом.ФФОМСРасход) + СУММА(РасчетыСФондом.ТФОМСРасход) КАК П000100014008,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц1
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014108,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц2
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014208,
	|	СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ФФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) + СУММА(ВЫБОР
	|			КОГДА МЕСЯЦ(РасчетыСФондом.Период) = &Месяц3
	|				ТОГДА РасчетыСФондом.ТФОМСРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК П000100014308
	|ИЗ
	|	ВТРасчетыСФондом КАК РасчетыСФондом";
	
	ОстаткиНаНачалоПериодаТекст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Остатки.ПФРСтраховаяОстаток), 0) КАК Остаток
	|ПОМЕСТИТЬ ВТОстаткиПоСтраховойЧастиНаДатуОбъединения
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|			&ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР,
	|			Организация = &парамОбособленноеПодразделение
	|				И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|				И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Остатки.П000100010003) КАК П000100010003,
	|	СУММА(Остатки.П000100010004) КАК П000100010004,
	|	СУММА(Остатки.П000100010005) КАК П000100010005,
	|	СУММА(Остатки.П000100010006) КАК П000100010006,
	|	СУММА(Остатки.П000100010007) КАК П000100010007,
	|	СУММА(Остатки.П000100010008) КАК П000100010008
	|ИЗ
	|	(ВЫБРАТЬ
	|		Остатки.ПФРПоСуммарномуТарифуОстаток КАК П000100010003,
	|		Остатки.ПФРСтраховаяОстаток КАК П000100010004,
	|		Остатки.ПФРНакопительнаяОстаток КАК П000100010005,
	|		Остатки.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОстаток КАК П000100010006,
	|		Остатки.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОстаток КАК П000100010007,
	|		Остатки.ФФОМСОстаток + Остатки.ТФОМСОстаток КАК П000100010008
	|	ИЗ
	|		РегистрНакопления.РасчетыПоСтраховымВзносам.Остатки(
	|				&парамНачалоГода,
	|				Организация = &парамОбособленноеПодразделение
	|					И МесяцРасчетногоПериода >= &парамДатаПереходаНаВзносы
	|					И ВидПлатежа В (ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогАкт), ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам))) КАК Остатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток < 0
	|				ТОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток < 0
	|				ТОГДА -ОстаткиПоСтраховойЧастиНаДатуОбъединения.Остаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТОстаткиПоСтраховойЧастиНаДатуОбъединения КАК ОстаткиПоСтраховойЧастиНаДатуОбъединения) КАК Остатки";
	
	ЗастрахованныеЛицаТекст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗастрахованныеЛица.Физлицо) КАК КоличествоФизлиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаботникиОрганизацииСрезПоследних.Сотрудник.Физлицо КАК Физлицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&парамНачалоОтчетногоПериода,
	|				Организация = &парамГоловнаяОрганизация
	|					И Сотрудник.ВидДоговора В (&ДоговорыЗЛ)
	|					И &ДополнительноеУсловие) КАК РаботникиОрганизацииСрезПоследних
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &парамНачалоОтчетногоПериода
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделениеЗавершения
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ОбособленноеПодразделение
	|			КОНЕЦ = &парамОбособленноеПодразделение
	|		И ВЫБОР
	|				КОГДА РаботникиОрганизацииСрезПоследних.ПериодЗавершения <= &парамНачалоОтчетногоПериода
	|						И РаботникиОрганизацииСрезПоследних.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостоянияЗавершения
	|				ИНАЧЕ РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния
	|			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РаботникиОрганизации.Сотрудник.Физлицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизации
	|	ГДЕ
	|		РаботникиОрганизации.Период МЕЖДУ &парамНачалоОтчетногоПериода И &парамКонецОтчетногоПериода
	|		И РаботникиОрганизации.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|		И РаботникиОрганизации.Организация = &парамГоловнаяОрганизация
	|		И РаботникиОрганизации.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|		И РаботникиОрганизации.Сотрудник.ВидДоговора В(&ДоговорыЗЛ)
	|		И &ДополнительноеУсловие
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|				&парамНачалоОтчетногоПериода,
	|				&парамКонецОтчетногоПериода,
	|				,
	|				Организация = &парамГоловнаяОрганизация
	|					И ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И ВидДохода.ВходитВБазуПФР) КАК СтраховыеВзносыСведенияОДоходахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
	|	ИЗ
	|		Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|	ГДЕ
	|		ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &парамКонецОтчетногоПериода
	|		И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &парамНачалоОтчетногоПериода
	|		И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|		И ДоговорНаВыполнениеРаботСФизЛицом.Организация = &парамОбособленноеПодразделение) КАК ЗастрахованныеЛица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЗастрахованныеЛица.Физлицо.СтраховойНомерПФР = """"
	|				ТОГДА ЛОЖЬ
	|			КОГДА ЗастрахованныеЛица.Физлицо.СтраховойНомерПФР = ""   -   -      ""
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	ЗастрахованныеЛицаТекст = СтрЗаменить(ЗастрахованныеЛицаТекст, "&ДополнительноеУсловие", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.УсловиеОтбораЗЛпоОПСизСотрудников());
	
	ПерерасчетыТекст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) КАК Период,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""3""
	|	КОНЕЦ КАК П000400000102,
	|	ВЫБОР
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|			ТОГДА ""1""
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) <> 0
	|			ТОГДА ""2""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК П000400000103,
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода) КАК П000400000104,
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода) КАК П000400000105,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД) КАК П000400000106,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуСПревышения) КАК П000400000107,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховая + СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД) КАК П000400000108,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховаяСПревышения) КАК П000400000109,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРНакопительная + СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД) КАК П000400000110,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК П000400000111,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК П000400000112,
	|	ВЫБОР
	|		КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|			ТОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4)
	|		ИНАЧЕ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4)
	|	КОНЕЦ КАК П000400000113,
	|	СУММА(СтраховыеВзносыИсчисленные.ФФОМС + СтраховыеВзносыИсчисленные.ФФОМСЕНВД) КАК П000400000114
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.Период МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""3""
	|	КОНЕЦ,
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуСПревышения) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховая + СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРСтраховаяСПревышения) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРНакопительная + СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) <> 0
	|		ИЛИ СУММА(СтраховыеВзносыИсчисленные.ФФОМС + СтраховыеВзносыИсчисленные.ФФОМСЕНВД) <> 0
	|		ИЛИ ВЫБОР
	|			КОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0
	|				ТОГДА СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4)
	|			ИНАЧЕ СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4)
	|		КОНЕЦ <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""3""
	|	КОНЕЦ,
	|	""2"",
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4),
	|	0
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.Период МЕЖДУ &парамНачалоГода И &парамКонецОтчетногоПериода
	|	И НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ) > НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, КВАРТАЛ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГОД(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.ДатаПолученияДохода),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленные.Период, КВАРТАЛ),
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.КамеральнаяПроверка)
	|			ТОГДА ""1""
	|		КОГДА СтраховыеВзносыИсчисленные.ОснованиеДляДоначисления = ЗНАЧЕНИЕ(Перечисление.ОснованияДляДоначисленияСтраховыхВзносов.ВыезднаяПроверка)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""3""
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) <> 0 И
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	П000400000104,
	|	П000400000105,
	|	П000400000102,
	|	П000400000103";
	
	// -------------------------------------------------------------------------------
	// Вывод данных в отчет
	
	УзелТитульногоЛиста = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Титульный");
	УзелРаздел1 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел1");
	УзелРаздел2 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел21");
	УзелРаздел22 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел22");
	УзелРаздел24 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел24");
	
	// Титульный лист
	
	Отчет = Отчеты.СредняяЧисленностьРаботниковОрганизаций.Создать();
	ТаблицаСреднихЧисленостей = Отчет.ПолучитьТаблицуЧисленностей(Организация, НачалоГода(ДатаКонцаПериодаОтчета), ДатаКонцаПериодаОтчета, Ложь);
	Если ТаблицаСреднихЧисленостей.Количество() > 0 Тогда
		СтрокаТЗ = ТаблицаСреднихЧисленостей[0];
		Если СтрокаТЗ.СреднеСписочнаяЧисленность <> Null Тогда
			ЧисленностьРаботников = Формат(Окр(СтрокаТЗ.СреднеСписочнаяЧисленность),"ЧЦ=5; ЧДЦ=0; ЧГ=0");
			ВсегоЗнаков = СтрДлина(ЧисленностьРаботников);
			Для СчСимволов = 1 По ВсегоЗнаков Цикл
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "СрСписЧисл" + Строка(7 - СчСимволов), Сред(ЧисленностьРаботников, ВсегоЗнаков - СчСимволов + 1,1));
			КонецЦикла;
			Если ВсегоЗнаков < 6 Тогда
				Для СчСимволов = ВсегоЗнаков + 1 По 5 Цикл
					ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "СрСписЧисл" + Строка(7 - СчСимволов), "");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = ЗастрахованныеЛицаТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	Если Выборка.Следующий() Тогда
		ЧисленностьЗастрахованныхЛиц = Формат(Выборка.КоличествоФизлиц,"ЧЦ=6; ЧДЦ=0; ЧГ=0");
		ВсегоЗнаков = СтрДлина(ЧисленностьЗастрахованныхЛиц);
		Для СчСимволов = 1 По ВсегоЗнаков Цикл
			ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "КолЗастрахованных" + Строка(7 - СчСимволов), Сред(ЧисленностьЗастрахованныхЛиц, ВсегоЗнаков - СчСимволов + 1,1));
		КонецЦикла;
		Если ВсегоЗнаков < 6 Тогда
			Для СчСимволов = ВсегоЗнаков + 1 По 6 Цикл
				ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелТитульногоЛиста, "КолЗастрахованных" + Строка(7 - СчСимволов), "");
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Раздел 1 
	
	Запрос.Текст = РасчетыСФондамиТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел1,Результат); 
	
	Запрос.Текст = ОстаткиНаНачалоПериодаТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
		ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел1,Результат); 
	
	// Раздел 2 
	
	Запрос.Текст = ОсновнойТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		МассивРезультатов = Запрос.ВыполнитьПакет();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	
	ВсегоЗапросов = МассивРезультатов.Количество();
	
	// Разделы 2.2 и 2.3 
	
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел22,МассивРезультатов[ВсегоЗапросов-4]); 
	ВывестиРезультатЗапросаВДеревоПоказателей(УзелРаздел22,МассивРезультатов[ВсегоЗапросов-5]); 
	
	// Раздел 2.1 
	
	ВсеТарифы = МассивРезультатов[ВсегоЗапросов-3].Выгрузить();
	ТаблицаДоходов = МассивРезультатов[ВсегоЗапросов-2].Выгрузить();
	ТаблицаВзносов = МассивРезультатов[ВсегоЗапросов-1].Выгрузить();
	КоличествоТарифов = ВсеТарифы.Количество();
	ИндексПоследнейСтроки = КоличествоТарифов - 1;
	СтруктураПоиска = Новый Структура("ВидТарифаСтраховыхВзносов");
	
	Для каждого СтрокаРезультата Из ВсеТарифы Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРезультата);
		
		СтрокаДоходов = ТаблицаДоходов.Скопировать(СтруктураПоиска);
		СтрокаВзносов = ТаблицаВзносов.Скопировать(СтруктураПоиска);
		
		КодТарифа = СоответствиеКодовТарифа[СтрокаРезультата.ВидТарифаСтраховыхВзносов];
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел2, "П000210001001", Лев(КодТарифа,1));
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел2, "П000210001002", Прав(КодТарифа,1));
		
		Если СтрокаДоходов.Количество() = 0 и СтрокаВзносов.Количество() = 0 Тогда // по текущему тарифу нет данных
			Если КоличествоТарифов > 1 И ВсеТарифы.Индекс(СтрокаРезультата) = ИндексПоследнейСтроки Тогда
				ДеревоПоказателей.Строки.Удалить(УзелРаздел2)
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДоходов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел2, СтрокаДоходов)
		КонецЕсли;
		Если СтрокаВзносов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел2, СтрокаВзносов)
		КонецЕсли;
		
		// если применяемых в орг. тарифов больше 1, тогда создадим еще одну ветку для раздела 2
		Если ВсеТарифы.Индекс(СтрокаРезультата) < ИндексПоследнейСтроки Тогда  
			УзелРаздел2 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел21");
		КонецЕсли;
		
	КонецЦикла;
	
	// Раздел 2.4 
	
	ВсеОснования = МассивРезультатов[ВсегоЗапросов-8].Выгрузить();
	ТаблицаДоходов = МассивРезультатов[ВсегоЗапросов-6].Выгрузить();
	ТаблицаВзносов = МассивРезультатов[ВсегоЗапросов-7].Выгрузить();
	ТаблицаЧисленности = МассивРезультатов[ВсегоЗапросов-9].Выгрузить();
	КоличествоОснований = ВсеОснования.Количество();
	ИндексПоследнейСтроки = КоличествоОснований - 1;
	СтруктураПоиска = Новый Структура("Основание");
	
	Для каждого СтрокаРезультата Из ВсеОснования Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРезультата);
		
		СтрокаДоходов = ТаблицаДоходов.Скопировать(СтруктураПоиска);
		СтрокаВзносов = ТаблицаВзносов.Скопировать(СтруктураПоиска);
		СтрокаЧисленности = ТаблицаЧисленности.Скопировать(СтруктураПоиска);
		
		ОпределитьСтрокуВДеревеДанныхДляЗаполнения(УзелРаздел24, "П000240001001", СтрокаРезультата.Основание);
		
		Если СтрокаДоходов.Количество() = 0 И СтрокаВзносов.Количество() = 0 И СтрокаЧисленности.Количество() = 0 Тогда // по текущему основанию нет данных
			Если КоличествоОснований > 1 И ВсеОснования.Индекс(СтрокаРезультата) = ИндексПоследнейСтроки Тогда
				ДеревоПоказателей.Строки.Удалить(УзелРаздел24)
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДоходов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаДоходов)
		КонецЕсли;
		Если СтрокаВзносов.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаВзносов)
		КонецЕсли;
		Если СтрокаЧисленности.Количество() <> 0 Тогда
			ВывестиСтрокуТаблицыДанныхВДеревоПоказателей(УзелРаздел24, СтрокаЧисленности)
		КонецЕсли;
		
		// если применяемых в орг. оснований больше 1, тогда создадим еще одну ветку для раздела 2.4
		Если ВсеОснования.Индекс(СтрокаРезультата) < ИндексПоследнейСтроки Тогда  
			УзелРаздел24 = ОпределитьСтрокуВДеревеДанныхДляЗаполнения(ДеревоПоказателей, "Раздел24");
		КонецЕсли;
		
	КонецЦикла;
	
	// Раздел 4
	
	Запрос.Текст = ПерерасчетыТекст;
	#Если ТолстыйКлиентОбычноеПриложение тогда
	ФормированиеПечатныхФорм.ЗапомнитьПараметрыЗапроса(Запрос, МассивЗапросов);
	#КонецЕсли
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		#Если ТолстыйКлиентОбычноеПриложение тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ФормированиеПечатныхФорм.ПроверитьОшибкуЗапрос(МассивЗапросов, ИнформацияОбОшибке, , истина);
		#КонецЕсли
		Возврат ПустоеДерево;
	КонецПопытки;
	ВывестиТаблицуДанныхВДеревоПоказателей(ДеревоПоказателей, Результат.Выгрузить(), "П0004000001");
	
	Возврат МассивЗначенийДерева(ДеревоПоказателей);
	
КонецФункции 

