
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		СтрокаНабора.Год = Год(СтрокаНабора.ОтчетныйПериод);
		Если СтрокаНабора.ОтчетныйПериод < ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами() Тогда
			СтрокаНабора.КатегорияЗастрахованныхЛиц = ""
		КонецЕсли;
		Если СтрокаНабора.ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
			СтрокаНабора.ТипДоговора = ""
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

