&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = Параметры.АдресПроблем;
	ТаблицаЗаявок = ПолучитьИзВременногоХранилища(Данные);
	
	Для Каждого СтрокаЗаявки из ТаблицаЗаявок Цикл
		
		НоваяСтрока = ЗаявкиКПереформированию.Добавить();
		НоваяСтрока.Заявка = СтрокаЗаявки.ЗаявкаНаРасходованиеДенежныхСредств;
		НоваяСтрока.Списание = СтрокаЗаявки.СписаниеСРасчетногоСчета;
		НоваяСтрока.Состояние = СтрокаЗаявки.СостояниеДокумента;
		Если ЗначениеЗаполнено(СтрокаЗаявки.ОшибкиКонтроля) Тогда
			НоваяСтрока.КонтрольКартинка = Истина;
			НоваяСтрока.КонтрольФЗ275 = "Ошибок: " + СтрокаЗаявки.ОшибкиКонтроля;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиКПереформированиюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЗаявкиКПереформированию.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЭлементИмя = Элементы.ЗаявкиКПереформированию.ТекущийЭлемент.Имя;
	
	Если ТекущийЭлементИмя = "ЗаявкиКПереформированиюКонтрольФЗ275" Тогда
		ОткрытьОтчетПоКонтролю(Неопределено);
	ИначеЕсли ТекущийЭлементИмя = "ЗаявкиКПереформированиюСостояние"
		ИЛИ ТекущийЭлементИмя = "ЗаявкиКПереформированиюСписаниеНомер"
		ИЛИ ТекущийЭлементИмя = "ЗаявкиКПереформированиюСписаниеДата" Тогда
		ОткрытьСписание(Неопределено);
	Иначе
		ОткрытьЗначение(ТекущиеДанные.Заявка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоКонтролю(Команда)
	
	ТекущиеДанные = Элементы.ЗаявкиКПереформированию.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ПараметрыФормыКонтроля = Новый Структура("ПараметрКоманды", 
	//	Новый Структура("Ссылка", Элементы.ЗаявкиКПереформированию.ТекущиеДанные.Заявка));
	//ОткрытьФорму("Отчет.КонтрольДокументов275.Форма.Форма", ПараметрыФормыКонтроля);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФормирование(Команда)
	
	Закрыть(ВыполнитьНаСервере());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого СтрокаЗаявки из ЗаявкиКПереформированию Цикл
		СтрокаЗаявки.Флаг = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого СтрокаЗаявки из ЗаявкиКПереформированию Цикл
		СтрокаЗаявки.Флаг = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписание(Команда)
	
	ТекущиеДанные = Элементы.ЗаявкиКПереформированию.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(Элементы.ЗаявкиКПереформированию.ТекущиеДанные.Списание);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьНаСервере()
	
	МассивПропускаемых = Новый Массив;
	
	Для Каждого СтрокаДокументов из ЗаявкиКПереформированию Цикл
		Если СтрокаДокументов.Флаг Тогда
			Если ЗначениеЗаполнено(СтрокаДокументов.Списание) Тогда
				Попытка
					ДокументОбъект = СтрокаДокументов.Списание.ПолучитьОбъект();
					ДокументОбъект.УстановитьПометкуУдаления(Истина);
				Исключение
					МассивПропускаемых.Добавить(СтрокаДокументов.Заявка);
				КонецПопытки;
			КонецЕсли;
		Иначе
			МассивПропускаемых.Добавить(СтрокаДокументов.Заявка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПропускаемых;
	
КонецФункции

