

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СчетФактураПолученный = НайтиСчетФактуру(ПараметрКоманды);
	Если ЗначениеЗаполнено(СчетФактураПолученный) Тогда
		ПараметрыФормы = Новый Структура("Ключ", СчетФактураПолученный);
		ОткрытьФорму("Документ.СчетФактураПолученный.Форма.ФормаДокументаУправляемая", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);
		Возврат;
	КонецЕсли;
	//Не нашли счет фактуру
	СтрокаСообщения = Нстр("ru = 'Счет-фактура еще не создан. Новый счет-фактуру можно создать на основании.'");
	Предупреждение(СтрокаСообщения);
КонецПроцедуры

&НаСервере
Функция НайтиСчетФактуру(ДокументСсылка)
	Возврат УчетНДС.НайтиПодчиненныйСчетФактуру(ДокументСсылка, "СчетФактураПолученный");
КонецФункции


