Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;
Перем мПериодичность Экспорт;

Перем мТаблицаСоставПоказателей Экспорт; // Состав показателей отчета
// Состав показателей отчета, значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

Перем мДеревоСтраницОтчета Экспорт; // Структура листов отчета
Перем мЕстьВыбранные Экспорт; // Признак выбора печатных листов

Перем мВерсияФормы Экспорт;
Перем мВыбраннаяФорма Экспорт;

Перем мСкопированаФорма Экспорт; // Признак скопированной формы

Перем мСохраненныйДок Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мЗаписьЗапрещена Экспорт;

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске

Перем мТаблицаФормОтчета Экспорт;

Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

Перем мФормыИФорматы Экспорт;
Перем мВерсияОтчета Экспорт;

Перем мСчетчикСтраниц Экспорт; // Признак отключения автоматической нумерации страниц
Перем мАвтоВыборКодов Экспорт; // Признак отключения выбора значений из списков
Перем мПечатьБезШтрихкодаРазрешена Экспорт;
Перем мПроверятьСоотношенияПриПечатиИВыгрузки Экспорт; // Признак запуска проверки контрольных соотношений

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СтрокаЧГ0(ИсходноеЧисло) Экспорт // враппер
	
	Возврат РегламентированнаяОтчетность.СтрокаЧГ0(ИсходноеЧисло);
	
КонецФункции

// Возвращает массив ссылок на элементы справочника "РегистрацииВНалоговомОргане".
//
// Возвращаемое значение: массив ссылок на элементы справочника "РегистрацииВНалоговомОргане".
//
// Параметры:
//  Организация     - ссылка на элемент справочника организаций.
//  ПараметрыОтбора - структура (необязательный):
//    * КодНО - Строка - код налогового органа (необязательный);
//    * КПП"  - Строка - КПП (строка) (необязательный);
//    * ОКТМО - Строка - код по ОКТМО (строка) (необязательный);
//    * КодыПричиныПостановкиНаУчет" - Массив - символы в КПП на 5-6 позициях (необязательный).
//
Функция РегистрацииОрганизацииВНалоговомОргане(Организация, ПараметрыОтбора = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СправочникИФНС.Ссылка КАК Ссылка,
	               |	СправочникИФНС.КПП КАК КПП,
	               |	СправочникИФНС.Код КАК КодНО,
	               |	СправочникИФНС.Представитель КАК Представитель
	               |ИЗ
	               |	Справочник.РегистрацияВИФНС КАК СправочникИФНС
	               |ГДЕ
	               |	СправочникИФНС.Владелец = &Владелец
	               |	И СправочникИФНС.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КодНО,
	               |	КПП";
	Запрос.УстановитьПараметр("Владелец", Организация);
	
	Регистрации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		КолРегистраций = Регистрации.Количество();
		Для Инд = 0 По КолРегистраций - 1 Цикл
			ОбрИнд = КолРегистраций - 1 - Инд;
			Если ПараметрыОтбора.Свойство("КодНО") Тогда
				Если СокрЛП(Регистрации[ОбрИнд].Код) <> СокрЛП(ПараметрыОтбора.КодНО) Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыОтбора.Свойство("КПП") Тогда
				Если ВРег(СокрЛП(Регистрации[ОбрИнд].КПП)) <> ВРег(СокрЛП(ПараметрыОтбора.КПП)) Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыОтбора.Свойство("КодыПричиныПостановкиНаУчет") Тогда
				Если ПараметрыОтбора.КодыПричиныПостановкиНаУчет.Найти(
					Сред(ВРег(СокрЛП(Регистрации[ОбрИнд].КПП)), 5, 2)) = Неопределено Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыОтбора.Свойство("ОКТМО") Тогда
				Если СокрЛП(Регистрации[ОбрИнд].КодПоОКТМО) <> СокрЛП(ПараметрыОтбора.ОКТМО) Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Регистрации;
	
КонецФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
	ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
	ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	
	Возврат НовСтр;
	
КонецФункции

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

Форма20041001 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2004-11-01', "96н", "ФормаОтчета2004Кв4", , '20041231');
ОпределитьФорматВДеревеФормИФорматов(Форма20041001, "3.00002");

Форма20050101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2005-02-17', "23н", "ФормаОтчета2004Кв4", '20050101', );
ОпределитьФорматВДеревеФормИФорматов(Форма20050101, "3.00003");

Форма20060101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2006-01-17', "8н", "ФормаОтчета2006Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20060101, "3.00004");

Форма20070101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2006-12-19', "177н", "ФормаОтчета2007Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20070101, "3.00005");

Форма20080101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2007-09-20', "83н", "ФормаОтчета2008Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20080101, "3.00005");

Форма20090101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2008-12-08', "137н", "ФормаОтчета2009Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20090101, "5.01");

Форма20100101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2009-11-19', "119н", "ФормаОтчета2010Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20100101, "5.02");

ФормаОтчета2012Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2012-01-23', "ММВ-7-3/13@", "ФормаОтчета2012Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2012Кв1, "5.03");

ФормаОтчета2013Кв4 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2013-11-14', "ММВ-7-3/501@", "ФормаОтчета2013Кв4");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2013Кв4, "5.04");

ФормаОтчета2015Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2014-07-04', "ММВ-7-3/353@", "ФормаОтчета2015Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2015Кв1, "5.05");

ФормаОтчета2016Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2015-12-22', "ММВ-7-3/590@", "ФормаОтчета2016Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2016Кв1, "5.06");

ФормаОтчета2017Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2016-10-19', "ММВ-7-3/574@", "ФормаОтчета2017Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2017Кв1, "5.07");

Форма20180101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2018-02-20', "СД-4-3/3375@", "ФормаОтчета2018Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20180101, "5.07");

Форма20180701 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2018-07-25', "СД-4-3/14369@", "ФормаОтчета2018Кв3");
ОпределитьФорматВДеревеФормИФорматов(Форма20180701, "5.09");

Форма20181001 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152016", '2018-06-26', "ММВ-7-3/414@", "ФормаОтчета2018Кв4");
ОпределитьФорматВДеревеФормИФорматов(Форма20181001, "5.08");

мСтруктураВариантыЗаполнения = Новый Структура;

мТаблицаСоставПоказателей = РегламентированнаяОтчетность.СозданиеТаблицыСоставаПоказателей();
мТаблицаФормОтчета = РегламентированнаяОтчетность.СозданиеТаблицыФормОтчета();

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2006Кв1";
НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Минфина РФ от 17.01.2006 г. № 8н";
НоваяФорма.ДатаНачалоДействия = '2006-01-01';
НоваяФорма.ДатаКонецДействия  = '2006-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2004Кв4";
НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Минфина РФ от 01.11.2004 г. № 96н";
НоваяФорма.ДатаНачалоДействия = '2004-11-01';
НоваяФорма.ДатаКонецДействия  = '2006-12-31'; // Действует до конца 2006 г. одновременно с новой формой

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв1";
НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Минфина РФ от 17.01.2006 г. № 8н (в редакции приказа Минфина РФ от 19.12.2006 г. № 177н)";
НоваяФорма.ДатаНачалоДействия = '2007-01-01';
НоваяФорма.ДатаКонецДействия  = '2007-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2008Кв1";
НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Минфина РФ от 17.01.2006 г. № 8н (в редакции приказа Минфина РФ от 19.12.2006 г. № 177н, от 20.09.2007 г. № 83н)";
НоваяФорма.ДатаНачалоДействия = '2008-01-01';
НоваяФорма.ДатаКонецДействия  = '2008-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Кв1";
НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Минфина РФ от 08.12.2008 г. № 137н";
НоваяФорма.ДатаНачалоДействия = '2009-01-01';
НоваяФорма.ДатаКонецДействия  = '2009-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв1";
НоваяФорма.ОписаниеОтчета     = "Форма утверждена приказом Минфина РФ от 08.12.2008 г. № 137н (в редакции приказа Минфина России от 19.11.2009 № 119н)";
НоваяФорма.ДатаНачалоДействия = '2010-01-01';
НоваяФорма.ДатаКонецДействия  = '2011-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 23.01.2012 № ММВ-7-3/13@";
НоваяФорма.ДатаНачалоДействия = '2012-01-01';
НоваяФорма.ДатаКонецДействия  = '2013-09-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 23.01.2012 № ММВ-7-3/13@ (в ред. приказа ФНС России от 14 ноября 2013 г. № ММВ-7-3/501@)";
НоваяФорма.ДатаНачалоДействия = '2013-10-01';
НоваяФорма.ДатаКонецДействия  = '2014-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 04.07.2014 № ММВ-7-3/353@";
НоваяФорма.ДатаНачалоДействия = '2015-01-01';
НоваяФорма.ДатаКонецДействия  = '2015-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 04.07.2014 № ММВ-7-3/353@ (в ред. приказа ФНС России от 22.12.2015 № ММВ-7-3/590@)";
НоваяФорма.ДатаНачалоДействия = '2016-01-01';
НоваяФорма.ДатаКонецДействия  = '2017-03-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 04.07.2014 № ММВ-7-3/353@ (в ред. приказа ФНС России от 19.10.2016 № ММВ-7-3/574@)";
НоваяФорма.ДатаНачалоДействия = '2017-01-01';
НоваяФорма.ДатаКонецДействия  = '2018-11-25';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2018Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 04.07.2014 № ММВ-7-3/353@ (в редакции письма ФНС России от 20.02.2018 № СД-4-3/3375@)";
НоваяФорма.ДатаНачалоДействия = '2018-01-01';
НоваяФорма.ДатаКонецДействия  = '2018-06-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2018Кв3";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к письму ФНС России от 25.07.2018 № СД-4-3/14369@";
НоваяФорма.ДатаНачалоДействия = '2018-07-01';
НоваяФорма.ДатаКонецДействия  = '2018-11-25';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2018Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 26.06.2018 № ММВ-7-3/414@.";
НоваяФорма.ДатаНачалоДействия = '2018-10-01';
НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));

