
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// В процедуре требуется реализовать открытие формы нового документа пересчета товаров.
//
// Параметры:
//  Форма - УправляемаяФорма - форма запущенной обработки корректировки остатков,
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - организация предприятия,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - магазин, в котором корректируются остатки.
//
Процедура СоздатьПриказНаПроведениеИнвентаризации(Форма, Организация, ТорговыйОбъект) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// В процедуре требуется реализовать открытие формы списка документов пересчета товаров.
//
// Параметры:
//  Форма - УправляемаяФорма - форма запущенной обработки корректировки остатков,
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - организация предприятия,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - магазин, в котором корректируются остатки.
//
Процедура ОткрытьСписокИнвентаризаций(Форма, Организация, ТорговыйОбъект) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// Формирует отчет по излишкам/недостачам для переданного торгового объекта.
//
// Параметры:
//  Форма - УправляемаяФорма - форма запущенной обработки корректировки остатков,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - магазин, в котором корректируются остатки.
//
Процедура СформироватьОтчетПоИзлишкамНедостачам(Форма, ТорговыйОбъект) Экспорт
	
	
	Возврат;
	
КонецПроцедуры

// ПРОГРАММНЫЙ ИНТЕРФЕЙС
///////////////////////////////////////////////////////////////////////////////
