#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтрокаПолейКлюча = "";
	ОписаниеКлючаЗаписи = Новый Структура;
	Для Каждого Измерение Из ЭтотОбъект.Метаданные().Измерения Цикл
		ОписаниеКлючаЗаписи.Вставить(Измерение.Имя);
		СтрокаПолейКлюча = СтрокаПолейКлюча + ?(СтрокаПолейКлюча = "","", ", ")+ Измерение.Имя;
	КонецЦикла;
	
	КонтролируемыеСделки.ПроверитьПравильностьЗаполненияКонтрагентаРегистра(Отказ, ЭтотОбъект.Выгрузить(, СтрокаПолейКлюча), ОписаниеКлючаЗаписи);
	
КонецПроцедуры

#КонецЕсли