// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

Перем мВерсияФормы Экспорт;

Перем мПериодичность Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мСчетчикСтраниц Экспорт; 

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мЗаписьЗапрещена Экспорт;

Перем мАвтоВыборКодов Экспорт; // для флажка "отключить выбор значений из списка"

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске
Перем мТаблицаФормОтчета Экспорт;

Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

Перем мВерсияОтчета Экспорт;

Перем мПечатьБезШтрихкодаРазрешена Экспорт;
Перем мФормыИФорматы Экспорт;

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Процедура ЗаполнитьСписокФормДо2015()
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2005Кв1";
	НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к Порядку заполнения налоговой декларации, утвержденному приказом Минфина РФ от 03.03.2005 г. №31н";
	НоваяФорма.ДатаНачалоДействия = '2005-03-01';
	НоваяФорма.ДатаКонецДействия  = '2006-01-31';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2006Кв1";
	НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к Порядку заполнения налоговой декларации, утвержденному приказом Минфина РФ от 28.12.2005 г. №163н";
	НоваяФорма.ДатаНачалоДействия = '2006-01-01';
	НоваяФорма.ДатаКонецДействия  = '2006-12-31';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв1";
	НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к Порядку заполнения налоговой декларации, утвержденному приказом Минфина РФ от 27.11.2006 № 153н";
	НоваяФорма.ДатаНачалоДействия = '2007-01-01';
	НоваяФорма.ДатаКонецДействия  = '2009-05-31';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Кв2";
	НоваяФорма.ОписаниеОтчета     = "Утверждено Приказом Минфина России от 27.11.2006 № 153н (с выгрузкой в формате программы ""ЭСНДС НП"" версии 1.3)";
	НоваяФорма.ДатаНачалоДействия = '2009-05-01';
	НоваяФорма.ДатаКонецДействия  = '2010-06-30';
	
	// Порядок внесения форм с незаданной датой окончания действия определяет их порядок в таблице выбора варианта отчета.
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв2";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов таможенного союза (с выгрузкой в формате 5.05)";
	НоваяФорма.ДатаНачалоДействия = '2012-01-01';
	НоваяФорма.ДатаКонецДействия  = '2012-09-30';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов таможенного союза (с выгрузкой в формате 5.04)";
	НоваяФорма.ДатаНачалоДействия = '2012-02-01';
	НоваяФорма.ДатаКонецДействия  = '2012-09-30';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв3";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов таможенного союза (с выгрузкой в формате 5.03)";
	НоваяФорма.ДатаНачалоДействия = '2011-07-01';
	НоваяФорма.ДатаКонецДействия  = '2012-09-30';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв2";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов таможенного союза (с выгрузкой в формате 5.02)";
	НоваяФорма.ДатаНачалоДействия = '2011-05-01';
	НоваяФорма.ДатаКонецДействия  = '2012-09-30';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв2";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов таможенного союза";
	НоваяФорма.ДатаНачалоДействия = '2010-07-01';
	НоваяФорма.ДатаКонецДействия  = '2012-09-30';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв3";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов таможенного союза (с выгрузкой в формате 5.06)";
	НоваяФорма.ДатаНачалоДействия = '2012-10-01';
	НоваяФорма.ДатаКонецДействия  = '2014-12-31';
	
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв1";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов Евразийского экономического союза (с выгрузкой в формате 5.07)";
	НоваяФорма.ДатаНачалоДействия = '2015-01-01';
	НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));
	
КонецПроцедуры

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

ФормаОтчета2005кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2005-03-03', "31н", "ФормаОтчета2005кв1");
ФормаОтчета2006Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2005-12-28', "163н", "ФормаОтчета2006Кв1");
ФормаОтчета2007кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2006-11-27', "153н", "ФормаОтчета2007кв1");
ФормаОтчета2009кв2 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2006-11-27', "153н", "ФормаОтчета2009кв2");

ФормаОтчета2010кв2 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2009-12-11', "б/н", "ФормаОтчета2010кв2");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2010кв2, "1.3.0", , , , '20101231');
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2010кв2, "5.01" , , , '2011-01-01');

ФормаОтчета2011кв2 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2009-12-11', "б/н", "ФормаОтчета2011кв2");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2011кв2, "5.02" , , , '2011-05-01');

ФормаОтчета2011кв3 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2009-12-11', "б/н", "ФормаОтчета2011кв3");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2011кв3, "5.03" , , , '2011-07-01');

ФормаОтчета2012Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2009-12-11', "б/н", "ФормаОтчета2012Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2012Кв1, "5.04" , , , '2012-02-01');

ФормаОтчета2012Кв2 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2009-12-11', "б/н", "ФормаОтчета2012Кв2");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2012Кв2, "5.05" , , , '2012-06-01');

ФормаОтчета2012Кв3 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2009-12-11', "б/н", "ФормаОтчета2012Кв3");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2012Кв3, "5.06" , , , '2012-10-01');

ФормаОтчета2015Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1151099", '2009-12-11', "б/н", "ФормаОтчета2015Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2015Кв1, "5.07");

ОписаниеТиповСтрока15 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);
ОписаниеТиповСтрока50 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);

мТаблицаСоставПоказателей = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",     ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",   ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",     ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",     ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",      ОписаниеТиповСтрока50);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСтруктуре", ОписаниеТиповСтрока50);

мСтруктураВариантыЗаполнения = Новый Структура;

ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(0);

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);

Если ТекущаяДата() < '2015-01-01' Тогда
	ЗаполнитьСписокФормДо2015();
Иначе
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв1";
	НоваяФорма.ОписаниеОтчета     = "Приложение №1 к Протоколу об обмене информацией государств-членов Евразийского экономического союза (с выгрузкой в формате 5.07)";
	НоваяФорма.ДатаНачалоДействия = '2005-01-01';
	НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));
КонецЕсли;