
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Перем Ошибки;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не Владелец.ТипПлатежаФЗ275 = Справочники.ТипыПлатежейФЗ275.ОплатаТоваровРаботУслугПоРегулируемымЦенам Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТарифноеРегулирование");
	Иначе
		Наименование = ТарифноеРегулирование.Наименование;
		МассивНепроверяемыхРеквизитов.Добавить("Наименование");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Владелец.ТипПлатежаФЗ275 = Справочники.ТипыПлатежейФЗ275.ОплатаТоваровРаботУслугПоРегулируемымЦенам Тогда
		Наименование = ТарифноеРегулирование.Наименование;
	КонецЕсли;
КонецПроцедуры
