// ОБРАБОТЧИКИ ОБНОВЛЕНИЯ

// Обработчик обновления
//
// Проводит документы по регистру "ДвиженияДСпоГосконтрактам"
Процедура ПровестиПоРегиструДвиженияДСпоГосконтрактам() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Документы.Ссылка,
	|	Документы.Ссылка.Оплачено,
	|	Документы.Ссылка.Дата,
	|	Документы.Ссылка.ДатаОплаты
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтрактыИсполнителей КАК КонтрактыИсполнителей
	|		ПО Документы.ДоговорКонтрагента = КонтрактыИсполнителей.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтрактыСЗаказчиками КАК КонтрактыСЗаказчиками
	|		ПО Документы.ДоговорКонтрагента = КонтрактыСЗаказчиками.Договор
	|ГДЕ
	|	(НЕ КонтрактыИсполнителей.Ссылка ЕСТЬ NULL 
	|			ИЛИ НЕ КонтрактыСЗаказчиками.Ссылка ЕСТЬ NULL )
	|	И Документы.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Документы.Ссылка,
	|	Документы.Ссылка.Оплачено,
	|	Документы.Ссылка.Дата,
	|	Документы.Ссылка.ДатаОплаты";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		нзГосКонтракты = РегистрыНакопления.ДвиженияДСпоГосконтрактам.СоздатьНаборЗаписей();
		нзГосКонтракты.ОбменДанными.Загрузка = Истина;
		
		Пока Выборка.Следующий() Цикл

			нзГосКонтракты.Очистить();
			нзГосКонтракты.Отбор.Регистратор.Установить(Выборка.Ссылка);
			ТаблицаДвиженияДенежныхСредств = УправлениеДенежнымиСредствами.ПолучитьТаблицуДвиженияДСпоГосконтрактам(Выборка.Ссылка);
			ДатаДвижений=?(Выборка.Оплачено,УправлениеДенежнымиСредствами.ПолучитьДатуДвижений(Выборка.Дата,Выборка.ДатаОплаты),Выборка.Дата);
			Если ТаблицаДвиженияДенежныхСредств.Количество() > 0 Тогда
				Попытка
					нзГосКонтракты.мПериод          = ДатаДвижений;
					нзГосКонтракты.мТаблицаДвижений = ТаблицаДвиженияДенежныхСредств;
					нзГосКонтракты.ВыполнитьДвижения();
				Исключение
					ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы'"), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				КонецПопытки;
			КонецЕсли;
			
		КонецЦикла
		
	КонецЕсли;
	
КонецПроцедуры
