////////////////////////////////////////////////////////////////////////////////

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//  нет
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2010Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамМесяцРасчета", Месяц(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПредыдущийМесяц", Месяц(ПериодРегистрации) - 1);
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации)).РазмерФСС;
	Запрос.УстановитьПараметр("ПредельнаяСумма", ?(ЗначениеЗаполнено(ПредельнаяСумма),ПредельнаяСумма,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	Запрос.УстановитьПараметр("парамЭтоЮрЛицо", ОбщегоНазначенияЗКПереопределяемый.ЭтоЮрЛицо(Организация));
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах";
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.Выполнить();
	
	// ФизлицаДляРасчета
	//
	Если ОграничениеНаСотрудников = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТСписокСотрудников
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
		|	И СведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо
		|ИЗ
		|	ВТДанныеДокумента КАК СведенияОДоходах
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		Запрос.Выполнить();
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
        |ПОМЕСТИТЬ ВТСписокСотрудников
        |ИЗ
        |   &парамТаблицаСотрудников КАК ТаблицаСотрудников
        |
        |ИНДЕКСИРОВАТЬ ПО
        |   ФизЛицо";
		Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
		Запрос.Выполнить();
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПериодРегистрации));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПериодРегистрации) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|	ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК НеИмеетПравоНаПенсию
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|			И ГражданствоФизЛиц.НеИмеетПравоНаПенсию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО (СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра)
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот КАК ОблагаемыйДоход
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецМесяцаПериодаРегистрации,
	|			Месяц,
	|			Организация = &парамГоловнаяОрганизация
	|				И Физлицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТСписокСотрудников КАК СписокСотрудников)) КАК СведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.Период),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(РанееИсчисленныеВзносы.Период) КАК Месяц,
	|	РанееИсчисленныеВзносы.ФССОборот,
	|	РанееИсчисленныеВзносы.ФФОМСОборот,
	|	РанееИсчисленныеВзносы.ТФОМСОборот,
	|	РанееИсчисленныеВзносы.ПФРНакопительнаяОборот,
	|	РанееИсчисленныеВзносы.ПФРСтраховаяОборот,
	|	РанееИсчисленныеВзносы.ПФРНакопительнаяЕНВДОборот,
	|	РанееИсчисленныеВзносы.ПФРСтраховаяЕНВДОборот,
	|	РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносыПоМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецМесяцаПериодаРегистрации,
	|			Месяц,
	|			Организация = &парамГоловнаяОрганизация
	|				И (НЕ ФизЛицо В
	|						(ВЫБРАТЬ
	|							СписокСотрудников.ФизЛицо
	|						ИЗ
	|							ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|				И ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТСписокСотрудников КАК СписокСотрудников)) КАК РанееИсчисленныеВзносы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленные.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыИсчисленные.Период),
	|	-СтраховыеВзносыИсчисленные.ФСС,
	|	-СтраховыеВзносыИсчисленные.ФФОМС,
	|	-СтраховыеВзносыИсчисленные.ТФОМС,
	|	-СтраховыеВзносыИсчисленные.ПФРНакопительная,
	|	-СтраховыеВзносыИсчисленные.ПФРСтраховая,
	|	-СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД,
	|	-СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД,
	|	-СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.Регистратор = &Регистратор
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И (НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|	И СтраховыеВзносыИсчисленные.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ФССОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ФССОборот,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ФФОМСОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ФФОМСОборот,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ТФОМСОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТФОМСОборот,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ФССОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ФССОборотИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ФФОМСОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ФФОМСОборотИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ТФОМСОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ТФОМСОборотИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ПФРНакопительнаяОборот + РанееИсчисленныеВзносы.ПФРНакопительнаяЕНВДОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРНакопительнаяОборотИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ПФРСтраховаяОборот + РанееИсчисленныеВзносы.ПФРСтраховаяЕНВДОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСтраховаяОборотИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ПФРНакопительнаяОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРНакопительнаяОборот,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ПФРСтраховаяОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСтраховаяОборот,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ПФРНакопительнаяЕНВДОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРНакопительнаяЕНВДОборот,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|				ТОГДА РанееИсчисленныеВзносы.ПФРСтраховаяЕНВДОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСтраховаяЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	ВТРанееИсчисленныеВзносыПоМесяцам КАК РанееИсчисленныеВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО РанееИсчисленныеВзносы.ФизЛицо = Инвалид.Физлицо
	|			И РанееИсчисленныеВзносы.Месяц = Инвалид.Месяц
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	Основная.Месяц КАК Месяц,
	|	СУММА(ВЫБОР
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					И (Иностр.Физлицо ЕСТЬ NULL 
	|						ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					И (Иностр.Физлицо ЕСТЬ NULL 
	|						ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуПФР
	|					И Основная.ОблагаетсяЕНВД
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРИнвалидаЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА Основная.ОблагаетсяЕНВД
	|				ТОГДА 0
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРПоОсновномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И (Иностр.Физлицо ЕСТЬ NULL 
	|						ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					И (Иностр.Физлицо ЕСТЬ NULL 
	|						ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА Основная.ОблагаетсяЕНВД
	|				ТОГДА 0
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССПоОсновномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И (Иностр.Физлицо ЕСТЬ NULL 
	|						ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					И (Иностр.Физлицо ЕСТЬ NULL 
	|						ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА Основная.ОблагаетсяЕНВД
	|				ТОГДА 0
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСПоОсновномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И (Иностр.Физлицо ЕСТЬ NULL 
	|						ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|ГДЕ
	|	(НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ДоходыЗастрахованныхЛиц.ФизЛицо КАК ФизЛицо,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС
	|ПОМЕСТИТЬ ВТНакопленнаяОблагаемаяБаза
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ПО (ДоходыЗастрахованныхЛиц.Месяц МЕЖДУ 1 И МЕСЯЦ(Периоды.Период))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	МЕСЯЦ(Периоды.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо КАК ФизЛицо,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФРИнвалида) КАК БазаПФРИнвалидаВсего,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФРИнвалидаЕНВД) КАК БазаПФРИнвалидаЕНВД
	|ПОМЕСТИТЬ ВТБазаПФРПоИнвалидам
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|ГДЕ
	|	ДоходыЗастрахованныхЛиц.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.Месяц КАК Месяц,
	|	База.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА База.БазаПФР <= &ПредельнаяСумма
	|			ТОГДА 1
	|		КОГДА База.БазаПФР = ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0) >= &ПредельнаяСумма
	|			ТОГДА 0
	|		ИНАЧЕ (&ПредельнаяСумма - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0)) / (База.БазаПФР - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0))
	|	КОНЕЦ КАК КоэффициентОбложенияПФР,
	|	ВЫБОР
	|		КОГДА База.БазаФСС <= &ПредельнаяСумма
	|			ТОГДА 1
	|		КОГДА База.БазаФСС = ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0) >= &ПредельнаяСумма
	|			ТОГДА 0
	|		ИНАЧЕ (&ПредельнаяСумма - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0)) / (База.БазаФСС - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0))
	|	КОНЕЦ КАК КоэффициентОбложенияФСС,
	|	ВЫБОР
	|		КОГДА База.БазаФОМС <= &ПредельнаяСумма
	|			ТОГДА 1
	|		КОГДА База.БазаФОМС = ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0) >= &ПредельнаяСумма
	|			ТОГДА 0
	|		ИНАЧЕ (&ПредельнаяСумма - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0)) / (База.БазаФОМС - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0))
	|	КОНЕЦ КАК КоэффициентОбложенияФОМС
	|ПОМЕСТИТЬ ВТКоэффициентыДостиженияПредельнойСуммы
	|ИЗ
	|	ВТНакопленнаяОблагаемаяБаза КАК База
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленнаяОблагаемаяБаза КАК НакопленоПоПрошлыйМесяц
	|		ПО (База.Месяц - 1 = НакопленоПоПрошлыйМесяц.Месяц)
	|			И База.ФизЛицо = НакопленоПоПрошлыйМесяц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо КАК ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Месяц КАК Месяц,
	|	ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаПФРИнвалида
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаПФРИнвалида = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)
	|	КОНЕЦ КАК БазаПФРИнвалида,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаПФРПоОсновномуТарифу
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаПФРПоОсновномуТарифу = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаПФРЕНВД = 0
	|			ТОГДА &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)
	|		ИНАЧЕ ВЫРАЗИТЬ((&ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)) * ДоходыЗастрахованныхЛиц.БазаПФРПоОсновномуТарифу / (ДоходыЗастрахованныхЛиц.БазаПФРПоОсновномуТарифу + ДоходыЗастрахованныхЛиц.БазаПФРЕНВД) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК БазаПФРПоОсновномуТарифу,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаПФРЕНВД
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаПФРЕНВД = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаПФРПоОсновномуТарифу = 0
	|			ТОГДА &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0) - (ВЫРАЗИТЬ((&ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)) * ДоходыЗастрахованныхЛиц.БазаПФРПоОсновномуТарифу / (ДоходыЗастрахованныхЛиц.БазаПФРПоОсновномуТарифу + ДоходыЗастрахованныхЛиц.БазаПФРЕНВД) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК БазаПФРЕНВД,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаФССИнвалида
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФССИнвалида = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)
	|	КОНЕЦ КАК БазаФССИнвалида,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаФССПоОсновномуТарифу
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФССПоОсновномуТарифу = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФССЕНВД = 0
	|			ТОГДА &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)
	|		ИНАЧЕ ВЫРАЗИТЬ((&ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)) * ДоходыЗастрахованныхЛиц.БазаФССПоОсновномуТарифу / (ДоходыЗастрахованныхЛиц.БазаФССПоОсновномуТарифу + ДоходыЗастрахованныхЛиц.БазаФССЕНВД) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК БазаФССПоОсновномуТарифу,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаФССЕНВД
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФССЕНВД = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФССПоОсновномуТарифу = 0
	|			ТОГДА &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0) - (ВЫРАЗИТЬ((&ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)) * ДоходыЗастрахованныхЛиц.БазаФССПоОсновномуТарифу / (ДоходыЗастрахованныхЛиц.БазаФССПоОсновномуТарифу + ДоходыЗастрахованныхЛиц.БазаФССЕНВД) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК БазаФССЕНВД,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаФОМСИнвалида
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФОМСИнвалида = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)
	|	КОНЕЦ КАК БазаФОМСИнвалида,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаФОМСПоОсновномуТарифу
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФОМСПоОсновномуТарифу = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФОМСЕНВД = 0
	|			ТОГДА &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)
	|		ИНАЧЕ ВЫРАЗИТЬ((&ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)) * ДоходыЗастрахованныхЛиц.БазаФОМСПоОсновномуТарифу / (ДоходыЗастрахованныхЛиц.БазаФОМСПоОсновномуТарифу + ДоходыЗастрахованныхЛиц.БазаФОМСЕНВД) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК БазаФОМСПоОсновномуТарифу,
	|	ВЫБОР
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 1
	|			ТОГДА ДоходыЗастрахованныхЛиц.БазаФОМСЕНВД
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФОМСЕНВД = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФОМСПоОсновномуТарифу = 0
	|			ТОГДА &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0) - (ВЫРАЗИТЬ((&ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)) * ДоходыЗастрахованныхЛиц.БазаФОМСПоОсновномуТарифу / (ДоходыЗастрахованныхЛиц.БазаФОМСПоОсновномуТарифу + ДоходыЗастрахованныхЛиц.БазаФОМСЕНВД) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыДостиженияПредельнойСуммы КАК Коэффициенты
	|		ПО ДоходыЗастрахованныхЛиц.ФизЛицо = Коэффициенты.ФизЛицо
	|			И ДоходыЗастрахованныхЛиц.Месяц = Коэффициенты.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленнаяОблагаемаяБаза КАК НакопленнаяОблагаемаяБазаПоПредыдущийМесяц
	|		ПО ДоходыЗастрахованныхЛиц.ФизЛицо = НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.ФизЛицо
	|			И (ДоходыЗастрахованныхЛиц.Месяц - 1 = НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО ДоходыЗастрахованныхЛиц.Месяц = ИспользуемыеТарифы.Месяц
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРПоОсновномуТарифу) * ОсновнойТариф.ПФРНакопительная / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРНакопительная,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРПоОсновномуТарифу) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРПоОсновномуТарифу) * (ОсновнойТариф.ПФР - ОсновнойТариф.ПФРНакопительная) / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСтраховая,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФССПоОсновномуТарифу) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСПоОсновномуТарифу) * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСПоОсновномуТарифу) * ОсновнойТариф.ТФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатТФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТОграниченнаяОблагаемаяБаза КАК ОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО ОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновнойТариф.ПФРНакопительная,
	|	ОсновнойТариф.ПФР,
	|	ОсновнойТариф.ФСС,
	|	ОсновнойТариф.ФФОМС,
	|	ОсновнойТариф.ТФОМС,
	|	ОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРИнвалида) * ТарифИнвалида.ПФРНакопительная / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРНакопительнаяИнвалида,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРИнвалида) * ТарифИнвалида.ПФР / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРИнвалида) * (ТарифИнвалида.ПФР - ТарифИнвалида.ПФРНакопительная) / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСтраховаяИнвалида,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФССИнвалида) * ТарифИнвалида.ФСС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФССИнвалида,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСИнвалида) * ТарифИнвалида.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФФОМСИнвалида,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСИнвалида) * ТарифИнвалида.ТФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатТФОМСИнвалида,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРЕНВД) * ТарифЕНВД.ПФРНакопительная / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРНакопительнаяЕНВД,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРЕНВД) * ТарифЕНВД.ПФР / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРЕНВД) * (ТарифЕНВД.ПФР - ТарифЕНВД.ПФРНакопительная) / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСтраховаяЕНВД
	|ПОМЕСТИТЬ ВТИсчисленоПоЛьготномуТарифу
	|ИЗ
	|	ВТОграниченнаяОблагаемаяБаза КАК ОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ТарифЕНВД
	|		ПО (ТарифЕНВД.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ТарифИнвалида
	|		ПО (ТарифИнвалида.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифИнвалида.ПФРНакопительная,
	|	ТарифИнвалида.ПФР,
	|	ТарифИнвалида.ФСС,
	|	ТарифИнвалида.ФФОМС,
	|	ТарифИнвалида.ТФОМС,
	|	ТарифЕНВД.ПФРНакопительная,
	|	ТарифЕНВД.ПФР,
	|	ТарифЕНВД.ФСС,
	|	ТарифЕНВД.ФФОМС,
	|	ТарифЕНВД.ТФОМС,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.14 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТВзносыПоДополнительномуТарифу
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяПоДополнительномуТарифу
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И (НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	СУММА(Начислено.ОблагаемаяБаза) КАК ОблагаемаяБаза,
	|	СУММА(Начислено.ОблагаемаяБазаИнвалида) КАК ОблагаемаяБазаИнвалида,
	|	ВЫРАЗИТЬ(СУММА(Начислено.ОблагаемаяБаза) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2)) КАК Взносов,
	|	ВЫРАЗИТЬ(СУММА(Начислено.ОблагаемаяБазаИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2)) КАК ВзносовПоИнвалидам
	|ПОМЕСТИТЬ ВТБазаВзносовФСС_НС_ПЗ
	|ИЗ
	|	(ВЫБРАТЬ
	|		БазовыеНачисленияФССНС.ФизЛицо КАК ФизЛицо,
	|		ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|						И ОсновнойТариф.ВидТарифаСтраховыхВзносов <> ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|					ИЛИ (НЕ &парамЭтоЮрЛицо)
	|				ТОГДА БазовыеНачисленияФССНС.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОблагаемаяБаза,
	|		ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ОсновнойТариф.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И &парамЭтоЮрЛицо
	|				ТОГДА БазовыеНачисленияФССНС.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ОблагаемаяБазаИнвалида
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК БазовыеНачисленияФССНС
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|			ПО БазовыеНачисленияФССНС.ФизЛицо = Инвалид.Физлицо
	|				И (Инвалид.Месяц = &парамМесяцРасчета)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ОсновнойТариф
	|			ПО (ОсновнойТариф.Месяц = &парамМесяцРасчета)
	|	ГДЕ
	|		БазовыеНачисленияФССНС.ПериодРегистрации = &парамПериодРегистрации
	|		И &парамДопУсловие
	|		И БазовыеНачисленияФССНС.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|		И (НЕ БазовыеНачисленияФССНС.ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|		И БазовыеНачисленияФССНС.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|		И БазовыеНачисленияФССНС.ВидРасчета.КодДоходаФСС_НС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		БазовыеНачисленияФССНС.ФизЛицо,
	|		ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ NULL 
	|						И ОсновнойТариф.ВидТарифаСтраховыхВзносов <> ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|					ИЛИ (НЕ &парамЭтоЮрЛицо)
	|				ТОГДА БазовыеНачисленияФССНС.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ОсновнойТариф.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И &парамЭтоЮрЛицо
	|				ТОГДА БазовыеНачисленияФССНС.Результат
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК БазовыеНачисленияФССНС
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|			ПО БазовыеНачисленияФССНС.ФизЛицо = Инвалид.Физлицо
	|				И (Инвалид.Месяц = &парамМесяцРасчета)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ОсновнойТариф
	|			ПО (ОсновнойТариф.Месяц = &парамМесяцРасчета)
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(БазовыеНачисленияФССНС.ПериодРегистрации, МЕСЯЦ) = &парамПериодРегистрации
	|		И &парамДопУсловие
	|		И БазовыеНачисленияФССНС.ВидРасчета.КодДоходаФСС_НС = ЗНАЧЕНИЕ(Перечисление.ДоходыФСС_НС.Облагается)
	|		И (НЕ БазовыеНачисленияФССНС.ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|		И БазовыеНачисленияФССНС.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|		И БазовыеНачисленияФССНС.ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК Начислено
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(БазаВзносовФСС_НС_ПЗ.ОблагаемаяБаза) КАК МаксимумБазы,
	|	МАКСИМУМ(БазаВзносовФСС_НС_ПЗ.ОблагаемаяБазаИнвалида) КАК МаксимумБазыИнвалида
	|ПОМЕСТИТЬ ВТМаксимумыОблагаемойБазыПоНС_ПЗ
	|ИЗ
	|	ВТБазаВзносовФСС_НС_ПЗ КАК БазаВзносовФСС_НС_ПЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(БазаВзносовФСС_НС_ПЗ.ФизЛицо) КАК ФизЛицо,
	|	МАКСИМУМ(БазаВзносовФСС_НС_ПЗИнвалида.ФизЛицо) КАК ФизЛицоИнвалид
	|ПОМЕСТИТЬ ВТФизлицаОкругления
	|ИЗ
	|	ВТМаксимумыОблагаемойБазыПоНС_ПЗ КАК Максимумы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаВзносовФСС_НС_ПЗ КАК БазаВзносовФСС_НС_ПЗ
	|		ПО (Максимумы.МаксимумБазы > 0)
	|			И Максимумы.МаксимумБазы = БазаВзносовФСС_НС_ПЗ.ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаВзносовФСС_НС_ПЗ КАК БазаВзносовФСС_НС_ПЗИнвалида
	|		ПО (Максимумы.МаксимумБазыИнвалида > 0)
	|			И Максимумы.МаксимумБазыИнвалида = БазаВзносовФСС_НС_ПЗИнвалида.ОблагаемаяБазаИнвалида
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(БазаВзносовФСС_НС_ПЗ.ОблагаемаяБаза) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2)) КАК РассчитаноВзносов,
	|	ВЫРАЗИТЬ(СУММА(БазаВзносовФСС_НС_ПЗ.ОблагаемаяБазаИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2)) КАК РассчитаноВзносовПоИнвалидам,
	|	СУММА(ВЫБОР
	|			КОГДА БазаВзносовФСС_НС_ПЗ.ФизЛицо = ФизлицоОкругления.ФизЛицо
	|				ТОГДА 0
	|			ИНАЧЕ БазаВзносовФСС_НС_ПЗ.Взносов
	|		КОНЕЦ) КАК ПросуммированоВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА БазаВзносовФСС_НС_ПЗ.ФизЛицо = ФизлицоОкругления.ФизЛицоИнвалид
	|				ТОГДА 0
	|			ИНАЧЕ БазаВзносовФСС_НС_ПЗ.ВзносовПоИнвалидам
	|		КОНЕЦ) КАК ПросуммированоВзносовПоИнвалидам
	|ПОМЕСТИТЬ ВТИтогоВзносовФСС_НС_ПЗ
	|ИЗ
	|	ВТБазаВзносовФСС_НС_ПЗ КАК БазаВзносовФСС_НС_ПЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизлицаОкругления КАК ФизлицоОкругления
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БазаВзносовФСС_НС_ПЗ.ФизЛицо КАК ФизЛицо,
	|	БазаВзносовФСС_НС_ПЗ.Взносов + БазаВзносовФСС_НС_ПЗ.ВзносовПоИнвалидам КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФС_НС_ПЗ
	|ИЗ
	|	ВТБазаВзносовФСС_НС_ПЗ КАК БазаВзносовФСС_НС_ПЗ
	|ГДЕ
	|	(НЕ БазаВзносовФСС_НС_ПЗ.ФизЛицо В
	|				(ВЫБРАТЬ
	|					ФизлицоОкругления.ФизЛицо
	|				ИЗ
	|					ВТФизлицаОкругления КАК ФизлицоОкругления
	|				ГДЕ
	|					ФизлицоОкругления.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|		
	|				ОБЪЕДИНИТЬ ВСЕ
	|		
	|				ВЫБРАТЬ
	|					ФизлицоОкругления.ФизЛицоИнвалид
	|				ИЗ
	|					ВТФизлицаОкругления КАК ФизлицоОкругления
	|				ГДЕ
	|					ФизлицоОкругления.ФизЛицоИнвалид <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)))
	|	И БазаВзносовФСС_НС_ПЗ.Взносов + БазаВзносовФСС_НС_ПЗ.ВзносовПоИнвалидам <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФизлицоОкругления.ФизЛицо,
	|	ИтогоВзносовФСС_НС_ПЗ.РассчитаноВзносов - ИтогоВзносовФСС_НС_ПЗ.ПросуммированоВзносов
	|ИЗ
	|	ВТФизлицаОкругления КАК ФизлицоОкругления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогоВзносовФСС_НС_ПЗ КАК ИтогоВзносовФСС_НС_ПЗ
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ИтогоВзносовФСС_НС_ПЗ.РассчитаноВзносов <> ИтогоВзносовФСС_НС_ПЗ.ПросуммированоВзносов
	|	И ФизлицоОкругления.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФизлицоОкругления.ФизЛицоИнвалид,
	|	ИтогоВзносовФСС_НС_ПЗ.РассчитаноВзносовПоИнвалидам - ИтогоВзносовФСС_НС_ПЗ.ПросуммированоВзносовПоИнвалидам
	|ИЗ
	|	ВТФизлицаОкругления КАК ФизлицоОкругления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогоВзносовФСС_НС_ПЗ КАК ИтогоВзносовФСС_НС_ПЗ
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ИтогоВзносовФСС_НС_ПЗ.РассчитаноВзносовПоИнвалидам <> ИтогоВзносовФСС_НС_ПЗ.ПросуммированоВзносовПоИнвалидам
	|	И ФизлицоОкругления.ФизЛицоИнвалид <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо,
	|	-СтраховыеВзносыИсчисленныеОбороты.ФССНесчастныеСлучаиОборот
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные.Обороты(
	|			&парамПериодРегистрации,
	|			&парамКонецМесяцаПериодаРегистрации,
	|			,
	|			(НЕ ФизЛицо В
	|						(ВЫБРАТЬ
	|							СписокСотрудников.ФизЛицо
	|						ИЗ
	|							ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|				И ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТСписокСотрудников КАК СписокСотрудников)
	|				И ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК СтраховыеВзносыИсчисленныеОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленные.ФизЛицо,
	|	СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.Регистратор = &Регистратор
	|	И (НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|	И СтраховыеВзносыИсчисленные.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|	И СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	СУММА(ВсегоИсчислено.РезультатПФРНакопительная) КАК РезультатПФРНакопительная,
	|	СУММА(ВсегоИсчислено.РезультатПФРСтраховая) КАК РезультатПФРСтраховая,
	|	СУММА(ВсегоИсчислено.РезультатПФРНакопительнаяЕНВД) КАК РезультатПФРНакопительнаяЕНВД,
	|	СУММА(ВсегоИсчислено.РезультатПФРСтраховаяЕНВД) КАК РезультатПФРСтраховаяЕНВД,
	|	СУММА(ВсегоИсчислено.РезультатФСС) КАК РезультатФСС,
	|	СУММА(ВсегоИсчислено.РезультатФФОМС) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатТФОМС) КАК РезультатТФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПФРНакопительнаяИнвалида) КАК РезультатПФРНакопительнаяИнвалида,
	|	СУММА(ВсегоИсчислено.РезультатПФРСтраховаяИнвалида) КАК РезультатПФРСтраховаяИнвалида,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТСуммыВзносовНарастающимИтогом
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРНакопительная КАК РезультатПФРНакопительная,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСтраховая КАК РезультатПФРСтраховая,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		ИсчисленоПоОсновномуТарифу.РезультатТФОМС КАК РезультатТФОМС,
	|		0 КАК РезультатПФРНакопительнаяЕНВД,
	|		0 КАК РезультатПФРСтраховаяЕНВД,
	|		0 КАК РезультатПФРНакопительнаяИнвалида,
	|		0 КАК РезультатПФРСтраховаяИнвалида,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатФССНесчастныеСлучаи
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсчисленоПоЛьготномуТарифу.ФизЛицо,
	|		ИсчисленоПоЛьготномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		ИсчисленоПоЛьготномуТарифу.РезультатФССИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатФФОМСИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатТФОМСИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатПФРНакопительнаяЕНВД,
	|		ИсчисленоПоЛьготномуТарифу.РезультатПФРСтраховаяЕНВД,
	|		ИсчисленоПоЛьготномуТарифу.РезультатПФРНакопительнаяИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатПФРСтраховаяИнвалида,
	|		0,
	|		0
	|	ИЗ
	|		ВТИсчисленоПоЛьготномуТарифу КАК ИсчисленоПоЛьготномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0
	|	ИЗ
	|		ВТВзносыПоДополнительномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов
	|	ИЗ
	|		ВТВзносыФС_НС_ПЗ КАК ВзносыФС_НС_ПЗ) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборотИнвалида, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборотИнвалида, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатТФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ТФОМСОборот, 0) - ЕСТЬNULL(ИсчисленныеВзносы.ТФОМСОборотИнвалида, 0) КАК ТФОМС,
	|	СуммыНарастающимИтогом.РезультатПФРНакопительная - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборот, 0) + ВЫБОР
	|		КОГДА МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего <> 0
	|				И МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД <> 0
	|			ТОГДА ВЫРАЗИТЬ((СуммыНарастающимИтогом.РезультатПФРНакопительнаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборотИнвалида, 0)) * (МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего - МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД) / МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ СуммыНарастающимИтогом.РезультатПФРНакопительнаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборотИнвалида, 0)
	|	КОНЕЦ КАК ПФРНакопительная,
	|	СуммыНарастающимИтогом.РезультатПФРСтраховая - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборот, 0) + ВЫБОР
	|		КОГДА МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего <> 0
	|				И МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД <> 0
	|			ТОГДА ВЫРАЗИТЬ((СуммыНарастающимИтогом.РезультатПФРСтраховаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборотИнвалида, 0)) * (МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего - МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД) / МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ СуммыНарастающимИтогом.РезультатПФРСтраховаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборотИнвалида, 0)
	|	КОНЕЦ КАК ПФРСтраховая,
	|	СуммыНарастающимИтогом.РезультатПФРНакопительнаяЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяЕНВДОборот, 0) + ВЫБОР
	|		КОГДА МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего <> 0
	|				И МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД <> 0
	|			ТОГДА СуммыНарастающимИтогом.РезультатПФРНакопительнаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборотИнвалида, 0) - (ВЫРАЗИТЬ((СуммыНарастающимИтогом.РезультатПФРНакопительнаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборотИнвалида, 0)) * (МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего - МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД) / МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего КАК ЧИСЛО(15, 2)))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПФРНакопительнаяЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРСтраховаяЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяЕНВДОборот, 0) + ВЫБОР
	|		КОГДА МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего <> 0
	|				И МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД <> 0
	|			ТОГДА СуммыНарастающимИтогом.РезультатПФРСтраховаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборотИнвалида, 0) - (ВЫРАЗИТЬ((СуммыНарастающимИтогом.РезультатПФРСтраховаяИнвалида - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборотИнвалида, 0)) * (МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего - МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаЕНВД) / МесячнаяБазаПФРПоИнвалидам.БазаПФРИнвалидаВсего КАК ЧИСЛО(15, 2)))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПФРСтраховаяЕНВД,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносовНарастающимИтогом КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПФРПоИнвалидам КАК МесячнаяБазаПФРПоИнвалидам
	|		ПО СуммыНарастающимИтогом.ФизЛицо = МесячнаяБазаПФРПоИнвалидам.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ФизЛицо,
	|	Взносы.ФСС,
	|	Взносы.ФФОМС,
	|	Взносы.ТФОМС,
	|	Взносы.ПФРНакопительная,
	|	Взносы.ПФРСтраховая,
	|	Взносы.ПФРНакопительнаяЕНВД,
	|	Взносы.ПФРСтраховаяЕНВД,
	|	Взносы.ПоДополнительномуТарифу КАК ПФРПоДополнительномуТарифу,
	|	Взносы.ФССНесчастныеСлучаи
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ТФОМС <> 0
	|			ИЛИ Взносы.ПФРНакопительная <> 0
	|			ИЛИ Взносы.ПФРСтраховая <> 0
	|			ИЛИ Взносы.ПФРНакопительнаяЕНВД <> 0
	|			ИЛИ Взносы.ПФРСтраховаяЕНВД <> 0
	|			ИЛИ Взносы.ПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Взносы.Порядок";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"И &парамДопУсловие",РасчетСтраховыхВзносовПереопределяемый.ПолучитьДополнительноеУсловиеЗапросаБазаФСС_НС());
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  // ПолучитьДанныеРасчетаЗа2010Год

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//  нет
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2011Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамМесяцРасчета", Месяц(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПредыдущийМесяц", Месяц(ПериодРегистрации) - 1);
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамЭтоЮрЛицо", ОбщегоНазначенияЗКПереопределяемый.ЭтоЮрЛицо(Организация));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации)).РазмерФСС;
	Запрос.УстановитьПараметр("ПредельнаяСумма", ?(ЗначениеЗаполнено(ПредельнаяСумма),ПредельнаяСумма,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах";
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.Выполнить();
	
	// ФизлицаДляРасчета
	//
	Если ОграничениеНаСотрудников = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТСписокСотрудников
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
		|	И СведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо
		|ИЗ
		|	ВТДанныеДокумента КАК СведенияОДоходах
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		Запрос.Выполнить();
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
        |ПОМЕСТИТЬ ВТСписокСотрудников
        |ИЗ
        |   &парамТаблицаСотрудников КАК ТаблицаСотрудников
        |
        |ИНДЕКСИРОВАТЬ ПО
        |   ФизЛицо";
		Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
		Запрос.Выполнить();
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПериодРегистрации));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПериодРегистрации) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС,
	|	ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК НеИмеетПравоНаПенсию
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|	ГДЕ
	|		ГражданствоФизЛиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ГражданствоФизЛиц.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|			И ГражданствоФизЛиц.НеИмеетПравоНаПенсию
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО (СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра)
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецМесяцаПериодаРегистрации,
	|			Месяц,
	|			Организация = &парамГоловнаяОрганизация
	|				И Физлицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТСписокСотрудников КАК СписокСотрудников)) КАК СведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.Период),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ТФОМСОборот) КАК ТФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНакопительнаяОборот) КАК ПФРНакопительнаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСтраховаяОборот) КАК ПФРСтраховаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		МЕСЯЦ(РанееИсчисленныеВзносы.Период) КАК Месяц,
	|		РанееИсчисленныеВзносы.ФССОборот + РанееИсчисленныеВзносы.ФССЕНВДОборот КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМСОборот + РанееИсчисленныеВзносы.ФФОМСЕНВДОборот КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ТФОМСОборот + РанееИсчисленныеВзносы.ТФОМСЕНВДОборот КАК ТФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРНакопительнаяОборот + РанееИсчисленныеВзносы.ПФРНакопительнаяЕНВДОборот КАК ПФРНакопительнаяОборот,
	|		РанееИсчисленныеВзносы.ПФРСтраховаяОборот + РанееИсчисленныеВзносы.ПФРСтраховаяЕНВДОборот КАК ПФРСтраховаяОборот,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот КАК ПФРПоДополнительномуТарифуОборот,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.Период = &парамПериодРегистрации
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ФССНесчастныеСлучаиОборот
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыИсчисленные.Обороты(
	|				&парамНачалоГода,
	|				&парамКонецМесяцаПериодаРегистрации,
	|				Месяц,
	|				Организация = &парамГоловнаяОрганизация
	|					И (НЕ ФизЛицо В
	|							(ВЫБРАТЬ
	|								СписокСотрудников.ФизЛицо
	|							ИЗ
	|								ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|					И ФизЛицо В
	|						(ВЫБРАТЬ
	|							СписокСотрудников.ФизЛицо
	|						ИЗ
	|							ВТСписокСотрудников КАК СписокСотрудников)) КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		МЕСЯЦ(СтраховыеВзносыИсчисленные.Период),
	|		-СтраховыеВзносыИсчисленные.ФСС - СтраховыеВзносыИсчисленные.ФССЕНВД,
	|		-СтраховыеВзносыИсчисленные.ФФОМС - СтраховыеВзносыИсчисленные.ФФОМСЕНВД,
	|		-СтраховыеВзносыИсчисленные.ТФОМС - СтраховыеВзносыИсчисленные.ТФОМСЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРНакопительная - СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРСтраховая - СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам,
	|		-СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу,
	|		-СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.Регистратор = &Регистратор
	|		И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|		И (НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|		И СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	Основная.Месяц КАК Месяц,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоИнвалидныйМесяц,
	|	СУММА(ВЫБОР
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ (НЕ Иностр.НеИмеетПравоНаПенсию))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА (Иностр.Физлицо ЕСТЬ NULL 
	|					ИЛИ Иностр.ИмеетПравоНаСтрахованиеФОМС)
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС
	|					И &парамЭтоЮрЛицо
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					И &парамЭтоЮрЛицо
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу,
	|	ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|ГДЕ
	|	(НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ДоходыЗастрахованныхЛиц.ФизЛицо КАК ФизЛицо,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС
	|ПОМЕСТИТЬ ВТНакопленнаяОблагаемаяБаза
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ПО (ДоходыЗастрахованныхЛиц.Месяц МЕЖДУ 1 И МЕСЯЦ(Периоды.Период))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	МЕСЯЦ(Периоды.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	База.Месяц КАК Месяц,
	|	База.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА База.БазаПФР <= &ПредельнаяСумма
	|			ТОГДА 1
	|		КОГДА База.БазаПФР = ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0) >= &ПредельнаяСумма
	|			ТОГДА 0
	|		ИНАЧЕ (&ПредельнаяСумма - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0)) / (База.БазаПФР - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаПФР, 0))
	|	КОНЕЦ КАК КоэффициентОбложенияПФР,
	|	ВЫБОР
	|		КОГДА База.БазаФСС <= &ПредельнаяСумма
	|			ТОГДА 1
	|		КОГДА База.БазаФСС = ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0) >= &ПредельнаяСумма
	|			ТОГДА 0
	|		ИНАЧЕ (&ПредельнаяСумма - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0)) / (База.БазаФСС - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФСС, 0))
	|	КОНЕЦ КАК КоэффициентОбложенияФСС,
	|	ВЫБОР
	|		КОГДА База.БазаФОМС <= &ПредельнаяСумма
	|			ТОГДА 1
	|		КОГДА База.БазаФОМС = ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0) >= &ПредельнаяСумма
	|			ТОГДА 0
	|		ИНАЧЕ (&ПредельнаяСумма - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0)) / (База.БазаФОМС - ЕСТЬNULL(НакопленоПоПрошлыйМесяц.БазаФОМС, 0))
	|	КОНЕЦ КАК КоэффициентОбложенияФОМС
	|ПОМЕСТИТЬ ВТКоэффициентыДостиженияПредельнойСуммы
	|ИЗ
	|	ВТНакопленнаяОблагаемаяБаза КАК База
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленнаяОблагаемаяБаза КАК НакопленоПоПрошлыйМесяц
	|		ПО (База.Месяц - 1 = НакопленоПоПрошлыйМесяц.Месяц)
	|			И База.ФизЛицо = НакопленоПоПрошлыйМесяц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо КАК ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Месяц КАК Месяц,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА (НЕ ДоходыЗастрахованныхЛиц.ЭтоИнвалидныйМесяц)
	|			ТОГДА 0
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 1
	|			ТОГДА НакопленнаяОблагаемаяБазаТекущийМесяц.БазаПФР - ВЫБОР
	|					КОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0) < &ПредельнаяСумма
	|						ТОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)
	|					ИНАЧЕ &ПредельнаяСумма
	|				КОНЕЦ
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)
	|	КОНЕЦ КАК БазаПФРИнвалида,
	|	ВЫБОР
	|		КОГДА ДоходыЗастрахованныхЛиц.ЭтоИнвалидныйМесяц
	|			ТОГДА 0
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 1
	|			ТОГДА НакопленнаяОблагаемаяБазаТекущийМесяц.БазаПФР - ВЫБОР
	|					КОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0) < &ПредельнаяСумма
	|						ТОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)
	|					ИНАЧЕ &ПредельнаяСумма
	|				КОНЕЦ
	|		КОГДА Коэффициенты.КоэффициентОбложенияПФР = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаПФР, 0)
	|	КОНЕЦ КАК БазаПФРПоОсновномуТарифу,
	|	ВЫБОР
	|		КОГДА (НЕ ДоходыЗастрахованныхЛиц.ЭтоИнвалидныйМесяц)
	|			ТОГДА 0
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 1
	|			ТОГДА НакопленнаяОблагаемаяБазаТекущийМесяц.БазаФСС - ВЫБОР
	|					КОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0) < &ПредельнаяСумма
	|						ТОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)
	|					ИНАЧЕ &ПредельнаяСумма
	|				КОНЕЦ
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)
	|	КОНЕЦ КАК БазаФССИнвалида,
	|	ВЫБОР
	|		КОГДА ДоходыЗастрахованныхЛиц.ЭтоИнвалидныйМесяц
	|			ТОГДА 0
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 1
	|			ТОГДА НакопленнаяОблагаемаяБазаТекущийМесяц.БазаФСС - ВЫБОР
	|					КОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0) < &ПредельнаяСумма
	|						ТОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)
	|					ИНАЧЕ &ПредельнаяСумма
	|				КОНЕЦ
	|		КОГДА Коэффициенты.КоэффициентОбложенияФСС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФСС, 0)
	|	КОНЕЦ КАК БазаФССПоОсновномуТарифу,
	|	ВЫБОР
	|		КОГДА (НЕ ДоходыЗастрахованныхЛиц.ЭтоИнвалидныйМесяц)
	|			ТОГДА 0
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 1
	|			ТОГДА НакопленнаяОблагаемаяБазаТекущийМесяц.БазаФОМС - ВЫБОР
	|					КОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0) < &ПредельнаяСумма
	|						ТОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)
	|					ИНАЧЕ &ПредельнаяСумма
	|				КОНЕЦ
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФОМС = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)
	|	КОНЕЦ КАК БазаФОМСИнвалида,
	|	ВЫБОР
	|		КОГДА ДоходыЗастрахованныхЛиц.ЭтоИнвалидныйМесяц
	|			ТОГДА 0
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 1
	|			ТОГДА НакопленнаяОблагаемаяБазаТекущийМесяц.БазаФОМС - ВЫБОР
	|					КОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0) < &ПредельнаяСумма
	|						ТОГДА ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)
	|					ИНАЧЕ &ПредельнаяСумма
	|				КОНЕЦ
	|		КОГДА Коэффициенты.КоэффициентОбложенияФОМС = 0
	|			ТОГДА 0
	|		КОГДА ДоходыЗастрахованныхЛиц.БазаФОМС = 0
	|			ТОГДА 0
	|		ИНАЧЕ &ПредельнаяСумма - ЕСТЬNULL(НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.БазаФОМС, 0)
	|	КОНЕЦ КАК БазаФОМСПоОсновномуТарифу
	|ПОМЕСТИТЬ ВТОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициентыДостиженияПредельнойСуммы КАК Коэффициенты
	|		ПО ДоходыЗастрахованныхЛиц.ФизЛицо = Коэффициенты.ФизЛицо
	|			И ДоходыЗастрахованныхЛиц.Месяц = Коэффициенты.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленнаяОблагаемаяБаза КАК НакопленнаяОблагаемаяБазаПоПредыдущийМесяц
	|		ПО ДоходыЗастрахованныхЛиц.ФизЛицо = НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.ФизЛицо
	|			И (ДоходыЗастрахованныхЛиц.Месяц - 1 = НакопленнаяОблагаемаяБазаПоПредыдущийМесяц.Месяц)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНакопленнаяОблагаемаяБаза КАК НакопленнаяОблагаемаяБазаТекущийМесяц
	|		ПО ДоходыЗастрахованныхЛиц.ФизЛицо = НакопленнаяОблагаемаяБазаТекущийМесяц.ФизЛицо
	|			И ДоходыЗастрахованныхЛиц.Месяц = НакопленнаяОблагаемаяБазаТекущийМесяц.Месяц
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРПоОсновномуТарифу) * ОсновнойТариф.ПФРНакопительная / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРНакопительная,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРПоОсновномуТарифу) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРПоОсновномуТарифу) * (ОсновнойТариф.ПФР - ОсновнойТариф.ПФРНакопительная) / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСтраховая,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФССПоОсновномуТарифу) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСПоОсновномуТарифу) * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСПоОсновномуТарифу) * ОсновнойТариф.ТФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатТФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТОграниченнаяОблагаемаяБаза КАК ОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО ОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновнойТариф.ПФРНакопительная,
	|	ОсновнойТариф.ПФР,
	|	ОсновнойТариф.ФСС,
	|	ОсновнойТариф.ФФОМС,
	|	ОсновнойТариф.ТФОМС,
	|	ОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРИнвалида) * ТарифИнвалида.ПФРНакопительная / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРНакопительнаяИнвалида,
	|	ВЫБОР
	|		КОГДА ГОД(ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРИнвалида) * ТарифИнвалида.ПФР / 100 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаПФРИнвалида) * (ТарифИнвалида.ПФР - ТарифИнвалида.ПФРНакопительная) / 100 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСтраховаяИнвалида,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФССИнвалида) * ТарифИнвалида.ФСС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФССИнвалида,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСИнвалида) * ТарифИнвалида.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФФОМСИнвалида,
	|	ВЫРАЗИТЬ(СУММА(ОграниченнаяОблагаемаяБаза.БазаФОМСИнвалида) * ТарифИнвалида.ТФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатТФОМСИнвалида
	|ПОМЕСТИТЬ ВТИсчисленоПоЛьготномуТарифу
	|ИЗ
	|	ВТОграниченнаяОблагаемаяБаза КАК ОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ТарифИнвалида
	|		ПО (ТарифИнвалида.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифИнвалида.ПФРНакопительная,
	|	ТарифИнвалида.ПФР,
	|	ТарифИнвалида.ФСС,
	|	ТарифИнвалида.ФФОМС,
	|	ТарифИнвалида.ТФОМС,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо,
	|	ОграниченнаяОблагаемаяБаза.ФизЛицо.ДатаРождения
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.14 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТВзносыПоДополнительномуТарифу
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяПоДополнительномуТарифу
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И (НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.067 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТВзносыДляШахтеров
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И (НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(Начислено.БазаФСС_НСПоОсновномуТарифу * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(Начислено.БазаФСС_НСИнвалида * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) - ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|ГДЕ
	|	Начислено.Месяц = &парамМесяцРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	СУММА(ВсегоИсчислено.РезультатПФРНакопительная) КАК РезультатПФРНакопительная,
	|	СУММА(ВсегоИсчислено.РезультатПФРСтраховая) КАК РезультатПФРСтраховая,
	|	СУММА(ВсегоИсчислено.РезультатФСС) КАК РезультатФСС,
	|	СУММА(ВсегоИсчислено.РезультатФФОМС) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатТФОМС) КАК РезультатТФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров
	|ПОМЕСТИТЬ ВТСуммыВзносовНарастающимИтогом
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРНакопительная КАК РезультатПФРНакопительная,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСтраховая КАК РезультатПФРСтраховая,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		ИсчисленоПоОсновномуТарифу.РезультатТФОМС КАК РезультатТФОМС,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатДляШахтеров
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсчисленоПоЛьготномуТарифу.ФизЛицо,
	|		ИсчисленоПоЛьготномуТарифу.ФизЛицо.Наименование,
	|		ИсчисленоПоЛьготномуТарифу.РезультатПФРНакопительнаяИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатПФРСтраховаяИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатФССИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатФФОМСИнвалида,
	|		ИсчисленоПоЛьготномуТарифу.РезультатТФОМСИнвалида,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТИсчисленоПоЛьготномуТарифу КАК ИсчисленоПоЛьготномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыПоДополнительномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу
	|	ИЗ
	|		ВТВзносыДляШахтеров КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатТФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ТФОМСОборот, 0) КАК ТФОМС,
	|	СуммыНарастающимИтогом.РезультатПФРНакопительная - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборот, 0) КАК ПФРНакопительная,
	|	СуммыНарастающимИтогом.РезультатПФРСтраховая - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборот, 0) КАК ПФРСтраховая,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносовНарастающимИтогом КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ Основная.ОблагаетсяЕНВД)
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ Основная.ОблагаетсяЕНВД)
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА (НЕ Основная.ОблагаетсяЕНВД)
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	(НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников))
	|	И Основная.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА (НЕ СведенияОДоходах.ОблагаетсяЕНВД)
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И (НЕ ВидыДеятельности.ТолькоЕНВД)
	|			ТОГДА Взносы.ФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ФФОМС - (ВЫРАЗИТЬ(Взносы.ФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И (НЕ ВидыДеятельности.ТолькоЕНВД)
	|			ТОГДА Взносы.ТФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ТФОМС - (ВЫРАЗИТЬ(Взносы.ТФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ТФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ТФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ТФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ТФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И (НЕ ВидыДеятельности.ТолькоЕНВД)
	|			ТОГДА Взносы.ФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ФСС - (ВЫРАЗИТЬ(Взносы.ФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И (НЕ ВидыДеятельности.ТолькоЕНВД)
	|			ТОГДА Взносы.ПФРНакопительная
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ПФРНакопительная - (ВЫРАЗИТЬ(Взносы.ПФРНакопительная * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ПФРНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРНакопительная
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ПФРНакопительная * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРНакопительнаяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И (НЕ ВидыДеятельности.ТолькоЕНВД)
	|			ТОГДА Взносы.ПФРСтраховая
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ПФРСтраховая - (ВЫРАЗИТЬ(Взносы.ПФРСтраховая * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРСтраховая
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ПФРСтраховая * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРСтраховаяЕНВД,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ТФОМС <> 0
	|			ИЛИ Взносы.ПФРНакопительная <> 0
	|			ИЛИ Взносы.ПФРСтраховая <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Взносы.Порядок";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции  // ПолучитьДанныеРасчета

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//  нет
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2012Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамМесяцРасчета", Месяц(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПредыдущийМесяц", Месяц(ПериодРегистрации) - 1);
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПредоставлятьЛьготуПоИнвалидам", ОбщегоНазначенияЗКПереопределяемый.ЭтоЮрЛицо(Организация));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации)).РазмерФСС;
	Запрос.УстановитьПараметр("ПредельнаяСумма", ?(ЗначениеЗаполнено(ПредельнаяСумма),ПредельнаяСумма,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах";
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.Выполнить();
	
	// ФизлицаДляРасчета
	//
	Если ОграничениеНаСотрудников = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТСписокСотрудников
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
		|	И СведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо
		|ИЗ
		|	ВТДанныеДокумента КАК СведенияОДоходах
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		Запрос.Выполнить();
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
        |ПОМЕСТИТЬ ВТСписокСотрудников
        |ИЗ
        |   &парамТаблицаСотрудников КАК ТаблицаСотрудников
        |
        |ИНДЕКСИРОВАТЬ ПО
        |   ФизЛицо";
		Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
		Запрос.Выполнить();
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПериодРегистрации));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПериодРегистрации) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР + ТарифСтраховыхВзносовСрезПоследних.ФСС + ТарифСтраховыхВзносовСрезПоследних.ФФОМС + ТарифСтраховыхВзносовСрезПоследних.ТФОМС КАК СуммарныйТариф
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тарифы.ВидТарифа,
	|	ВЫБОР
	|		КОГДА Тарифы.СуммарныйТариф > ТарифДляИнвалидов.СуммарныйТариф
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыделятьДоходыИнвалидов
	|ПОМЕСТИТЬ ВТОписаниеТарифов
	|ИЗ
	|	ВТТарифы КАК Тарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ТарифДляИнвалидов
	|		ПО (ТарифДляИнвалидов.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	НЕ ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК ИмеетПравоНаСтрахованиеПФР,
	|	НЕ ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК ИмеетПравоНаСтрахованиеФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС,
	|	ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) КАК ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И (СписокСотрудников.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения < НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
	|				И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО (СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра)
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецМесяцаПериодаРегистрации,
	|			Месяц,
	|			Организация = &парамГоловнаяОрганизация
	|				И Физлицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТСписокСотрудников КАК СписокСотрудников)) КАК СведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.Период),
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ТФОМСОборот) КАК ТФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНакопительнаяОборот) КАК ПФРНакопительнаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСтраховаяОборот) КАК ПФРСтраховаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		МЕСЯЦ(РанееИсчисленныеВзносы.Период) КАК Месяц,
	|		РанееИсчисленныеВзносы.ФССОборот + РанееИсчисленныеВзносы.ФССЕНВДОборот КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМСОборот + РанееИсчисленныеВзносы.ФФОМСЕНВДОборот КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ТФОМСОборот + РанееИсчисленныеВзносы.ТФОМСЕНВДОборот КАК ТФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРНакопительнаяОборот + РанееИсчисленныеВзносы.ПФРНакопительнаяЕНВДОборот КАК ПФРНакопительнаяОборот,
	|		РанееИсчисленныеВзносы.ПФРСтраховаяОборот + РанееИсчисленныеВзносы.ПФРСтраховаяЕНВДОборот КАК ПФРСтраховаяОборот,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот КАК ПФРПоДополнительномуТарифуОборот,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.Период = &парамПериодРегистрации
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ФССНесчастныеСлучаиОборот
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыИсчисленные.Обороты(
	|				&парамНачалоГода,
	|				&парамКонецМесяцаПериодаРегистрации,
	|				Месяц,
	|				Организация = &парамГоловнаяОрганизация
	|					И НЕ ФизЛицо В
	|							(ВЫБРАТЬ
	|								СписокСотрудников.ФизЛицо
	|							ИЗ
	|								ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|					И ФизЛицо В
	|						(ВЫБРАТЬ
	|							СписокСотрудников.ФизЛицо
	|						ИЗ
	|							ВТСписокСотрудников КАК СписокСотрудников)) КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		МЕСЯЦ(СтраховыеВзносыИсчисленные.Период),
	|		-СтраховыеВзносыИсчисленные.ФСС - СтраховыеВзносыИсчисленные.ФССЕНВД,
	|		-СтраховыеВзносыИсчисленные.ФФОМС - СтраховыеВзносыИсчисленные.ФФОМСЕНВД,
	|		-СтраховыеВзносыИсчисленные.ТФОМС - СтраховыеВзносыИсчисленные.ТФОМСЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРНакопительная - СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРСтраховая - СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам,
	|		-СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу,
	|		-СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.Регистратор = &Регистратор
	|		И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|		И НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|		И СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ГОД(Основная.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НачислятьНакопительнуюЧасть,
	|	Основная.Месяц КАК Месяц,
	|	Основная.Период,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеПФР
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|					И ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|					И ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФСС
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФОМС
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС
	|					И &ПредоставлятьЛьготуПоИнвалидам
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					И &ПредоставлятьЛьготуПоИнвалидам
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|			ПО Иностр.Физлицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|				И Иностр.Месяц = ПринятыеПоДолгосрочнымДоговорам.Месяц
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА Основная.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	Основная.Период,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГОД(Основная.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(СведенияОДоходах.БазаФОМС) КАК ЗаГодФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФОМС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФОМС,
	|	СУММА(СведенияОДоходах.БазаФСС) КАК ЗаГодФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФСС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГодФОМС - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГодФОМС - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПределФОМС,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПределФСС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период КАК Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	ДоходыЗастрахованныхЛиц.БазаПФР КАК ЗаМесяц,
	|	ДоходыЗастрахованныхЛиц.БазаФСС КАК ЗаМесяцФСС,
	|	ДоходыЗастрахованныхЛиц.БазаФОМС КАК ЗаМесяцФОМС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФОМС) КАК ЗаМесяцФОМС,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|		Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		Превышение.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел,
	|		ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|		ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|		ОбособленноеПодразделениеДляОкругления.НачислятьНакопительнуюЧасть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел
	|		ИЗ
	|			ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|ГДЕ
	|	СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И МЕСЯЦ(СуммыПоМесяцам.Период) <= &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФОМС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФОМС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаФОМС
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|		Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		Превышение.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел,
	|		ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|		ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|		ОбособленноеПодразделениеДляОкругления.НачислятьНакопительнуюЧасть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПределФОМС
	|		ИЗ
	|			ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|ГДЕ
	|	СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И МЕСЯЦ(СуммыПоМесяцам.Период) <= &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаФСС
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|		Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		Превышение.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел,
	|		ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|		ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|		ОбособленноеПодразделениеДляОкругления.НачислятьНакопительнуюЧасть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПределФСС
	|		ИЗ
	|			ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|ГДЕ
	|	СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И МЕСЯЦ(СуммыПоМесяцам.Период) <= &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС
	|ПОМЕСТИТЬ ВТНеОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть
	|				ТОГДА ОсновнойТариф.ПФРНакопительная
	|			ИНАЧЕ 0
	|		КОНЕЦ / 100 КАК ЧИСЛО(15, 2)) КАК РезультатПФРНакопительная,
	|	(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * (ОсновнойТариф.ПФР - ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть
	|				ТОГДА ОсновнойТариф.ПФРНакопительная
	|			ИНАЧЕ 0
	|		КОНЕЦ) / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим))
	|				ТОГДА ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0) * 0.1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2))) КАК РезультатПФРСтраховая,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФОМС - ЕСТЬNULL(ПревышениеДоходаФОМС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТНеОграниченнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть = ПревышениеДоходаПФР.НачислятьНакопительнуюЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть = ПревышениеДоходаФСС.НачислятьНакопительнуюЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФОМС КАК ПревышениеДоходаФОМС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФОМС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФОМС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть = ПревышениеДоходаФОМС.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.14 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТВзносыПоДополнительномуТарифу
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяПоДополнительномуТарифу
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.067 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТВзносыДляШахтеров
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(18, 5))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(18, 5))) - МАКСИМУМ(ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0)) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|ГДЕ
	|	Начислено.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.Взносов - РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаиСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) КАК Взносов
	|	ИЗ
	|		ВТДоходыЗастрахованныхЛиц КАК Начислено
	|	ГДЕ
	|		Начислено.Месяц = &парамМесяцРасчета) КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|		ИЗ
	|			ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы) КАК РанееИсчисленныеВзносы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРНакопительная) КАК ЧИСЛО(15, 2)) КАК РезультатПФРНакопительная,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСтраховая) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСтраховая,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФСС) КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМС) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров
	|ПОМЕСТИТЬ ВТСуммыВзносовНарастающимИтогом
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРНакопительная КАК РезультатПФРНакопительная,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСтраховая КАК РезультатПФРСтраховая,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатДляШахтеров
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыПоДополнительномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу
	|	ИЗ
	|		ВТВзносыДляШахтеров КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатПФРНакопительная - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборот, 0) КАК ПФРНакопительная,
	|	СуммыНарастающимИтогом.РезультатПФРСтраховая - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборот, 0) КАК ПФРСтраховая,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносовНарастающимИтогом КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И Основная.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ФФОМС - (ВЫРАЗИТЬ(Взносы.ФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ФСС - (ВЫРАЗИТЬ(Взносы.ФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРНакопительная
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ПФРНакопительная - (ВЫРАЗИТЬ(Взносы.ПФРНакопительная * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ПФРНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРНакопительная
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ПФРНакопительная * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРНакопительнаяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРСтраховая
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ПФРСтраховая - (ВЫРАЗИТЬ(Взносы.ПФРСтраховая * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРСтраховая
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ПФРСтраховая * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРСтраховаяЕНВД,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ПФРНакопительная <> 0
	|			ИЛИ Взносы.ПФРСтраховая <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Взносы.Порядок";

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начислено.Взносов КАК ВзносовСводно
	|ИЗ
	|	ВТВзносыФССНесчастныеСлучаиСводно КАК Начислено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВзносовСводно) Тогда
		ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"ФССНесчастныеСлучаи", Выборка.ВзносовСводно, 2, "ФизЛицо");
	КонецЕсли;
	
	Возврат ВременнаяТаблица;
	
КонецФункции  // ПолучитьДанныеРасчетаЗа2012Год

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//  нет
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2013Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамМесяцРасчета", Месяц(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПредыдущийМесяц", Месяц(ПериодРегистрации) - 1);
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации)).РазмерФСС;
	Запрос.УстановитьПараметр("ПредельнаяСумма", ?(ЗначениеЗаполнено(ПредельнаяСумма),ПредельнаяСумма,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПериодРегистрации), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах";
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.Выполнить();
	
	// ФизлицаДляРасчета
	//
	Если ОграничениеНаСотрудников = Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТСписокСотрудников
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
		|	И СведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ФизЛицо
		|ИЗ
		|	ВТДанныеДокумента КАК СведенияОДоходах
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо";
		Запрос.Выполнить();
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
        |ПОМЕСТИТЬ ВТСписокСотрудников
        |ИЗ
        |   &парамТаблицаСотрудников КАК ТаблицаСотрудников
        |
        |ИНДЕКСИРОВАТЬ ПО
        |   ФизЛицо";
		Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
		Запрос.Выполнить();
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПериодРегистрации));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПериодРегистрации) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СрезПоследних(&парамКонецГода, ) КАК ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР + ТарифСтраховыхВзносовСрезПоследних.ФСС + ТарифСтраховыхВзносовСрезПоследних.ФФОМС + ТарифСтраховыхВзносовСрезПоследних.ТФОМС КАК СуммарныйТариф
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тарифы.ВидТарифа,
	|	ВЫБОР
	|		КОГДА Тарифы.СуммарныйТариф > ТарифДляИнвалидов.СуммарныйТариф
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВыделятьДоходыИнвалидов
	|ПОМЕСТИТЬ ВТОписаниеТарифов
	|ИЗ
	|	ВТТарифы КАК Тарифы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ТарифДляИнвалидов
	|		ПО (ТарифДляИнвалидов.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	НЕ ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК ИмеетПравоНаСтрахованиеПФР,
	|	НЕ ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК ИмеетПравоНаСтрахованиеФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС,
	|	ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) КАК ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И (СписокСотрудников.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения < НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
	|				И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО (СведенияОбИнвалидностиФизлиц.Период = Периоды.ПериодРегистра)
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.Период) КАК Месяц,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
	|			&парамНачалоГода,
	|			&парамКонецМесяцаПериодаРегистрации,
	|			Месяц,
	|			Организация = &парамГоловнаяОрганизация
	|				И Физлицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТСписокСотрудников КАК СписокСотрудников)) КАК СведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.Период),
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ТФОМСОборот) КАК ТФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНакопительнаяОборот) КАК ПФРНакопительнаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСтраховаяОборот) КАК ПФРСтраховаяОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		МЕСЯЦ(РанееИсчисленныеВзносы.Период) КАК Месяц,
	|		РанееИсчисленныеВзносы.ФССОборот + РанееИсчисленныеВзносы.ФССЕНВДОборот КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМСОборот + РанееИсчисленныеВзносы.ФФОМСЕНВДОборот КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ТФОМСОборот + РанееИсчисленныеВзносы.ТФОМСЕНВДОборот КАК ТФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРНакопительнаяОборот + РанееИсчисленныеВзносы.ПФРНакопительнаяЕНВДОборот КАК ПФРНакопительнаяОборот,
	|		РанееИсчисленныеВзносы.ПФРСтраховаяОборот + РанееИсчисленныеВзносы.ПФРСтраховаяЕНВДОборот КАК ПФРСтраховаяОборот,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот КАК ПФРПоДополнительномуТарифуОборот,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.Период = &парамПериодРегистрации
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ФССНесчастныеСлучаиОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыИсчисленные.Обороты(
	|				&парамНачалоГода,
	|				&парамКонецМесяцаПериодаРегистрации,
	|				Месяц,
	|				Организация = &парамГоловнаяОрганизация
	|					И НЕ ФизЛицо В
	|							(ВЫБРАТЬ
	|								СписокСотрудников.ФизЛицо
	|							ИЗ
	|								ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|					И ФизЛицо В
	|						(ВЫБРАТЬ
	|							СписокСотрудников.ФизЛицо
	|						ИЗ
	|							ВТСписокСотрудников КАК СписокСотрудников)) КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		МЕСЯЦ(СтраховыеВзносыИсчисленные.Период),
	|		-СтраховыеВзносыИсчисленные.ФСС - СтраховыеВзносыИсчисленные.ФССЕНВД,
	|		-СтраховыеВзносыИсчисленные.ФФОМС - СтраховыеВзносыИсчисленные.ФФОМСЕНВД,
	|		-СтраховыеВзносыИсчисленные.ТФОМС - СтраховыеВзносыИсчисленные.ТФОМСЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРНакопительная - СтраховыеВзносыИсчисленные.ПФРНакопительнаяЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРСтраховая - СтраховыеВзносыИсчисленные.ПФРСтраховаяЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам,
	|		-СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу,
	|		-СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|	ГДЕ
	|		СтраховыеВзносыИсчисленные.Регистратор = &Регистратор
	|		И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|		И НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|					(ВЫБРАТЬ
	|						СписокСотрудников.ФизЛицо
	|					ИЗ
	|						ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|		И СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ГОД(Основная.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НачислятьНакопительнуюЧасть,
	|	Основная.Месяц КАК Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеПФР
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|					И ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|					И ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФСС
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФОМС
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|			ПО Иностр.Физлицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|				И Иностр.Месяц = ПринятыеПоДолгосрочнымДоговорам.Месяц
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА Основная.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГОД(Основная.ФизЛицо.ДатаРождения) < 1967
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПроживающиеИностранцы)
	|			ТОГДА ЛОЖЬ
	|		КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(СведенияОДоходах.БазаФОМС) КАК ЗаГодФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФОМС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФОМС,
	|	СУММА(СведенияОДоходах.БазаФСС) КАК ЗаГодФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФСС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГодФОМС - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГодФОМС - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПределФОМС,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПределФСС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период КАК Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК ЗаМесяц,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК ЗаМесяцФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК ЗаМесяцФОМС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФОМС) КАК ЗаМесяцФОМС,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|		Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		Превышение.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел,
	|		ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|		ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|		ОбособленноеПодразделениеДляОкругления.НачислятьНакопительнуюЧасть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел
	|		ИЗ
	|			ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|ГДЕ
	|	СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И МЕСЯЦ(СуммыПоМесяцам.Период) <= &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФОМС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФОМС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаФОМС
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|		Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		Превышение.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел,
	|		ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|		ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|		ОбособленноеПодразделениеДляОкругления.НачислятьНакопительнуюЧасть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПределФОМС
	|		ИЗ
	|			ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|ГДЕ
	|	СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И МЕСЯЦ(СуммыПоМесяцам.Период) <= &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
	|	БазаЗаМесяцПоОбособленным.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|ПОМЕСТИТЬ ВТПревышениеДоходаФСС
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо КАК ФизЛицо,
	|		Превышение.Период КАК Период,
	|		Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|		Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|		Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|		Превышение.НачислятьНакопительнуюЧасть КАК НачислятьНакопительнуюЧасть
	|	ИЗ
	|		ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Превышение.ФизЛицо,
	|		Превышение.Период,
	|		Превышение.СуммаПревысившаяПредел,
	|		ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|		ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
	|		ОбособленноеПодразделениеДляОкругления.НачислятьНакопительнуюЧасть
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПределФСС
	|		ИЗ
	|			ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|ГДЕ
	|	СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|	И МЕСЯЦ(СуммыПоМесяцам.Период) <= &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	СуммыПоМесяцам.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС
	|ПОМЕСТИТЬ ВТНеОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.НачислятьНакопительнуюЧасть,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть
	|				ТОГДА ОсновнойТариф.ПФРНакопительная
	|			ИНАЧЕ 0
	|		КОНЕЦ / 100 КАК ЧИСЛО(15, 2)) КАК РезультатПФРНакопительная,
	|	(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * (ОсновнойТариф.ПФР - ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть
	|				ТОГДА ОсновнойТариф.ПФРНакопительная
	|			ИНАЧЕ 0
	|		КОНЕЦ) / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов В (ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД), ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим))
	|				ТОГДА ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0) * 0.1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(15, 2))) КАК РезультатПФРСтраховая,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФОМС - ЕСТЬNULL(ПревышениеДоходаФОМС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТНеОграниченнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть = ПревышениеДоходаПФР.НачислятьНакопительнуюЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть = ПревышениеДоходаФСС.НачислятьНакопительнуюЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФОМС КАК ПревышениеДоходаФОМС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФОМС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФОМС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.НачислятьНакопительнуюЧасть = ПревышениеДоходаФОМС.НачислятьНакопительнуюЧасть
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.БазаПФР) * ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИВредныхРаботах
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифыВзносов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо,
	|	ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.БазаПФР) * ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифыВзносов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо,
	|	ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.14 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТВзносыПоДополнительномуТарифу
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяПоДополнительномуТарифу
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.067 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТВзносыДляШахтеров
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(18, 5))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(18, 5))) - МАКСИМУМ(ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0)) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|ГДЕ
	|	Начислено.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.Взносов - РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаиСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) КАК Взносов
	|	ИЗ
	|		ВТДоходыЗастрахованныхЛиц КАК Начислено
	|	ГДЕ
	|		Начислено.Месяц = &парамМесяцРасчета) КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|		ИЗ
	|			ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы) КАК РанееИсчисленныеВзносы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРНакопительная) КАК ЧИСЛО(15, 2)) КАК РезультатПФРНакопительная,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСтраховая) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСтраховая,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФСС) КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМС) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТСуммыВзносовНарастающимИтогом
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРНакопительная КАК РезультатПФРНакопительная,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСтраховая КАК РезультатПФРСтраховая,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатДляШахтеров,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыПоДополнительномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыДляШахтеров КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаЗанятыхНаПодземныхИВредныхРаботах.ФизЛицо,
	|		ВзносыЗаЗанятыхНаПодземныхИВредныхРаботах.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыЗаЗанятыхНаПодземныхИВредныхРаботах.РезультатПоДополнительномуТарифу,
	|		0
	|	ИЗ
	|		ВТЗаЗанятыхНаПодземныхИВредныхРаботах КАК ВзносыЗаЗанятыхНаПодземныхИВредныхРаботах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыЗаЗанятыхНаТяжелыхИПрочихРаботах.ФизЛицо,
	|		ВзносыЗаЗанятыхНаТяжелыхИПрочихРаботах.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыЗаЗанятыхНаТяжелыхИПрочихРаботах.РезультатПоДополнительномуТарифу
	|	ИЗ
	|		ВТЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ВзносыЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатПФРНакопительная - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНакопительнаяОборот, 0) КАК ПФРНакопительная,
	|	СуммыНарастающимИтогом.РезультатПФРСтраховая - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСтраховаяОборот, 0) КАК ПФРСтраховая,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносовНарастающимИтогом КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И Основная.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.Месяц = &парамМесяцРасчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ФФОМС - (ВЫРАЗИТЬ(Взносы.ФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ФСС - (ВЫРАЗИТЬ(Взносы.ФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРНакопительная
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ПФРНакопительная - (ВЫРАЗИТЬ(Взносы.ПФРНакопительная * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ПФРНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРНакопительная
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ПФРНакопительная * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРНакопительнаяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРСтраховая
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.ПФРСтраховая - (ВЫРАЗИТЬ(Взносы.ПФРСтраховая * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК ПФРСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.ПФРСтраховая
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.ПФРСтраховая * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПФРСтраховаяЕНВД,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ПФРНакопительная <> 0
	|			ИЛИ Взносы.ПФРСтраховая <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Взносы.Порядок";

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начислено.Взносов КАК ВзносовСводно
	|ИЗ
	|	ВТВзносыФССНесчастныеСлучаиСводно КАК Начислено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВзносовСводно) Тогда
		ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"ФССНесчастныеСлучаи", Выборка.ВзносовСводно, 2, "ФизЛицо");
	КонецЕсли;
	
	Возврат ВременнаяТаблица;
	
КонецФункции  // ПолучитьДанныеРасчетаЗа2013Год

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//	ОграничениеНаСотрудников - таблица значений с обязательной колонкой ФизЛицо
//  ДанныеОДоходах - таблица значений с колонками, совпадающими с полями рег-ра СтраховыеВзносыСведенияОДоходах
//
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2014Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	СведенияОДоходах.ДатаПолученияДохода,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	&парамТаблицаСотрудников КАК ТаблицаСотрудников
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Даты.ДатаПолученияДохода) КАК ДатаПолученияДохода
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
	|		И НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода
	|		И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|		И СведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода
	|	ИЗ
	|		ВТДанныеДокумента КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода) КАК Даты";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(ПериодРегистрации);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(?(ЗначениеЗаполнено(Выборка.ДатаПолученияДохода),Макс(Выборка.ДатаПолученияДохода, ПериодРегистрации), ПериодРегистрации));
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПоследнийМесяцРасчетногоПериода));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПоследнийМесяцРасчетногоПериода) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.УстановитьПараметр("парамКонецМесяцаРасчетногоПериода", КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода)).РазмерФСС;
	Запрос.УстановитьПараметр("ПредельнаяСумма", ?(ЗначениеЗаполнено(ПредельнаяСумма),ПредельнаяСумма,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= УчетнаяПолитикаНалоговыйУчет.ДатаРегистрацииИзменений)
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СрезПоследних(&парамКонецГода, ) КАК ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР + ТарифСтраховыхВзносовСрезПоследних.ФСС + ТарифСтраховыхВзносовСрезПоследних.ФФОМС + ТарифСтраховыхВзносовСрезПоследних.ТФОМС КАК СуммарныйТариф
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	НЕ ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК ИмеетПравоНаСтрахованиеПФР,
	|	НЕ ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК ИмеетПравоНаСтрахованиеФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС,
	|	ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) КАК ВидЗастрахованногоЛица
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= ГражданствоФизЛиц.ДатаРегистрацииИзменений)
	|				И (СписокСотрудников.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ВременноПребывающие.ПериодЗавершения < НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|					И ВременноПребывающие.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|			ИНАЧЕ ВременноПребывающие.ПринятПоДолгосрочномуДоговору
	|		КОНЕЦ, ЛОЖЬ) КАК ЕстьДолгосрочныйДоговор
	|ПОМЕСТИТЬ ВТПринятыеПоДолгосрочнымДоговорам
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ВременноПребывающие.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|			ПО Периоды.Период >= ВременноПребывающие.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= ВременноПребывающие.ДатаРегистрацииИзменений)
	|				И (СписокСотрудников.ФизЛицо = ВременноПребывающие.ФизЛицо)
	|				И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам КАК ВременноПребывающие
	|		ПО Периоды.ПериодРегистра = ВременноПребывающие.Период
	|			И Периоды.Физлицо = ВременноПребывающие.ФизЛицо
	|			И (ВременноПребывающие.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО Периоды.ПериодРегистра = СведенияОбИнвалидностиФизлиц.Период
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	КОНЕЦПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ОбособленноеПодразделение
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода),
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленныеСтраховыеВзносы.Период,
	|	ИсчисленныеСтраховыеВзносы.Регистратор,
	|	ИсчисленныеСтраховыеВзносы.Организация,
	|	ИсчисленныеСтраховыеВзносы.ФизЛицо,
	|	ИсчисленныеСтраховыеВзносы.ОбособленноеПодразделение,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоСуммарномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоСуммарномуТарифуЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФСС,
	|	ИсчисленныеСтраховыеВзносы.ФССЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФССНесчастныеСлучаи,
	|	ИсчисленныеСтраховыеВзносы.ФФОМС,
	|	ИсчисленныеСтраховыеВзносы.ФФОМСЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоДополнительномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРНаДоплатуКПенсииШахтерам,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК ИсчисленныеСтраховыеВзносы
	|ГДЕ
	|	ИсчисленныеСтраховыеВзносы.Организация = &парамГоловнаяОрганизация
	|	И ИсчисленныеСтраховыеВзносы.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И НЕ ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленные.Организация,
	|	СтраховыеВзносыИсчисленные.ФизЛицо,
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение,
	|	СтраховыеВзносыИсчисленные.ДатаПолученияДохода,
	|	СтраховыеВзносыИсчисленные.Период,
	|	СтраховыеВзносыИсчисленные.ФСС,
	|	СтраховыеВзносыИсчисленные.ФФОМС,
	|	СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу,
	|	СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу,
	|	СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	СтраховыеВзносыИсчисленные.ФССЕНВД,
	|	СтраховыеВзносыИсчисленные.ФФОМСЕНВД,
	|	СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД
	|ПОМЕСТИТЬ ВТДанныеВзносовРегистратора
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.Регистратор = &Регистратор
	|	И СтраховыеВзносыИсчисленные.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыИсчисленные.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СтраховыеВзносыИсчисленные.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И НЕ СтраховыеВзносыИсчисленные.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И СтраховыеВзносыИсчисленные.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	РанееИсчисленныеВзносы.Период,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот) КАК ПФРПоСуммарномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССЕНВДОборот) КАК ФССЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСЕНВДОборот) КАК ФФОМСЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот) КАК ПФРПоСуммарномуТарифуЕНВДОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|		РанееИсчисленныеВзносы.ФСС КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМС КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифуОборот,
	|		0 КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		0 КАК ПФРПоДополнительномуТарифуОборот,
	|		0 КАК ФССНесчастныеСлучаиОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ФССЕНВД КАК ФССЕНВДОборот,
	|		РанееИсчисленныеВзносы.ФФОМСЕНВД КАК ФФОМСЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРПоСуммарномуТарифуЕНВДОборот
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо,
	|		&парамКонецМесяцаРасчетногоПериода,
	|		0,
	|		0,
	|		0,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерам,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифу,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаи
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		КОНЕЦПЕРИОДА(СтраховыеВзносыИсчисленные.ДатаПолученияДохода, МЕСЯЦ),
	|		-СтраховыеВзносыИсчисленные.ФСС,
	|		-СтраховыеВзносыИсчисленные.ФФОМС,
	|		-СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу,
	|		0,
	|		0,
	|		0,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		-СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		-СтраховыеВзносыИсчисленные.ФССЕНВД,
	|		-СтраховыеВзносыИсчисленные.ФФОМСЕНВД,
	|		-СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД
	|	ИЗ
	|		ВТДанныеВзносовРегистратора КАК СтраховыеВзносыИсчисленные
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтраховыеВзносыИсчисленные.ФизЛицо,
	|		&парамКонецМесяцаРасчетногоПериода,
	|		0,
	|		0,
	|		0,
	|		-СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам,
	|		-СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу,
	|		-ВЫБОР
	|			КОГДА СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|				ТОГДА СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТДанныеВзносовРегистратора КАК СтраховыеВзносыИсчисленные) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо,
	|	РанееИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	Основная.Месяц КАК Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеПФР
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы)
	|					И ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			КОГДА Иностр.ВидЗастрахованногоЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами)
	|					И ПринятыеПоДолгосрочнымДоговорам.ЕстьДолгосрочныйДоговор
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФСС
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФОМС
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу,
	|	Основная.ОбособленноеПодразделение,
	|	Основная.ПериодРегистрации
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПринятыеПоДолгосрочнымДоговорам КАК ПринятыеПоДолгосрочнымДоговорам
	|			ПО Иностр.Физлицо = ПринятыеПоДолгосрочнымДоговорам.Физлицо
	|				И Иностр.Месяц = ПринятыеПоДолгосрочнымДоговорам.Месяц
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА Основная.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.КлассУсловийТруда,
	|	Основная.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	Основная.ПериодРегистрации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(СведенияОДоходах.БазаФОМС) КАК ЗаГодФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФОМС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФОМС,
	|	СУММА(СведенияОДоходах.БазаФСС) КАК ЗаГодФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФСС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГодФОМС - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГодФОМС - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФОМС, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПределФОМС,
	|	ВЫБОР
	|		КОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСумма >= 0
	|			ТОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСумма >= 0
	|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПревысившаяПределФСС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ОблагаемаяБаза.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ДоходыЗастрахованныхЛиц.Период, МЕСЯЦ) КАК Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК ЗаМесяц,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК ЗаМесяцФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК ЗаМесяцФОМС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФОМС) КАК ЗаМесяцФОМС,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПредел
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФОМС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФОМС = БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФОМС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФОМС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФОМС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТПревышениеДоходаФОМС
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделениеФОМС КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПределФОМС
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФОМС КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТПревышениеДоходаФСС
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПределФСС
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период,
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС
	|ПОМЕСТИТЬ ВТНеОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ПО Периоды.Период >= ДоходыЗастрахованныхЛиц.Период
	|ГДЕ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	СУММА((ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))) + ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0) * 0.1 КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РезультатПФРПоСуммарномуТарифу,
	|	СУММА(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2))) КАК РезультатФСС,
	|	СУММА(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФОМС - ЕСТЬNULL(ПревышениеДоходаФОМС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2))) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом
	|ИЗ
	|	ВТНеОграниченнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаПФР.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаФСС.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФОМС КАК ПревышениеДоходаФОМС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФОМС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФОМС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаФОМС.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоСуммарномуТарифу, 0) КАК РезультатПФРПоСуммарномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФСС, 0) КАК РезультатФСС,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФФОМС, 0) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоОсновномуТарифуНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.Период,
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФФОМС - (ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФСС - (ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРПоСуммарномуТарифу - (ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифуЕНВД
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифу КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|			И Взносы.Период = РаспределениеДоходовПоЕНВД.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|			И Взносы.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифыВзносов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо,
	|	ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	НарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|ИЗ
	|	ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4))
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф,
	|	ДоходыФизлиц.ФизЛицо,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	НарастающимИтогом.ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценки
	|ИЗ
	|	ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.14 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТВзносыПоДополнительномуТарифу
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяПоДополнительномуТарифу
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.067 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТВзносыДляШахтеров
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(18, 5))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(18, 5))) - МАКСИМУМ(ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0)) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|			И (РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	Начислено.ПериодРегистрации = &парамПериодРегистрации
	|	И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начислено.Взносов - РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаиСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) КАК Взносов
	|	ИЗ
	|		ВТДоходыЗастрахованныхЛиц КАК Начислено
	|	ГДЕ
	|		Начислено.ПериодРегистрации = &парамПериодРегистрации
	|		И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|		ИЗ
	|			ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ГДЕ
	|			РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.Период,
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифу) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФСС) КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМС) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМСЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМСЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФССЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФССЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифуЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифуЕНВД
	|ПОМЕСТИТЬ ВТСуммыВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифу КАК РезультатПФРПоСуммарномуТарифу,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатДляШахтеров,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ИсчисленоПоОсновномуТарифу.Период КАК Период,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМСЕНВД КАК РезультатФФОМСЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФССЕНВД КАК РезультатФССЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифуЕНВД КАК РезультатПФРПоСуммарномуТарифуЕНВД
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыПоДополнительномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыДляШахтеров КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах КАК ЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоРезультатамСпециальнойОценки.ФизЛицо,
	|		ПоРезультатамСпециальнойОценки.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТПоРезультатамСпециальнойОценки КАК ПоРезультатамСпециальнойОценки) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВсегоИсчислено.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.Период,
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот, 0) КАК ПФРПоСуммарномуТарифу,
	|	СуммыНарастающимИтогом.РезультатФССЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФССЕНВДОборот, 0) КАК ФССЕНВД,
	|	СуммыНарастающимИтогом.РезультатФФОМСЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСЕНВДОборот, 0) КАК ФФОМСЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифуЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот, 0) КАК ПФРПоСуммарномуТарифуЕНВД,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносов КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|			И СуммыНарастающимИтогом.Период = ИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период КАК ДатаПолученияДохода,
	|	Взносы.ФизЛицо,
	|	Взносы.ФФОМС КАК ФФОМС,
	|	Взносы.ФФОМСЕНВД КАК ФФОМСЕНВД,
	|	Взносы.ФСС КАК ФСС,
	|	Взносы.ФССЕНВД КАК ФССЕНВД,
	|	Взносы.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
	|	Взносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРПоСуммарномуТарифуЕНВД,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифу <> 0
	|			ИЛИ Взносы.ФССЕНВД <> 0
	|			ИЛИ Взносы.ФФОМСЕНВД <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифуЕНВД <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПолученияДохода,
	|	Взносы.Порядок";

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начислено.Взносов КАК ВзносовСводно
	|ИЗ
	|	ВТВзносыФССНесчастныеСлучаиСводно КАК Начислено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВзносовСводно) Тогда
		ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"ФССНесчастныеСлучаи", Выборка.ВзносовСводно, 2, "ФизЛицо, ДатаПолученияДохода");
	КонецЕсли;
	
	Возврат ВременнаяТаблица;
	
КонецФункции  // ПолучитьДанныеРасчетаЗа2014Год

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//	ОграничениеНаСотрудников - таблица значений с обязательной колонкой ФизЛицо
//  ДанныеОДоходах - таблица значений с колонками, совпадающими с полями рег-ра СтраховыеВзносыСведенияОДоходах
//
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2015Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета)
	
	Если ПериодРегистрации < ДатаСтрахованияВсехВременноПребывающих() Тогда
		Возврат ПолучитьДанныеРасчетаЗа2014Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета);
    КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	СведенияОДоходах.ДатаПолученияДохода,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	&парамТаблицаСотрудников КАК ТаблицаСотрудников
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Даты.ДатаПолученияДохода) КАК ДатаПолученияДохода
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
	|		И НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода
	|		И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|		И СведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода
	|	ИЗ
	|		ВТДанныеДокумента КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода) КАК Даты";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(ПериодРегистрации);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(?(ЗначениеЗаполнено(Выборка.ДатаПолученияДохода),Макс(Выборка.ДатаПолученияДохода, ПериодРегистрации), ПериодРегистрации));
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПоследнийМесяцРасчетногоПериода));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПоследнийМесяцРасчетногоПериода) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.УстановитьПараметр("парамКонецМесяцаРасчетногоПериода", КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	Запрос.УстановитьПараметр("ПредельнаяСуммаФСС", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерФСС),ПредельнаяСумма.РазмерФСС,0));
	Запрос.УстановитьПараметр("ПредельнаяСуммаПФР", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерПФР),ПредельнаяСумма.РазмерПФР,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= УчетнаяПолитикаНалоговыйУчет.ДатаРегистрацииИзменений)
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СрезПоследних(&парамКонецГода, ) КАК ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФССсИностранцев,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР + ТарифСтраховыхВзносовСрезПоследних.ФСС + ТарифСтраховыхВзносовСрезПоследних.ФФОМС + ТарифСтраховыхВзносовСрезПоследних.ТФОМС КАК СуммарныйТариф
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеПФР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФССкакИностранец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= ГражданствоФизЛиц.ДатаРегистрацииИзменений)
	|				И (СписокСотрудников.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО Периоды.ПериодРегистра = СведенияОбИнвалидностиФизлиц.Период
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	КОНЕЦПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ОбособленноеПодразделение
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода),
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленныеСтраховыеВзносы.Период,
	|	ИсчисленныеСтраховыеВзносы.Регистратор,
	|	ИсчисленныеСтраховыеВзносы.Организация,
	|	ИсчисленныеСтраховыеВзносы.ФизЛицо,
	|	ИсчисленныеСтраховыеВзносы.ОбособленноеПодразделение,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоСуммарномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоСуммарномуТарифуЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФСС,
	|	ИсчисленныеСтраховыеВзносы.ФССЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФССНесчастныеСлучаи,
	|	ИсчисленныеСтраховыеВзносы.ФФОМС,
	|	ИсчисленныеСтраховыеВзносы.ФФОМСЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоДополнительномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРНаДоплатуКПенсииШахтерам,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК ИсчисленныеСтраховыеВзносы
	|ГДЕ
	|	ИсчисленныеСтраховыеВзносы.Организация = &парамГоловнаяОрганизация
	|	И ИсчисленныеСтраховыеВзносы.Регистратор <> &Регистратор
	|	И ИсчисленныеСтраховыеВзносы.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И НЕ ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	РанееИсчисленныеВзносы.Период,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот) КАК ПФРПоСуммарномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССЕНВДОборот) КАК ФССЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСЕНВДОборот) КАК ФФОМСЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот) КАК ПФРПоСуммарномуТарифуЕНВДОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|		РанееИсчисленныеВзносы.ФСС КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМС КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифуОборот,
	|		0 КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		0 КАК ПФРПоДополнительномуТарифуОборот,
	|		0 КАК ФССНесчастныеСлучаиОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ФССЕНВД КАК ФССЕНВДОборот,
	|		РанееИсчисленныеВзносы.ФФОМСЕНВД КАК ФФОМСЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРПоСуммарномуТарифуЕНВДОборот
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо,
	|		&парамКонецМесяцаРасчетногоПериода,
	|		0,
	|		0,
	|		0,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерам,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифу,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаи
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо,
	|	РанееИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	Основная.Месяц КАК Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеПФР
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФСС
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФССкакИностранец
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССзаИностранцев,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФОМС
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу,
	|	Основная.ОбособленноеПодразделение,
	|	Основная.ПериодРегистрации
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА Основная.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.КлассУсловийТруда,
	|	Основная.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	Основная.ПериодРегистрации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев) КАК ЗаГодФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПределФСС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ОблагаемаяБаза.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ДоходыЗастрахованныхЛиц.Период, МЕСЯЦ) КАК Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК ЗаМесяц,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС + ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПредел
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА 0
	|			ИНАЧЕ СуммыПоМесяцам.СуммаПревысившаяПредел
	|		КОНЕЦ) КАК СуммаПревысившаяПредел,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА СуммыПоМесяцам.СуммаПревысившаяПредел
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПревысившаяПределЗаИностранцев
	|ПОМЕСТИТЬ ВТПревышениеДоходаФСС
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПределФСС
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК ДанныеОПравеНаПенсию
	|			ПО СуммыПоМесяцам.ФизЛицо = ДанныеОПравеНаПенсию.Физлицо
	|				И (МЕСЯЦ(СуммыПоМесяцам.Период) = ДанныеОПравеНаПенсию.Месяц)
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период,
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК БазаФССзаИностранцев
	|ПОМЕСТИТЬ ВТНеОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ПО Периоды.Период >= ДоходыЗастрахованныхЛиц.Период
	|ГДЕ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	СУММА((ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))) + ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0) * 0.1 КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РезультатПФРПоСуммарномуТарифу,
	|	СУММА((ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФССзаИностранцев - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПределЗаИностранцев, 0)) * ОсновнойТариф.ФССсИностранцев / 100 КАК ЧИСЛО(15, 2)))) КАК РезультатФСС,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаФОМС * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2))) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом
	|ИЗ
	|	ВТНеОграниченнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаПФР.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаФСС.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоСуммарномуТарифу, 0) КАК РезультатПФРПоСуммарномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФСС, 0) КАК РезультатФСС,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФФОМС, 0) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоОсновномуТарифуНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.Период,
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФФОМС - (ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФСС - (ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРПоСуммарномуТарифу - (ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифуЕНВД
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифу КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|			И Взносы.Период = РаспределениеДоходовПоЕНВД.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|			И Взносы.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифыВзносов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо,
	|	ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	НарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|ИЗ
	|	ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4))
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф,
	|	ДоходыФизлиц.ФизЛицо,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	НарастающимИтогом.ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценки
	|ИЗ
	|	ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.14 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТВзносыПоДополнительномуТарифу
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяПоДополнительномуТарифу
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	ВЫРАЗИТЬ(СУММА(ДоходыФизлиц.ОблагаемыйДоход) * 0.067 КАК ЧИСЛО(15, 2)) КАК РезультатПоДополнительномуТарифу
	|ПОМЕСТИТЬ ВТВзносыДляШахтеров
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК ДоходыФизлиц
	|ГДЕ
	|	ДоходыФизлиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|	И ДоходыФизлиц.ВходитВБазуПФР
	|	И НЕ ДоходыФизлиц.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(18, 5))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(18, 5))) - МАКСИМУМ(ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0)) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|			И (РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	Начислено.ПериодРегистрации = &парамПериодРегистрации
	|	И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Начислено.Взносов, 0) - ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаиСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) КАК Взносов
	|	ИЗ
	|		ВТДоходыЗастрахованныхЛиц КАК Начислено
	|	ГДЕ
	|		Начислено.ПериодРегистрации = &парамПериодРегистрации
	|		И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|		ИЗ
	|			ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ГДЕ
	|			РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.Период,
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифу) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФСС) КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМС) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМСЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМСЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФССЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФССЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифуЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифуЕНВД
	|ПОМЕСТИТЬ ВТСуммыВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифу КАК РезультатПФРПоСуммарномуТарифу,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатДляШахтеров,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ИсчисленоПоОсновномуТарифу.Период КАК Период,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМСЕНВД КАК РезультатФФОМСЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФССЕНВД КАК РезультатФССЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифуЕНВД КАК РезультатПФРПоСуммарномуТарифуЕНВД
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыПоДополнительномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыДляШахтеров КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах КАК ЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоРезультатамСпециальнойОценки.ФизЛицо,
	|		ПоРезультатамСпециальнойОценки.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.Период,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТПоРезультатамСпециальнойОценки КАК ПоРезультатамСпециальнойОценки) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВсегоИсчислено.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.Период,
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот, 0) КАК ПФРПоСуммарномуТарифу,
	|	СуммыНарастающимИтогом.РезультатФССЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФССЕНВДОборот, 0) КАК ФССЕНВД,
	|	СуммыНарастающимИтогом.РезультатФФОМСЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСЕНВДОборот, 0) КАК ФФОМСЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифуЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот, 0) КАК ПФРПоСуммарномуТарифуЕНВД,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносов КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|			И СуммыНарастающимИтогом.Период = ИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период КАК ДатаПолученияДохода,
	|	Взносы.ФизЛицо,
	|	Взносы.ФФОМС КАК ФФОМС,
	|	Взносы.ФФОМСЕНВД КАК ФФОМСЕНВД,
	|	Взносы.ФСС КАК ФСС,
	|	Взносы.ФССЕНВД КАК ФССЕНВД,
	|	Взносы.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
	|	Взносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРПоСуммарномуТарифуЕНВД,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифу <> 0
	|			ИЛИ Взносы.ФССЕНВД <> 0
	|			ИЛИ Взносы.ФФОМСЕНВД <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифуЕНВД <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПолученияДохода,
	|	Взносы.Порядок";

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начислено.Взносов КАК ВзносовСводно
	|ИЗ
	|	ВТВзносыФССНесчастныеСлучаиСводно КАК Начислено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВзносовСводно) Тогда
		ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"ФССНесчастныеСлучаи", Выборка.ВзносовСводно, 2, "ФизЛицо, ДатаПолученияДохода");
	Иначе
		Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
			СтрокаТЗ.ФССНесчастныеСлучаи = 0
		КонецЦикла;
	КонецЕсли;
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("ФСС");
	Ресурсы.Добавить("ФФОМС");
	Ресурсы.Добавить("ПФРПоСуммарномуТарифу");
	Ресурсы.Добавить("ФССЕНВД");
	Ресурсы.Добавить("ФФОМСЕНВД");
	Ресурсы.Добавить("ПФРПоСуммарномуТарифуЕНВД");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4");
	Ресурсы.Добавить("ПФРПоДополнительномуТарифу");
	Ресурсы.Добавить("ПФРНаДоплатуКПенсииШахтерам");
	Ресурсы.Добавить("ФССНесчастныеСлучаи");
	ТаблицаРезультатов = ВременнаяТаблица.СкопироватьКолонки();
	Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
		ЕстьДанныеВСтроке = Ложь;
		Для каждого ИмяРесурса Из Ресурсы Цикл
			ЕстьДанныеВСтроке = СтрокаТЗ[ИмяРесурса] <> 0;
			Если ЕстьДанныеВСтроке Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьДанныеВСтроке Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаРезультатов.Добавить(),СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультатов;
	
КонецФункции  // ПолучитьДанныеРасчетаЗа2015Год

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//	ОграничениеНаСотрудников - таблица значений с обязательной колонкой ФизЛицо
//  ДанныеОДоходах - таблица значений с колонками, совпадающими с полями рег-ра СтраховыеВзносыСведенияОДоходах
//
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2016Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета)
	
	Если ПериодРегистрации < ДатаВыделенияВзносовНаОПСсСуммПревышенияПредельнойВеличины() Тогда
		Возврат ПолучитьДанныеРасчетаЗа2015Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета);
    КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоПредыдущегоГода", ДобавитьМесяц(НачалоГода(ПериодРегистрации), -12));
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	СведенияОДоходах.ДатаПолученияДохода,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	&парамТаблицаСотрудников КАК ТаблицаСотрудников
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Даты.ДатаПолученияДохода) КАК ДатаПолученияДохода
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
	|		И НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода
	|		И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|		И СведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода
	|	ИЗ
	|		ВТДанныеДокумента КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода) КАК Даты";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(ПериодРегистрации);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(?(ЗначениеЗаполнено(Выборка.ДатаПолученияДохода),Макс(Выборка.ДатаПолученияДохода, ПериодРегистрации), ПериодРегистрации));
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПоследнийМесяцРасчетногоПериода));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПоследнийМесяцРасчетногоПериода) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.УстановитьПараметр("парамКонецМесяцаРасчетногоПериода", КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	Запрос.УстановитьПараметр("ПредельнаяСуммаФСС", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерФСС),ПредельнаяСумма.РазмерФСС,0));
	Запрос.УстановитьПараметр("ПредельнаяСуммаПФР", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерПФР),ПредельнаяСумма.РазмерПФР,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= УчетнаяПолитикаНалоговыйУчет.ДатаРегистрацииИзменений)
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СрезПоследних(&парамКонецГода, ) КАК ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФССсИностранцев,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР + ТарифСтраховыхВзносовСрезПоследних.ФСС + ТарифСтраховыхВзносовСрезПоследних.ФФОМС + ТарифСтраховыхВзносовСрезПоследних.ТФОМС КАК СуммарныйТариф
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеПФР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФССкакИностранец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= ГражданствоФизЛиц.ДатаРегистрацииИзменений)
	|				И (СписокСотрудников.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО Периоды.ПериодРегистра = СведенияОбИнвалидностиФизлиц.Период
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	КОНЕЦПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ОбособленноеПодразделение
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода),
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленныеСтраховыеВзносы.Период,
	|	ИсчисленныеСтраховыеВзносы.Регистратор,
	|	ИсчисленныеСтраховыеВзносы.Организация,
	|	ИсчисленныеСтраховыеВзносы.ФизЛицо,
	|	ИсчисленныеСтраховыеВзносы.ОбособленноеПодразделение,
	|	ИсчисленныеСтраховыеВзносы.ПФРДоПредельнойВеличины КАК ПФРПоСуммарномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРДоПредельнойВеличиныЕНВД КАК ПФРПоСуммарномуТарифуЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФСС,
	|	ИсчисленныеСтраховыеВзносы.ФССЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФССНесчастныеСлучаи,
	|	ИсчисленныеСтраховыеВзносы.ФФОМС,
	|	ИсчисленныеСтраховыеВзносы.ФФОМСЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоДополнительномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРНаДоплатуКПенсииШахтерам,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода,
	|	ИсчисленныеСтраховыеВзносы.ПФРСПревышения,
	|	ИсчисленныеСтраховыеВзносы.ПФРСПревышенияЕНВД
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК ИсчисленныеСтраховыеВзносы
	|ГДЕ
	|	ИсчисленныеСтраховыеВзносы.Организация = &парамГоловнаяОрганизация
	|	И ИсчисленныеСтраховыеВзносы.Регистратор <> &Регистратор
	|	И ИсчисленныеСтраховыеВзносы.Период МЕЖДУ &парамНачалоПредыдущегоГода И &парамКонецМесяцаПериодаРегистрации
	|	И ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И НЕ ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	РанееИсчисленныеВзносы.Период,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот) КАК ПФРПоСуммарномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот) КАК ПФРПоСуммарномуТарифуЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСПревышения) КАК ПФРСПревышения,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСПревышенияЕНВД) КАК ПФРСПревышенияЕНВД,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССЕНВДОборот) КАК ФССЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСЕНВДОборот) КАК ФФОМСЕНВДОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|		РанееИсчисленныеВзносы.ФСС КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМС КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифуОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРПоСуммарномуТарифуЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерам КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифу КАК ПФРПоДополнительномуТарифуОборот,
	|		0 КАК ФССНесчастныеСлучаиОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ФССЕНВД КАК ФССЕНВДОборот,
	|		РанееИсчисленныеВзносы.ФФОМСЕНВД КАК ФФОМСЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРСПревышения КАК ПФРСПревышения,
	|		РанееИсчисленныеВзносы.ПФРСПревышенияЕНВД КАК ПФРСПревышенияЕНВД
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо,
	|		&парамКонецМесяцаРасчетногоПериода,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаи
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	ГДЕ
	|		РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|		И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо,
	|	РанееИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	Основная.Месяц КАК Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.ОблагаетсяПоДополнительномуТарифу,
	|	Основная.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	Основная.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеПФР
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФСС
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФССкакИностранец
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССзаИностранцев,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФОМС
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу,
	|	Основная.ОбособленноеПодразделение,
	|	Основная.ПериодРегистрации
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА Основная.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.ОблагаетсяПоДополнительномуТарифу,
	|	Основная.КлассУсловийТруда,
	|	Основная.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	Основная.ПериодРегистрации,
	|	Основная.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев) КАК ЗаГодФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПределФСС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ОблагаемаяБаза.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ДоходыЗастрахованныхЛиц.Период, МЕСЯЦ) КАК Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК ЗаМесяц,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС + ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПредел
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА 0
	|			ИНАЧЕ СуммыПоМесяцам.СуммаПревысившаяПредел
	|		КОНЕЦ) КАК СуммаПревысившаяПредел,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА СуммыПоМесяцам.СуммаПревысившаяПредел
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПревысившаяПределЗаИностранцев
	|ПОМЕСТИТЬ ВТПревышениеДоходаФСС
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПределФСС
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК ДанныеОПравеНаПенсию
	|			ПО СуммыПоМесяцам.ФизЛицо = ДанныеОПравеНаПенсию.Физлицо
	|				И (МЕСЯЦ(СуммыПоМесяцам.Период) = ДанныеОПравеНаПенсию.Месяц)
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период,
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК БазаФССзаИностранцев,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыЗастрахованныхЛиц.ОблагаетсяПоДополнительномуТарифу
	|				ТОГДА ДоходыЗастрахованныхЛиц.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРПоДополнительномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыЗастрахованныхЛиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|				ТОГДА ДоходыЗастрахованныхЛиц.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРДляШахтеров
	|ПОМЕСТИТЬ ВТНеОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ПО Периоды.Период >= ДоходыЗастрахованныхЛиц.Период
	|ГДЕ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоСуммарномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0) * 0.1 КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСПревышения,
	|	СУММА((ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФССзаИностранцев - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПределЗаИностранцев, 0)) * ОсновнойТариф.ФССсИностранцев / 100 КАК ЧИСЛО(15, 2)))) КАК РезультатФСС,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаФОМС * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2))) КАК РезультатФФОМС,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаПФРПоДополнительномуТарифу * 0.14 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоДополнительномуТарифу,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаПФРДляШахтеров * 0.067 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоДополнительномуТарифуДляШахтеров
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом
	|ИЗ
	|	ВТНеОграниченнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаПФР.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаФСС.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоСуммарномуТарифу, 0) КАК РезультатПФРПоСуммарномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ПФРСПревышения - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.ПФРСПревышения, 0) КАК РезультатПФРСПревышения,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоДополнительномуТарифу, 0) КАК РезультатПоДополнительномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоДополнительномуТарифуДляШахтеров - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоДополнительномуТарифуДляШахтеров, 0) КАК РезультатПоДополнительномуТарифуДляШахтеров,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФСС, 0) КАК РезультатФСС,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФФОМС, 0) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоОсновномуТарифуНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.Период,
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФФОМС - (ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФСС - (ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРПоСуммарномуТарифу - (ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРСПревышения
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРСПревышения - (ВЫРАЗИТЬ(Взносы.РезультатПФРСПревышения * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРСПревышения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРСПревышения
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРСПревышения * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСПревышенияЕНВД
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифу КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|			И Взносы.Период = РаспределениеДоходовПоЕНВД.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|			И Взносы.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифыВзносов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо,
	|	ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	НарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|ИЗ
	|	ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4))
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф,
	|	ДоходыФизлиц.ФизЛицо,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	НарастающимИтогом.ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценки
	|ИЗ
	|	ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(18, 5))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(18, 5))) - МАКСИМУМ(ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0)) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|			И (РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	Начислено.ПериодРегистрации = &парамПериодРегистрации
	|	И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Начислено.Взносов, 0) - ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаиСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) КАК Взносов
	|	ИЗ
	|		ВТДоходыЗастрахованныхЛиц КАК Начислено
	|	ГДЕ
	|		Начислено.ПериодРегистрации = &парамПериодРегистрации
	|		И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|		ИЗ
	|			ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ГДЕ
	|			РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.Период,
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифу) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифуЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСПревышения) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСПревышения,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСПревышенияЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСПревышенияЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФСС) КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМС) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМСЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМСЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФССЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФССЕНВД
	|ПОМЕСТИТЬ ВТСуммыВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифу КАК РезультатПФРПоСуммарномуТарифу,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифуЕНВД КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСПревышения КАК РезультатПФРСПревышения,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСПревышенияЕНВД КАК РезультатПФРСПревышенияЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатДляШахтеров,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ИсчисленоПоОсновномуТарифу.Период КАК Период,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМСЕНВД КАК РезультатФФОМСЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФССЕНВД КАК РезультатФССЕНВД
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифуДляШахтеров,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах КАК ЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоРезультатамСпециальнойОценки.ФизЛицо,
	|		ПоРезультатамСпециальнойОценки.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТПоРезультатамСпециальнойОценки КАК ПоРезультатамСпециальнойОценки) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВсегоИсчислено.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.Период,
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатФССЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФССЕНВДОборот, 0) КАК ФССЕНВД,
	|	СуммыНарастающимИтогом.РезультатФФОМСЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСЕНВДОборот, 0) КАК ФФОМСЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот, 0) КАК ПФРПоСуммарномуТарифу,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифуЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот, 0) КАК ПФРПоСуммарномуТарифуЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРСПревышения - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСПревышения, 0) КАК ПФРСПревышения,
	|	СуммыНарастающимИтогом.РезультатПФРСПревышенияЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСПревышенияЕНВД, 0) КАК ПФРСПревышенияЕНВД,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносов КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|			И СуммыНарастающимИтогом.Период = ИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период КАК ДатаПолученияДохода,
	|	Взносы.ФизЛицо,
	|	Взносы.ФФОМС КАК ФФОМС,
	|	Взносы.ФФОМСЕНВД КАК ФФОМСЕНВД,
	|	Взносы.ФСС КАК ФСС,
	|	Взносы.ФССЕНВД КАК ФССЕНВД,
	|	Взносы.ПФРПоСуммарномуТарифу КАК ПФРДоПредельнойВеличины,
	|	Взносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРДоПредельнойВеличиныЕНВД,
	|	Взносы.ПФРСПревышения КАК ПФРСПревышения,
	|	Взносы.ПФРСПревышенияЕНВД КАК ПФРСПревышенияЕНВД,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ПФРСПревышения <> 0
	|			ИЛИ Взносы.ПФРСПревышенияЕНВД <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифу <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифуЕНВД <> 0
	|			ИЛИ Взносы.ФССЕНВД <> 0
	|			ИЛИ Взносы.ФФОМСЕНВД <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПолученияДохода,
	|	Взносы.Порядок";

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начислено.Взносов КАК ВзносовСводно
	|ИЗ
	|	ВТВзносыФССНесчастныеСлучаиСводно КАК Начислено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВзносовСводно) Тогда
		ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"ФССНесчастныеСлучаи", Выборка.ВзносовСводно, 2, "ФизЛицо, ДатаПолученияДохода");
	Иначе
		Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
			СтрокаТЗ.ФССНесчастныеСлучаи = 0
		КонецЦикла;
	КонецЕсли;
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("ФСС");
	Ресурсы.Добавить("ФФОМС");
	Ресурсы.Добавить("ПФРДоПредельнойВеличины");
	Ресурсы.Добавить("ПФРСПревышения");
	Ресурсы.Добавить("ФССЕНВД");
	Ресурсы.Добавить("ФФОМСЕНВД");
	Ресурсы.Добавить("ПФРДоПредельнойВеличиныЕНВД");
	Ресурсы.Добавить("ПФРСПревышенияЕНВД");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4");
	Ресурсы.Добавить("ПФРПоДополнительномуТарифу");
	Ресурсы.Добавить("ПФРНаДоплатуКПенсииШахтерам");
	Ресурсы.Добавить("ФССНесчастныеСлучаи");
	ТаблицаРезультатов = ВременнаяТаблица.СкопироватьКолонки();
	Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
		ЕстьДанныеВСтроке = Ложь;
		Для каждого ИмяРесурса Из Ресурсы Цикл
			ЕстьДанныеВСтроке = СтрокаТЗ[ИмяРесурса] <> 0;
			Если ЕстьДанныеВСтроке Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьДанныеВСтроке Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаРезультатов.Добавить(),СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультатов;
	
КонецФункции  // ПолучитьДанныеРасчета

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//	ОграничениеНаСотрудников - таблица значений с обязательной колонкой ФизЛицо
//  ДанныеОДоходах - таблица значений с колонками, совпадающими с полями рег-ра СтраховыеВзносыСведенияОДоходах
//
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчетаЗа2017Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета)
	
	Если ПериодРегистрации < ДатаПередачиАдминистрированияВзносовФНС() Тогда
		Возврат ПолучитьДанныеРасчетаЗа2016Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета);
    КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоПредыдущегоГода", ДобавитьМесяц(НачалоГода(ПериодРегистрации), -12));
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	СведенияОДоходах.ДатаПолученияДохода,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.Результат,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	&парамТаблицаСотрудников КАК ТаблицаСотрудников
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Даты.ДатаПолученияДохода) КАК ДатаПолученияДохода
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
	|		И НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода
	|		И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|		И СведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода
	|	ИЗ
	|		ВТДанныеДокумента КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода) КАК Даты";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(ПериодРегистрации);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(?(ЗначениеЗаполнено(Выборка.ДатаПолученияДохода),Макс(Выборка.ДатаПолученияДохода, ПериодРегистрации), ПериодРегистрации));
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПоследнийМесяцРасчетногоПериода));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПоследнийМесяцРасчетногоПериода) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	Запрос.УстановитьПараметр("парамКонецМесяцаРасчетногоПериода", КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	Запрос.УстановитьПараметр("ПредельнаяСуммаФСС", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерФСС),ПредельнаяСумма.РазмерФСС,0));
	Запрос.УстановитьПараметр("ПредельнаяСуммаПФР", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерПФР),ПредельнаяСумма.РазмерПФР,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= УчетнаяПолитикаНалоговыйУчет.ДатаРегистрацииИзменений)
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СрезПоследних(&парамКонецГода, ) КАК ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФССсИностранцев,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР + ТарифСтраховыхВзносовСрезПоследних.ФСС + ТарифСтраховыхВзносовСрезПоследних.ФФОМС + ТарифСтраховыхВзносовСрезПоследних.ТФОМС КАК СуммарныйТариф
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеПФР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФССкакИностранец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= ГражданствоФизЛиц.ДатаРегистрацииИзменений)
	|				И (СписокСотрудников.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО Периоды.ПериодРегистра = СведенияОбИнвалидностиФизлиц.Период
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	КОНЕЦПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.Результат,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ОбособленноеПодразделение
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода),
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	-СтраховыеВзносыСведенияОДоходах.Результат,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.Результат,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленныеСтраховыеВзносы.Период,
	|	ИсчисленныеСтраховыеВзносы.Регистратор,
	|	ИсчисленныеСтраховыеВзносы.Организация,
	|	ИсчисленныеСтраховыеВзносы.ФизЛицо,
	|	ИсчисленныеСтраховыеВзносы.ОбособленноеПодразделение,
	|	ИсчисленныеСтраховыеВзносы.ПФРДоПредельнойВеличины КАК ПФРПоСуммарномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРДоПредельнойВеличиныЕНВД КАК ПФРПоСуммарномуТарифуЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФСС,
	|	ИсчисленныеСтраховыеВзносы.ФССЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФССНесчастныеСлучаи,
	|	ИсчисленныеСтраховыеВзносы.ФФОМС,
	|	ИсчисленныеСтраховыеВзносы.ФФОМСЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоДополнительномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРНаДоплатуКПенсииШахтерам,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода,
	|	ИсчисленныеСтраховыеВзносы.ПФРСПревышения,
	|	ИсчисленныеСтраховыеВзносы.ПФРСПревышенияЕНВД
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК ИсчисленныеСтраховыеВзносы
	|ГДЕ
	|	ИсчисленныеСтраховыеВзносы.Организация = &парамГоловнаяОрганизация
	|	И ИсчисленныеСтраховыеВзносы.Регистратор <> &Регистратор
	|	И ИсчисленныеСтраховыеВзносы.Период МЕЖДУ &парамНачалоПредыдущегоГода И &парамКонецМесяцаПериодаРегистрации
	|	И ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И НЕ ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	РанееИсчисленныеВзносы.Период,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот) КАК ПФРПоСуммарномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот) КАК ПФРПоСуммарномуТарифуЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСПревышения) КАК ПФРСПревышения,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСПревышенияЕНВД) КАК ПФРСПревышенияЕНВД,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССЕНВДОборот) КАК ФССЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСЕНВДОборот) КАК ФФОМСЕНВДОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|		РанееИсчисленныеВзносы.ФСС КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМС КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифуОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРПоСуммарномуТарифуЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерам КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифу КАК ПФРПоДополнительномуТарифуОборот,
	|		0 КАК ФССНесчастныеСлучаиОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ФССЕНВД КАК ФССЕНВДОборот,
	|		РанееИсчисленныеВзносы.ФФОМСЕНВД КАК ФФОМСЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРСПревышения КАК ПФРСПревышения,
	|		РанееИсчисленныеВзносы.ПФРСПревышенияЕНВД КАК ПФРСПревышенияЕНВД
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо,
	|		&парамКонецМесяцаРасчетногоПериода,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаи
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	ГДЕ
	|		РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|		И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо,
	|	РанееИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	Основная.Месяц КАК Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.ОблагаетсяПоДополнительномуТарифу,
	|	Основная.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	Основная.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеПФР
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФСС
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФССкакИностранец
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССзаИностранцев,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФОМС
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС_НС
	|				ТОГДА ВЫБОР
	|						КОГДА Основная.ВходитВБазуФСС
	|							ТОГДА Основная.ОблагаемыйДоход
	|						ИНАЧЕ Основная.Результат
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС_НС
	|				ТОГДА ВЫБОР
	|						КОГДА Основная.ВходитВБазуФСС
	|							ТОГДА Основная.ОблагаемыйДоход
	|						ИНАЧЕ Основная.Результат
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу,
	|	Основная.ОбособленноеПодразделение,
	|	Основная.ПериодРегистрации
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА Основная.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.ОблагаетсяПоДополнительномуТарифу,
	|	Основная.КлассУсловийТруда,
	|	Основная.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	Основная.ПериодРегистрации,
	|	Основная.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев) КАК ЗаГодФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПределФСС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ОблагаемаяБаза.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ДоходыЗастрахованныхЛиц.Период, МЕСЯЦ) КАК Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК ЗаМесяц,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС + ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПредел
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА 0
	|			ИНАЧЕ СуммыПоМесяцам.СуммаПревысившаяПредел
	|		КОНЕЦ) КАК СуммаПревысившаяПредел,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА СуммыПоМесяцам.СуммаПревысившаяПредел
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПревысившаяПределЗаИностранцев
	|ПОМЕСТИТЬ ВТПревышениеДоходаФСС
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПределФСС
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК ДанныеОПравеНаПенсию
	|			ПО СуммыПоМесяцам.ФизЛицо = ДанныеОПравеНаПенсию.Физлицо
	|				И (МЕСЯЦ(СуммыПоМесяцам.Период) = ДанныеОПравеНаПенсию.Месяц)
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период,
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК БазаФССзаИностранцев,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыЗастрахованныхЛиц.ОблагаетсяПоДополнительномуТарифу
	|				ТОГДА ДоходыЗастрахованныхЛиц.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРПоДополнительномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыЗастрахованныхЛиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|				ТОГДА ДоходыЗастрахованныхЛиц.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРДляШахтеров
	|ПОМЕСТИТЬ ВТНеОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ПО Периоды.Период >= ДоходыЗастрахованныхЛиц.Период
	|ГДЕ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоСуммарномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0) * 0.1 КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСПревышения,
	|	СУММА((ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФССзаИностранцев - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПределЗаИностранцев, 0)) * ОсновнойТариф.ФССсИностранцев / 100 КАК ЧИСЛО(15, 2)))) КАК РезультатФСС,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаФОМС * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2))) КАК РезультатФФОМС,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаПФРПоДополнительномуТарифу * 0.14 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоДополнительномуТарифу,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаПФРДляШахтеров * 0.067 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоДополнительномуТарифуДляШахтеров
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом
	|ИЗ
	|	ВТНеОграниченнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаПФР.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаФСС.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоСуммарномуТарифу, 0) КАК РезультатПФРПоСуммарномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ПФРСПревышения - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.ПФРСПревышения, 0) КАК РезультатПФРСПревышения,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоДополнительномуТарифу, 0) КАК РезультатПоДополнительномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоДополнительномуТарифуДляШахтеров - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоДополнительномуТарифуДляШахтеров, 0) КАК РезультатПоДополнительномуТарифуДляШахтеров,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФСС, 0) КАК РезультатФСС,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФФОМС, 0) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоОсновномуТарифуНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.Период,
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФФОМС - (ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФСС - (ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРПоСуммарномуТарифу - (ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРСПревышения
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРСПревышения - (ВЫРАЗИТЬ(Взносы.РезультатПФРСПревышения * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРСПревышения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРСПревышения
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРСПревышения * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСПревышенияЕНВД
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифу КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|			И Взносы.Период = РаспределениеДоходовПоЕНВД.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|			И Взносы.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифыВзносов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо,
	|	ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	НарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|ИЗ
	|	ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4))
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф,
	|	ДоходыФизлиц.ФизЛицо,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	НарастающимИтогом.ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценки
	|ИЗ
	|	ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(18, 5))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(18, 5))) - МАКСИМУМ(ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0)) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|			И (РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	Начислено.ПериодРегистрации = &парамПериодРегистрации
	|	И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Начислено.Взносов, 0) - ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаиСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) КАК Взносов
	|	ИЗ
	|		ВТДоходыЗастрахованныхЛиц КАК Начислено
	|	ГДЕ
	|		Начислено.ПериодРегистрации = &парамПериодРегистрации
	|		И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|		ИЗ
	|			ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ГДЕ
	|			РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.Период,
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифу) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифуЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСПревышения) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСПревышения,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСПревышенияЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСПревышенияЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФСС) КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМС) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМСЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМСЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФССЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФССЕНВД
	|ПОМЕСТИТЬ ВТСуммыВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифу КАК РезультатПФРПоСуммарномуТарифу,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифуЕНВД КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСПревышения КАК РезультатПФРСПревышения,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСПревышенияЕНВД КАК РезультатПФРСПревышенияЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатДляШахтеров,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ИсчисленоПоОсновномуТарифу.Период КАК Период,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМСЕНВД КАК РезультатФФОМСЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФССЕНВД КАК РезультатФССЕНВД
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифуДляШахтеров,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах КАК ЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоРезультатамСпециальнойОценки.ФизЛицо,
	|		ПоРезультатамСпециальнойОценки.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТПоРезультатамСпециальнойОценки КАК ПоРезультатамСпециальнойОценки) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВсегоИсчислено.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.Период,
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатФССЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФССЕНВДОборот, 0) КАК ФССЕНВД,
	|	СуммыНарастающимИтогом.РезультатФФОМСЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСЕНВДОборот, 0) КАК ФФОМСЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот, 0) КАК ПФРПоСуммарномуТарифу,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифуЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот, 0) КАК ПФРПоСуммарномуТарифуЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРСПревышения - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСПревышения, 0) КАК ПФРСПревышения,
	|	СуммыНарастающимИтогом.РезультатПФРСПревышенияЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСПревышенияЕНВД, 0) КАК ПФРСПревышенияЕНВД,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносов КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|			И СуммыНарастающимИтогом.Период = ИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период КАК ДатаПолученияДохода,
	|	Взносы.ФизЛицо,
	|	Взносы.ФФОМС КАК ФФОМС,
	|	Взносы.ФФОМСЕНВД КАК ФФОМСЕНВД,
	|	Взносы.ФСС КАК ФСС,
	|	Взносы.ФССЕНВД КАК ФССЕНВД,
	|	Взносы.ПФРПоСуммарномуТарифу КАК ПФРДоПредельнойВеличины,
	|	Взносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРДоПредельнойВеличиныЕНВД,
	|	Взносы.ПФРСПревышения КАК ПФРСПревышения,
	|	Взносы.ПФРСПревышенияЕНВД КАК ПФРСПревышенияЕНВД,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ПФРСПревышения <> 0
	|			ИЛИ Взносы.ПФРСПревышенияЕНВД <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифу <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифуЕНВД <> 0
	|			ИЛИ Взносы.ФССЕНВД <> 0
	|			ИЛИ Взносы.ФФОМСЕНВД <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПолученияДохода,
	|	Взносы.Порядок";

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начислено.Взносов КАК ВзносовСводно
	|ИЗ
	|	ВТВзносыФССНесчастныеСлучаиСводно КАК Начислено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВзносовСводно) Тогда
		ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"ФССНесчастныеСлучаи", Выборка.ВзносовСводно, 2, "ФизЛицо, ДатаПолученияДохода");
	Иначе
		Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
			СтрокаТЗ.ФССНесчастныеСлучаи = 0
		КонецЦикла;
	КонецЕсли;
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("ФСС");
	Ресурсы.Добавить("ФФОМС");
	Ресурсы.Добавить("ПФРДоПредельнойВеличины");
	Ресурсы.Добавить("ПФРСПревышения");
	Ресурсы.Добавить("ФССЕНВД");
	Ресурсы.Добавить("ФФОМСЕНВД");
	Ресурсы.Добавить("ПФРДоПредельнойВеличиныЕНВД");
	Ресурсы.Добавить("ПФРСПревышенияЕНВД");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4");
	Ресурсы.Добавить("ПФРПоДополнительномуТарифу");
	Ресурсы.Добавить("ПФРНаДоплатуКПенсииШахтерам");
	Ресурсы.Добавить("ФССНесчастныеСлучаи");
	ТаблицаРезультатов = ВременнаяТаблица.СкопироватьКолонки();
	Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
		ЕстьДанныеВСтроке = Ложь;
		Для каждого ИмяРесурса Из Ресурсы Цикл
			ЕстьДанныеВСтроке = СтрокаТЗ[ИмяРесурса] <> 0;
			Если ЕстьДанныеВСтроке Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьДанныеВСтроке Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаРезультатов.Добавить(),СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультатов;
	
КонецФункции  // ПолучитьДанныеРасчета

// Предназначена для получения выборки из запроса с данными расчета 
// По текущему регистратору получает 
//    	данные о начисленной зарплате в разрезе кодов дохода 
// 		данные об инвалидности физлиц помесячно
//		присоединяет данные о скидках к доходам
//
// Параметры:
//	ОграничениеНаСотрудников - таблица значений с обязательной колонкой ФизЛицо
//  ДанныеОДоходах - таблица значений с колонками, совпадающими с полями рег-ра СтраховыеВзносыСведенияОДоходах
//
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьДанныеРасчета(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета)
	
	Если ПериодРегистрации < '20180101' Тогда
		Возврат ПолучитьДанныеРасчетаЗа2017Год(Ссылка, ПериодРегистрации, ГоловнаяОрганизация, Организация, ОграничениеНаСотрудников, ДанныеОДоходах, ДатаРасчета);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамОбособленноеПодразделение", Организация);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("парамНачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамНачалоПредыдущегоГода", ДобавитьМесяц(НачалоГода(ПериодРегистрации), -12));
	Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамКонецМесяцаПериодаРегистрации", КонецМесяца(ДатаРасчета));
	Запрос.УстановитьПараметр("парамГодРасчета", Год(ПериодРегистрации));
	
	Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
	Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
	
	// ---------------------------------------------------------------------------
	// тексты запросов
	//
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ОбособленноеПодразделение,
	|	СведенияОДоходах.Период,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	СведенияОДоходах.ДатаПолученияДохода,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.Результат,
	|	СведенияОДоходах.ОблагаетсяЕНВД
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&ДанныеОДоходах КАК СведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТСписокСотрудников
	|ИЗ
	|	&парамТаблицаСотрудников КАК ТаблицаСотрудников
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Даты.ДатаПолученияДохода) КАК ДатаПолученияДохода
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода
	|	ИЗ
	|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
	|		И НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода
	|		И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|		И СведенияОДоходах.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТСписокСотрудников КАК СписокСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СведенияОДоходах.ДатаПолученияДохода
	|	ИЗ
	|		ВТДанныеДокумента КАК СведенияОДоходах
	|	ГДЕ
	|		НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, ГОД) = &парамНачалоГода) КАК Даты";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(ПериодРегистрации);
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПоследнийМесяцРасчетногоПериода = КонецМесяца(?(ЗначениеЗаполнено(Выборка.ДатаПолученияДохода),Макс(Выборка.ДатаПолученияДохода, ПериодРегистрации), ПериодРегистрации));
	КонецЕсли;
	
	// Периоды
	// Таблица список периодов
	// Поля:
	//		Период
	// Описание:
	//  список периодов - первые даты месяцев с начала года по "текущий" для запроса период
	//
	
	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(НачалоГода(ПоследнийМесяцРасчетногоПериода));
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По Месяц(ПоследнийМесяцРасчетногоПериода) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
		ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("парамКонецМесяцаРасчетногоПериода", КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода));
	Запрос.УстановитьПараметр("ПредельнаяСуммаФСС", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерФСС),ПредельнаяСумма.РазмерФСС,0));
	Запрос.УстановитьПараметр("ПредельнаяСуммаПФР", ?(ЗначениеЗаполнено(ПредельнаяСумма.РазмерПФР),ПредельнаяСумма.РазмерПФР,0));
	Ставка = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.ПолучитьПоследнее(КонецМесяца(ПоследнийМесяцРасчетногоПериода), Новый Структура("Организация", Организация)).Ставка;
	Запрос.УстановитьПараметр("СтавкаВзносаФСС_НС_ПЗ", Ставка / 100);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТИспользуемыеТарифы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= УчетнаяПолитикаНалоговыйУчет.ДатаРегистрацииИзменений)
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И (УчетнаяПолитикаНалоговыйУчет.Организация = &парамГоловнаяОрганизация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних.ЗаЗанятыхНаТяжелыхИПрочихРаботах
	|ПОМЕСТИТЬ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
	|ИЗ
	|	РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.СрезПоследних(&парамКонецГода, ) КАК ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсиейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТарифСтраховыхВзносовСрезПоследних.ВидТарифа КАК ВидТарифа,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФРНакопительная,
	|	ТарифСтраховыхВзносовСрезПоследних.ФСС,
	|	ТарифСтраховыхВзносовСрезПоследних.ФССсИностранцев,
	|	ТарифСтраховыхВзносовСрезПоследних.ФФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ТФОМС,
	|	ТарифСтраховыхВзносовСрезПоследних.ПФР + ТарифСтраховыхВзносовСрезПоследних.ФСС + ТарифСтраховыхВзносовСрезПоследних.ФФОМС + ТарифСтраховыхВзносовСрезПоследних.ТФОМС КАК СуммарныйТариф
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&парамКонецГода, ) КАК ТарифСтраховыхВзносовСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	Периоды.Физлицо КАК Физлицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыИзЕАЭС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеПФР,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыПризнанныеБеженцами), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФССкакИностранец,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ГражданствоФизЛиц.ВидЗастрахованногоЛица, ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ)) В (ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыНестрахуемые), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцыСтрахуемыеФСС), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыПостоянноПроживающие), ЗНАЧЕНИЕ(Перечисление.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВысококвалифицированныеСпециалистыВременноПроживающие))
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИмеетПравоНаСтрахованиеФОМС
	|ПОМЕСТИТЬ ВТДанныеОПравеНаПенсию
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СписокСотрудников.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокСотрудников КАК СписокСотрудников
	|			ПО (ИСТИНА)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|			ПО Периоды.Период >= ГражданствоФизЛиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= ГражданствоФизЛиц.ДатаРегистрацииИзменений)
	|				И (СписокСотрудников.ФизЛицо = ГражданствоФизЛиц.ФизЛицо)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СписокСотрудников.ФизЛицо,
	|		Периоды.Период) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО Периоды.ПериодРегистра = ГражданствоФизЛиц.Период
	|			И Периоды.Физлицо = ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|	СведенияОбИнвалидностиФизлиц.Период КАК Период,
	|	СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений,
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|ПОМЕСТИТЬ ВТ_СведенияОбИнвалидности
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Физлицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МЕСЯЦ(Периоды.Период) КАК Месяц,
	|	СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТДанныеОбИнвалидности
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И (&парамКонецМесяцаПериодаРегистрации >= СведенияОбИнвалидностиФизлиц.ДатаРегистрацииИзменений)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СведенияОбИнвалидности КАК СведенияОбИнвалидностиФизлиц
	|		ПО Периоды.ПериодРегистра = СведенияОбИнвалидностиФизлиц.Период
	|			И Периоды.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|			И (СведенияОбИнвалидностиФизлиц.Инвалидность)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	МЕСЯЦ(СведенияОДоходах.ДатаПолученияДохода) КАК Месяц,
	|	КОНЕЦПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВходитВБазуПФР,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС КАК ВходитВБазуФСС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС КАК ВходитВБазуФСС_НС,
	|	СведенияОДоходах.ВидДохода.ВходитВБазуФОМС КАК ВходитВБазуФОМС,
	|	СведенияОДоходах.Результат - СведенияОДоходах.Скидка КАК ОблагаемыйДоход,
	|	СведенияОДоходах.Результат,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ОбособленноеПодразделение
	|ПОМЕСТИТЬ ВТДоходыПоФизлицамМесяцам
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	МЕСЯЦ(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода),
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	-СтраховыеВзносыСведенияОДоходах.Результат + СтраховыеВзносыСведенияОДоходах.Скидка,
	|	-СтраховыеВзносыСведенияОДоходах.Результат,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И СтраховыеВзносыСведенияОДоходах.Период <= &парамКонецМесяцаПериодаРегистрации
	|	И СтраховыеВзносыСведенияОДоходах.Регистратор = &Регистратор
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &парамГоловнаяОрганизация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.Месяц,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ),
	|	СтраховыеВзносыСведенияОДоходах.Период,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС_НС,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаемыйДоход,
	|	СтраховыеВзносыСведенияОДоходах.Результат,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение
	|ИЗ
	|	ВТДанныеДокумента КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА СведенияОДоходах.ВходитВБазуПФР
	|					ИЛИ СведенияОДоходах.ВходитВБазуФОМС
	|				ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленныеСтраховыеВзносы.Период,
	|	ИсчисленныеСтраховыеВзносы.Регистратор,
	|	ИсчисленныеСтраховыеВзносы.Организация,
	|	ИсчисленныеСтраховыеВзносы.ФизЛицо,
	|	ИсчисленныеСтраховыеВзносы.ОбособленноеПодразделение,
	|	ИсчисленныеСтраховыеВзносы.ПФРДоПредельнойВеличины КАК ПФРПоСуммарномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРДоПредельнойВеличиныЕНВД КАК ПФРПоСуммарномуТарифуЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФСС,
	|	ИсчисленныеСтраховыеВзносы.ФССЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ФССНесчастныеСлучаи,
	|	ИсчисленныеСтраховыеВзносы.ФФОМС,
	|	ИсчисленныеСтраховыеВзносы.ФФОМСЕНВД,
	|	ИсчисленныеСтраховыеВзносы.ПФРПоДополнительномуТарифу,
	|	ИсчисленныеСтраховыеВзносы.ПФРНаДоплатуКПенсииШахтерам,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ИсчисленныеСтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода,
	|	ИсчисленныеСтраховыеВзносы.ПФРСПревышения,
	|	ИсчисленныеСтраховыеВзносы.ПФРСПревышенияЕНВД
	|ПОМЕСТИТЬ ВТДанныеУчетаВзносов
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК ИсчисленныеСтраховыеВзносы
	|ГДЕ
	|	ИсчисленныеСтраховыеВзносы.Организация = &парамГоловнаяОрганизация
	|	И ИсчисленныеСтраховыеВзносы.Регистратор <> &Регистратор
	|	И ИсчисленныеСтраховыеВзносы.Период МЕЖДУ &парамНачалоПредыдущегоГода И &парамКонецМесяцаПериодаРегистрации
	|	И ИсчисленныеСтраховыеВзносы.ДатаПолученияДохода МЕЖДУ &парамНачалоГода И &парамКонецМесяцаРасчетногоПериода
	|	И НЕ ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|	И ИсчисленныеСтраховыеВзносы.ФизЛицо В
	|			(ВЫБРАТЬ
	|				СписокСотрудников.ФизЛицо
	|			ИЗ
	|				ВТСписокСотрудников КАК СписокСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|	РанееИсчисленныеВзносы.Период,
	|	СУММА(РанееИсчисленныеВзносы.ФССОборот) КАК ФССОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСОборот) КАК ФФОМСОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот) КАК ПФРПоСуммарномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот) КАК ПФРПоСуммарномуТарифуЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСПревышения) КАК ПФРСПревышения,
	|	СУММА(РанееИсчисленныеВзносы.ПФРСПревышенияЕНВД) КАК ПФРСПревышенияЕНВД,
	|	СУММА(РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот) КАК ПФРПоДополнительномуТарифуОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот) КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|	СУММА(РанееИсчисленныеВзносы.ФССЕНВДОборот) КАК ФССЕНВДОборот,
	|	СУММА(РанееИсчисленныеВзносы.ФФОМСЕНВДОборот) КАК ФФОМСЕНВДОборот
	|ПОМЕСТИТЬ ВТРанееИсчисленныеВзносы
	|ИЗ
	|	(ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо КАК ФизЛицо,
	|		КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.ДатаПолученияДохода, МЕСЯЦ) КАК Период,
	|		РанееИсчисленныеВзносы.ФСС КАК ФССОборот,
	|		РанееИсчисленныеВзносы.ФФОМС КАК ФФОМСОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифуОборот,
	|		РанееИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРПоСуммарномуТарифуЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерам КАК ПФРНаДоплатуКПенсииШахтерамОборот,
	|		РанееИсчисленныеВзносы.ПФРПоДополнительномуТарифу КАК ПФРПоДополнительномуТарифуОборот,
	|		0 КАК ФССНесчастныеСлучаиОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот,
	|		РанееИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот,
	|		РанееИсчисленныеВзносы.ФССЕНВД КАК ФССЕНВДОборот,
	|		РанееИсчисленныеВзносы.ФФОМСЕНВД КАК ФФОМСЕНВДОборот,
	|		РанееИсчисленныеВзносы.ПФРСПревышения КАК ПФРСПревышения,
	|		РанееИсчисленныеВзносы.ПФРСПревышенияЕНВД КАК ПФРСПревышенияЕНВД
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РанееИсчисленныеВзносы.ФизЛицо,
	|		&парамКонецМесяцаРасчетногоПериода,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|					И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода
	|				ТОГДА РанееИсчисленныеВзносы.ФССНесчастныеСлучаи
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		ВТДанныеУчетаВзносов КАК РанееИсчисленныеВзносы
	|	ГДЕ
	|		РанееИсчисленныеВзносы.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|		И КОНЕЦПЕРИОДА(РанееИсчисленныеВзносы.Период, МЕСЯЦ) = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|
	|СГРУППИРОВАТЬ ПО
	|	РанееИсчисленныеВзносы.ФизЛицо,
	|	РанееИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	Основная.Месяц КАК Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.ОблагаетсяПоДополнительномуТарифу,
	|	Основная.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	Основная.КлассУсловийТруда,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ПустаяСсылка)
	|			ТОГДА Основная.ЛьготныйТерриториальныйТариф
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеПФР
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФСС
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФССкакИностранец
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССзаИностранцев,
	|	СУММА(ВЫБОР
	|			КОГДА Иностр.ИмеетПравоНаСтрахованиеФОМС
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА (Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|					ИЛИ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
	|					И Основная.ВходитВБазуФСС_НС
	|				ТОГДА ВЫБОР
	|						КОГДА Основная.ВходитВБазуФСС
	|							ТОГДА Основная.ОблагаемыйДоход
	|						ИНАЧЕ Основная.Результат
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСИнвалида,
	|	СУММА(ВЫБОР
	|			КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА 0
	|			КОГДА ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|				ТОГДА 0
	|			КОГДА Основная.ВходитВБазуФСС_НС
	|				ТОГДА ВЫБОР
	|						КОГДА Основная.ВходитВБазуФСС
	|							ТОГДА Основная.ОблагаемыйДоход
	|						ИНАЧЕ Основная.Результат
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС_НСПоОсновномуТарифу,
	|	Основная.ОбособленноеПодразделение,
	|	Основная.ПериодРегистрации
	|ПОМЕСТИТЬ ВТДоходыЗастрахованныхЛиц
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК Иностр
	|		ПО Основная.ФизЛицо = Иностр.Физлицо
	|			И Основная.Месяц = Иностр.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОбИнвалидности КАК Инвалид
	|		ПО Основная.ФизЛицо = Инвалид.Физлицо
	|			И Основная.Месяц = Инвалид.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользуемыеТарифы КАК ИспользуемыеТарифы
	|		ПО Основная.Месяц = ИспользуемыеТарифы.Месяц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО (ВЫБОР
	|				КОГДА Основная.ЯвляетсяДоходомФармацевта
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|				КОГДА Основная.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ПустаяСсылка)
	|					ТОГДА Основная.ЛьготныйТерриториальныйТариф
	|				КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|				ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|			КОНЕЦ = ОписаниеТарифов.ВидТарифа)
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Месяц,
	|	Основная.Период,
	|	Основная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Основная.ОблагаетсяПоДополнительномуТарифу,
	|	Основная.КлассУсловийТруда,
	|	Основная.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Инвалид.Физлицо ЕСТЬ НЕ NULL 
	|				И ОписаниеТарифов.ВыделятьДоходыИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|		КОГДА Основная.ЯвляетсяДоходомФармацевта
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляФармацевтовАптек)
	|		КОГДА Основная.ЛьготныйТерриториальныйТариф <> ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ПустаяСсылка)
	|			ТОГДА Основная.ЛьготныйТерриториальныйТариф
	|		КОГДА Основная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
	|		ИНАЧЕ ИспользуемыеТарифы.ВидТарифаСтраховыхВзносов
	|	КОНЕЦ,
	|	Основная.ПериодРегистрации,
	|	Основная.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Месяц,
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
	|	СУММА(СведенияОДоходах.БазаПФР) КАК ЗаГод,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяц,
	|	СУММА(СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев) КАК ЗаГодФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.Период
	|				ТОГДА СведенияОДоходах.БазаФСС + СведенияОДоходах.БазаФССзаИностранцев
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК СведенияОДоходах
	|		ПО (СведенияОДоходах.Период МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаПФР = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГод - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - &ПредельнаяСуммаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	ВЫБОР
	|		КОГДА &ПредельнаяСуммаФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ОблагаемаяБаза.ЗаГодФСС - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ - ВЫБОР
	|				КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС >= 0
	|					ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГодФСС, 0) - &ПредельнаяСуммаФСС
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПревысившаяПределФСС
	|ПОМЕСТИТЬ ВТБазаПревышенияДохода
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
	|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ОблагаемаяБаза.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ДоходыЗастрахованныхЛиц.Период, МЕСЯЦ) КАК Период,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК ЗаМесяц,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС + ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.Период,
	|	ДоходыЗастрахованныхЛиц.ОбособленноеПодразделение,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц,
	|	МАКСИМУМ(СведенияОДоходах.ЗаМесяцФСС) КАК ЗаМесяцФСС
	|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
	|ИЗ
	|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(СуммыПоМесяцам.СуммаПревысившаяПредел) КАК СуммаПревысившаяПредел
	|ПОМЕСТИТЬ ВТПревышениеДохода
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПредел
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.Период КАК Период,
	|	&парамОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазыФСС
	|ИЗ
	|	ВТМаксБазаЗаМесяц КАК СведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
	|			И СведенияОДоходах.ЗаМесяцФСС = БазаЗаМесяцПоОбособленным.ЗаМесяцФСС
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период,
	|	ОбособленноеПодразделение,
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	ОблагаемаяБаза.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС = 0
	|				ИЛИ ОблагаемаяБаза.ЗаМесяцФСС = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПределФСС КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяцФСС КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СуммаПревысившаяПредел,
	|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
	|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделениеФСС
	|ИЗ
	|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
	|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
	|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
	|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
	|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
	|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
	|ГДЕ
	|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА 0
	|			ИНАЧЕ СуммыПоМесяцам.СуммаПревысившаяПредел
	|		КОНЕЦ) КАК СуммаПревысившаяПредел,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеОПравеНаПенсию.ИмеетПравоНаСтрахованиеФССкакИностранец
	|				ТОГДА СуммыПоМесяцам.СуммаПревысившаяПредел
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПревысившаяПределЗаИностранцев
	|ПОМЕСТИТЬ ВТПревышениеДоходаФСС
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо КАК ФизЛицо,
	|			Превышение.Период КАК Период,
	|			Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел,
	|			Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
	|			Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение
	|		ИЗ
	|			ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Превышение.ФизЛицо,
	|			Превышение.Период,
	|			Превышение.СуммаПревысившаяПредел,
	|			ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
	|			ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				Превышение.ФизЛицо КАК ФизЛицо,
	|				Превышение.Период КАК Период,
	|				-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
	|			ИЗ
	|				ВТПревышениеДоходаПоОбособленноеПодразделениеФСС КАК Превышение
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				Превышение.ФизЛицо,
	|				Превышение.Период,
	|				Превышение.СуммаПревысившаяПределФСС
	|			ИЗ
	|				ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазыФСС КАК ОбособленноеПодразделениеДляОкругления
	|				ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
	|					И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период) КАК СуммыПоМесяцам
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеОПравеНаПенсию КАК ДанныеОПравеНаПенсию
	|			ПО СуммыПоМесяцам.ФизЛицо = ДанныеОПравеНаПенсию.Физлицо
	|				И (МЕСЯЦ(СуммыПоМесяцам.Период) = ДанныеОПравеНаПенсию.Месяц)
	|		ПО Периоды.Период >= СуммыПоМесяцам.Период
	|			И (СуммыПоМесяцам.ОбособленноеПодразделение = &парамОбособленноеПодразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СуммыПоМесяцам.ФизЛицо,
	|	СуммыПоМесяцам.ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период,
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаПФР) КАК БазаПФР,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФСС) КАК БазаФСС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФОМС) КАК БазаФОМС,
	|	СУММА(ДоходыЗастрахованныхЛиц.БазаФССзаИностранцев) КАК БазаФССзаИностранцев,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыЗастрахованныхЛиц.ОблагаетсяПоДополнительномуТарифу
	|				ТОГДА ДоходыЗастрахованныхЛиц.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРПоДополнительномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА ДоходыЗастрахованныхЛиц.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|				ТОГДА ДоходыЗастрахованныхЛиц.БазаПФР
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРДляШахтеров
	|ПОМЕСТИТЬ ВТНеОграниченнаяОблагаемаяБаза
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыЗастрахованныхЛиц
	|		ПО Периоды.Период >= ДоходыЗастрахованныхЛиц.Период
	|ГДЕ
	|	ДоходыЗастрахованныхЛиц.ФизЛицо ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыЗастрахованныхЛиц.ФизЛицо,
	|	ДоходыЗастрахованныхЛиц.ВидТарифаСтраховыхВзносов,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаПФР - ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ПФР / 100 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоСуммарномуТарифу,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ОписаниеТарифов.НачислятьВзносыНаСуммыПревышающиеПредельную, ЛОЖЬ)
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ПревышениеДоходаПФР.СуммаПревысившаяПредел, 0) * 0.1 КАК ЧИСЛО(15, 2))
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПФРСПревышения,
	|	СУММА((ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФСС - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПредел, 0)) * ОсновнойТариф.ФСС / 100 КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ((НеОграниченнаяОблагаемаяБаза.БазаФССзаИностранцев - ЕСТЬNULL(ПревышениеДоходаФСС.СуммаПревысившаяПределЗаИностранцев, 0)) * ОсновнойТариф.ФССсИностранцев / 100 КАК ЧИСЛО(15, 2)))) КАК РезультатФСС,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаФОМС * ОсновнойТариф.ФФОМС / 100 КАК ЧИСЛО(15, 2))) КАК РезультатФФОМС,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаПФРПоДополнительномуТарифу * 0.14 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоДополнительномуТарифу,
	|	СУММА(ВЫРАЗИТЬ(НеОграниченнаяОблагаемаяБаза.БазаПФРДляШахтеров * 0.067 КАК ЧИСЛО(15, 2))) КАК РезультатПФРПоДополнительномуТарифуДляШахтеров
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом
	|ИЗ
	|	ВТНеОграниченнаяОблагаемаяБаза КАК НеОграниченнаяОблагаемаяБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасширенноеОписаниеТарифов КАК ОписаниеТарифов
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОписаниеТарифов.ВидТарифа
	|			И (ОписаниеТарифов.РасчетныйПериод = &парамГодРасчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ОсновнойТариф
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ОсновнойТариф.ВидТарифа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаПФР.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДоходаФСС КАК ПревышениеДоходаФСС
	|		ПО НеОграниченнаяОблагаемаяБаза.ВидТарифаСтраховыхВзносов = ПревышениеДоходаФСС.ВидТарифаСтраховыхВзносов
	|			И НеОграниченнаяОблагаемаяБаза.ФизЛицо = ПревышениеДоходаФСС.ФизЛицо
	|			И НеОграниченнаяОблагаемаяБаза.Период = ПревышениеДоходаФСС.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НеОграниченнаяОблагаемаяБаза.Период,
	|	НеОграниченнаяОблагаемаяБаза.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоСуммарномуТарифу, 0) КАК РезультатПФРПоСуммарномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ПФРСПревышения - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.ПФРСПревышения, 0) КАК РезультатПФРСПревышения,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоДополнительномуТарифу, 0) КАК РезультатПоДополнительномуТарифу,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатПФРПоДополнительномуТарифуДляШахтеров - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатПФРПоДополнительномуТарифуДляШахтеров, 0) КАК РезультатПоДополнительномуТарифуДляШахтеров,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФСС, 0) КАК РезультатФСС,
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатФФОМС, 0) КАК РезультатФФОМС
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифу
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоОсновномуТарифуНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоОсновномуТарифуНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(ИсчисленоПоОсновномуТарифуНарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсчисленоПоОсновномуТарифуНарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.Период,
	|	Основная.ФизЛицо КАК ФизЛицо,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФР,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФСС,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМС,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуПФР
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаПФРЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФСС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФССЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА Основная.ОблагаетсяЕНВД
	|					И Основная.ВходитВБазуФОМС
	|				ТОГДА Основная.ОблагаемыйДоход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаФОМСЕНВД
	|ПОМЕСТИТЬ ВТРаспределениеДоходовПоЕНВД
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК Основная
	|ГДЕ
	|	НЕ Основная.ФизЛицо В
	|				(ВЫБРАТЬ
	|					СписокСотрудников.ФизЛицо
	|				ИЗ
	|					ВТФизлицаБезОблагаемойБазы КАК СписокСотрудников)
	|
	|СГРУППИРОВАТЬ ПО
	|	Основная.ФизЛицо,
	|	Основная.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА СУММА(ВЫБОР
	|						КОГДА СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) > 0
	|				И СУММА(ВЫБОР
	|						КОГДА НЕ СведенияОДоходах.ОблагаетсяЕНВД
	|							ТОГДА СведенияОДоходах.ОблагаемыйДоход
	|						ИНАЧЕ 0
	|					КОНЕЦ) = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ТолькоЕНВД,
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|ПОМЕСТИТЬ ВТВидыДеятельности
	|ИЗ
	|	ВТДоходыПоФизлицамМесяцам КАК СведенияОДоходах
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	Взносы.ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФФОМС - (ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФФОМС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФФОМС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФФОМС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФОМС + РаспределениеДоходовПоЕНВД.БазаФОМСЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФФОМСЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатФСС - (ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатФСС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатФСС
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатФСС * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаФСС + РаспределениеДоходовПоЕНВД.БазаФССЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатФССЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРПоСуммарномуТарифу - (ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРПоСуммарномуТарифу
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРПоСуммарномуТарифу * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И НЕ ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРСПревышения
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ Взносы.РезультатПФРСПревышения - (ВЫРАЗИТЬ(Взносы.РезультатПФРСПревышения * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2)))
	|	КОНЕЦ КАК РезультатПФРСПревышения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|				И ВидыДеятельности.ТолькоЕНВД
	|			ТОГДА Взносы.РезультатПФРСПревышения
	|		КОГДА ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Взносы.РезультатПФРСПревышения * ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) / ЕСТЬNULL(РаспределениеДоходовПоЕНВД.БазаПФР + РаспределениеДоходовПоЕНВД.БазаПФРЕНВД, 0) КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК РезультатПФРСПревышенияЕНВД
	|ПОМЕСТИТЬ ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД
	|ИЗ
	|	ВТИсчисленоПоОсновномуТарифу КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспределениеДоходовПоЕНВД КАК РаспределениеДоходовПоЕНВД
	|		ПО Взносы.ФизЛицо = РаспределениеДоходовПоЕНВД.ФизЛицо
	|			И Взносы.Период = РаспределениеДоходовПоЕНВД.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыДеятельности КАК ВидыДеятельности
	|		ПО Взносы.ФизЛицо = ВидыДеятельности.ФизЛицо
	|			И Взносы.Период = ВидыДеятельности.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ТарифыВзносов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыФизлиц.ФизЛицо,
	|	ТарифыВзносов.ЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	ТарифыВзносов.ЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	НарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|ИЗ
	|	ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаЗанятыхНаПодземныхИТяжелыхРаботахНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПодземныеИВредныеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВЫБОР
	|				КОГДА ДоходыФизлиц.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ТяжелыеИПрочиеРаботы)
	|						И ДоходыФизлиц.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4)
	|					ТОГДА ДоходыФизлиц.БазаПФР
	|				ИНАЧЕ 0
	|			КОНЕЦ) * ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф / 100 КАК ЧИСЛО(15, 2)) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ДоходыФизлиц.ФизЛицо КАК ФизЛицо,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗастрахованныхЛиц КАК ДоходыФизлиц
	|		ПО Периоды.Период >= ДоходыФизлиц.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда КАК ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4
	|		ПО (ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.КлассУсловийТруда = ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4))
	|ГДЕ
	|	ДоходыФизлиц.КлассУсловийТруда <> ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаОпасный.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный1.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный2.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный3.Тариф,
	|	ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТрудаВредный4.Тариф,
	|	ДоходыФизлиц.ФизЛицо,
	|	Периоды.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	НарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленоПоПрошлыйМесяц.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4, 0) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	НарастающимИтогом.ФизЛицо,
	|	НарастающимИтогом.Период
	|ПОМЕСТИТЬ ВТПоРезультатамСпециальнойОценки
	|ИЗ
	|	ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК НарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПоРезультатамСпециальнойОценкиНарастающимИтогом КАК ИсчисленоПоПрошлыйМесяц
	|		ПО НарастающимИтогом.ФизЛицо = ИсчисленоПоПрошлыйМесяц.ФизЛицо
	|			И (НАЧАЛОПЕРИОДА(НарастающимИтогом.Период, МЕСЯЦ) = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ИсчисленоПоПрошлыйМесяц.Период, МЕСЯЦ), МЕСЯЦ, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НарастающимИтогом.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&парамКонецМесяцаРасчетногоПериода КАК Период,
	|	Начислено.ФизЛицо КАК ФизЛицо,
	|	(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(18, 5))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(18, 5))) - МАКСИМУМ(ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0)) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаи
	|ИЗ
	|	ВТДоходыЗастрахованныхЛиц КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ПО Начислено.ФизЛицо = РанееИсчисленныеВзносы.ФизЛицо
	|			И (РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода)
	|ГДЕ
	|	Начислено.ПериодРегистрации = &парамПериодРегистрации
	|	И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	Начислено.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Начислено.Взносов, 0) - ЕСТЬNULL(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот, 0) КАК Взносов
	|ПОМЕСТИТЬ ВТВзносыФССНесчастныеСлучаиСводно
	|ИЗ
	|	(ВЫБРАТЬ
	|		(ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСПоОсновномуТарифу) * &СтавкаВзносаФСС_НС_ПЗ КАК ЧИСЛО(15, 2))) + (ВЫРАЗИТЬ(СУММА(Начислено.БазаФСС_НСИнвалида) * &СтавкаВзносаФСС_НС_ПЗ * 0.6 КАК ЧИСЛО(15, 2))) КАК Взносов
	|	ИЗ
	|		ВТДоходыЗастрахованныхЛиц КАК Начислено
	|	ГДЕ
	|		Начислено.ПериодРегистрации = &парамПериодРегистрации
	|		И Начислено.ОбособленноеПодразделение = &парамОбособленноеПодразделение) КАК Начислено
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(РанееИсчисленныеВзносы.ФССНесчастныеСлучаиОборот) КАК ФССНесчастныеСлучаиОборот
	|		ИЗ
	|			ВТРанееИсчисленныеВзносы КАК РанееИсчисленныеВзносы
	|		ГДЕ
	|			РанееИсчисленныеВзносы.Период = &парамКонецМесяцаРасчетногоПериода) КАК РанееИсчисленныеВзносы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсегоИсчислено.Период,
	|	ВсегоИсчислено.ФизЛицо КАК ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифу) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифу,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРПоСуммарномуТарифуЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСПревышения) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСПревышения,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатПФРСПревышенияЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатПФРСПревышенияЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФСС) КАК ЧИСЛО(15, 2)) КАК РезультатФСС,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМС) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМС,
	|	СУММА(ВсегоИсчислено.РезультатПоДополнительномуТарифу) КАК РезультатПоДополнительномуТарифу,
	|	СУММА(ВсегоИсчислено.РезультатФССНесчастныеСлучаи) КАК РезультатФССНесчастныеСлучаи,
	|	СУММА(ВсегоИсчислено.РезультатДляШахтеров) КАК РезультатДляШахтеров,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4) КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СУММА(ВсегоИсчислено.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФФОМСЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФФОМСЕНВД,
	|	ВЫРАЗИТЬ(СУММА(ВсегоИсчислено.РезультатФССЕНВД) КАК ЧИСЛО(15, 2)) КАК РезультатФССЕНВД
	|ПОМЕСТИТЬ ВТСуммыВзносов
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоОсновномуТарифу.ФизЛицо.Наименование КАК Порядок,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифу КАК РезультатПФРПоСуммарномуТарифу,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРПоСуммарномуТарифуЕНВД КАК РезультатПФРПоСуммарномуТарифуЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСПревышения КАК РезультатПФРСПревышения,
	|		ИсчисленоПоОсновномуТарифу.РезультатПФРСПревышенияЕНВД КАК РезультатПФРСПревышенияЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФСС КАК РезультатФСС,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМС КАК РезультатФФОМС,
	|		0 КАК РезультатФССНесчастныеСлучаи,
	|		0 КАК РезультатПоДополнительномуТарифу,
	|		0 КАК РезультатДляШахтеров,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		0 КАК РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		0 КАК РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ИсчисленоПоОсновномуТарифу.Период КАК Период,
	|		ИсчисленоПоОсновномуТарифу.РезультатФФОМСЕНВД КАК РезультатФФОМСЕНВД,
	|		ИсчисленоПоОсновномуТарифу.РезультатФССЕНВД КАК РезультатФССЕНВД
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифуСУчетомЕНВД КАК ИсчисленоПоОсновномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыФС_НС_ПЗ.ФизЛицо,
	|		ВзносыФС_НС_ПЗ.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Взносов,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыФС_НС_ПЗ.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТВзносыФССНесчастныеСлучаи КАК ВзносыФС_НС_ПЗ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВзносыПоДополнительномуТарифу.ФизЛицо,
	|		ВзносыПоДополнительномуТарифу.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифу,
	|		ВзносыПоДополнительномуТарифу.РезультатПоДополнительномуТарифуДляШахтеров,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВзносыПоДополнительномуТарифу.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТИсчисленоПоОсновномуТарифу КАК ВзносыПоДополнительномуТарифу
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ЗаЗанятыхНаПодземныхИТяжелыхРаботах.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТЗаЗанятыхНаПодземныхИТяжелыхРаботах КАК ЗаЗанятыхНаПодземныхИТяжелыхРаботах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоРезультатамСпециальнойОценки.ФизЛицо,
	|		ПоРезультатамСпециальнойОценки.ФизЛицо.Наименование,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4,
	|		ПоРезультатамСпециальнойОценки.Период,
	|		0,
	|		0
	|	ИЗ
	|		ВТПоРезультатамСпециальнойОценки КАК ПоРезультатамСпециальнойОценки) КАК ВсегоИсчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсегоИсчислено.ФизЛицо,
	|	ВсегоИсчислено.Порядок,
	|	ВсегоИсчислено.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыНарастающимИтогом.Период,
	|	СуммыНарастающимИтогом.ФизЛицо КАК ФизЛицо,
	|	СуммыНарастающимИтогом.Порядок КАК Порядок,
	|	СуммыНарастающимИтогом.РезультатФСС - ЕСТЬNULL(ИсчисленныеВзносы.ФССОборот, 0) КАК ФСС,
	|	СуммыНарастающимИтогом.РезультатФФОМС - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСОборот, 0) КАК ФФОМС,
	|	СуммыНарастающимИтогом.РезультатФССЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФССЕНВДОборот, 0) КАК ФССЕНВД,
	|	СуммыНарастающимИтогом.РезультатФФОМСЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ФФОМСЕНВДОборот, 0) КАК ФФОМСЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуОборот, 0) КАК ПФРПоСуммарномуТарифу,
	|	СуммыНарастающимИтогом.РезультатПФРПоСуммарномуТарифуЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоСуммарномуТарифуЕНВДОборот, 0) КАК ПФРПоСуммарномуТарифуЕНВД,
	|	СуммыНарастающимИтогом.РезультатПФРСПревышения - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСПревышения, 0) КАК ПФРСПревышения,
	|	СуммыНарастающимИтогом.РезультатПФРСПревышенияЕНВД - ЕСТЬNULL(ИсчисленныеВзносы.ПФРСПревышенияЕНВД, 0) КАК ПФРСПревышенияЕНВД,
	|	СуммыНарастающимИтогом.РезультатПоДополнительномуТарифу - ЕСТЬNULL(ИсчисленныеВзносы.ПФРПоДополнительномуТарифуОборот, 0) КАК ПФРПоДополнительномуТарифу,
	|	СуммыНарастающимИтогом.РезультатДляШахтеров - ЕСТЬNULL(ИсчисленныеВзносы.ПФРНаДоплатуКПенсииШахтерамОборот, 0) КАК ПФРНаДоплатуКПенсииШахтерам,
	|	СуммыНарастающимИтогом.РезультатФССНесчастныеСлучаи КАК ФССНесчастныеСлучаи,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботах - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасныйОборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	СуммыНарастающимИтогом.РезультатЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 - ЕСТЬNULL(ИсчисленныеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4Оборот, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ПОМЕСТИТЬ ВТВзносыЗаМесяц
	|ИЗ
	|	ВТСуммыВзносов КАК СуммыНарастающимИтогом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееИсчисленныеВзносы КАК ИсчисленныеВзносы
	|		ПО СуммыНарастающимИтогом.ФизЛицо = ИсчисленныеВзносы.ФизЛицо
	|			И СуммыНарастающимИтогом.Период = ИсчисленныеВзносы.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Взносы.Период КАК ДатаПолученияДохода,
	|	Взносы.ФизЛицо,
	|	Взносы.ФФОМС КАК ФФОМС,
	|	Взносы.ФФОМСЕНВД КАК ФФОМСЕНВД,
	|	Взносы.ФСС КАК ФСС,
	|	Взносы.ФССЕНВД КАК ФССЕНВД,
	|	Взносы.ПФРПоСуммарномуТарифу КАК ПФРДоПредельнойВеличины,
	|	Взносы.ПФРПоСуммарномуТарифуЕНВД КАК ПФРДоПредельнойВеличиныЕНВД,
	|	Взносы.ПФРСПревышения КАК ПФРСПревышения,
	|	Взносы.ПФРСПревышенияЕНВД КАК ПФРСПревышенияЕНВД,
	|	Взносы.ФССНесчастныеСлучаи,
	|	Взносы.ПФРПоДополнительномуТарифу,
	|	Взносы.ПФРНаДоплатуКПенсииШахтерам,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3,
	|	Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4,
	|	Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4
	|ИЗ
	|	ВТВзносыЗаМесяц КАК Взносы
	|ГДЕ
	|	(Взносы.ФСС <> 0
	|			ИЛИ Взносы.ФФОМС <> 0
	|			ИЛИ Взносы.ПФРСПревышения <> 0
	|			ИЛИ Взносы.ПФРСПревышенияЕНВД <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифу <> 0
	|			ИЛИ Взносы.ПФРПоСуммарномуТарифуЕНВД <> 0
	|			ИЛИ Взносы.ФССЕНВД <> 0
	|			ИЛИ Взносы.ФФОМСЕНВД <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4 <> 0
	|			ИЛИ Взносы.ПФРПоДополнительномуТарифу <> 0
	|			ИЛИ Взносы.ПФРНаДоплатуКПенсииШахтерам <> 0
	|			ИЛИ Взносы.ФССНесчастныеСлучаи <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПолученияДохода,
	|	Взносы.Порядок";

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	ВременнаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начислено.Взносов КАК ВзносовСводно
	|ИЗ
	|	ВТВзносыФССНесчастныеСлучаиСводно КАК Начислено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ВзносовСводно) Тогда
		ЗаполнениеРегламентированнойОтчетности.ОкруглитьСлагаемыеПоСумме(ВременнаяТаблица,"ФССНесчастныеСлучаи", Выборка.ВзносовСводно, 2, "ФизЛицо, ДатаПолученияДохода");
	Иначе
		Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
			СтрокаТЗ.ФССНесчастныеСлучаи = 0
		КонецЦикла;
	КонецЕсли;
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("ФСС");
	Ресурсы.Добавить("ФФОМС");
	Ресурсы.Добавить("ПФРДоПредельнойВеличины");
	Ресурсы.Добавить("ПФРСПревышения");
	Ресурсы.Добавить("ФССЕНВД");
	Ресурсы.Добавить("ФФОМСЕНВД");
	Ресурсы.Добавить("ПФРДоПредельнойВеличиныЕНВД");
	Ресурсы.Добавить("ПФРСПревышенияЕНВД");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4");
	Ресурсы.Добавить("ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4");
	Ресурсы.Добавить("ПФРПоДополнительномуТарифу");
	Ресурсы.Добавить("ПФРНаДоплатуКПенсииШахтерам");
	Ресурсы.Добавить("ФССНесчастныеСлучаи");
	ТаблицаРезультатов = ВременнаяТаблица.СкопироватьКолонки();
	Для каждого СтрокаТЗ Из ВременнаяТаблица Цикл
		ЕстьДанныеВСтроке = Ложь;
		Для каждого ИмяРесурса Из Ресурсы Цикл
			ЕстьДанныеВСтроке = СтрокаТЗ[ИмяРесурса] <> 0;
			Если ЕстьДанныеВСтроке Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьДанныеВСтроке Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаРезультатов.Добавить(),СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультатов;
	
КонецФункции  // ПолучитьДанныеРасчета


// Расчет взносов по регистратору формирует итоговую таблицу с рассчитанными взносами
// вызывая для всех лет, попавшихся в данные о доходах, соответствующие процедуры расчета
//
// Параметры:
//	ВыборкаПоШапкеДокумента - структура (выборка и пр.) с полями Ссылка, ПериодРегистрации, ОбособленноеПодразделение, Организация
//	ОграничениеНаСотрудников - таблица значений с обязательной колонкой ФизЛицо
//  ДанныеОДоходах - таблица значений с колонками, совпадающими с полями рег-ра СтраховыеВзносыСведенияОДоходах
//
// Возвращаемое значение:
//  Таблица значений
//
Функция РассчитатьВзносы(ВыборкаПоШапкеДокумента, ОграничениеНаСотрудников, ДанныеОДоходах) Экспорт
	
	Если ВыборкаПоШапкеДокумента.ПериодРегистрации < ПроведениеРасчетов.ДатаРасширенияПеречняЛьготныхТарифовСтраховыхВзносов() Тогда
		Возврат ПолучитьДанныеРасчетаЗа2010Год(ВыборкаПоШапкеДокумента.Ссылка, ВыборкаПоШапкеДокумента.ПериодРегистрации, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОграничениеНаСотрудников, ДанныеОДоходах);
	ИначеЕсли ВыборкаПоШапкеДокумента.ПериодРегистрации < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда
		Возврат ПолучитьДанныеРасчетаЗа2011Год(ВыборкаПоШапкеДокумента.Ссылка, ВыборкаПоШапкеДокумента.ПериодРегистрации, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОграничениеНаСотрудников, ДанныеОДоходах);	
	ИначеЕсли ВыборкаПоШапкеДокумента.ПериодРегистрации < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
		Возврат ПолучитьДанныеРасчетаЗа2012Год(ВыборкаПоШапкеДокумента.Ссылка, ВыборкаПоШапкеДокумента.ПериодРегистрации, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОграничениеНаСотрудников, ДанныеОДоходах);	
	ИначеЕсли ВыборкаПоШапкеДокумента.ПериодРегистрации < РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда
		Возврат ПолучитьДанныеРасчетаЗа2013Год(ВыборкаПоШапкеДокумента.Ссылка, ВыборкаПоШапкеДокумента.ПериодРегистрации, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОграничениеНаСотрудников, ДанныеОДоходах);	
	Иначе
		
		ИсчисленныеСтраховыеВзносы = РегистрыНакопления.СтраховыеВзносыИсчисленные.СоздатьНаборЗаписей().ВыгрузитьКолонки();;
		
		ДанныеОДоходах.Колонки.Добавить("РасчетныйГод");
		Для каждого СтрокаРегистра Из ДанныеОДоходах Цикл
			СтрокаРегистра.РасчетныйГод = НачалоГода(СтрокаРегистра.ДатаПолученияДохода);
		КонецЦикла;
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("парамГоловнаяОрганизация", ВыборкаПоШапкеДокумента.Организация);
		Запрос.УстановитьПараметр("парамОбособленноеПодразделение", ВыборкаПоШапкеДокумента.ОбособленноеПодразделение);
		Запрос.УстановитьПараметр("парамПериодРегистрации", НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
		Запрос.УстановитьПараметр("парамКонецПериодаРегистрации", КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
		
		Запрос.УстановитьПараметр("ДанныеОДоходах", ДанныеОДоходах);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизЛицо,
		|	СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода
		|ПОМЕСТИТЬ ВТДанныеДокумента
		|ИЗ
		|	&ДанныеОДоходах КАК СведенияОДоходах";
		Запрос.Выполнить();
		Если ОграничениеНаСотрудников = Неопределено Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
			|ПОМЕСТИТЬ ВТСписокСотрудников
			|ИЗ
			|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(СведенияОДоходах.Период, МЕСЯЦ) = &парамПериодРегистрации
			|	И СведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СведенияОДоходах.ФизЛицо
			|ИЗ
			|	ВТДанныеДокумента КАК СведенияОДоходах
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ФизЛицо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СписокСотрудников.ФизЛицо
			|ИЗ
			|	ВТСписокСотрудников КАК СписокСотрудников";
			ОграничениеНаСотрудников = Запрос.Выполнить().Выгрузить();
			
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|   ТаблицаСотрудников.ФизЛицо КАК ФизЛицо
			|ПОМЕСТИТЬ ВТСписокСотрудников
			|ИЗ
			|   &парамТаблицаСотрудников КАК ТаблицаСотрудников
			|
			|ИНДЕКСИРОВАТЬ ПО
			|   ФизЛицо";
			Запрос.УстановитьПараметр("парамТаблицаСотрудников", ОграничениеНаСотрудников);
			Запрос.Выполнить();
		КонецЕсли;
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходах.ДатаПолученияДохода
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ) КАК ДатаПолученияДохода,
		|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|		СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ВидДоходаВходитВБазуПФР,
		|		СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу КАК ОблагаетсяПоДополнительномуТарифу,
		|		СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам КАК ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|		СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		СУММА(СведенияОДоходах.Результат) КАК Результат
		|	ИЗ
		|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
		|	ГДЕ
		|		СведенияОДоходах.Организация = &парамГоловнаяОрганизация
		|		И СведенияОДоходах.Период МЕЖДУ &парамПериодРегистрации И &парамКонецПериодаРегистрации
		|		И СведенияОДоходах.ДатаПолученияДохода < &парамПериодРегистрации
		|		И СведенияОДоходах.ОбособленноеПодразделение = &парамОбособленноеПодразделение
		|		И СведенияОДоходах.ФизЛицо В
		|				(ВЫБРАТЬ
		|					СписокСотрудников.ФизЛицо
		|				ИЗ
		|					ВТСписокСотрудников КАК СписокСотрудников)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОДоходах.ФизЛицо,
		|		СведенияОДоходах.ВидДохода.ВходитВБазуПФР,
		|		СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
		|		СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|		СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ)) КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.Результат <> 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(СведенияОДоходах.ДатаПолученияДохода, МЕСЯЦ)
		|ИЗ
		|	ВТДанныеДокумента КАК СведенияОДоходах
		|ГДЕ
		|	СведенияОДоходах.ДатаПолученияДохода < &парамПериодРегистрации
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	&парамПериодРегистрации
		|
		|УПОРЯДОЧИТЬ ПО
		|	СведенияОДоходах.ДатаПолученияДохода";
		
		ТаблицаДат = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаМесяца Из ТаблицаДат Цикл
			
			Если НачалоГода(СтрокаМесяца.ДатаПолученияДохода) >= РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда
				Прервать;
			КонецЕсли;
			
			ДатаРасчета = НачалоДня(КонецМесяца(СтрокаМесяца.ДатаПолученияДохода));
			ДоходыДляРасчета = ДанныеОДоходах.Скопировать(ДанныеОДоходах.НайтиСтроки(Новый Структура("ДатаПолученияДохода", ДатаРасчета)));
			
			ФизлицаРасчета = ДоходыДляРасчета.Скопировать(,"ФизЛицо");
			Если ДатаРасчета < ПроведениеРасчетов.ДатаРасширенияПеречняЛьготныхТарифовСтраховыхВзносов() Тогда
				ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(ПолучитьДанныеРасчетаЗа2010Год(ВыборкаПоШапкеДокумента.Ссылка, СтрокаМесяца.ДатаПолученияДохода, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ФизлицаРасчета, ДоходыДляРасчета), ИсчисленныеСтраховыеВзносы);	
			ИначеЕсли ДатаРасчета < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда
				ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(ПолучитьДанныеРасчетаЗа2011Год(ВыборкаПоШапкеДокумента.Ссылка, СтрокаМесяца.ДатаПолученияДохода, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ФизлицаРасчета, ДоходыДляРасчета), ИсчисленныеСтраховыеВзносы);	
			ИначеЕсли ДатаРасчета < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
				ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(ПолучитьДанныеРасчетаЗа2012Год(ВыборкаПоШапкеДокумента.Ссылка, СтрокаМесяца.ДатаПолученияДохода, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ФизлицаРасчета, ДоходыДляРасчета), ИсчисленныеСтраховыеВзносы);	
			ИначеЕсли ДатаРасчета < РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда
				ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(ПолучитьДанныеРасчетаЗа2013Год(ВыборкаПоШапкеДокумента.Ссылка, СтрокаМесяца.ДатаПолученияДохода, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ФизлицаРасчета, ДоходыДляРасчета), ИсчисленныеСтраховыеВзносы);	
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого СтрокаМесяца Из ТаблицаДат Цикл
			СтрокаМесяца.ДатаПолученияДохода = НачалоГода(СтрокаМесяца.ДатаПолученияДохода);
		КонецЦикла;
		ТаблицаДат.Свернуть("ДатаПолученияДохода");
		ТаблицаДат.Сортировать("ДатаПолученияДохода");
		
		Для каждого СтрокаМесяца Из ТаблицаДат Цикл
			
			Если СтрокаМесяца.ДатаПолученияДохода < РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда
				Продолжить;
			КонецЕсли;
			
			ДоходыДляРасчета = ДанныеОДоходах.Скопировать(ДанныеОДоходах.НайтиСтроки(Новый Структура("РасчетныйГод", СтрокаМесяца.ДатаПолученияДохода)));
			ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(ПолучитьДанныеРасчета(ВыборкаПоШапкеДокумента.Ссылка, ?(Год(СтрокаМесяца.ДатаПолученияДохода) < Год(ВыборкаПоШапкеДокумента.ПериодРегистрации), НачалоМесяца(КонецГода(СтрокаМесяца.ДатаПолученияДохода)), ВыборкаПоШапкеДокумента.ПериодРегистрации), ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОбособленноеПодразделение, ОграничениеНаСотрудников, ДоходыДляРасчета, ВыборкаПоШапкеДокумента.ПериодРегистрации), ИсчисленныеСтраховыеВзносы);	
			
		КонецЦикла;
		
		ОбщегоНазначенияЗК.СвернутьТаблицуДвиженийРегистраНакоплений("СтраховыеВзносыИсчисленные", ИсчисленныеСтраховыеВзносы);
		
		Возврат ИсчисленныеСтраховыеВзносы
		
	КонецЕсли;
	
КонецФункции // РассчитатьВзносы()

// Расчет скидки по материальной помощи по данным учета доходов
//
// Параметры:
//	ВыборкаПоШапкеДокумента - структура (выборка и пр.) с полями Ссылка, ПериодРегистрации, ОбособленноеПодразделение, Организация
//	ТаблицаКОбработке - таблица значений с колонками 
//  							ФизЛицо
//  							ВидДохода
//  							ДатаПолученияДохода
//  МенеджерВременныхТаблиц - содержит вр.таблицу ВТДанныеУчета с колонками
//  							ФизЛицо
//  							ВидДохода
//  							ДатаПолученияДохода
//  							Результат
//  							Скидка
//
// Возвращаемое значение:
//  нет
//
Процедура РасчетСкидок(РасчетныйПериод, ТаблицаКОбработке, МенеджерВременныхТаблиц) Экспорт
	
	Если ТаблицаКОбработке.Количество() = 0 Тогда  // считать оказалось нечего
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
 	Запрос.УстановитьПараметр("парамСтрокиКОбработке", ТаблицаКОбработке);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СведенияОДоходах.ВидДохода КАК ВидДохода,
	|	СведенияОДоходах.ДатаПолученияДохода
	|ПОМЕСТИТЬ ВТСтрокиКОбработке
	|ИЗ
	|	&парамСтрокиКОбработке КАК СведенияОДоходах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыПоМесяцам.ФизЛицо,
	|	ДоходыПоМесяцам.ВидДохода КАК ВидДохода,
	|	ДоходыПоМесяцам.ДатаПолученияДохода,
	|	СУММА(ДоходыПоМесяцам.Результат) КАК РезультатЗаГод,
	|	СУММА(ДоходыПоМесяцам.Скидка) КАК ПредоставленнаяСкидкаЗаГод
	|ПОМЕСТИТЬ ВТПредоставленныеСкидки
	|ИЗ
	|	ВТДанныеУчета КАК ДоходыПоМесяцам
	|ГДЕ
	|	ДоходыПоМесяцам.ВидДохода В (ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.МатпомощьПрокуроров), ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.Матпомощь))
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыПоМесяцам.ФизЛицо,
	|	ДоходыПоМесяцам.ВидДохода,
	|	ДоходыПоМесяцам.ДатаПолученияДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиКОбработке.ФизЛицо,
	|	СтрокиКОбработке.ВидДохода,
	|	СтрокиКОбработке.ДатаПолученияДохода,
	|	СУММА(ПредоставленныеСкидки.РезультатЗаГод) КАК РезультатЗаГод,
	|	СУММА(ПредоставленныеСкидки.ПредоставленнаяСкидкаЗаГод) КАК ПредоставленнаяСкидкаЗаГод
	|ИЗ
	|	ВТСтрокиКОбработке КАК СтрокиКОбработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредоставленныеСкидки КАК ПредоставленныеСкидки
	|		ПО СтрокиКОбработке.ФизЛицо = ПредоставленныеСкидки.ФизЛицо
	|			И СтрокиКОбработке.ВидДохода = ПредоставленныеСкидки.ВидДохода
	|			И СтрокиКОбработке.ДатаПолученияДохода >= ПредоставленныеСкидки.ДатаПолученияДохода
	|			И (ГОД(СтрокиКОбработке.ДатаПолученияДохода) = ГОД(ПредоставленныеСкидки.ДатаПолученияДохода))
	|ГДЕ
	|	ПредоставленныеСкидки.ФизЛицо ЕСТЬ НЕ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	СтрокиКОбработке.ВидДохода,
	|	СтрокиКОбработке.ФизЛицо,
	|	СтрокиКОбработке.ДатаПолученияДохода";
	
	СтруктураПоиска = Новый Структура("Физлицо, ВидДохода, ДатаПолученияДохода");
	ПравоНаСкидку = РегистрыСведений.СтраховыеВзносыСкидкиКДоходам.ПолучитьПоследнее(РасчетныйПериод, Новый Структура("ВидДохода", Справочники.ДоходыПоСтраховымВзносам.Матпомощь)).ГодоваяСкидка;
	Если Не ЗначениеЗаполнено(ПравоНаСкидку) Тогда
		ПравоНаСкидку = 0
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// Распределим скидку между строками о доходах
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка); // Физлицо, ВидДохода
		
		НайденныеСтроки = ТаблицаКОбработке.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		// В общем случае предоставляемая скидка есть
		НайденныеСтроки[0].Скидка = Мин(Выборка.РезультатЗаГод, ПравоНаСкидку) - Выборка.ПредоставленнаяСкидкаЗаГод;
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для Сч = 1  По НайденныеСтроки.Количество() - 1 Цикл
				НайденныеСтроки[Сч].Скидка = 0
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры // РасчетСкидок()

////////////////////////////////////////////////////////////////////////////////

Процедура ВписатьСтрокуРегистраТарифСтраховыхВзносов(НаборЗаписей,ДатаСведений,ВидТарифа,ПФР = 0,ПФРНакопительная = 0,ФСС = 0,ФССсИностранцев = 0,ФФОМС = 0,ТФОМС = 0)

    НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.Период = ДатаСведений;
	НоваяСтрока.ВидТарифа = ВидТарифа;
	НоваяСтрока.ПФР = ПФР;
	НоваяСтрока.ПФРНакопительная = ПФРНакопительная;
	НоваяСтрока.ФСС = ФСС;
	НоваяСтрока.ФССсИностранцев = ФССсИностранцев;
	НоваяСтрока.ТФОМС = ТФОМС;
	НоваяСтрока.ФФОМС = ФФОМС;

КонецПроцедуры

Функция ТаблицаТарифовСтраховыхВзносов() Экспорт

	ТаблицаТарифов = Новый ТаблицаЗначений;
	ТаблицаТарифов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ТаблицаТарифов.Колонки.Добавить("ВидТарифа", Новый ОписаниеТипов("ПеречислениеСсылка.ТарифыСтраховыхВзносов"));
	ТаблицаТарифов.Колонки.Добавить("ПФР", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТарифов.Колонки.Добавить("ПФРНакопительная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТарифов.Колонки.Добавить("ФСС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТарифов.Колонки.Добавить("ФССсИностранцев", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТарифов.Колонки.Добавить("ТФОМС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТарифов.Колонки.Добавить("ФФОМС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаТарифов.Индексы.Добавить("ВидТарифа");
	
	ОбщийНалоговыйРежим = Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим;	

	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',ОбщийНалоговыйРежим,
			20.0,	6.0,	2.9,	0.0,	1.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',ОбщийНалоговыйРежим,
			26.0,	6.0,	2.9,	0.0,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ОбщийНалоговыйРежим,
			22.0,	6.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ОбщийНалоговыйРежим,
			22.0,	0.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',ОбщийНалоговыйРежим,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	УпрощенныйНалоговыйРежим = Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим;	

	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',УпрощенныйНалоговыйРежим,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',УпрощенныйНалоговыйРежим,
			26.0,	6.0,	2.9,	0.0,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',УпрощенныйНалоговыйРежим,
			22.0,	6.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',УпрощенныйНалоговыйРежим,
			22.0,	0.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',УпрощенныйНалоговыйРежим,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	ЕНВД = Перечисления.ТарифыСтраховыхВзносов.ЕНВД;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',ЕНВД,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',ЕНВД,
			26.0,	6.0,	2.9,	0.0,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ЕНВД,
			22.0,	6.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ЕНВД,
			22.0,	0.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',ЕНВД,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	
	СельХозПроизводители = Перечисления.ТарифыСтраховыхВзносов.СельХозПроизводители;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',СельХозПроизводители,
			15.8,	6.0,	1.9,	0.0,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',СельХозПроизводители,
			16.0,	6.0,	1.9,	0.0,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',СельХозПроизводители,
			16.0,	6.0,	1.9,	0.0,	2.3);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20130101',СельХозПроизводители,
			21.0,	6.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',СельХозПроизводители,
			21.0,	0.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',СельХозПроизводители,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	ЕСХН = Перечисления.ТарифыСтраховыхВзносов.ЕСХН;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',ЕСХН,
			10.3,	6.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',ЕСХН,
			16.0,	6.0,	1.9,	0.0,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ЕСХН,
			16.0,	6.0,	1.9,	0.0,	2.3);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20130101',ЕСХН,
			21.0,	6.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ЕСХН,
			21.0,	0.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',ЕСХН,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	НародныеХудожественныеПромыслы = Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',НародныеХудожественныеПромыслы,
			16.0,	6.0,	1.9,	0.0,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',НародныеХудожественныеПромыслы,
			16.0,	6.0,	1.9,	0.0,	2.3);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20130101',НародныеХудожественныеПромыслы,
			21.0,	6.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',НародныеХудожественныеПромыслы,
			21.0,	0.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',НародныеХудожественныеПромыслы,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
			
	ОрганизацияИнвалидов = Перечисления.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',ОрганизацияИнвалидов,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',ОрганизацияИнвалидов,
			16.0,	6.0,	1.9,	0.0,	1.1,	1.2);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ОрганизацияИнвалидов,
			16.0,	6.0,	1.9,	0.0,	2.3);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20130101',ОрганизацияИнвалидов,
			21.0,	6.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ОрганизацияИнвалидов,
			21.0,	0.0,	2.4,	0.0,	3.7);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',ОрганизацияИнвалидов,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	СМИ = Перечисления.ТарифыСтраховыхВзносов.СМИ;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',СМИ,
			 );	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',СМИ,
			20.0,	6.0,	2.9,	0.0,	1.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',СМИ,
			20.8,	6.0,	2.9,	0.0,	3.3);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20130101',СМИ,
			21.6,	6.0,	2.9,	0.0,	3.5);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',СМИ,
			23.2,	0.0,	2.9,	0.0,	3.9);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',СМИ,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	РезидентТехникоВнедренческойЗоны = Перечисления.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',РезидентТехникоВнедренческойЗоны,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',РезидентТехникоВнедренческойЗоны,
			 8.0,	6.0,	2.0,	0.0,	2.0,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',РезидентТехникоВнедренческойЗоны,
			 8.0,	6.0,	2.0,	0.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',РезидентТехникоВнедренческойЗоны,
			 8.0,	0.0,	2.0,	0.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',РезидентТехникоВнедренческойЗоны,
			 8.0,	0.0,	2.0,	1.8,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20180101',РезидентТехникоВнедренческойЗоны,
			13.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20190101',РезидентТехникоВнедренческойЗоны,
			20.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20200101',РезидентТехникоВнедренческойЗоны,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	ХозОбществаБюджетныхВУЗов = Перечисления.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',ХозОбществаБюджетныхВУЗов,
			 );	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',ХозОбществаБюджетныхВУЗов,
			 8.0,	6.0,	2.0,	0.0,	2.0,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ХозОбществаБюджетныхВУЗов,
			 8.0,	6.0,	2.0,	0.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ХозОбществаБюджетныхВУЗов,
			 8.0,	0.0,	2.0,	0.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',ХозОбществаБюджетныхВУЗов,
			 8.0,	0.0,	2.0,	1.8,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20180101',ХозОбществаБюджетныхВУЗов,
			13.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20190101',ХозОбществаБюджетныхВУЗов,
			20.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20200101',ХозОбществаБюджетныхВУЗов,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	ITОрганизации = Перечисления.ТарифыСтраховыхВзносов.ITОрганизации;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',ITОрганизации,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',ITОрганизации,
			 8.0,	6.0,	2.0,	0.0,	2.0,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ITОрганизации,
			 8.0,	6.0,	2.0,	0.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ITОрганизации,
			 8.0,	0.0,	2.0,	0.0,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',ITОрганизации,
			 8.0,	0.0,	2.0,	1.8,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20240101',ITОрганизации,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	Мультипликаторы = Перечисления.ТарифыСтраховыхВзносов.Мультипликаторы;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20180101',Мультипликаторы,
			 8.0,	0.0,	2.0,	1.8,	4.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20240101',Мультипликаторы,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	УпрощенныйНалоговыйРежимПроизводство = Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',УпрощенныйНалоговыйРежимПроизводство,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20110101',УпрощенныйНалоговыйРежимПроизводство,
			18.0,	6.0,	2.9,	0.0,	3.1,	2.0);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',УпрощенныйНалоговыйРежимПроизводство,
			20.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',УпрощенныйНалоговыйРежимПроизводство,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20190101',УпрощенныйНалоговыйРежимПроизводство,
 			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	ДляЧленовЭкипажейМорскихСудовПодФлагомРФ = Перечисления.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
			 );	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС, ТФОМС - не взимаются.
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20280101',ДляЧленовЭкипажейМорскихСудовПодФлагомРФ,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	ДляФармацевтовАптек = Перечисления.ТарифыСтраховыхВзносов.ДляФармацевтовАптек;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ДляФармацевтовАптек,
			20.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ДляФармацевтовАптек,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20190101',ДляФармацевтовАптек,
 			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	НекоммерческиеОрганизации = Перечисления.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',НекоммерческиеОрганизации,
			20.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',НекоммерческиеОрганизации,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20250101',НекоммерческиеОрганизации,
 			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	БлаготворительныеОрганизации = Перечисления.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',БлаготворительныеОрганизации,
			20.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',БлаготворительныеОрганизации,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20250101',БлаготворительныеОрганизации,
 			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	ОрганизацииОказывающиеИнжиниринговыеУслуги = Перечисления.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20120101',ОрганизацииОказывающиеИнжиниринговыеУслуги,
			22.0,	6.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ОрганизацииОказывающиеИнжиниринговыеУслуги,
			22.0,	0.0,	2.9,	0.0,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',ОрганизацииОказывающиеИнжиниринговыеУслуги,
			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	ИндивидуальныйПредпринимательПрименяющийПатент = Перечисления.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20130101',ИндивидуальныйПредпринимательПрименяющийПатент,
			20.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',ИндивидуальныйПредпринимательПрименяющийПатент,
			20.0,	0.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20190101',ИндивидуальныйПредпринимательПрименяющийПатент,
 			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	УчастникПроектаИнновационныйЦентрСколково = Перечисления.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20100101',УчастникПроектаИнновационныйЦентрСколково,
			14.0,	6.0);	// ПФР (всего), ПФРНакопительная
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20140101',УчастникПроектаИнновационныйЦентрСколково,
			14.0,	0.0);	// ПФР (всего), ПФРНакопительная

	УчастникОсобойЗоныВКрыму = Перечисления.ТарифыСтраховыхВзносов.УчастникОсобойЗоныВКрыму;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',УчастникОсобойЗоныВКрыму,
			6.0,	0.0,	1.5,	1.5,	0.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития = Перечисления.ТарифыСтраховыхВзносов.РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20150101',РезидентТерриторииОпережающегоСоциальноЭкономическогоРазвития,
			6.0,	0.0,	1.5,	1.5,	0.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	РезидентПортаВладивосток = Перечисления.ТарифыСтраховыхВзносов.РезидентПортаВладивосток;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20160101',РезидентПортаВладивосток,
			6.0,	0.0,	1.5,	1.5,	0.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	РезидентОсобойЗоныВКалининградскойОбласти = Перечисления.ТарифыСтраховыхВзносов.РезидентОсобойЗоныВКалининградскойОбласти;	
	
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20180101',РезидентОсобойЗоныВКалининградскойОбласти,
			6.0,	0.0,	1.5,	1.5,	0.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС
	ВписатьСтрокуРегистраТарифСтраховыхВзносов(ТаблицаТарифов,'20260101',РезидентОсобойЗоныВКалининградскойОбласти,
 			22.0,	0.0,	2.9,	1.8,	5.1);	// ПФР (всего), ПФРНакопительная, ФСС, ФСС с иностранцев, ФФОМС

	Возврат ТаблицаТарифов	

КонецФункции

Функция ТекущиеТарифыСтраховыхВзносовПоВидамТарифа(ДатаАктуальности) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТарифСтраховыхВзносов.Период,
	|	ТарифСтраховыхВзносов.ВидТарифа,
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ПФРНакопительная,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС
	|ПОМЕСТИТЬ ВТТарифы
	|ИЗ
	|	&ТаблицаТарифов КАК ТарифСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыСреза.ВидТарифа,
	|	ТарифСтраховыхВзносов.ПФР,
	|	ТарифСтраховыхВзносов.ПФРНакопительная,
	|	ТарифСтраховыхВзносов.ФСС,
	|	ТарифСтраховыхВзносов.ФФОМС
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ТарифСтраховыхВзносов.Период) КАК Период,
	|		ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа
	|	ИЗ
	|		ВТТарифы КАК ТарифСтраховыхВзносов
	|	ГДЕ
	|		ТарифСтраховыхВзносов.Период <= &ДатаАктуальности
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТарифСтраховыхВзносов.ВидТарифа) КАК ДатыСреза
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифы КАК ТарифСтраховыхВзносов
	|		ПО ДатыСреза.ВидТарифа = ТарифСтраховыхВзносов.ВидТарифа
	|			И ДатыСреза.Период = ТарифСтраховыхВзносов.Период";
	Запрос.УстановитьПараметр("ТаблицаТарифов", ТаблицаТарифовСтраховыхВзносов());
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

////////////////////////////////////////////////////////////////////////////////

Процедура ПоместитьВМенеджерРасширенноеОписаниеТарифовСтраховыхВзносов(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаСтрахованияВременноПребывающих", ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов());
	
	Запрос.Текст = 
    "ВЫБРАТЬ
    |	2010 КАК РасчетныйПериод,
    |	ДАТАВРЕМЯ(2010, 12, 31, 23, 59, 59) КАК Период
    |ПОМЕСТИТЬ ВТПериодыТарифов
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2011,
    |	ДАТАВРЕМЯ(2011, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2012,
    |	ДАТАВРЕМЯ(2012, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2013,
    |	ДАТАВРЕМЯ(2013, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2014,
    |	ДАТАВРЕМЯ(2014, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2015,
    |	ДАТАВРЕМЯ(2015, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2016,
    |	ДАТАВРЕМЯ(2016, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2017,
    |	ДАТАВРЕМЯ(2017, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2018,
    |	ДАТАВРЕМЯ(2018, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2019,
    |	ДАТАВРЕМЯ(2019, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2020,
    |	ДАТАВРЕМЯ(2020, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2021,
    |	ДАТАВРЕМЯ(2021, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2022,
    |	ДАТАВРЕМЯ(2022, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2023,
    |	ДАТАВРЕМЯ(2023, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2024,
    |	ДАТАВРЕМЯ(2024, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2025,
    |	ДАТАВРЕМЯ(2025, 12, 31, 23, 59, 59)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	2026,
    |	ДАТАВРЕМЯ(2026, 12, 31, 23, 59, 59)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ДатыПоследнихДвижений.РасчетныйПериод,
    |	ДатыПоследнихДвижений.Период,
    |	ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа,
    |	ТарифСтраховыхВзносов.ПФР,
    |	ТарифСтраховыхВзносов.ПФРНакопительная,
    |	ТарифСтраховыхВзносов.ФСС,
    |	ТарифСтраховыхВзносов.ФФОМС,
    |	ТарифСтраховыхВзносов.ТФОМС,
    |	ТарифСтраховыхВзносов.ПФР + ТарифСтраховыхВзносов.ФСС + ТарифСтраховыхВзносов.ФФОМС + ТарифСтраховыхВзносов.ТФОМС КАК СуммарныйТариф
    |ПОМЕСТИТЬ ВТРазмерыТарифныхСтавокДляОписанияТарифа
    |ИЗ
    |	(ВЫБРАТЬ
    |		ТарифСтраховыхВзносов.ВидТарифа КАК ВидТарифа,
    |		Периоды.Период КАК Период,
    |		МАКСИМУМ(ТарифСтраховыхВзносов.Период) КАК ПериодПоследнегоДвижения,
    |		Периоды.РасчетныйПериод КАК РасчетныйПериод
    |	ИЗ
    |		ВТПериодыТарифов КАК Периоды
    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифСтраховыхВзносов КАК ТарифСтраховыхВзносов
    |			ПО Периоды.Период >= ТарифСтраховыхВзносов.Период
    |	
    |	СГРУППИРОВАТЬ ПО
    |		ТарифСтраховыхВзносов.ВидТарифа,
    |		Периоды.Период,
    |		Периоды.РасчетныйПериод) КАК ДатыПоследнихДвижений
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТарифСтраховыхВзносов КАК ТарифСтраховыхВзносов
    |		ПО ДатыПоследнихДвижений.ВидТарифа = ТарифСтраховыхВзносов.ВидТарифа
    |			И ДатыПоследнихДвижений.ПериодПоследнегоДвижения = ТарифСтраховыхВзносов.Период
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	Тарифы.РасчетныйПериод,
    |	Тарифы.ВидТарифа,
    |	ВЫБОР
    |		КОГДА Тарифы.Период < &ДатаСтрахованияВременноПребывающих
    |			ТОГДА ИСТИНА
    |		КОГДА Тарифы.СуммарныйТариф > ТарифДляИнвалидов.СуммарныйТариф
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ВыделятьДоходыИнвалидов,
    |	ВЫБОР
    |		КОГДА Тарифы.РасчетныйПериод >= 2017
    |			ТОГДА ЛОЖЬ
    |		КОГДА Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
    |			ТОГДА ИСТИНА
    |		КОГДА Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим)
    |			ТОГДА ИСТИНА
    |		КОГДА Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |			ТОГДА ЛОЖЬ
    |		КОГДА (Тарифы.РасчетныйПериод = 2012
    |				ИЛИ Тарифы.РасчетныйПериод = 2013)
    |				И Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги)
    |			ТОГДА ЛОЖЬ
    |		КОГДА Тарифы.ПФР = ОсновнойТариф.ПФР
    |				И Тарифы.ФСС = ОсновнойТариф.ФСС
    |				И Тарифы.ФФОМС = ОсновнойТариф.ФФОМС
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЗаменятьТарифНаЕНВД,
    |	ВЫБОР
    |		КОГДА Тарифы.РасчетныйПериод >= 2017
    |				И (Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |					ИЛИ Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим))
    |			ТОГДА ИСТИНА
    |		КОГДА Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
    |			ТОГДА ЛОЖЬ
    |		КОГДА Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим)
    |			ТОГДА ЛОЖЬ
    |		КОГДА (Тарифы.РасчетныйПериод = 2012
    |				ИЛИ Тарифы.РасчетныйПериод = 2013)
    |				И Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги)
    |			ТОГДА ЛОЖЬ
    |		КОГДА Тарифы.ПФР = ОсновнойТариф.ПФР
    |				И Тарифы.ФСС = ОсновнойТариф.ФСС
    |				И Тарифы.ФФОМС = ОсновнойТариф.ФФОМС
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК ЗаменятьОсновнымТарифом,
    |	ВЫБОР
    |		КОГДА Тарифы.РасчетныйПериод < 2012
    |			ТОГДА ЛОЖЬ
    |		КОГДА (Тарифы.РасчетныйПериод = 2012
    |				ИЛИ Тарифы.РасчетныйПериод = 2013)
    |				И Тарифы.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги)
    |			ТОГДА ЛОЖЬ
    |		КОГДА Тарифы.ПФР = ОсновнойТариф.ПФР
    |				И Тарифы.ФСС = ОсновнойТариф.ФСС
    |				И Тарифы.ФФОМС = ОсновнойТариф.ФФОМС
    |			ТОГДА ИСТИНА
    |		ИНАЧЕ ЛОЖЬ
    |	КОНЕЦ КАК НачислятьВзносыНаСуммыПревышающиеПредельную
    |ПОМЕСТИТЬ ВТРасширенноеОписаниеТарифов
    |ИЗ
    |	ВТРазмерыТарифныхСтавокДляОписанияТарифа КАК Тарифы
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавокДляОписанияТарифа КАК ОсновнойТариф
    |		ПО (ОсновнойТариф.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим))
    |			И Тарифы.РасчетныйПериод = ОсновнойТариф.РасчетныйПериод
    |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавокДляОписанияТарифа КАК ТарифДляИнвалидов
    |		ПО (ТарифДляИнвалидов.ВидТарифа = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов))
    |			И Тарифы.РасчетныйПериод = ТарифДляИнвалидов.РасчетныйПериод
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |УНИЧТОЖИТЬ ВТПериодыТарифов
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |УНИЧТОЖИТЬ ВТРазмерыТарифныхСтавокДляОписанияТарифа";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция НеучитываемыеВидыДохода() Экспорт

	МассивВидовДохода = Новый Массив;
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ПустаяСсылка());
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом);
	МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.РаспределятьПоБазовымНачислениям);
	
    Возврат МассивВидовДохода
	
КонецФункции 

////////////////////////////////////////////////////////////////////////////////

Процедура СформироватьДоходыВУчетеПоСтраховымВзносам(НаборЗаписей, МенеджерВременныхТаблиц, ВыборкаПоШапкеДокумента, ИмяПоляСторнируемогоДокумента = "Регистратор", ПоИтогамМесяца = Ложь, ИмяПоляСсылки = "Ссылка") Экспорт
	
	Если ВыборкаПоШапкеДокумента.ПериодРегистрации < РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Тогда
		Возврат	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецМесяца", НачалоДня(КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации)));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Если ПоИтогамМесяца Тогда
		
		Запрос.УстановитьПараметр("Начало", НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
		Запрос.УстановитьПараметр("Окончание", КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
		Запрос.УстановитьПараметр("Организация", ВыборкаПоШапкеДокумента.Организация);
		Запрос.УстановитьПараметр("Ссылка", ВыборкаПоШапкеДокумента[ИмяПоляСсылки]);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОДоходах.ФизЛицо,
		|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР КАК ОблагаетсяВзносамиВПФР,
		|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
		|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СведенияОДоходах.КлассУсловийТруда,
		|	СУММА(СведенияОДоходах.Результат) КАК Результат
		|ПОМЕСТИТЬ ВТДоходыЗаПериод
		|ИЗ
		|	(ВЫБРАТЬ
		|		СтраховыеВзносыСведенияОДоходахОбороты.ФизЛицо КАК ФизЛицо,
		|		СтраховыеВзносыСведенияОДоходахОбороты.ВидДохода КАК ВидДохода,
		|		СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяПоДополнительномуТарифу КАК ОблагаетсяПоДополнительномуТарифу,
		|		СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам КАК ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|		СтраховыеВзносыСведенияОДоходахОбороты.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		СтраховыеВзносыСведенияОДоходахОбороты.КлассУсловийТруда КАК КлассУсловийТруда,
		|		СтраховыеВзносыСведенияОДоходахОбороты.РезультатОборот - СтраховыеВзносыСведенияОДоходахОбороты.СкидкаОборот КАК Результат
		|	ИЗ
		|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
		|				&Начало,
		|				&Окончание,
		|				,
		|				Организация = &Организация
		|					И ФизЛицо В
		|						(ВЫБРАТЬ
		|							Доходы.Физлицо
		|						ИЗ
		|							ВТНачисления КАК Доходы)) КАК СтраховыеВзносыСведенияОДоходахОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтраховыеВзносыСведенияОДоходах.ФизЛицо,
		|		СтраховыеВзносыСведенияОДоходах.ВидДохода,
		|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
		|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
		|		-СтраховыеВзносыСведенияОДоходах.Результат - СтраховыеВзносыСведенияОДоходах.Скидка
		|	ИЗ
		|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
		|	ГДЕ
		|		СтраховыеВзносыСведенияОДоходах.Регистратор = &Ссылка
		|		И СтраховыеВзносыСведенияОДоходах.ФизЛицо В
		|				(ВЫБРАТЬ
		|					Доходы.Физлицо
		|				ИЗ
		|					ВТНачисления КАК Доходы)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СтраховыеВзносыСведенияОДоходах.ФизЛицо,
		|		СтраховыеВзносыСведенияОДоходах.ВидДохода,
		|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
		|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|		СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|		СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
		|		СтраховыеВзносыСведенияОДоходах.Результат - СтраховыеВзносыСведенияОДоходах.Скидка
		|	ИЗ
		|		ВТНачисления КАК СтраховыеВзносыСведенияОДоходах) КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизЛицо,
		|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
		|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СведенияОДоходах.КлассУсловийТруда,
		|	СведенияОДоходах.ВидДохода.ВходитВБазуПФР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.ТипСтроки,
		|	Начисления.НомерСтроки,
		|	Начисления.ВидРасчета,
		|	Начисления.ВидДохода,
		|	Начисления.ОблагаетсяЕНВД,
		|	Начисления.ОблагаетсяПоДополнительномуТарифу,
		|	Начисления.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Начисления.КлассУсловийТруда,
		|	Начисления.ЯвляетсяДоходомФармацевта,
		|	Начисления.ЛьготныйТерриториальныйТариф,
		|	Начисления.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
		|	Начисления.ПериодДействияНачало,
		|	Начисления.Результат,
		|	Начисления.Скидка,
		|	Начисления.Физлицо КАК Физлицо,
		|	Начисления.ДокументОснование,
		|	ВЫБОР
		|		КОГДА Начисления.Сторно
		|				И ДоходыЗаПериод.Результат >= 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ Начисления.Сторно
		|	КОНЕЦ КАК Сторно
		|ПОМЕСТИТЬ ВТВременная
		|ИЗ
		|	ВТНачисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗаПериод КАК ДоходыЗаПериод
		|		ПО Начисления.Физлицо = ДоходыЗаПериод.ФизЛицо
		|			И Начисления.ВидДохода.ВходитВБазуПФР = ДоходыЗаПериод.ОблагаетсяВзносамиВПФР
		|			И Начисления.ОблагаетсяПоДополнительномуТарифу = ДоходыЗаПериод.ОблагаетсяПоДополнительномуТарифу
		|			И Начисления.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
		|			И Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|			И Начисления.КлассУсловийТруда = ДоходыЗаПериод.КлассУсловийТруда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Временная.ТипСтроки,
		|	Временная.НомерСтроки,
		|	Временная.ВидРасчета,
		|	Временная.ВидДохода,
		|	Временная.ОблагаетсяЕНВД,
		|	Временная.ОблагаетсяПоДополнительномуТарифу,
		|	Временная.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	Временная.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	Временная.КлассУсловийТруда,
		|	Временная.ЯвляетсяДоходомФармацевта,
		|	Временная.ЛьготныйТерриториальныйТариф,
		|	Временная.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
		|	Временная.ПериодДействияНачало,
		|	Временная.Результат,
		|	Временная.Скидка,
		|	Временная.Физлицо,
		|	Временная.ДокументОснование,
		|	Временная.Сторно
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	ВТВременная КАК Временная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТВременная";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.ТипСтроки,
	|	МИНИМУМ(Начисления.НомерСтроки) КАК НомерСтроки,
	|	Начисления.ВидРасчета,
	|	Начисления.ВидДохода,
	|	Начисления.ОблагаетсяЕНВД,
	|	Начисления.ОблагаетсяПоДополнительномуТарифу,
	|	Начисления.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Начисления.КлассУсловийТруда,
	|	Начисления.ЯвляетсяДоходомФармацевта,
	|	Начисления.ЛьготныйТерриториальныйТариф,
	|	Начисления.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ) КАК ДатаНачала,
	|	СУММА(Начисления.Результат) КАК Результат,
	|	СУММА(Начисления.Скидка) КАК Скидка,
	|	Начисления.Физлицо КАК Физлицо,
	|	Начисления.Сторно
	|ПОМЕСТИТЬ ВТСтрокиДоходов
	|ИЗ
	|	ВТНачисления КАК Начисления
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.ТипСтроки,
	|	Начисления.ВидРасчета,
	|	Начисления.ВидДохода,
	|	Начисления.ОблагаетсяЕНВД,
	|	Начисления.ОблагаетсяПоДополнительномуТарифу,
	|	Начисления.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	Начисления.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	Начисления.КлассУсловийТруда,
	|	Начисления.ЯвляетсяДоходомФармацевта,
	|	Начисления.ЛьготныйТерриториальныйТариф,
	|	Начисления.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	Начисления.Физлицо,
	|	Начисления.Сторно,
	|	НАЧАЛОПЕРИОДА(Начисления.ПериодДействияНачало, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ТипСтроки,
	|	ДанныеДокумента.НомерСтроки,
	|	ДанныеДокумента.Физлицо,
	|	ДанныеДокумента.ВидРасчета,
	|	ДанныеДокумента.ВидДохода,
	|	ДанныеДокумента.ОблагаетсяЕНВД,
	|	ДанныеДокумента.ОблагаетсяПоДополнительномуТарифу,
	|	ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДанныеДокумента.КлассУсловийТруда,
	|	ДанныеДокумента.ЯвляетсяДоходомФармацевта,
	|	ДанныеДокумента.ЛьготныйТерриториальныйТариф,
	|	ДанныеДокумента.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ДанныеДокумента.Сторно,
	|	&КонецМесяца КАК ДатаПолученияДохода,
	|	СтрокиДокументаПоНомерСтроки.ДокументОснование,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сторно
	|				И ЕСТЬNULL(СтрокиДокументаПоПериодуДействия.НомерСтроки, 0) <> ДанныеДокумента.НомерСтроки
	|			ТОГДА 0
	|		КОГДА СторноЗаписиДокумента.Результат ЕСТЬ NULL 
	|			ТОГДА ДанныеДокумента.Результат
	|		КОГДА НЕ ДанныеДокумента.Сторно
	|				И ДанныеДокумента.Результат + СторноЗаписиДокумента.Результат > 0
	|			ТОГДА ДанныеДокумента.Результат + СторноЗаписиДокумента.Результат
	|		КОГДА ДанныеДокумента.Сторно
	|				И ДанныеДокумента.Результат + СторноЗаписиДокумента.Результат < 0
	|			ТОГДА ДанныеДокумента.Результат + СторноЗаписиДокумента.Результат
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Результат,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Сторно
	|				И ЕСТЬNULL(СтрокиДокументаПоПериодуДействия.НомерСтроки, 0) <> ДанныеДокумента.НомерСтроки
	|			ТОГДА 0
	|		КОГДА СторноЗаписиДокумента.Результат ЕСТЬ NULL 
	|			ТОГДА ДанныеДокумента.Скидка
	|		КОГДА НЕ ДанныеДокумента.Сторно
	|				И ДанныеДокумента.Результат + СторноЗаписиДокумента.Результат > 0
	|			ТОГДА ДанныеДокумента.Скидка + СторноЗаписиДокумента.Скидка
	|		КОГДА ДанныеДокумента.Сторно
	|				И ДанныеДокумента.Результат + СторноЗаписиДокумента.Результат < 0
	|			ТОГДА ДанныеДокумента.Скидка + СторноЗаписиДокумента.Скидка
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Скидка,
	|	СтрокиДокументаПоПериодуДействия.ДокументОснование КАК СторнируемыйДокумент
	|ПОМЕСТИТЬ ВТНачисленияСоСторноЗаписями
	|ИЗ
	|	ВТСтрокиДоходов КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК СтрокиДокументаПоПериодуДействия
	|		ПО (ДанныеДокумента.ДатаНачала = НАЧАЛОПЕРИОДА(СтрокиДокументаПоПериодуДействия.ПериодДействияНачало, МЕСЯЦ))
	|			И ДанныеДокумента.ТипСтроки = СтрокиДокументаПоПериодуДействия.ТипСтроки
	|			И ДанныеДокумента.ВидРасчета = СтрокиДокументаПоПериодуДействия.ВидРасчета
	|			И ДанныеДокумента.Физлицо = СтрокиДокументаПоПериодуДействия.Физлицо
	|			И ДанныеДокумента.ВидДохода = СтрокиДокументаПоПериодуДействия.ВидДохода
	|			И ДанныеДокумента.ОблагаетсяЕНВД = СтрокиДокументаПоПериодуДействия.ОблагаетсяЕНВД
	|			И ДанныеДокумента.ОблагаетсяПоДополнительномуТарифу = СтрокиДокументаПоПериодуДействия.ОблагаетсяПоДополнительномуТарифу
	|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|			И ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СтрокиДокументаПоПериодуДействия.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|			И ДанныеДокумента.КлассУсловийТруда = СтрокиДокументаПоПериодуДействия.КлассУсловийТруда
	|			И ДанныеДокумента.ЯвляетсяДоходомФармацевта = СтрокиДокументаПоПериодуДействия.ЯвляетсяДоходомФармацевта
	|			И ДанныеДокумента.ЛьготныйТерриториальныйТариф = СтрокиДокументаПоПериодуДействия.ЛьготныйТерриториальныйТариф
	|			И ДанныеДокумента.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ = СтрокиДокументаПоПериодуДействия.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			И ДанныеДокумента.Сторно = СтрокиДокументаПоПериодуДействия.Сторно
	|			И (СтрокиДокументаПоПериодуДействия.Сторно)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисления КАК СтрокиДокументаПоНомерСтроки
	|		ПО ДанныеДокумента.НомерСтроки = СтрокиДокументаПоНомерСтроки.НомерСтроки
	|			И ДанныеДокумента.ТипСтроки = СтрокиДокументаПоНомерСтроки.ТипСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтрокиДоходов КАК СторноЗаписиДокумента
	|		ПО ДанныеДокумента.ВидРасчета = СторноЗаписиДокумента.ВидРасчета
	|			И ДанныеДокумента.ТипСтроки = СторноЗаписиДокумента.ТипСтроки
	|			И ДанныеДокумента.Физлицо = СторноЗаписиДокумента.Физлицо
	|			И ДанныеДокумента.ДатаНачала = СторноЗаписиДокумента.ДатаНачала
	|			И ДанныеДокумента.ВидДохода = СторноЗаписиДокумента.ВидДохода
	|			И ДанныеДокумента.ОблагаетсяЕНВД = СторноЗаписиДокумента.ОблагаетсяЕНВД
	|			И ДанныеДокумента.ОблагаетсяПоДополнительномуТарифу = СторноЗаписиДокумента.ОблагаетсяПоДополнительномуТарифу
	|			И ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам = СторноЗаписиДокумента.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|			И ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СторноЗаписиДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
	|			И ДанныеДокумента.КлассУсловийТруда = СторноЗаписиДокумента.КлассУсловийТруда
	|			И ДанныеДокумента.ЯвляетсяДоходомФармацевта = СторноЗаписиДокумента.ЯвляетсяДоходомФармацевта
	|			И ДанныеДокумента.ЛьготныйТерриториальныйТариф = СторноЗаписиДокумента.ЛьготныйТерриториальныйТариф
	|			И ДанныеДокумента.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ = СторноЗаписиДокумента.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ
	|			И (НЕ ДанныеДокумента.Сторно
	|					И СторноЗаписиДокумента.Сторно
	|				ИЛИ ДанныеДокумента.Сторно
	|					И НЕ СторноЗаписиДокумента.Сторно)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленияСоСторноЗаписями.ТипСтроки,
	|	НачисленияСоСторноЗаписями.НомерСтроки,
	|	НачисленияСоСторноЗаписями.СторнируемыйДокумент
	|ИЗ
	|	ВТНачисленияСоСторноЗаписями КАК НачисленияСоСторноЗаписями
	|ГДЕ
	|	НачисленияСоСторноЗаписями.Сторно";
	
	ТаблицаСторнируемыхДокументов = Запрос.Выполнить().Выгрузить();
	ТаблицаПромежуточныхИсправлений = ТаблицаСторнируемыхДокументов.СкопироватьКолонки("СторнируемыйДокумент");
	ТаблицаПромежуточныхИсправлений.Колонки.Добавить("ПромежуточноеИсправление", ТаблицаСторнируемыхДокументов.Колонки.СторнируемыйДокумент.ТипЗначения);
	ПроведениеРасчетов.УточнитьСторнируемыеДокументы(ТаблицаСторнируемыхДокументов, ТаблицаПромежуточныхИсправлений);
	Запрос.УстановитьПараметр("ТаблицаСторнируемыхДокументов", ТаблицаСторнируемыхДокументов);
	Запрос.УстановитьПараметр("ТаблицаПромежуточныхИсправлений", ТаблицаПромежуточныхИсправлений);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСторнируемыхДокументов.ТипСтроки,
	|	ТаблицаСторнируемыхДокументов.НомерСтроки,
	|	ТаблицаСторнируемыхДокументов.СторнируемыйДокумент
	|ПОМЕСТИТЬ ВТТаблицаСторнируемыхДокументов
	|ИЗ
	|	&ТаблицаСторнируемыхДокументов КАК ТаблицаСторнируемыхДокументов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаПромежуточныхИсправлений.ПромежуточноеИсправление,
	|	ТаблицаПромежуточныхИсправлений.СторнируемыйДокумент
	|ПОМЕСТИТЬ ВТТаблицаПромежуточныхИсправлений
	|ИЗ
	|	&ТаблицаПромежуточныхИсправлений КАК ТаблицаПромежуточныхИсправлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходах.Период,
	|	СведенияОДоходах.ДокументОснование КАК Регистратор,
	|	СведенияОДоходах.Результат,
	|	СведенияОДоходах.Скидка,
	|	СведенияОДоходах.ФизЛицо,
	|	СведенияОДоходах.ВидДохода,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ДатаПолученияДохода,
	|	СведенияОДоходах.ВидРасчета
	|ПОМЕСТИТЬ ВТСведенияРегистраБезУточнений
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|ГДЕ
	|	СведенияОДоходах.ДокументОснование В
	|			(ВЫБРАТЬ
	|				СторноЗаписи.СторнируемыйДокумент
	|			ИЗ
	|				ВТТаблицаСторнируемыхДокументов КАК СторноЗаписи)
	|	И СведенияОДоходах.ФизЛицо В
	|			(ВЫБРАТЬ
	|				Начисления.Физлицо
	|			ИЗ
	|				ВТНачисленияСоСторноЗаписями КАК Начисления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияРегистраБезУточнений.Регистратор,
	|	СведенияРегистраБезУточнений.ФизЛицо,
	|	СведенияРегистраБезУточнений.ВидДохода,
	|	СведенияРегистраБезУточнений.ВидРасчета,
	|	СведенияРегистраБезУточнений.ОблагаетсяЕНВД,
	|	СведенияРегистраБезУточнений.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияРегистраБезУточнений.КлассУсловийТруда,
	|	СведенияРегистраБезУточнений.ЯвляетсяДоходомФармацевта,
	|	СведенияРегистраБезУточнений.ЛьготныйТерриториальныйТариф,
	|	СведенияРегистраБезУточнений.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	МИНИМУМ(СведенияРегистраБезУточнений.ДатаПолученияДохода) КАК ДатаПолученияДохода,
	|	МИНИМУМ(СведенияРегистраБезУточнений.Период) КАК Период
	|ПОМЕСТИТЬ ВТСторнируемыеСтрокиДоходов
	|ИЗ
	|	ВТСведенияРегистраБезУточнений КАК СведенияРегистраБезУточнений
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияРегистраБезУточнений.Регистратор,
	|	СведенияРегистраБезУточнений.ФизЛицо,
	|	СведенияРегистраБезУточнений.ВидДохода,
	|	СведенияРегистраБезУточнений.ОблагаетсяЕНВД,
	|	СведенияРегистраБезУточнений.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияРегистраБезУточнений.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияРегистраБезУточнений.КлассУсловийТруда,
	|	СведенияРегистраБезУточнений.ЯвляетсяДоходомФармацевта,
	|	СведенияРегистраБезУточнений.ЛьготныйТерриториальныйТариф,
	|	СведенияРегистраБезУточнений.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияРегистраБезУточнений.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоходыСУточнением.Период,
	|	ДоходыСУточнением.Регистратор,
	|	СУММА(ДоходыСУточнением.Результат) КАК Результат,
	|	СУММА(ДоходыСУточнением.Скидка) КАК Скидка,
	|	ДоходыСУточнением.ФизЛицо,
	|	ДоходыСУточнением.ВидДохода,
	|	ДоходыСУточнением.ОблагаетсяЕНВД,
	|	ДоходыСУточнением.ОблагаетсяПоДополнительномуТарифу,
	|	ДоходыСУточнением.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	ДоходыСУточнением.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДоходыСУточнением.КлассУсловийТруда,
	|	ДоходыСУточнением.ЯвляетсяДоходомФармацевта,
	|	ДоходыСУточнением.ЛьготныйТерриториальныйТариф,
	|	ДоходыСУточнением.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ДоходыСУточнением.ДатаПолученияДохода,
	|	ДоходыСУточнением.ВидРасчета
	|ПОМЕСТИТЬ ВТСведенияРегистра
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОДоходах.Период КАК Период,
	|		СведенияОДоходах.Регистратор КАК Регистратор,
	|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|		СведенияОДоходах.ВидДохода КАК ВидДохода,
	|		СведенияОДоходах.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|		СведенияОДоходах.ВидРасчета КАК ВидРасчета,
	|		СведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|		СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу КАК ОблагаетсяПоДополнительномуТарифу,
	|		СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам КАК ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|		СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|		СведенияОДоходах.КлассУсловийТруда КАК КлассУсловийТруда,
	|		СведенияОДоходах.ЯвляетсяДоходомФармацевта КАК ЯвляетсяДоходомФармацевта,
	|		СведенияОДоходах.ЛьготныйТерриториальныйТариф КАК ЛьготныйТерриториальныйТариф,
	|		СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ КАК ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|		СведенияОДоходах.Результат КАК Результат,
	|		СведенияОДоходах.Скидка КАК Скидка
	|	ИЗ
	|		ВТСведенияРегистраБезУточнений КАК СведенияОДоходах
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СведенияОДоходах.Период,
	|		СтрокиДоходов.Регистратор,
	|		СтрокиДоходов.ФизЛицо,
	|		СтрокиДоходов.ВидДохода,
	|		СведенияОДоходах.ДатаПолученияДохода,
	|		СтрокиДоходов.ВидРасчета,
	|		СтрокиДоходов.ОблагаетсяЕНВД,
	|		СтрокиДоходов.ОблагаетсяПоДополнительномуТарифу,
	|		СтрокиДоходов.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|		СтрокиДоходов.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|		СтрокиДоходов.КлассУсловийТруда,
	|		СтрокиДоходов.ЯвляетсяДоходомФармацевта,
	|		СтрокиДоходов.ЛьготныйТерриториальныйТариф,
	|		СтрокиДоходов.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|		СведенияОДоходах.Результат,
	|		СведенияОДоходах.Скидка
	|	ИЗ
	|		ВТСторнируемыеСтрокиДоходов КАК СтрокиДоходов
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаПромежуточныхИсправлений КАК ТаблицаПромежуточныхИсправлений
	|			ПО СтрокиДоходов.Регистратор = ТаблицаПромежуточныхИсправлений.СторнируемыйДокумент
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СведенияОДоходах
	|			ПО СтрокиДоходов.ФизЛицо = СведенияОДоходах.ФизЛицо
	|				И (ТаблицаПромежуточныхИсправлений.ПромежуточноеИсправление = СведенияОДоходах.ДокументОснование)
	|				И СтрокиДоходов.ВидДохода = СведенияОДоходах.ВидДохода
	|				И СтрокиДоходов.ВидРасчета = СведенияОДоходах.ВидРасчета
	|	ГДЕ
	|		СведенияОДоходах.ФизЛицо ЕСТЬ НЕ NULL ) КАК ДоходыСУточнением
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыСУточнением.Период,
	|	ДоходыСУточнением.Регистратор,
	|	ДоходыСУточнением.ФизЛицо,
	|	ДоходыСУточнением.ВидДохода,
	|	ДоходыСУточнением.ДатаПолученияДохода,
	|	ДоходыСУточнением.ОблагаетсяЕНВД,
	|	ДоходыСУточнением.ОблагаетсяПоДополнительномуТарифу,
	|	ДоходыСУточнением.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	ДоходыСУточнением.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ДоходыСУточнением.КлассУсловийТруда,
	|	ДоходыСУточнением.ЯвляетсяДоходомФармацевта,
	|	ДоходыСУточнением.ЛьготныйТерриториальныйТариф,
	|	ДоходыСУточнением.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ДоходыСУточнением.ВидРасчета
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДоходыСУточнением.Результат) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ТипСтроки КАК ТипСтроки,
	|	ДанныеДокумента.НомерСтроки КАК НомерСтроки,
	|	ДанныеДокумента.Физлицо,
	|	ДанныеДокумента.ДокументОснование,
	|	ДанныеДокумента.ВидРасчета,
	|	ЕСТЬNULL(СведенияОДоходах.ВидДохода, ДанныеДокумента.ВидДохода) КАК ВидДохода,
	|	ДанныеДокумента.Результат,
	|	ДанныеДокумента.Скидка,
	|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяЕНВД, ДанныеДокумента.ОблагаетсяЕНВД) КАК ОблагаетсяЕНВД,
	|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу, ДанныеДокумента.ОблагаетсяПоДополнительномуТарифу) КАК ОблагаетсяПоДополнительномуТарифу,
	|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам, ДанныеДокумента.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам) КАК ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	ЕСТЬNULL(СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией, ДанныеДокумента.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией) КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ЕСТЬNULL(СведенияОДоходах.КлассУсловийТруда, ДанныеДокумента.КлассУсловийТруда) КАК КлассУсловийТруда,
	|	ЕСТЬNULL(СведенияОДоходах.ЯвляетсяДоходомФармацевта, ДанныеДокумента.ЯвляетсяДоходомФармацевта) КАК ЯвляетсяДоходомФармацевта,
	|	ЕСТЬNULL(СведенияОДоходах.ЛьготныйТерриториальныйТариф, ДанныеДокумента.ЛьготныйТерриториальныйТариф) КАК ЛьготныйТерриториальныйТариф,
	|	ЕСТЬNULL(СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ, ДанныеДокумента.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ) КАК ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ЕСТЬNULL(СведенияОДоходах.ДатаПолученияДохода, ДанныеДокумента.ДатаПолученияДохода) КАК ДатаПолученияДохода,
	|	ВЫБОР
	|		КОГДА СведенияОДоходах.Регистратор ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСторнируемыеДанныеУчета,
	|	ЕСТЬNULL(СведенияОДоходах.Результат, 0) КАК РезультатВУчете,
	|	ЕСТЬNULL(СведенияОДоходах.Скидка, 0) КАК СкидкаВУчете
	|ИЗ
	|	ВТНачисленияСоСторноЗаписями КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблицаСторнируемыхДокументов КАК ТаблицаСторнируемыхДокументов
	|		ПО ДанныеДокумента.НомерСтроки = ТаблицаСторнируемыхДокументов.НомерСтроки
	|			И ДанныеДокумента.ТипСтроки = ТаблицаСторнируемыхДокументов.ТипСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияРегистра КАК СведенияОДоходах
	|		ПО (ТаблицаСторнируемыхДокументов.СторнируемыйДокумент = СведенияОДоходах.Регистратор)
	|			И ДанныеДокумента.Физлицо = СведенияОДоходах.ФизЛицо
	|			И (ВЫБОР
	|				КОГДА СведенияОДоходах.ВидРасчета.КодДоходаСтраховыеВзносы ЕСТЬ NULL 
	|					ТОГДА ДанныеДокумента.ВидДохода = СведенияОДоходах.ВидДохода
	|				ИНАЧЕ ДанныеДокумента.ВидРасчета = СведенияОДоходах.ВидРасчета
	|			КОНЕЦ)
	|ГДЕ
	|	(ДанныеДокумента.Результат <> 0
	|			ИЛИ ДанныеДокумента.Скидка <> 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипСтроки,
	|	НомерСтроки,
	|	ЕстьСторнируемыеДанныеУчета УБЫВ,
	|	ДатаПолученияДохода УБЫВ";
	
	Если ТипЗнч(НаборЗаписей) = Тип("ТаблицаЗначений") Тогда
		ВременнаяТаблица = НаборЗаписей	
	Иначе
		ВременнаяТаблица = НаборЗаписей.ВыгрузитьКолонки();
	КонецЕсли;

	Запрос.Текст = СтрЗаменить(Запрос.Текст,"СведенияОДоходах.ДокументОснование", "СведенияОДоходах." + ИмяПоляСторнируемогоДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("ТипСтроки") Цикл
		Пока Выборка.СледующийПоЗначениюПоля("НомерСтроки") Цикл
			Если Выборка.ЕстьСторнируемыеДанныеУчета Тогда
				
				СторноВсего = -Выборка.Результат;
				СторноСкидки = -Выборка.Скидка;
				
				Пока Выборка.Следующий() Цикл
					
					Результат = -Мин(СторноВсего, Выборка.РезультатВУчете);
					СторноВсего = СторноВсего + Результат;
					Если СторноСкидки = 0 Тогда
						Скидка = 0
					Иначе
						Скидка = -Мин(СторноСкидки, Выборка.СкидкаВУчете);
						СторноСкидки = СторноСкидки + Скидка;
					КонецЕсли;
					
					Движение = ВременнаяТаблица.Добавить();
					
					ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента); //  Период, ОбособленноеПодразделение, Организация
					ЗаполнитьЗначенияСвойств(Движение,Выборка); // Физлицо, ВидДохода, ВидРасчета и пр.
					
					// ресурсы 
					Движение.Результат = Результат;
					Движение.Скидка	= Скидка;
					
					Если СторноВсего = 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				Движение = ВременнаяТаблица.Добавить();
				
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента); //  Период, ОбособленноеПодразделение, Организация
				ЗаполнитьЗначенияСвойств(Движение,Выборка); // Период, Физлицо, ВидДохода, Результат, ВидРасчета
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ПоИтогамМесяца Тогда
		
		Запрос.УстановитьПараметр("ОбособленноеПодразделение", ВыборкаПоШапкеДокумента.ОбособленноеПодразделение);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
		|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
		|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
		|	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
		|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
		|	СУММА(СтраховыеВзносыСведенияОДоходах.Результат) КАК Результат,
		|	СУММА(СтраховыеВзносыСведенияОДоходах.Скидка) КАК Скидка,
		|	СтраховыеВзносыСведенияОДоходах.ВидРасчета
		|ПОМЕСТИТЬ ВТЗаписиЗаПрошлыйПериод
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыЗаПериод КАК ДоходыЗаПериод
		|		ПО СтраховыеВзносыСведенияОДоходах.ФизЛицо = ДоходыЗаПериод.ФизЛицо
		|			И СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР = ДоходыЗаПериод.ОблагаетсяВзносамиВПФР
		|			И СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу = ДоходыЗаПериод.ОблагаетсяПоДополнительномуТарифу
		|			И СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам = ДоходыЗаПериод.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
		|			И СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = ДоходыЗаПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией
		|			И СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда = ДоходыЗаПериод.КлассУсловийТруда
		|ГДЕ
		|	СтраховыеВзносыСведенияОДоходах.Регистратор <> &Ссылка
		|	И СтраховыеВзносыСведенияОДоходах.Организация = &Организация
		|	И СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &ОбособленноеПодразделение
		|	И ДоходыЗаПериод.Результат >= 0
		|	И НЕ СтраховыеВзносыСведенияОДоходах.ПоАктуПроверки
		|	И СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода < &Начало
		|	И СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &Начало И &Окончание
		|
		|СГРУППИРОВАТЬ ПО
		|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
		|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
		|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
		|	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
		|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
		|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
		|	СтраховыеВзносыСведенияОДоходах.ВидРасчета
		|
		|ИМЕЮЩИЕ
		|	СУММА(СтраховыеВзносыСведенияОДоходах.Результат) < 0  
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаписиЗаПрошлыйПериод.ФизЛицо,
		|	ЗаписиЗаПрошлыйПериод.ВидДохода,
		|	ЗаписиЗаПрошлыйПериод.ДатаПолученияДохода,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяЕНВД,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяПоДополнительномуТарифу,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	ЗаписиЗаПрошлыйПериод.ЯвляетсяДоходомФармацевта,
		|	ЗаписиЗаПрошлыйПериод.ЛьготныйТерриториальныйТариф,
		|	ЗаписиЗаПрошлыйПериод.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ЗаписиЗаПрошлыйПериод.КлассУсловийТруда,
		|	-ЗаписиЗаПрошлыйПериод.Результат КАК Результат,
		|	-ЗаписиЗаПрошлыйПериод.Скидка КАК Скидка,
		|	ЗаписиЗаПрошлыйПериод.ВидРасчета
		|ИЗ
		|	ВТЗаписиЗаПрошлыйПериод КАК ЗаписиЗаПрошлыйПериод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаписиЗаПрошлыйПериод.ФизЛицо,
		|	ЗаписиЗаПрошлыйПериод.ВидДохода,
		|	&КонецМесяца,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяЕНВД,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяПоДополнительномуТарифу,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
		|	ЗаписиЗаПрошлыйПериод.ЯвляетсяДоходомФармацевта,
		|	ЗаписиЗаПрошлыйПериод.ЛьготныйТерриториальныйТариф,
		|	ЗаписиЗаПрошлыйПериод.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
		|	ЗаписиЗаПрошлыйПериод.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
		|	ЗаписиЗаПрошлыйПериод.КлассУсловийТруда,
		|	ЗаписиЗаПрошлыйПериод.Результат,
		|	ЗаписиЗаПрошлыйПериод.Скидка,
		|	ЗаписиЗаПрошлыйПериод.ВидРасчета
		|ИЗ
		|	ВТЗаписиЗаПрошлыйПериод КАК ЗаписиЗаПрошлыйПериод";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Движение = ВременнаяТаблица.Добавить();
			
			ЗаполнитьЗначенияСвойств(Движение,ВыборкаПоШапкеДокумента); //  Период, ОбособленноеПодразделение, Организация
			ЗаполнитьЗначенияСвойств(Движение,Выборка); // Физлицо, ВидДохода, Результат, ВидРасчета ...
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НаборЗаписей) <> Тип("ТаблицаЗначений") Тогда
		ОбщегоНазначенияЗК.СвернутьТаблицуДвиженийРегистраНакоплений("СтраховыеВзносыСведенияОДоходах", ВременнаяТаблица);
		НаборЗаписей.Загрузить(ВременнаяТаблица);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоСкидкам(НаборЗаписейОДоходах, ОписаниеДокумента, НеоблагаемыеСуммыДоходов, ДанныеОДоходах) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДоходов",	ДанныеОДоходах);
	Запрос.УстановитьПараметр("НеоблагаемыеСуммы", НеоблагаемыеСуммыДоходов);
	
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("ФизЛицо");
	ТаблицаРаспределения.Колонки.Добавить("ВидДохода");
	ТаблицаРаспределения.Колонки.Добавить("ОблагаетсяПоДополнительномуТарифу");
	ТаблицаРаспределения.Колонки.Добавить("ВидРасчета");
	ТаблицаРаспределения.Колонки.Добавить("Результат");
	ТаблицаРаспределения.Колонки.Добавить("ОблагаетсяЕНВД");
	ТаблицаРаспределения.Колонки.Добавить("ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам");
	ТаблицаРаспределения.Колонки.Добавить("ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией");
	ТаблицаРаспределения.Колонки.Добавить("КлассУсловийТруда");
	ТаблицаРаспределения.Колонки.Добавить("ЯвляетсяДоходомФармацевта");
	ТаблицаРаспределения.Колонки.Добавить("ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ");
	ТаблицаРаспределения.Колонки.Добавить("ДатаПолученияДохода");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ВидДохода КАК ВидДохода,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СтраховыеВзносыСведенияОДоходах.КлассУсловийТруда,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СтраховыеВзносыСведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СтраховыеВзносыСведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СтраховыеВзносыСведенияОДоходах.Результат,
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода,
	|	СтраховыеВзносыСведенияОДоходах.ВидРасчета
	|ПОМЕСТИТЬ ВТДанныеДляРаспределенияСкидки
	|ИЗ
	|	&ТаблицаДоходов КАК СтраховыеВзносыСведенияОДоходах
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ВидДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ФизЛицо КАК ФизЛицо,
	|	ДанныеДокумента.Скидка,
	|	ДанныеДокумента.ДатаПолученияДохода,
	|	ДанныеДокумента.ВидДохода КАК ВидДохода
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	&НеоблагаемыеСуммы КАК ДанныеДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ВидДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ФизЛицо КАК ФизЛицо,
	|	ДанныеДокумента.ВидДохода КАК ВидДохода,
	|	СУММА(СведенияОДоходах.Результат) КАК Результат,
	|	СведенияОДоходах.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам КАК ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией КАК ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидРасчета КАК ВидРасчета,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу КАК ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ДатаПолученияДохода
	|ПОМЕСТИТЬ ВТСведенияОДоходах
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляРаспределенияСкидки КАК СведенияОДоходах
	|		ПО ДанныеДокумента.ФизЛицо = СведенияОДоходах.ФизЛицо
	|			И ДанныеДокумента.ВидДохода = СведенияОДоходах.ВидДохода
	|			И ДанныеДокумента.ДатаПолученияДохода = СведенияОДоходах.ДатаПолученияДохода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.ФизЛицо,
	|	ДанныеДокумента.ВидДохода,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходах.ВидРасчета,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу,
	|	СведенияОДоходах.ДатаПолученияДохода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ВидДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.ФизЛицо КАК ФизЛицо,
	|	ДанныеДокумента.ВидДохода КАК ВидДохода,
	|	ДанныеДокумента.Скидка,
	|	ДанныеДокумента.ДатаПолученияДохода КАК ДатаПолученияДохода,
	|	СведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам,
	|	СведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходах.КлассУсловийТруда,
	|	СведенияОДоходах.ОблагаетсяЕНВД,
	|	СведенияОДоходах.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходах.ЛьготныйТерриториальныйТариф,
	|	СведенияОДоходах.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	ЕСТЬNULL(СведенияОДоходах.Результат, 0) КАК Результат,
	|	СведенияОДоходах.ВидРасчета,
	|	СведенияОДоходах.ОблагаетсяПоДополнительномуТарифу
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДоходах КАК СведенияОДоходах
	|		ПО ДанныеДокумента.ФизЛицо = СведенияОДоходах.ФизЛицо
	|			И ДанныеДокумента.ВидДохода = СведенияОДоходах.ВидДохода
	|			И ДанныеДокумента.ДатаПолученияДохода = СведенияОДоходах.ДатаПолученияДохода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	ДатаПолученияДохода,
	|	ВидДохода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("ФизЛицо") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("ДатаПолученияДохода") Цикл
			
			Пока Выборка.СледующийПоЗначениюПоля("ВидДохода") Цикл
				
				СкидкаКРаспределению = Выборка.Скидка;
				
				ТаблицаРаспределения.Очистить();
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаРаспределения.Добавить(),Выборка);
				КонецЦикла;
				
				МассивКоэффициентов = ТаблицаРаспределения.ВыгрузитьКолонку("Результат");
				МассивСуммКНачислению = ОбщегоНазначенияЗК.РаспределитьПропорционально(СкидкаКРаспределению,МассивКоэффициентов);
				
				Если МассивСуммКНачислению = Неопределено Тогда
					
					СтрокаДвижения = НаборЗаписейОДоходах.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДвижения,ОписаниеДокумента);  // Период, Организация, ОбособленноеПодразделение
					ЗаполнитьЗначенияСвойств(СтрокаДвижения,Выборка,,"Результат"); // ФизЛицо,ВидДохода,ОблагаетсяЕНВД,ВидРасчета, ОблагаетсяПоДополнительномуТарифу, ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
					// ресурсы
					СтрокаДвижения.Скидка = СкидкаКРаспределению;
					
				Иначе
					
					Для каждого СтрокаТЗ Из ТаблицаРаспределения Цикл
						
						СтрокаДвижения = НаборЗаписейОДоходах.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДвижения,ОписаниеДокумента);  // Период, Организация, ОбособленноеПодразделение
						ЗаполнитьЗначенияСвойств(СтрокаДвижения,СтрокаТЗ,,"Результат"); // ФизЛицо,ВидДохода,ОблагаетсяЕНВД,ВидРасчета,ОблагаетсяПоДополнительномуТарифу, ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
						// ресурсы
						СтрокаДвижения.Скидка = МассивСуммКНачислению[ТаблицаРаспределения.Индекс(СтрокаТЗ)];
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияПоВзносамСОплаты4ДнейУходаЗаДетьмиИнвалидами(Движения, ОписаниеДокумента, МассивФизЛиц) Экспорт 

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Начало", НачалоМесяца(ОписаниеДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("Окончание", КонецМесяца(ОписаниеДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("Организация", ОписаниеДокумента.Организация);
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", ОписаниеДокумента.ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("МассивФизЛиц", МассивФизЛиц);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленные.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыИсчисленные.ДатаПолученияДохода,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифу + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуЕНВД + СтраховыеВзносыИсчисленные.ПФРПоСуммарномуТарифуСПревышения + СтраховыеВзносыИсчисленные.ФСС + СтраховыеВзносыИсчисленные.ФССЕНВД + СтраховыеВзносыИсчисленные.ФФОМС + СтраховыеВзносыИсчисленные.ФФОМСЕНВД + СтраховыеВзносыИсчисленные.ФССНесчастныеСлучаи + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличины + СтраховыеВзносыИсчисленные.ПФРДоПредельнойВеличиныЕНВД + СтраховыеВзносыИсчисленные.ПФРСПревышения + СтраховыеВзносыИсчисленные.ПФРСПревышенияЕНВД) КАК ОбычныеВзносы,
	|	СУММА(СтраховыеВзносыИсчисленные.ПФРПоДополнительномуТарифу + СтраховыеВзносыИсчисленные.ПФРНаДоплатуКПенсииШахтерам + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахВредный4 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОпасный + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный1 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный2 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный3 + СтраховыеВзносыИсчисленные.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахВредный4) КАК ВзносыЗаВредников
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные КАК СтраховыеВзносыИсчисленные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСтраховыхВзносов КАК РасчетСтраховыхВзносов
	|		ПО СтраховыеВзносыИсчисленные.Регистратор = РасчетСтраховыхВзносов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПерерасчетСтраховыхВзносов КАК ПерерасчетСтраховыхВзносов
	|		ПО СтраховыеВзносыИсчисленные.Регистратор = ПерерасчетСтраховыхВзносов.Ссылка
	|ГДЕ
	|	СтраховыеВзносыИсчисленные.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|	И СтраховыеВзносыИсчисленные.Период МЕЖДУ &Начало И &Окончание
	|	И СтраховыеВзносыИсчисленные.Организация = &Организация
	|	И СтраховыеВзносыИсчисленные.ФизЛицо В(&МассивФизЛиц)
	|	И (РасчетСтраховыхВзносов.Ссылка ЕСТЬ НЕ NULL 
	|			ИЛИ ПерерасчетСтраховыхВзносов.Ссылка ЕСТЬ НЕ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыИсчисленные.ФизЛицо,
	|	СтраховыеВзносыИсчисленные.ДатаПолученияДохода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	СтраховыеВзносыИсчисленные.ДатаПолученияДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(СтраховыеВзносыСведенияОДоходах.Результат - СтраховыеВзносыСведенияОДоходах.Скидка) КАК БазаВзносов,
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода,
	|	СтраховыеВзносыСведенияОДоходах.ВидРасчета,
	|	СУММА(ВЫБОР
	|			КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяПоДополнительномуТарифу
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам
	|					ИЛИ СтраховыеВзносыСведенияОДоходах.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией <> ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)
	|				ТОГДА СтраховыеВзносыСведенияОДоходах.Результат - СтраховыеВзносыСведенияОДоходах.Скидка
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК БазаВредныхВзносов,
	|	ВЫБОР
	|		КОГДА ОсновныеНачисленияОрганизаций.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПособие
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций КАК ДополнительныеНачисленияОрганизаций
	|		ПО СтраховыеВзносыСведенияОДоходах.ВидРасчета = ДополнительныеНачисленияОрганизаций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|		ПО СтраховыеВзносыСведенияОДоходах.ВидРасчета = ОсновныеНачисленияОрганизаций.Ссылка
	|ГДЕ
	|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &ОбособленноеПодразделение
	|	И СтраховыеВзносыСведенияОДоходах.Период МЕЖДУ &Начало И &Окончание
	|	И СтраховыеВзносыСведенияОДоходах.Организация = &Организация
	|	И СтраховыеВзносыСведенияОДоходах.ФизЛицо В(&МассивФизЛиц)
	|	И (СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФСС
	|			ИЛИ СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуФОМС)
	|	И (ДополнительныеНачисленияОрганизаций.Ссылка ЕСТЬ НЕ NULL 
	|			ИЛИ ОсновныеНачисленияОрганизаций.Ссылка ЕСТЬ НЕ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
	|	СтраховыеВзносыСведенияОДоходах.ДатаПолученияДохода,
	|	ВЫБОР
	|		КОГДА ОсновныеНачисленияОрганизаций.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.ДополнительныеВыходныеДниПоУходуЗаДетьмиИнвалидами)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СтраховыеВзносыСведенияОДоходах.ВидРасчета
	|
	|ИМЕЮЩИЕ
	|	СУММА(СтраховыеВзносыСведенияОДоходах.Результат - СтраховыеВзносыСведенияОДоходах.Скидка) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	-СУММА(ПособияСоциальномуСтрахованию.СуммаВсего) КАК СуммаВсего,
	|	ВЫБОР
	|		КОГДА ПособияСоциальномуСтрахованию.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
	|			ТОГДА ПособияСоциальномуСтрахованию.Сотрудник.Физлицо
	|		ИНАЧЕ ПособияСоциальномуСтрахованию.Сотрудник
	|	КОНЕЦ КАК ФизЛицо
	|ИЗ
	|	РегистрНакопления.ПособияСоциальномуСтрахованию КАК ПособияСоциальномуСтрахованию
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетСтраховыхВзносов КАК РасчетСтраховыхВзносов
	|		ПО ПособияСоциальномуСтрахованию.Регистратор = РасчетСтраховыхВзносов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПерерасчетСтраховыхВзносов КАК ПерерасчетСтраховыхВзносов
	|		ПО ПособияСоциальномуСтрахованию.Регистратор = ПерерасчетСтраховыхВзносов.Ссылка
	|ГДЕ
	|	ПособияСоциальномуСтрахованию.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ВидыПособийСоциальногоСтрахования.СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами)
	|	И ПособияСоциальномуСтрахованию.Период МЕЖДУ &Начало И &Окончание
	|	И ПособияСоциальномуСтрахованию.Организация = &ОбособленноеПодразделение
	|	И ВЫБОР
	|			КОГДА ПособияСоциальномуСтрахованию.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
	|				ТОГДА ПособияСоциальномуСтрахованию.Сотрудник.Физлицо
	|			ИНАЧЕ ПособияСоциальномуСтрахованию.Сотрудник
	|		КОНЕЦ В (&МассивФизЛиц)
	|	И (РасчетСтраховыхВзносов.Ссылка ЕСТЬ НЕ NULL 
	|			ИЛИ ПерерасчетСтраховыхВзносов.Ссылка ЕСТЬ НЕ NULL )
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПособияСоциальномуСтрахованию.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
	|			ТОГДА ПособияСоциальномуСтрахованию.Сотрудник.Физлицо
	|		ИНАЧЕ ПособияСоциальномуСтрахованию.Сотрудник
	|	КОНЕЦ";
	Результаты = Запрос.ВыполнитьПакет();
	
 	Отбор = Новый Структура("ФизЛицо, ДатаПолученияДохода");
	ТаблицаКоэффициентов = Результаты[1].Выгрузить();
	ТаблицаРаспределенныхПособий = Результаты[2].Выгрузить();
	Выборка = Результаты[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл

		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		
		СтрокиРаспределенияПоФизЛицу = ТаблицаКоэффициентов.НайтиСтроки(Отбор);
		
		Если СтрокиРаспределенияПоФизЛицу.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;		
		
		Коэффициенты = ВыделитьКоэффициентыРаспределенияИзМассиваСтрок(СтрокиРаспределенияПоФизЛицу,"БазаВзносов");
		РезультатыВзносов = ОбщегоНазначенияЗК.РаспределитьПропорционально(Выборка.ОбычныеВзносы, Коэффициенты);

		Коэффициенты = ВыделитьКоэффициентыРаспределенияИзМассиваСтрок(СтрокиРаспределенияПоФизЛицу,"БазаВредныхВзносов");
		РезультатыВредныхВзносов = ОбщегоНазначенияЗК.РаспределитьПропорционально(Выборка.ВзносыЗаВредников, Коэффициенты);

		Индекс = 0;
		Для Каждого СтрокаРаспределения Из СтрокиРаспределенияПоФизЛицу Цикл
			
			Если СтрокаРаспределения.ЭтоПособие Тогда
			
				Если РезультатыВзносов <> Неопределено Тогда
					СтрокаТЧ = ТаблицаРаспределенныхПособий.Добавить();
					СтрокаТЧ.СуммаВсего = РезультатыВзносов[Индекс];
					СтрокаТЧ.ФизЛицо = Выборка.ФизЛицо;
				КонецЕсли;
				
				Если РезультатыВредныхВзносов <> Неопределено Тогда
					СтрокаТЧ = ТаблицаРаспределенныхПособий.Добавить();
					СтрокаТЧ.СуммаВсего = РезультатыВредныхВзносов[Индекс];
					СтрокаТЧ.ФизЛицо = Выборка.ФизЛицо;
				КонецЕсли;
			
			КонецЕсли;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаРаспределенныхПособий.Свернуть("Физлицо","СуммаВсего");
	Для каждого СтрокаТЗ Из ТаблицаРаспределенныхПособий Цикл
		Если СтрокаТЗ.СуммаВсего = 0 Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ПособияСоциальномуСтрахованию.Добавить();
		Движение.Период = ОписаниеДокумента.ПериодРегистрации;
		Движение.Организация = ОписаниеДокумента.ОбособленноеПодразделение;
		Движение.ВидПособияСоциальногоСтрахования = Перечисления.ВидыПособийСоциальногоСтрахования.СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами;
		Движение.СуммаВсего = СтрокаТЗ.СуммаВсего;
		Движение.Сотрудник = СтрокаТЗ.ФизЛицо;
		Движение.ДокументОснование = ОписаниеДокумента.Ссылка;
		Движение.ДатаСтраховогоСлучая = КонецМесяца(ОписаниеДокумента.ПериодРегистрации);
	КонецЦикла;
	
КонецПроцедуры

// Выделяет коэффициенты отражения из массива переданных строк отражения
//
// Параметры
//  МассивСтрокОтражения - массив строк таблицы значений
//  ИмяКолонки - строка - имя колонки таблицы значений, содержащей 
//                 коэффициенты отражения
//
// Возвращаемое значение:
//   массив чисел - коэффициентов отражения
//
Функция ВыделитьКоэффициентыРаспределенияИзМассиваСтрок(МассивСтрокРаспределения,ИмяКолонки)
	
	Коэффициенты = Новый Массив;
	
	Для каждого СтрокаРаспределения Из МассивСтрокРаспределения Цикл
		Коэффициенты.Добавить(СтрокаРаспределения[ИмяКолонки]);
	КонецЦикла; 
	
	Возврат Коэффициенты
	
КонецФункции // ВыделитьКоэффициентыРаспределенияИзМассиваСтрок()

////////////////////////////////////////////////////////////////////////////////

// Формирует таблицу с отработанным временем в различных условиях вредности
//	с полями:
//		Сотрудник
//		ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией
//		ДоляВремени
//
// Параметры
//  МенеджерВременныхТаблиц - содержит вр.т. ВТСотрудники с полем Сотрудник
//
// Возвращаемое значение:
//   таблица значений
//
Функция ДолиДляРаспределенияВредности(МенеджерВременныхТаблиц, МесяцРасчета) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(МесяцРасчета));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(МесяцРасчета));
	Запрос.УстановитьПараметр("ДатаСледующегоМесяца", КонецМесяца(МесяцРасчета) + 1);
	
	ДатаМесяца = НачалоМесяца(МесяцРасчета);
	ДатыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(ДатаМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	ДатыТекст = ДатыТекст + "
	|ПОМЕСТИТЬ ВТДаты";
	Пока ДатаМесяца < НачалоДня(КонецМесяца(МесяцРасчета)) Цикл
		ДатаМесяца = ДатаМесяца + 86400;
		ДатыТекст = ДатыТекст +"
		|ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(ДатаМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ДатыТекст;
	Запрос.Выполнить();
	
	МассивМесяцев = Новый Массив;
	МассивМесяцев.Добавить(НачалоМесяца(МесяцРасчета));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(СотрудникиОрганизаций.ДатаУвольнения, МЕСЯЦ) КАК МесяцУвольнения
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|ГДЕ
	|	СотрудникиОрганизаций.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И СотрудникиОрганизаций.ДатаУвольнения < &НачалоМесяца
	|	И СотрудникиОрганизаций.Ссылка В
	|			(ВЫБРАТЬ
	|				Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТСотрудники КАК Сотрудники)";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МассивМесяцев.Добавить(Выборка.МесяцУвольнения);
			ДеньПериода = Выборка.МесяцУвольнения;
			ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(ДеньПериода,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериодыМесяц";
			Пока ДеньПериода < НачалоДня(КонецМесяца(Выборка.МесяцУвольнения)) Цикл
				ДеньПериода = ДеньПериода + 86400;
				ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(ДеньПериода,"ДФ=гггг,М,д,Ч,м,с") + ")";
				Если День(ДеньПериода) = День(КонецМесяца(ДеньПериода)) Тогда
					Запрос.Текст = ПериодыТекст;
					Запрос.Выполнить();
					ПериодыТекст = 
					"ВЫБРАТЬ
					|	ДатыПериода.Период
					|ПОМЕСТИТЬ ВТПериодыПромежуточная
					|ИЗ
					|	ВТПериодыМесяц КАК ДатыПериода
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	ДатыПериода.Период
					|ИЗ
					|	ВТДаты КАК ДатыПериода
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТДаты
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТПериодыМесяц
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ПериодыПромежуточная.Период
					|ПОМЕСТИТЬ ВТДаты
					|ИЗ
					|	ВТПериодыПромежуточная КАК ПериодыПромежуточная
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТПериодыПромежуточная"; 
					
					Запрос.Текст = ПериодыТекст;
					Запрос.Выполнить();
					ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(ДеньПериода,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериодыМесяц ГДЕ Ложь";
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивМесяцев", МассивМесяцев);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
	|	ДатыМесяца.Период КАК Период,
	|	ВЫБОР
	|		КОГДА СотрудникиОрганизаций.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ДатыМесяца.Период ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		КОГДА СотрудникиОрганизаций.ДатаУвольнения < ДатыМесяца.Период
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УжеУволен
	|ПОМЕСТИТЬ ВТДатыСотрудников
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДаты КАК ДатыМесяца
	|		ПО (ДатыМесяца.Период МЕЖДУ СотрудникиОрганизаций.ДатаПриемаНаРаботу И ВЫБОР
	|				КОГДА СотрудникиОрганизаций.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА &КонецМесяца
	|				ИНАЧЕ СотрудникиОрганизаций.ДатаУвольнения
	|			КОНЕЦ)
	|			И ((СотрудникиОрганизаций.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ИЛИ СотрудникиОрганизаций.ДатаУвольнения >= &НачалоМесяца)
	|					И ДатыМесяца.Период >= &НачалоМесяца
	|				ИЛИ СотрудникиОрганизаций.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И СотрудникиОрганизаций.ДатаУвольнения < &НачалоМесяца
	|					И ДатыМесяца.Период >= НАЧАЛОПЕРИОДА(СотрудникиОрганизаций.ДатаУвольнения, МЕСЯЦ))
	|ГДЕ
	|	СотрудникиОрганизаций.Ссылка В
	|			(ВЫБРАТЬ
	|				Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТСотрудники КАК Сотрудники)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиРегистра.Сотрудник КАК Сотрудник,
	|	ЗаписиРегистра.Период,
	|	ЗаписиРегистра.УжеУволен,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЗаписиРегистра.УжеУволен
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)
	|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= ЗаписиРегистра.Период
	|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизаций.ДолжностьЗавершения.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией
	|			ИНАЧЕ РаботникиОрганизаций.Должность.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией
	|		КОНЕЦ, ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)) КАК ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЗаписиРегистра.УжеУволен
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)
	|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= ЗаписиРегистра.Период
	|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
	|			ИНАЧЕ РаботникиОрганизаций.Должность
	|		КОНЕЦ, ЗНАЧЕНИЕ(Справочник.ДолжностиОрганизаций.ПустаяСсылка)) КАК Должность,
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА ЗаписиРегистра.УжеУволен
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)
	|			КОГДА РаботникиОрганизаций.ПериодЗавершения <= ЗаписиРегистра.Период
	|					И РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА РаботникиОрганизаций.ГрафикРаботыЗавершения
	|			ИНАЧЕ РаботникиОрганизаций.ГрафикРаботы
	|		КОНЕЦ, ЗНАЧЕНИЕ(Справочник.ГрафикиРаботы.ПустаяСсылка)) КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТВредностиСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДатыСотрудников.Сотрудник КАК Сотрудник,
	|		ДатыСотрудников.Период КАК Период,
	|		МАКСИМУМ(РаботникиОрганизаций.Период) КАК ПериодРегистра,
	|		ДатыСотрудников.УжеУволен КАК УжеУволен
	|	ИЗ
	|		ВТДатыСотрудников КАК ДатыСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО ДатыСотрудников.Сотрудник = РаботникиОрганизаций.Сотрудник
	|				И ДатыСотрудников.Период >= РаботникиОрганизаций.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДатыСотрудников.Сотрудник,
	|		ДатыСотрудников.Период,
	|		ДатыСотрудников.УжеУволен) КАК ЗаписиРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ПО ЗаписиРегистра.Сотрудник = РаботникиОрганизаций.Сотрудник
	|			И ЗаписиРегистра.ПериодРегистра = РаботникиОрганизаций.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиРегистра.Сотрудник,
	|	ЗаписиРегистра.Период,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЗаписиРегистра.УжеУволен
	|				ТОГДА ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|			КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= ЗаписиРегистра.Период
	|					И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаЗавершения
	|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.ВидРасчета
	|		КОНЕЦ КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций) КАК ВидРасчета
	|ПОМЕСТИТЬ ВТНачисленияСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДатыСотрудников.Сотрудник КАК Сотрудник,
	|		ДатыСотрудников.УжеУволен КАК УжеУволен,
	|		ДатыСотрудников.Период КАК Период,
	|		МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизаций.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТДатыСотрудников КАК ДатыСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|			ПО ДатыСотрудников.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
	|				И ДатыСотрудников.Период >= ПлановыеНачисленияРаботниковОрганизаций.Период
	|				И (ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение.Код ЕСТЬ NULL )
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДатыСотрудников.Сотрудник,
	|		ДатыСотрудников.УжеУволен,
	|		ДатыСотрудников.Период) КАК ЗаписиРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|		ПО ЗаписиРегистра.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
	|			И ЗаписиРегистра.ПериодРегистра = ПлановыеНачисленияРаботниковОрганизаций.Период
	|			И (ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение.Код ЕСТЬ NULL )
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= ЗаписиРегистра.Период
	|					И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
	|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиРегистра.Сотрудник,
	|	ЗаписиРегистра.Период,
	|	ВЫБОР
	|		КОГДА ЗаписиРегистра.УжеУволен
	|			ТОГДА ЛОЖЬ
	|		КОГДА ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВОтпускеПоУходу
	|ПОМЕСТИТЬ ВТОтпускаПоУходуСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДатыСотрудников.Сотрудник КАК Сотрудник,
	|		ДатыСотрудников.УжеУволен КАК УжеУволен,
	|		ДатыСотрудников.Период КАК Период,
	|		МАКСИМУМ(ПлановыеНачисленияРаботниковОрганизаций.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТДатыСотрудников КАК ДатыСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|			ПО ДатыСотрудников.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
	|				И ДатыСотрудников.Период >= ПлановыеНачисленияРаботниковОрганизаций.Период
	|				И (ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты))
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДатыСотрудников.Сотрудник,
	|		ДатыСотрудников.УжеУволен,
	|		ДатыСотрудников.Период) КАК ЗаписиРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций КАК ПлановыеНачисленияРаботниковОрганизаций
	|		ПО ЗаписиРегистра.Сотрудник = ПлановыеНачисленияРаботниковОрганизаций.Сотрудник
	|			И ЗаписиРегистра.ПериодРегистра = ПлановыеНачисленияРаботниковОрганизаций.Период
	|			И (ПлановыеНачисленияРаботниковОрганизаций.ВидРасчетаИзмерение = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомБезОплаты))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <= ЗаписиРегистра.Период
	|					И ПлановыеНачисленияРаботниковОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ПлановыеНачисленияРаботниковОрганизаций.ДействиеЗавершения
	|			ИНАЧЕ ПлановыеНачисленияРаботниковОрганизаций.Действие
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокРаботников.Сотрудник,
	|	СписокРаботников.Период,
	|	ВЫБОР
	|		КОГДА ГрафикиРаботыПоВидамВремени.План
	|			ТОГДА ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение
	|		ИНАЧЕ ГрафикиРаботыПоВидамВремени.ДополнительноеЗначениеПолное
	|	КОНЕЦ КАК Часы,
	|	ВЫБОР
	|		КОГДА ГрафикиРаботыПоВидамВремени.План
	|			ТОГДА ГрафикиРаботыПоВидамВремени.ОсновноеЗначение
	|		ИНАЧЕ ГрафикиРаботыПоВидамВремени.ОсновноеЗначениеПолное
	|	КОНЕЦ КАК Дни,
	|	ГрафикиРаботыПоВидамВремени.План
	|ПОМЕСТИТЬ ВТДанныеИндивидуальныхГрафиковИТабелей
	|ИЗ
	|	ВТДатыСотрудников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СписокРаботников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И СписокРаботников.Период = ГрафикиРаботыПоВидамВремени.Дата
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|			И (ГрафикиРаботыПоВидамВремени.Месяц В (&МассивМесяцев))
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокРаботников.Сотрудник КАК Сотрудник,
	|	СписокРаботников.Период,
	|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение КАК Дни,
	|	ГрафикиРаботыПоВидамВремени.ДополнительноеЗначение КАК Часы
	|ПОМЕСТИТЬ ВТОбщиеГрафикиРаботы
	|ИЗ
	|	ВТВредностиСотрудников КАК СписокРаботников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО СписокРаботников.ГрафикРаботы = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И СписокРаботников.Период = ГрафикиРаботыПоВидамВремени.Дата
	|			И (ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням))
	|			И (ГрафикиРаботыПоВидамВремени.Месяц В (&МассивМесяцев))
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиДляУточненияВредностей.Сотрудник,
	|	СотрудникиДляУточненияВредностей.Период,
	|	ВЫБОР
	|		КОГДА СотрудникиДляУточненияВредностей.УжеУволен
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(ОтпускаПоУходуСотрудников.ВОтпускеПоУходу, ЛОЖЬ)
	|				И ЕСТЬNULL(НачисленияСотрудников.ВидРасчета, ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеРаботает,
	|	ВЫБОР
	|		КОГДА СотрудникиДляУточненияВредностей.УжеУволен
	|			ТОГДА 0
	|		КОГДА ФактическиОтработано.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ФактическиОтработано.Часы
	|		КОГДА ИндивидуальныеГрафикиРаботы.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ИндивидуальныеГрафикиРаботы.Часы
	|		ИНАЧЕ ЕСТЬNULL(ОбщиеГрафикиРаботы.Часы, 0)
	|	КОНЕЦ КАК ОтработаноЧасов,
	|	ВЫБОР
	|		КОГДА СотрудникиДляУточненияВредностей.УжеУволен
	|			ТОГДА 0
	|		КОГДА ФактическиОтработано.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ФактическиОтработано.Дни
	|		КОГДА ИндивидуальныеГрафикиРаботы.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ИндивидуальныеГрафикиРаботы.Дни
	|		ИНАЧЕ ЕСТЬNULL(ОбщиеГрафикиРаботы.Дни, 0)
	|	КОНЕЦ КАК ОтработаноДней,
	|	ВЫБОР
	|		КОГДА СотрудникиДляУточненияВредностей.УжеУволен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)
	|		КОГДА ЕСТЬNULL(ОтпускаПоУходуСотрудников.ВОтпускеПоУходу, ЛОЖЬ)
	|				И ЕСТЬNULL(НачисленияСотрудников.ВидРасчета, ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка)
	|		ИНАЧЕ СотрудникиДляУточненияВредностей.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией
	|	КОНЕЦ КАК ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	ВЫБОР
	|		КОГДА СотрудникиДляУточненияВредностей.УжеУволен
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|		КОГДА ЕСТЬNULL(ОтпускаПоУходуСотрудников.ВОтпускеПоУходу, ЛОЖЬ)
	|				И ЕСТЬNULL(НачисленияСотрудников.ВидРасчета, ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(КлассыУсловийТрудаПоДолжностямСрезПоследних.КлассУсловийТруда, ЗНАЧЕНИЕ(Перечисление.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка))
	|	КОНЕЦ КАК КлассУсловийТруда
	|ПОМЕСТИТЬ ВТСотрудникСВредностьюИОтработаннымВременем
	|ИЗ
	|	ВТВредностиСотрудников КАК СотрудникиДляУточненияВредностей
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ФактическиОтработано
	|		ПО СотрудникиДляУточненияВредностей.Сотрудник = ФактическиОтработано.Сотрудник
	|			И СотрудникиДляУточненияВредностей.Период = ФактическиОтработано.Период
	|			И (НЕ ФактическиОтработано.План)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДанныеИндивидуальныхГрафиковИТабелей КАК ИндивидуальныеГрафикиРаботы
	|		ПО СотрудникиДляУточненияВредностей.Сотрудник = ИндивидуальныеГрафикиРаботы.Сотрудник
	|			И СотрудникиДляУточненияВредностей.Период = ИндивидуальныеГрафикиРаботы.Период
	|			И (ИндивидуальныеГрафикиРаботы.План)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбщиеГрафикиРаботы КАК ОбщиеГрафикиРаботы
	|		ПО СотрудникиДляУточненияВредностей.Сотрудник = ОбщиеГрафикиРаботы.Сотрудник
	|			И СотрудникиДляУточненияВредностей.Период = ОбщиеГрафикиРаботы.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияСотрудников КАК НачисленияСотрудников
	|		ПО СотрудникиДляУточненияВредностей.Сотрудник = НачисленияСотрудников.Сотрудник
	|			И СотрудникиДляУточненияВредностей.Период = НачисленияСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтпускаПоУходуСотрудников КАК ОтпускаПоУходуСотрудников
	|		ПО СотрудникиДляУточненияВредностей.Сотрудник = ОтпускаПоУходуСотрудников.Сотрудник
	|			И СотрудникиДляУточненияВредностей.Период = ОтпускаПоУходуСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлассыУсловийТрудаПоДолжностям.СрезПоследних(&КонецМесяца, ) КАК КлассыУсловийТрудаПоДолжностямСрезПоследних
	|		ПО СотрудникиДляУточненияВредностей.Должность = КлассыУсловийТрудаПоДолжностямСрезПоследних.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДанныеИндивидуальныхГрафиковИТабелей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбщиеГрафикиРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОтпускаПоУходуСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДатыСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВредностиСотрудников.Сотрудник КАК Сотрудник,
	|	ВредностиСотрудников.Период КАК Период,
	|	ЕСТЬNULL(ВредностиСотрудников.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ) КАК СуммированныйУчетРабочегоВремени,
	|	НачисленияСотрудников.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	НачисленияСотрудников.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ОбозначениеВТабелеУчетаРабочегоВремени,
	|	НачисленияСотрудников.ВидРасчета.ВидВремени КАК ВидВремени,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НачисленияСотрудников.ВидРасчета.СпособРасчета <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)
	|				ТОГДА ЛОЖЬ
	|			КОГДА ОсновныеНачисленияОрганизацийПоказатели.Ссылка В (ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ТарифнаяСтавкаЧасовая), ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ОтработаноВремениВЧасах), ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.НормаВремениВЧасах), ЗНАЧЕНИЕ(Справочник.ПоказателиСхемМотивации.ВремяВЧасах))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьЧасовойПоказатель
	|ИЗ
	|	ВТВредностиСотрудников КАК ВредностиСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияСотрудников КАК НачисленияСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК ОсновныеНачисленияОрганизацийПоказатели
	|			ПО НачисленияСотрудников.ВидРасчета = ОсновныеНачисленияОрганизацийПоказатели.Ссылка
	|		ПО ВредностиСотрудников.Сотрудник = НачисленияСотрудников.Сотрудник
	|			И ВредностиСотрудников.Период = НачисленияСотрудников.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВредностиСотрудников.Сотрудник,
	|	ВредностиСотрудников.Период,
	|	ВредностиСотрудников.ГрафикРаботы.СуммированныйУчетРабочегоВремени,
	|	НачисленияСотрудников.ВидРасчета.СпособРасчета,
	|	ЕСТЬNULL(ВредностиСотрудников.ГрафикРаботы.СуммированныйУчетРабочегоВремени, ЛОЖЬ),
	|	НачисленияСотрудников.ВидРасчета.ВидВремени,
	|	НачисленияСотрудников.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Период";
	
	ТаблицаКОбработке = Запрос.Выполнить().Выгрузить();
	ТаблицаКОбработке.Колонки.Добавить("ВидУчетаВремени", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУчетаВремени"));
	Для каждого СтрокаТЗ Из ТаблицаКОбработке Цикл
	    Если СтрокаТЗ.ЕстьЧасовойПоказатель Тогда
			СтрокаТЗ.ВидУчетаВремени = Перечисления.ВидыУчетаВремени.ПоЧасам
		Иначе
			СтрокаТЗ.ВидУчетаВремени = ПроведениеРасчетов.ПолучитьВидУчетаВремени(СтрокаТЗ.СпособРасчета, СтрокаТЗ.ВидВремени, СтрокаТЗ.СуммированныйУчетРабочегоВремени, СтрокаТЗ.ОбозначениеВТабелеУчетаРабочегоВремени);	
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("УчетВремениСотрудников", ТаблицаКОбработке);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетВремениСотрудников.Сотрудник,
	|	УчетВремениСотрудников.Период,
	|	УчетВремениСотрудников.ВидУчетаВремени
	|ПОМЕСТИТЬ ВТУчетВремениСотрудниковПоДням
	|ИЗ
	|	&УчетВремениСотрудников КАК УчетВремениСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетВремениСотрудниковПоДням.Сотрудник,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА УчетВремениСотрудниковПоДням.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоЧасам)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК РассчитыватьДолюПоЧасам
	|ПОМЕСТИТЬ ВТУчетВремениСотрудников
	|ИЗ
	|	ВТУчетВремениСотрудниковПоДням КАК УчетВремениСотрудниковПоДням
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетВремениСотрудниковПоДням.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникСВредностьюИОтработаннымВременем.Сотрудник КАК Сотрудник,
	|	СотрудникСВредностьюИОтработаннымВременем.КлассУсловийТруда,
	|	СотрудникСВредностьюИОтработаннымВременем.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	МИНИМУМ(СотрудникСВредностьюИОтработаннымВременем.НеРаботает) КАК НеРаботает,
	|	СУММА(ВЫБОР
	|			КОГДА УчетВремениСотрудников.РассчитыватьДолюПоЧасам
	|				ТОГДА СотрудникСВредностьюИОтработаннымВременем.ОтработаноЧасов
	|			ИНАЧЕ СотрудникСВредностьюИОтработаннымВременем.ОтработаноДней
	|		КОНЕЦ) КАК ДоляВремени
	|ИЗ
	|	ВТСотрудникСВредностьюИОтработаннымВременем КАК СотрудникСВредностьюИОтработаннымВременем
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетВремениСотрудников КАК УчетВремениСотрудников
	|		ПО СотрудникСВредностьюИОтработаннымВременем.Сотрудник = УчетВремениСотрудников.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникСВредностьюИОтработаннымВременем.Сотрудник,
	|	СотрудникСВредностьюИОтработаннымВременем.КлассУсловийТруда,
	|	СотрудникСВредностьюИОтработаннымВременем.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВредностиСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТНачисленияСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТУчетВремениСотрудниковПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТСотрудникСВредностьюИОтработаннымВременем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТУчетВремениСотрудников";
    Результаты = Запрос.ВыполнитьПакет();
	
	ТаблицаДолейДляРаспределенияВредности = Результаты[2].Выгрузить();
	ТаблицаДолейДляРаспределенияВредности.Индексы.Добавить("Сотрудник");
	
	Возврат ТаблицаДолейДляРаспределенияВредности
	
КонецФункции

// в переданной таблице распределяет, если потребуется, суммы дохода по разным условиям вредности
Процедура УточнитьДанныеОРаботахСДосрочнойПенсией(ТаблицаДанных, ТаблицаДолейДляРаспределенияВредности, ПроверятьПериодДействия, МесяцРасчета = Неопределено, ОписаниеНачислений = Неопределено, ИмяПоляРезультата = "Результат") Экспорт
	
	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		НоваяТаблица = ТаблицаДанных.СкопироватьКолонки();
	Иначе
		НоваяТаблица = ТаблицаДанных.ВыгрузитьКолонки();
	КонецЕсли;

	ЗаполнятьКлассУсловийТруда = НоваяТаблица.Колонки.Найти("КлассУсловийТруда") <> Неопределено;
	
	СоответствиеНеРаботающих = Новый Соответствие;
	СтруктураОтбора = Новый Структура("Сотрудник, НеРаботает", Неопределено, Ложь);
	Для каждого СтрокаТЗ Из ТаблицаДолейДляРаспределенияВредности.НайтиСтроки(Новый Структура("НеРаботает", Истина)) Цикл
		СтруктураОтбора.Сотрудник = СтрокаТЗ.Сотрудник;
		Если ТаблицаДолейДляРаспределенияВредности.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
			СоответствиеНеРаботающих.Вставить(СтрокаТЗ.Сотрудник, Истина);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтбора = Новый Структура("Сотрудник");
	Для каждого СтрокаТЗ Из ТаблицаДанных Цикл
		
		Сумма = СтрокаТЗ[ИмяПоляРезультата];
		Если Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СоответствиеНеРаботающих[СтрокаТЗ.Сотрудник] = Неопределено Тогда
			Если ПроверятьПериодДействия Тогда
				Если Не ЗначениеЗаполнено(СтрокаТЗ.ВидРасчета) Тогда
					Продолжить;	
				КонецЕсли;
				ОписаниеНачисления = ОписаниеНачислений[СтрокаТЗ.ВидРасчета];
				Если Не ОписаниеНачисления.РаспределяетсяВоВсехСлучаях Тогда // учет некоторых начислений уточняем всегда - они начислялись без учета кадровых изменений
					Если НачалоМесяца(СтрокаТЗ.ПериодДействияНачало) = МесяцРасчета Тогда // учет начислений текущего месяца не меняем
						Продолжить;	
					ИначеЕсли ОписаниеНачисления.ВидСтажаСЗВ4 = Перечисления.ВидыСтажаСЗВ4.ВключаетсяВСтажДляДосрочногоНазначенияПенсии Тогда // из начислений за другие месяцы не трогаем соответствующие периодам вредного стажа
						Продолжить;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			СтруктураОтбора.Сотрудник = СтрокаТЗ.Сотрудник;
			СтрокиРаспределения = ТаблицаДолейДляРаспределенияВредности.НайтиСтроки(СтруктураОтбора);
			ВсегоСтрок = СтрокиРаспределения.Количество();
			Если ВсегоСтрок = 1 Тогда
				СтрокаТЗ.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СтрокиРаспределения[0].ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией;
				Если ЗаполнятьКлассУсловийТруда Тогда
					СтрокаТЗ.КлассУсловийТруда = СтрокиРаспределения[0].КлассУсловийТруда;
				КонецЕсли;
			ИначеЕсли ВсегоСтрок > 1 Тогда
				
				Коэффициенты = Новый Массив;
				Для каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
					Коэффициенты.Добавить(СтрокаРаспределения.ДоляВремени);
				КонецЦикла; 
				РаспределениеРесурса = ОбщегоНазначенияЗК.РаспределитьПропорционально(Сумма,Коэффициенты);
				Если РаспределениеРесурса <> Неопределено Тогда
					Индекс = 0;
					Для каждого СтрокаРаспределения Из СтрокиРаспределения Цикл
						Если Индекс = 0 Тогда
							СтрокаКОбработке = СтрокаТЗ;
						Иначе 
							СтрокаКОбработке = НоваяТаблица.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаКОбработке, СтрокаТЗ);
						КонецЕсли;
						СтрокаКОбработке[ИмяПоляРезультата] = РаспределениеРесурса[Индекс];
						СтрокаКОбработке.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = СтрокаРаспределения.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией;
						Если ЗаполнятьКлассУсловийТруда Тогда
							СтрокаКОбработке.КлассУсловийТруда = СтрокаРаспределения.КлассУсловийТруда;
						КонецЕсли;
						Индекс = Индекс + 1;
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			СтрокаТЗ.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией = Перечисления.ВидыРаботСДосрочнойПенсией.ПустаяСсылка();
			Если ЗаполнятьКлассУсловийТруда Тогда
				СтрокаТЗ.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияЗК.ЗагрузитьВТаблицуЗначений(НоваяТаблица, ТаблицаДанных);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Процедура ОчиститьКлассУсловийТруда(НаборЗаписей, ИмяПоляПериод = "Период") Экспорт
	
	ДатаВступленияЗаконаВСилу = РасчетСтраховыхВзносов.ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись[ИмяПоляПериод] < ДатаВступленияЗаконаВСилу И ЗначениеЗаполнено(Запись.КлассУсловийТруда) Тогда
			Запись.КлассУсловийТруда = Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.ПустаяСсылка()
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ДАТЫ ИЗМЕНЕНИЯ ЗАКОНОДАТЕЛЬСТВА

// Возвращает дату вступления в силу Федерального закона "О внесении изменений в отдельные законодательные акты Российской Федерации по вопросам обязательного пенсионного страхования в части права выбора застрахованными лицами варианта пенсионного обеспечения"
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаОбъединенияСтраховойИНакопительнойЧастейВзносовПФР() Экспорт 

	Возврат '20140101'

КонецФункции 

Функция ДатаВыделенияВзносовНаОПСсСуммПревышенияПредельнойВеличины() Экспорт 

	Возврат '20160101'

КонецФункции 

// Возвращает год, с которого для каждого вида взноса используется своя база 
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   число
//
Функция ГодРазделенияПредельныхОблагаемыхБаз() Экспорт

	Возврат 2015

КонецФункции 

// Возвращает дату вступления в силу Федерального закона от 28 июня 2014 года № 188-ФЗ.
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаСтрахованияВсехВременноПребывающих() Экспорт 

	Возврат '20150101'

КонецФункции

// Возвращает дату вступления в силу Федерального закона от 30 декабря 2014 года № 4??-ФЗ.
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаВозмещенияФССВзносовСОплаты4ДнейУходаЗаДетьмиИнвалидами() Экспорт 

	Возврат '20150101'

КонецФункции

// Возвращает дату вступления в силу Федерального закона от ?? 2016 года № ???-ФЗ.
//
// Параметры:
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаПередачиАдминистрированияВзносовФНС() Экспорт 

	Возврат '20170101'

КонецФункции

