
//#Область ПрограммныйИнтерфейс

// Устанавливает имя и параметры формы сопоставления номенклатуры и алкогольной продукции.
//
// Параметры:
//  ИмяФормы - Строка - имя формы сопоставления номенклатуры и алкогольной продукции;
//  ПараметрыФормы - Структура - параметры открываемой формы, содержит:
//    АлкогольнаяПродукция - СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС - Сопоставляемая алкогольная продукция.
//    НоменклатураДляВыбора - Массив - массив номенклатуры для быстрого выбора.
//  Владелец - УправляемаяФорма, Неопределено - Форма-владелец;
//  ОписаниеОповещенияОЗакрытии - ОписаниеОповещения - описание оповещения о закрытии формы.
//
Процедура ИмяИПараметрыФормыСопоставления(ИмяФормы, ПараметрыФормы, Владелец, ОписаниеОповещенияОЗакрытии) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Возвращает имя события, которое наступает при записи документа поступления в базу данных.
//
Функция ИмяСобытияЗаписиПоступленияТоваров() Экспорт
	
	
	Возврат "";
	
КонецФункции

//#КонецОбласти
