// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ, хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы периода построения отчета
// и периодичность
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;
Перем мПериодичность Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мСчетчикСтраниц Экспорт; // флажок на форме выбора страниц, если Истина, то пересчет автоматический убрать

Перем мАвтоВыборКодов Экспорт; // для флажка "отключить выбор значений из списка"

Перем мЗаписьЗапрещена Экспорт;

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске

Перем мТаблицаФормОтчета Экспорт;

Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

// Переменная для хранения корректного текста для подменю Очистить.
// Хранится текст, декларация или отчет или расчет... очищать.
Перем мЧтоОчищать Экспорт;

Перем СвойстваЗаполненияОтчета Экспорт;

Перем мФормыИФорматы Экспорт;
Перем мВерсияОтчета Экспорт;

Перем мПроверятьСоотношенияПриПечатиИВыгрузки Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция СтрокаЧГ0(ИсходноеЧисло) Экспорт // враппер
	
	Возврат РегламентированнаяОтчетность.СтрокаЧГ0(ИсходноеЧисло);
	
КонецФункции

Процедура Инкр(ИнкрементируемоеЗначение) Экспорт
	
	ИнкрементируемоеЗначение = ИнкрементируемоеЗначение + 1;
	
КонецПроцедуры

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

Форма20040101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2003-12-01', "130", "ФормаОтчета2004Кв1");

Форма20050101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2004-12-22', "111", "ФормаОтчета2005Кв1");

Форма20060401 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2006-03-31', "37", "ФормаОтчета2006Кв2");

Форма20070101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2007-01-19', "11", "ФормаОтчета2007Кв1");

Форма20070701 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2007-08-21', "192", "ФормаОтчета2007Кв3");

Форма20090401 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2009-04-13', "92", "ФормаОтчета2009Кв2");

Форма20100101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2009-11-06', "871н", "ФормаОтчета2010Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20100101, "0.1");

Форма20101201 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2010-12-21', "1147н", "ФормаОтчета2010Кв4");
ОпределитьФорматВДеревеФормИФорматов(Форма20101201, "0.1");

Форма20110101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2011-02-28', "156н", "ФормаОтчета2011Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20110101, "0.3");

Форма20120301 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2012-03-12', "216н", "ФормаОтчета2012Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20120301, "0.4");

Форма20120701 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2012-08-31', "152н", "ФормаОтчета2012Кв3");
ОпределитьФорматВДеревеФормИФорматов(Форма20120701, "0.5");

Форма20130601 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2013-03-19', "107н", "ФормаОтчета2013Кв2");
ОпределитьФорматВДеревеФормИФорматов(Форма20130601, "0.5");

ФормаОтчета2014Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2014-02-11', "94н", "ФормаОтчета2014Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2014Кв1, "0.6");

ФормаОтчета2015Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2015-02-26', "59", "ФормаОтчета2015Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2015Кв1, "0.7");

ФормаОтчета2016Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2016-02-25', "54", "ФормаОтчета2016Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2016Кв1, "0.8");

ФормаОтчета2016Кв3 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2016-07-04', "260", "ФормаОтчета2016Кв3");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2016Кв3, "0.9");

ФормаОтчета2017Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2016-09-26', "381", "ФормаОтчета2017Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2017Кв1, "0.92");

ФормаОтчета2017Кв3 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1159999", '2017-06-07', "275", "ФормаОтчета2017Кв3");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2017Кв3, "0.93");

мЧтоОчищать = "Расчетную ведомость";

ОписаниеТиповСтрока15 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(15);
ОписаниеТиповСтрока50 = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(50);

мТаблицаСоставПоказателей = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",     ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",   ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",     ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",     ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",      ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСтруктуре", ОписаниеТиповСтрока50);

мСтруктураВариантыЗаполнения = Новый Структура;

ОписаниеТиповСтрока = ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(254);

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2004Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена постановлением ФСС РФ от 01.12.2003 №130";
НоваяФорма.ДатаНачалоДействия = '2003-01-01';
НоваяФорма.ДатаКонецДействия  = '2004-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2005Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена постановлением ФСС РФ от 22.12.2004 №111";
НоваяФорма.ДатаНачалоДействия = '2005-01-01';
НоваяФорма.ДатаКонецДействия  = '2006-03-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2006Кв2";
НоваяФорма.ОписаниеОтчета     = "Утверждена постановлением ФCC РФ от 22.12.2004 №111 (в ред. постановления ФСС РФ от 31.03.2006 г. № 37)";
НоваяФорма.ДатаНачалоДействия = '2006-04-01';
НоваяФорма.ДатаКонецДействия  = '2006-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена постановлением ФCC РФ от 22.12.2004 №111 (в ред. постановлений ФСС РФ от 31.03.2006 г. № 37, от 19.01.2007 № 11)";
НоваяФорма.ДатаНачалоДействия = '2007-01-01';
НоваяФорма.ДатаКонецДействия  = '2007-06-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв3";
НоваяФорма.ОписаниеОтчета     = "Утверждена постановлением ФCC РФ от 22.12.2004 №111 (в ред. постановлений ФСС РФ от 31.03.2006 г. № 37, от 19.01.2007 № 11, от 27.07.2007 № 165, от 21.08.2007 № 192)";
НоваяФорма.ДатаНачалоДействия = '2007-07-01';
НоваяФорма.ДатаКонецДействия  = '2009-03-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009Кв2";
НоваяФорма.ОписаниеОтчета     = "Утверждена постановлением ФCC РФ от 22.12.2004 №111 (в ред. от 31.03.2006 г. № 37, от 19.01.2007 № 11, от 27.07.2007 № 165, от 21.08.2007 № 192, от 13.04.2009 № 92)";
НоваяФорма.ДатаНачалоДействия = '2009-04-01';
НоваяФорма.ДатаКонецДействия  = '2009-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв1";
НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Минздравсоцразвития РФ от 06.11.2009 N 871н";
НоваяФорма.ДатаНачалоДействия = '2010-01-01';
НоваяФорма.ДатаКонецДействия  = '2010-11-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2010Кв4";
НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Минздравсоцразвития РФ от 06.11.2009 N 871н (в редакции приказа Минздравсоцразвития РФ от 21.12.2010 № 1147н)";
НоваяФорма.ДатаНачалоДействия = '2010-12-01';
НоваяФорма.ДатаКонецДействия  = '2010-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу Минздравсоцразвития России от 12.03.2012 № 216н";
НоваяФорма.ДатаНачалоДействия = '2012-01-01';
НоваяФорма.ДатаКонецДействия  = '2013-05-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу Минздравсоцразвития России от 28.02.2011 № 156н";
НоваяФорма.ДатаНачалоДействия = '2011-01-01';
НоваяФорма.ДатаКонецДействия  = '2012-03-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв3";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу Минздравсоцразвития России от 12.03.2012 № 216н (в редакции приказа Минтруда России от 31.08.2012 № 152н)";
НоваяФорма.ДатаНачалоДействия = '2012-09-01';
НоваяФорма.ДатаКонецДействия  = '2013-05-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв2";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу Минтруда России от 19.03.2013 № 107н";
НоваяФорма.ДатаНачалоДействия = '2013-06-01';
НоваяФорма.ДатаКонецДействия  = '2013-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу Минтруда России от 19.03.2013 № 107н (в редакции приказа Минтруда России от 11.02.2014 № 94н)";
НоваяФорма.ДатаНачалоДействия = '2014-01-01';
НоваяФорма.ДатаКонецДействия  = '2014-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФСС РФ от 26.02.2015 № 59";
НоваяФорма.ДатаНачалоДействия = '2015-01-01';
НоваяФорма.ДатаКонецДействия  = '2015-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФСС РФ от 26.02.2015 № 59 (в редакции приказа ФСС РФ от 25.02.2016 № 54)";
НоваяФорма.ДатаНачалоДействия = '2016-01-01';
НоваяФорма.ДатаКонецДействия  = '2016-06-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв3";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФСС РФ от 26.02.2015 № 59 (в редакции приказа ФСС РФ от 04.07.2016 № 260)";
НоваяФорма.ДатаНачалоДействия = '2016-07-01';
НоваяФорма.ДатаКонецДействия  = '2016-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФСС РФ от 26.09.2016 № 381";
НоваяФорма.ДатаНачалоДействия = '2017-01-01';
НоваяФорма.ДатаКонецДействия  = '2017-08-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017Кв3";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФСС РФ от 26.09.2016 № 381 (в редакции приказа ФСС РФ от 07.06.2017 № 275)";
НоваяФорма.ДатаНачалоДействия = '2017-09-01';
НоваяФорма.ДатаКонецДействия  = ОбщегоНазначения.ПустоеЗначениеТипа(Тип("Дата"));
