Процедура Подключаемый_ПроверитьОтветыНаЗаявленияНаПодключение() Экспорт
	
	ДокументооборотСКОКлиент.ПроверитьОтветыНаЗаявленияНаПодключение();
	
КонецПроцедуры

Процедура Подключаемый_ПроверитьОтветыНаЗаявленияНаПодключениеПриЗапуске() Экспорт
	
	ДокументооборотСКОКлиент.ПроверитьОтветыНаЗаявленияНаПодключение();
	
КонецПроцедуры

Процедура Подключаемый_ПредупредитьОбИстеченииСертификатов() Экспорт
	
	ДокументооборотСКОКлиент.ПредупредитьОбИстеченииСертификатов();
	
КонецПроцедуры

Процедура Подключаемый_ПредупредитьОТребованияхПоНДС() Экспорт
	
	ДокументооборотСКОКлиент.ПредупредитьОТребованияхПоНДС();
	
КонецПроцедуры

Процедура Подключаемый_ПредупредитьОКонфликтеКриптопровайдеров() Экспорт
	
	ДокументооборотСКОКлиент.ПредупредитьОКонфликтеКриптопровайдеров();
	
КонецПроцедуры

Процедура Подключаемый_ПодключитьОбработчикАвтообменаСНалоговымиОрганами() Экспорт
	
	ДокументооборотСКОКлиент.ПодключитьОбработчикАвтообменаСНалоговымиОрганами();
	
КонецПроцедуры

Процедура Подключаемый_ОбработчикАвтообменаСНалоговымиОрганами() Экспорт
	
	ДокументооборотСКОКлиент.ОбработчикАвтообменаСНалоговымиОрганами();
	
КонецПроцедуры

Процедура Подключаемый_ИнициализироватьКонтекстДокументооборотаСНалоговымиОрганами() Экспорт
	
	ДокументооборотСКОКлиент.ИнициализироватьКонтекстДокументооборотаСНалоговымиОрганами();
	
КонецПроцедуры

Процедура Подключаемый_ПредупредитьОНекорректныхСтатусахОтправки2НДФЛ() Экспорт
	
	ДокументооборотСКОКлиент.ПредупредитьОНекорректныхСтатусахОтправки2НДФЛ();
	
КонецПроцедуры

Процедура Подключаемый_ЗаменитьКодыТОГСПриНеобходимости() Экспорт
	
	РегламентированнаяОтчетность.ВФонеЗаменитьВОрганизацияхИПодразделенияхКодОрганаФСГС();
	
КонецПроцедуры

