// Хранит соответствие, при помощи которого храним и показываем содержимое пачки
Перем СоответствиеСсылокИОбъектов Экспорт;

Перем МассивПрошлыхПериодов Экспорт;

////////////////////////////////////////////////////////////////////////////////

// Процедура выводить сообщения в специальное окно сообщений
// тексты сообщений берутся из переменной МассивСообщений
//
Процедура ВывестиСообщенияОбОшибках(МассивСообщений) Экспорт
	
	Если МассивСообщений.Количество() > 0 Тогда
		ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
		ОбработкаКомментариев.УдалитьСообщения();
		ОбработкаКомментариев.ДобавитьСообщение("Подготовка данных для передачи в ПФР", Перечисления.ВидыСообщений.Раздел);
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			Если ЭлементМассива.РасшифровкаСообщения <> Неопределено И ЭлементМассива.РасшифровкаСообщения.Количество() > 1 Тогда
				РодительскаяСтрока = ОбработкаКомментариев.ДобавитьСообщение(ЭлементМассива.ТекстСообщения, ЭлементМассива.ВидСообщения);
				Для Каждого ЭлементРасшифровки Из ЭлементМассива.РасшифровкаСообщения Цикл
					МассивРасшифровки = Новый Массив;
					МассивРасшифровки.Добавить(Новый Структура("Представление, Расшифровка", ЭлементРасшифровки.Представление, ЭлементРасшифровки.Расшифровка));
					ОбработкаКомментариев.ДобавитьСообщение("", Перечисления.ВидыСообщений.Информация, МассивРасшифровки, РодительскаяСтрока);
					
				КонецЦикла;
			Иначе
				ОбработкаКомментариев.ДобавитьСообщение(ЭлементМассива.ТекстСообщения, ЭлементМассива.ВидСообщения, ЭлементМассива.РасшифровкаСообщения);
			КонецЕсли
		КонецЦикла;
		ОбработкаКомментариев.ПоказатьСообщения();
	КонецЕсли;	
	
КонецПроцедуры // ВывестиСообщенияОбОшибках()

// Создает структуру, с параметрами выводимого сообщения 
// для помещения в массив сообщений-структур
Функция СоздатьСообщениеСтруктуру(ТекстСообщения, ВидСообщения, РасшифровкаСообщения = Неопределено) Экспорт 
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТекстСообщения", ТекстСообщения);
	СтруктураСообщения.Вставить("ВидСообщения", ВидСообщения);
	СтруктураСообщения.Вставить("РасшифровкаСообщения", РасшифровкаСообщения);
	Возврат СтруктураСообщения
КонецФункции // СоздатьСообщениеСтруктуру()

////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьТаблицуДокументовАДВ() Экспорт 
	
	СоответствиеСсылокИОбъектов = Новый Соответствие;
	ПачкиДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("ДатаЗаменыЕСН", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией", ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаСЗВ4вПФР.Ссылка,
	|	ПередачаСЗВ4вПФР.НомерПачки КАК НомерПачки,
	|	ПередачаСЗВ4вПФР.НеСодержитСЗВ КАК НеПоказыватьКадровику,
	|	ПередачаСЗВ4вПФР.ОтчетныйПериод
	|ИЗ
	|	Документ.ПередачаСЗВ4вПФР КАК ПередачаСЗВ4вПФР
	|ГДЕ
	|	ПередачаСЗВ4вПФР.Организация = &Организация
	|	И ПередачаСЗВ4вПФР.ОтчетныйПериод = &ОтчетныйПериод
	|	И НЕ ПередачаСЗВ4вПФР.СпециальныйДокумент2010года
	|	И НЕ ПередачаСЗВ4вПФР.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.НомерПачки,
	|	ЛОЖЬ,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод
	|ИЗ
	|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4 КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|		ПО СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка = ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Организация = &Организация
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод = &ОтчетныйПериод
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.СпециальныйДокумент2010года
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПометкаУдаления
	|	И ПередачаСЗВ4вПФРПачкиДокументов.Ссылка ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.НомерПачки,
	|	ЛОЖЬ,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод
	|ИЗ
	|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4 КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2013 КАК ПередачаСЗВ4вПФРПачкиДокументов
	|		ПО СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка = ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Организация = &Организация
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод = &ОтчетныйПериод
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод >= &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.СпециальныйДокумент2010года
	|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПометкаУдаления
	|	И ПередачаСЗВ4вПФРПачкиДокументов.Ссылка ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПачкаДокументовСЗВ_6_4.Ссылка,
	|	ПачкаДокументовСЗВ_6_4.НомерПачки,
	|	ЛОЖЬ,
	|	ПачкаДокументовСЗВ_6_4.ОтчетныйПериод
	|ИЗ
	|	Документ.ПачкаДокументовСЗВ_6_4 КАК ПачкаДокументовСЗВ_6_4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2013 КАК ПередачаСЗВ4вПФРПачкиДокументов2013
	|		ПО ПачкаДокументовСЗВ_6_4.Ссылка = ПередачаСЗВ4вПФРПачкиДокументов2013.ДокументПачка
	|ГДЕ
	|	ПачкаДокументовСЗВ_6_4.Организация = &Организация
	|	И ПачкаДокументовСЗВ_6_4.ОтчетныйПериод = &ОтчетныйПериод
	|	И НЕ ПачкаДокументовСЗВ_6_4.ПометкаУдаления
	|	И ПередачаСЗВ4вПФРПачкиДокументов2013.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПачки";
	
	РаботаетНеРасчетчик = Не НастройкаПравДоступаПереопределяемый.ДоступнаРольРасчетчикаРегл();
	
	МассивПачек = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если РаботаетНеРасчетчик И Выборка.НеПоказыватьКадровику Тогда
			Продолжить;
		КонецЕсли;
		СтрокаПачки = ПачкиДокументов.Добавить();
		СтрокаПачки.Пачка			= Выборка.Ссылка;
		СтрокаПачки.ОтчетныйПериод	= Выборка.ОтчетныйПериод;
		МассивПачек.Добавить(Выборка.Ссылка);
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПередачаСЗВ4ВПФР") Тогда
			Если ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
				ПустыеСтроки = ДокументОбъект.ПачкиДокументов.НайтиСтроки(Новый Структура("ДокументПачка", Документы.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПустаяСсылка()));
				Если ПустыеСтроки.Количество() > 0 Тогда
					Для каждого СтрокаДокумента Из ПустыеСтроки Цикл
						ДокументОбъект.ПачкиДокументов.Удалить(СтрокаДокумента);
					КонецЦикла; 
				КонецЕсли;
			Иначе
				ПустыеСтроки = ДокументОбъект.ПачкиДокументов2013.НайтиСтроки(Новый Структура("ДокументПачка", Документы.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПустаяСсылка()));
				Если ПустыеСтроки.Количество() > 0 Тогда
					Для каждого СтрокаДокумента Из ПустыеСтроки Цикл
						ДокументОбъект.ПачкиДокументов2013.Удалить(СтрокаДокумента);
					КонецЦикла; 
				КонецЕсли;
				ПустыеСтроки = ДокументОбъект.ПачкиДокументов2013.НайтиСтроки(Новый Структура("ДокументПачка", Документы.ПачкаДокументовСЗВ_6_4.ПустаяСсылка()));
				Если ПустыеСтроки.Количество() > 0 Тогда
					Для каждого СтрокаДокумента Из ПустыеСтроки Цикл
						ДокументОбъект.ПачкиДокументов2013.Удалить(СтрокаДокумента);
					КонецЦикла; 
				КонецЕсли;
				ПустыеСтроки = ДокументОбъект.ПачкиДокументов2013.НайтиСтроки(Новый Структура("ДокументПачка", Неопределено));
				Если ПустыеСтроки.Количество() > 0 Тогда
					Для каждого СтрокаДокумента Из ПустыеСтроки Цикл
						ДокументОбъект.ПачкиДокументов2013.Удалить(СтрокаДокумента);
					КонецЦикла; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,ДокументОбъект);
	КонецЦикла;
	
	МассивПрошлыхПериодов = Новый Массив;
	Если Не РаботаетНеРасчетчик Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияПринятыеПФР.КомплектДокументов КАК Пачка,
		|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР КАК ОтчетныйПериод
		|ИЗ
		|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
		|ГДЕ
		|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
		|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР >= &ДатаЗаменыЕСН
		|	И СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4ВПФР.ПустаяСсылка)
		|	И СведенияПринятыеПФР.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетныйПериод УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ПачкиДокументов.Добавить(), Выборка);
			МассивПачек.Добавить(Выборка.Пачка);
			СоответствиеСсылокИОбъектов.Вставить(Выборка.Пачка, Выборка.Пачка.ПолучитьОбъект());
		КонецЦикла;
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР КАК ОтчетныйПериодПерсучетаПФР
		|ИЗ
		|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
		|ГДЕ
		|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
		|	И СведенияПринятыеПФР.Организация = &Организация
		|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР >= &ДатаЗаменыЕСН
		|	И СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4ВПФР.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СтраховыеВзносыСведенияОДоходах.Период < ДАТАВРЕМЯ(2010, 7, 1)
		|			ТОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, ГОД)
		|		КОГДА СтраховыеВзносыСведенияОДоходах.Период < ДАТАВРЕМЯ(2011, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, КВАРТАЛ)
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
		|ГДЕ
		|	СтраховыеВзносыСведенияОДоходах.Период >= &ДатаЗаменыЕСН
		|	И СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &Организация
		|	И СтраховыеВзносыСведенияОДоходах.Период < &ОтчетныйПериод
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2010, 7, 1)
		|			ТОГДА НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, ГОД)
		|		КОГДА ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < ДАТАВРЕМЯ(2011, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации, КВАРТАЛ)
		|	КОНЕЦ
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|ГДЕ
		|	ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации >= &ДатаЗаменыЕСН
		|	И ОсновныеНачисленияРаботниковОрганизаций.ПериодРегистрации < &ОтчетныйПериод
		|	И ОсновныеНачисленияРаботниковОрганизаций.ОбособленноеПодразделение = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетныйПериодПерсучетаПФР";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивПрошлыхПериодов.Добавить(Выборка.ОтчетныйПериодПерсучетаПФР);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПачкиАДВ", МассивПачек);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка КАК Ссылка
	|ИЗ
	|	Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.Ссылка В(&ПачкиАДВ)
	|	И ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка <> ЗНАЧЕНИЕ(Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПустаяСсылка)
	|	И ПередачаСЗВ4вПФРПачкиДокументов.Ссылка.ОтчетныйПериод < &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов2013.ДокументПачка
	|ИЗ
	|	Документ.ПередачаСЗВ4вПФР.ПачкиДокументов2013 КАК ПередачаСЗВ4вПФРПачкиДокументов2013
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов2013.Ссылка В(&ПачкиАДВ)
	|	И ПередачаСЗВ4вПФРПачкиДокументов2013.ДокументПачка <> ЗНАЧЕНИЕ(Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПустаяСсылка)
	|	И ПередачаСЗВ4вПФРПачкиДокументов2013.ДокументПачка <> ЗНАЧЕНИЕ(Документ.ПачкаДокументовСЗВ_6_4.ПустаяСсылка)
	|	И ПередачаСЗВ4вПФРПачкиДокументов2013.ДокументПачка <> НЕОПРЕДЕЛЕНО
	|	И ПередачаСЗВ4вПФРПачкиДокументов2013.Ссылка.ОтчетныйПериод >= &ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,Выборка.Ссылка.ПолучитьОбъект()) 
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуДокументовАДВ()

Процедура ЗаполнитьТаблицуДокументовСПВ() Экспорт 
	
	СоответствиеСсылокИОбъектов = Новый Соответствие;
	ПачкиСПВ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОВзносахИСтраховомСтажеСПВ1.Ссылка,
	|	СведенияОВзносахИСтраховомСтажеСПВ1.НомерПачки КАК НомерПачки
	|ИЗ
	|	Документ.СведенияОВзносахИСтраховомСтажеСПВ1 КАК СведенияОВзносахИСтраховомСтажеСПВ1
	|ГДЕ
	|	СведенияОВзносахИСтраховомСтажеСПВ1.Организация = &Организация
	|	И СведенияОВзносахИСтраховомСтажеСПВ1.ОтчетныйПериод = &ОтчетныйПериод
	|	И (НЕ СведенияОВзносахИСтраховомСтажеСПВ1.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПачки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПачкиСПВ.Добавить().Пачка = Выборка.Ссылка;
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,Выборка.Ссылка.ПолучитьОбъект()) 
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуДокументовАДВ()

Процедура ЗаполнитьТаблицуДокументовСЗВ63() Экспорт 
	
	СоответствиеСсылокИОбъектов = Новый Соответствие;
	ПачкиСЗВ63.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйГод);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОНачисленномЗаработкеСЗВ63.Ссылка,
	|	СведенияОНачисленномЗаработкеСЗВ63.НомерПачки КАК НомерПачки
	|ИЗ
	|	Документ.СведенияОНачисленномЗаработкеСЗВ63 КАК СведенияОНачисленномЗаработкеСЗВ63
	|ГДЕ
	|	СведенияОНачисленномЗаработкеСЗВ63.Организация = &Организация
	|	И СведенияОНачисленномЗаработкеСЗВ63.ОтчетныйПериод = &ОтчетныйПериод
	|	И (НЕ СведенияОНачисленномЗаработкеСЗВ63.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПачки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПачкиСЗВ63.Добавить().Пачка = Выборка.Ссылка;
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,Выборка.Ссылка.ПолучитьОбъект()) 
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуДокументовАДВ()

////////////////////////////////////////////////////////////////////////////////

// Получает значения общих для всех видов документов реквизитов
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Структура, содержащая значения реквизитов
//
Функция СтруктураОбщихРеквизитовДокумента()
	
	СтруктураРеквизитов = Новый Структура("Организация,ОтчетныйПериод,ФорматФайла,Ответственный,Руководитель,ДолжностьРуководителя,Дата,ОписьАДВ62");
	СтруктураРеквизитов.Дата = ОбщегоНазначенияЗК.ПолучитьРабочуюДату(); 
	СтруктураРеквизитов.Организация = Организация;
	СтруктураРеквизитов.ОтчетныйПериод = ОтчетныйПериод;
	СтруктураРеквизитов.ФорматФайла = Перечисления.ФорматФайлаПФР.Версия07;
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ПроцедурыПерсонифицированногоУчета.ДанныеРуководителяОрганизации(Организация, СтруктураРеквизитов.Дата));
	СтруктураРеквизитов.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	Если СтруктураРеквизитов.Ответственный.Пустая() Тогда
		СтруктураРеквизитов.Ответственный = глЗначениеПеременной("глТекущийПользователь")
	КонецЕсли;
	
    Возврат СтруктураРеквизитов
	
КонецФункции // СтруктураОбщихРеквизитовДокумента()

////////////////////////////////////////////////////////////////////////////////

Функция СоздатьАДВ(ЭтоАДВ11 = Ложь, СтруктураРеквизитов = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.ПередачаСЗВ4вПФР.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.НеСодержитСЗВ = ЭтоАДВ11;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.ПередачаСЗВ4вПФР.ПолучитьСсылку());
	Если ЭтоАДВ11 Тогда
		ДокОбъект.АвтозаполнениеСтрокЗадолженности();
	КонецЕсли;
	
	СтрокаПачки = ПачкиДокументов.Добавить();
	СтрокаПачки.Пачка			= ДокОбъект.ПолучитьСсылкуНового();
	СтрокаПачки.ОтчетныйПериод	= ДокОбъект.ОтчетныйПериод;
	СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
	Если ИзменятьПозициюСтроки Тогда
		ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции // СоздатьАДВ()

Функция СоздатьСЗВ6(ВСоставеОписи = Истина, ДокументОбъектАДВ11 = Неопределено, СтруктураРеквизитов = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.СведенияОТрудовомСтажеИЗаработкеСЗВ4.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ;
	ДокОбъект.ТипФормДокументов = "СЗВ-6-2";
	ДокОбъект.КатегорияЗастрахованныхЛиц = КатегорияЗастрахованныхЛиц;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПолучитьСсылку());
	
	Если ВСоставеОписи Тогда
		Если ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
			СтрокаПачки = ДокументОбъектАДВ11.ПачкиДокументов.Добавить();
		Иначе
			СтрокаПачки = ДокументОбъектАДВ11.ПачкиДокументов2013.Добавить();
		КонецЕсли;
		СтрокаПачки.ДокументПачка = ДокОбъект.ПолучитьСсылкуНового();
		СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.ДокументПачка, ДокОбъект);
		Если ИзменятьПозициюСтроки Тогда
			ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
		КонецЕсли;
	Иначе
		СтрокаПачки = ПачкиДокументов.Добавить();
		СтрокаПачки.Пачка			= ДокОбъект.ПолучитьСсылкуНового();
		СтрокаПачки.ОтчетныйПериод	= ДокОбъект.ОтчетныйПериод;
		СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
		Если ИзменятьПозициюСтроки Тогда
			ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции

Функция СоздатьСЗВ64(ВСоставеОписи = Истина, ДокументОбъектАДВ11 = Неопределено, СтруктураРеквизитов = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.ПачкаДокументовСЗВ_6_4.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ;
	ДокОбъект.ТипФормДокументов = "СЗВ-6-4";
	ДокОбъект.ТипДоговора = Перечисления.ТипДоговораСЗВ63.Трудовой;
	ДокОбъект.КатегорияЗастрахованныхЛиц = КатегорияЗастрахованныхЛиц;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.ПачкаДокументовСЗВ_6_4.ПолучитьСсылку());
	
	Если ВСоставеОписи Тогда
		СтрокаПачки = ДокументОбъектАДВ11.ПачкиДокументов2013.Добавить();
		СтрокаПачки.ДокументПачка = ДокОбъект.ПолучитьСсылкуНового();
		СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.ДокументПачка, ДокОбъект);
		Если ИзменятьПозициюСтроки Тогда
			ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
		КонецЕсли;
	Иначе
		СтрокаПачки = ПачкиДокументов.Добавить();
		СтрокаПачки.Пачка			= ДокОбъект.ПолучитьСсылкуНового();
		СтрокаПачки.ОтчетныйПериод	= ДокОбъект.ОтчетныйПериод;
		СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
		Если ИзменятьПозициюСтроки Тогда
			ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции

Функция СоздатьСПВ(СтруктураРеквизитов = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.СведенияОВзносахИСтраховомСтажеСПВ1.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ;
	ДокОбъект.КатегорияЗастрахованныхЛиц = КатегорияЗастрахованныхЛиц;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.СведенияОВзносахИСтраховомСтажеСПВ1.ПолучитьСсылку());
	
	СтрокаПачки = ПачкиСПВ.Добавить();
	СтрокаПачки.Пачка = ДокОбъект.ПолучитьСсылкуНового();
	СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
	Если ИзменятьПозициюСтроки Тогда
		ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции

Функция СоздатьСЗВ63(СтруктураРеквизитов = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.СведенияОНачисленномЗаработкеСЗВ63.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ;
	ДокОбъект.ТипДоговора = Перечисления.ТипДоговораСЗВ63.Трудовой;
	ДокОбъект.ОтчетныйПериод = ОтчетныйГод;
	ДокОбъект.КатегорияЗастрахованныхЛиц = КатегорияЗастрахованныхЛиц;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.СведенияОНачисленномЗаработкеСЗВ63.ПолучитьСсылку());
	
	СтрокаПачки = ПачкиСЗВ63.Добавить();
	СтрокаПачки.Пачка = ДокОбъект.ПолучитьСсылкуНового();
	СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
	Если ИзменятьПозициюСтроки Тогда
		ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции

Функция АвтозаполнениеПачек(ТипСведений, СсылкаНаДокументКомплекта = Неопределено) Экспорт
	
	ТекущаяСтрока = Неопределено;
	
	ДатаСозданияДокументов = ОбщегоНазначенияЗК.ПолучитьРабочуюДату();
	
	// информация об ошибках
	МассивСообщений = Новый Массив;
	СписокФизЛицБезСтрахНомеров = Новый СписокЗначений;
	
	Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Или ТипСведений = Перечисления.ТипыСведенийСЗВ.ПЕНСИОННАЯ Тогда
		
		Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
			ДанныеКомментирования = Неопределено;
			ТаблицаСтажа = ПроцедурыПерсонифицированногоУчетаПолныеПрава.ДанныеОСтажеИВзносах(ДатаСозданияДокументов, ОтчетныйПериод, Организация, Неопределено, Истина, ДанныеКомментирования, Истина); 
		Иначе
			ТаблицаСтажа = ПроцедурыПерсонифицированногоУчетаПолныеПрава.ДанныеОСтажеИВзносах(ДатаСозданияДокументов, ОтчетныйПериод, Организация, Пенсионеры.ВыгрузитьКолонку("ФизЛицо")); 
		КонецЕсли;
		
		Если ТаблицаСтажа.Количество() > 0 Тогда
			
			Если ДатаСозданияДокументов < НачалоДня(ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод)) Тогда
				Если ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
					МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("При расчете сумм уплаченных взносов учтены данные, зарегистрированные по " + Формат(ДатаСозданияДокументов,"ДЛФ=DD"), Перечисления.ВидыСообщений.ВажнаяИнформация));
				Иначе
					МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("При расчете сумм уплаченных взносов и заработка учтены данные, зарегистрированные по " + Формат(ДатаСозданияДокументов,"ДЛФ=DD"), Перечисления.ВидыСообщений.ВажнаяИнформация));
				КонецЕсли;
			КонецЕсли;
		
			СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
			
			Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
				
				ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
			
				ОбработкаКомментариев.ДобавитьСообщение("Автоматическое формирование комплекта документов перс.учета", Перечисления.ВидыСообщений.Раздел);
				Если ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
					ОбработкаКомментариев.ДобавитьСообщение("При расчете сумм уплаченных взносов учтены данные, зарегистрированные по " + Формат(ДатаСозданияДокументов,"ДЛФ=DD"), Перечисления.ВидыСообщений.ВажнаяИнформация, , , Ложь);
				Иначе
					ОбработкаКомментариев.ДобавитьСообщение("При расчете сумм уплаченных взносов и заработка учтены данные, зарегистрированные по " + Формат(ДатаСозданияДокументов,"ДЛФ=DD"), Перечисления.ВидыСообщений.ВажнаяИнформация, , , Ложь);
				КонецЕсли;
				РазделДокумента = ОбработкаКомментариев.ДобавитьСообщение("Расчет коэффициентов уплаты", Перечисления.ВидыСообщений.Информация);
				ОбработкаКомментариев.ДобавитьСообщение("Распределение уплаченных взносов проведено с учетом переданных ранее в ПФР сведений", Перечисления.ВидыСообщений.Информация, , РазделДокумента, Ложь);
				
				Переплаты = ДанныеКомментирования.Переплаты;
				Если Переплаты.Количество() > 0 Тогда
					РазделТаблицы = ОбработкаКомментариев.ДобавитьСообщение("В переданных в ПФР сведениях выявлены превышения сумм уплаченных взносов над начисленными! Данные по таким сотрудникам исключены из расчета уплаченных сумм за прошлые периоды.", Перечисления.ВидыСообщений.Ошибка, , РазделДокумента, Ложь);
					ОбработкаКомментариев.ДобавитьСообщение(Переплаты, Перечисления.ВидыСообщений.Таблица, , РазделТаблицы, Ложь);
				КонецЕсли;
				
				Итоги = ДанныеКомментирования.Итоги[0];
				Если Итоги.Страховая > 0 Или Итоги.Накопительная > 0 Тогда
					РазделТаблицы = ОбработкаКомментариев.ДобавитьСообщение("В переданных в ПФР сведениях задолженность по прошлым периодам составила: по страховой части " + Формат(Итоги.Страховая,"ЧЦ=14; ЧДЦ=2; ЧН=-") + ", по накопительной части " + Формат(Итоги.Накопительная,"ЧЦ=14; ЧДЦ=2; ЧН=-"), Перечисления.ВидыСообщений.Информация, , РазделДокумента, Ложь);
					ОбработкаКомментариев.ДобавитьСообщение(ДанныеКомментирования.ПрошлыеПериоды, Перечисления.ВидыСообщений.Таблица, , РазделТаблицы, Ложь);
				Иначе	
					ОбработкаКомментариев.ДобавитьСообщение("В переданных в ПФР сведениях суммы уплаченных взносов совпадают с начисленными суммами взносов", Перечисления.ВидыСообщений.Информация, , РазделДокумента, Ложь);
				КонецЕсли;
				
				ОбработкаКомментариев.ДобавитьСообщение("Учтено уплаты: по страховой части " + Формат(Итоги.ВсегоУплаченоСтраховая,"ЧЦ=14; ЧДЦ=2; ЧН=-") + ?(ЗначениеЗаполнено(Итоги.ЗачтенаПереплатаСтраховая)," (в т.ч. переплаты по итогам прошлых периодов " + Формат(Итоги.ЗачтенаПереплатаСтраховая,"ЧЦ=14; ЧДЦ=2; ЧН=-") + ")","") + ", по накопительной части " + Формат(Итоги.ВсегоУплаченоНакопительная,"ЧЦ=14; ЧДЦ=2; ЧН=-") + ?(ЗначениеЗаполнено(Итоги.ЗачтенаПереплатаНакопительная)," (в т.ч. переплаты по итогам прошлых периодов " + Формат(Итоги.ЗачтенаПереплатаНакопительная,"ЧЦ=14; ЧДЦ=2; ЧН=-") + ")",""), Перечисления.ВидыСообщений.Информация, , РазделДокумента, Ложь);
				
				Если Итоги.ВсегоУплаченоСтраховая > 0 Тогда
					РазделКоэффициентовУплаты = ОбработкаКомментариев.ДобавитьСообщение("Расчет коэффициентов уплаты по страховой части", Перечисления.ВидыСообщений.Информация, , РазделДокумента, Ложь);
					ИтогиСтраховая = Итоги.Страховая;
					Если ИтогиСтраховая > 0 Тогда
						ОбработкаКомментариев.ДобавитьСообщение("Коэффициент уплаты по прошлым периодам составил: " + Формат(Итоги.КоэффициентПрошлыхПериодовСтраховая / 100000,"ЧДЦ=10; ЧН=-") + ?(Итоги.ВсегоУплаченоСтраховая >= ИтогиСтраховая," (уплаты текущего периода достаточно для покрытия задолженности по прошлым периодам)", " (= " + Формат(Итоги.ВсегоУплаченоСтраховая,"ЧЦ=14; ЧДЦ=2") + " / " + Формат(ИтогиСтраховая,"ЧЦ=14; ЧДЦ=2; ЧН=-") + ")"), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
					Иначе
						ИтогиСтраховая = 0
					КонецЕсли;
					ОбработкаКомментариев.ДобавитьСообщение("Начислено за текущий период: " + Формат(Итоги.ПФРСтраховаяПриход,"ЧЦ=14; ЧДЦ=2; ЧН=-"), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
					ОбработкаКомментариев.ДобавитьСообщение("Учтено уплаты по текущему периоду: " + Формат(Макс(Итоги.ВсегоУплаченоСтраховая - ИтогиСтраховая, 0),"ЧЦ=14; ЧДЦ=2; ЧН=-") + ?(Итоги.ВсегоУплаченоСтраховая > ИтогиСтраховая," (= " + Формат(Итоги.ВсегоУплаченоСтраховая,"ЧЦ=14; ЧДЦ=2") + " - " + Формат(ИтогиСтраховая,"ЧЦ=14; ЧДЦ=2") + ")", "(уплата текущего периода учтена в счет покрытия задолженности по прошлым периодам)"), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
					ОбработкаКомментариев.ДобавитьСообщение("Коэффициент уплаты по текущему периоду составил: " + Формат(Итоги.КоэффициентТекущегоПериодаСтраховая / 100000,"ЧДЦ=10; ЧН=-") + ?(Итоги.ВсегоУплаченоСтраховая > ИтогиСтраховая," (= " + Формат(Итоги.ВсегоУплаченоСтраховая - ИтогиСтраховая,"ЧЦ=14; ЧДЦ=2") + " / " + Формат(Итоги.ПФРСтраховаяПриход,"ЧЦ=14; ЧДЦ=2") + ")",""), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
				КонецЕсли;
				Если Итоги.ВсегоУплаченоНакопительная > 0 Тогда
					РазделКоэффициентовУплаты = ОбработкаКомментариев.ДобавитьСообщение("Расчет коэффициентов уплаты по накопительной части", Перечисления.ВидыСообщений.Информация, , РазделДокумента, Ложь);
					ИтогиНакопительная = Итоги.Накопительная;
					Если ИтогиНакопительная > 0 Тогда
						ОбработкаКомментариев.ДобавитьСообщение("Коэффициент уплаты по прошлым периодам составил: " + Формат(Итоги.КоэффициентПрошлыхПериодовНакопительная / 100000,"ЧДЦ=10; ЧН=-") + ?(Итоги.ВсегоУплаченоНакопительная >= ИтогиНакопительная," (уплаты текущего периода достаточно для покрытия задолженности по прошлым периодам)", " (= " + Формат(Итоги.ВсегоУплаченоНакопительная,"ЧЦ=14; ЧДЦ=2") + " / " + Формат(ИтогиНакопительная,"ЧЦ=14; ЧДЦ=2; ЧН=-") + ")"), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
					Иначе
						ИтогиНакопительная = 0
					КонецЕсли;
					ОбработкаКомментариев.ДобавитьСообщение("Начислено за текущий период: " + Формат(Итоги.ПФРНакопительнаяПриход,"ЧЦ=14; ЧДЦ=2; ЧН=-"), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
					ОбработкаКомментариев.ДобавитьСообщение("Учтено уплаты по текущему периоду: " + Формат(Макс(Итоги.ВсегоУплаченоНакопительная - ИтогиНакопительная, 0),"ЧЦ=14; ЧДЦ=2; ЧН=-") + ?(Итоги.ВсегоУплаченоНакопительная > ИтогиНакопительная," (= " + Формат(Итоги.ВсегоУплаченоНакопительная,"ЧЦ=14; ЧДЦ=2") + " - " + Формат(ИтогиНакопительная,"ЧЦ=14; ЧДЦ=2") + ")", "(уплата текущего периода учтена в счет покрытия задолженности по прошлым периодам)"), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
					ОбработкаКомментариев.ДобавитьСообщение("Коэффициент уплаты по текущему периоду составил: " + Формат(Итоги.КоэффициентТекущегоПериодаНакопительная / 100000,"ЧДЦ=10; ЧН=-") + ?(Итоги.ВсегоУплаченоНакопительная > ИтогиНакопительная," (= " + Формат(Итоги.ВсегоУплаченоНакопительная - ИтогиНакопительная,"ЧЦ=14; ЧДЦ=2") + " / " + Формат(Итоги.ПФРНакопительнаяПриход,"ЧЦ=14; ЧДЦ=2") + ")",""), Перечисления.ВидыСообщений.Информация, , РазделКоэффициентовУплаты, Ложь);
				КонецЕсли;
				
				ОбъектАДВ62 = СоздатьАДВ(Ложь, СтруктураРеквизитов);
				СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
				ОбъектАДВ62.РасчетРСВ1 = СсылкаНаДокументКомплекта;
				ТекущаяСтрока = ПачкиДокументов[ПачкиДокументов.Количество() - 1];
				
				ТипФормДокументов = "";
				ТипДоговора = "";
				КатегорияЗЛ = "";
				ЛьготыПоУсловиямТруда = "";
				ЛьготыПоВыслуге = "";
				ТерриториальныеУсловия = "";
				НовыйДок = Неопределено;
				
				Если ОтчетныйПериод >= ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
					РезультатЗапроса = ПроцедурыПерсонифицированногоУчетаПолныеПрава.ДанныеОДоходахЗаОтчетныеПериоды(ОтчетныйПериод, ОтчетныйПериод, Организация, ДатаСозданияДокументов);
					ТаблицаДоходов = РезультатЗапроса.Выгрузить();
				КонецЕсли;
				
				СтруктураПоиска = Новый Структура("ФизЛицо,КатегорияЗастрахованныхЛиц,ТипДоговора");
				Для каждого СтрокаТЗ Из ТаблицаСтажа Цикл
					
					// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
					Если СтрокаТЗ.НетСтраховогоНомера Тогда
						СписокФизЛицБезСтрахНомеров.Добавить(СтрокаТЗ.ФизЛицо, СтрокаТЗ.Наименование);
						Продолжить;
					КонецЕсли;	
					
					Если ТипФормДокументов <> СтрокаТЗ.ТипФормДокументов Или ЛьготыПоУсловиямТруда <> СтрокаТЗ.ЛьготыПоУсловиямТруда
							Или ЛьготыПоВыслуге <> СтрокаТЗ.ЛьготыПоВыслуге Или КатегорияЗЛ <> СтрокаТЗ.КатегорияЗастрахованныхЛиц
							Или ТипДоговора <> СтрокаТЗ.ТипДоговора Или ТерриториальныеУсловия <> СтрокаТЗ.ТерриториальныеУсловия Тогда
						//
						Если НовыйДок = Неопределено Или НовыйДок.РаботникиОрганизации.Количество() <> 0 Тогда
							Если ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
								НовыйДок = СоздатьСЗВ6(Истина, ОбъектАДВ62, СтруктураРеквизитов);
								ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"ТипФормДокументов, КатегорияЗастрахованныхЛиц");
							Иначе
								НовыйДок = СоздатьСЗВ64(Истина, ОбъектАДВ62, СтруктураРеквизитов);
								ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"КатегорияЗастрахованныхЛиц, ТипДоговора");
							КонецЕсли;
							СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
						КонецЕсли;
						
						ТипФормДокументов = СтрокаТЗ.ТипФормДокументов;
						ТипДоговора = СтрокаТЗ.ТипДоговора;
						КатегорияЗЛ = СтрокаТЗ.КатегорияЗастрахованныхЛиц;
						ЛьготыПоУсловиямТруда = СтрокаТЗ.ЛьготыПоУсловиямТруда;
						ЛьготыПоВыслуге = СтрокаТЗ.ЛьготыПоВыслуге;
						ТерриториальныеУсловия = СтрокаТЗ.ТерриториальныеУсловия;
						
					КонецЕсли;
					
					Если НовыйДок.РаботникиОрганизации.Количество() = 200 Тогда
						
						Если ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
							НовыйДок = СоздатьСЗВ6(Истина, ОбъектАДВ62, СтруктураРеквизитов);
							ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"ТипФормДокументов, КатегорияЗастрахованныхЛиц");
						Иначе
							НовыйДок = СоздатьСЗВ64(Истина, ОбъектАДВ62, СтруктураРеквизитов);
							ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"КатегорияЗастрахованныхЛиц, ТипДоговора");
						КонецЕсли;
						СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
						
					КонецЕсли; 
					
					СтрокаТабличнойЧасти = НовыйДок.РаботникиОрганизации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТЗ);
					Фамилия = СтрокаТЗ.Фамилия;
					Имя = СтрокаТЗ.Имя;
					Отчество = СтрокаТЗ.Отчество;
					Если Не ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
						ОбщегоНазначенияЗК.ФамилияИнициалыФизЛица(СтрокаТЗ.Наименование,Фамилия,Имя,Отчество);
					КонецЕсли;
					СтрокаТабличнойЧасти.Фамилия = Фамилия;
					СтрокаТабличнойЧасти.Имя = Имя;
					СтрокаТабличнойЧасти.Отчество = Отчество;
					
					Если ОтчетныйПериод >= ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
						ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТЗ);
						СтрокиДоходов = ТаблицаДоходов.НайтиСтроки(СтруктураПоиска);
						Для каждого СтрокаДоходов Из СтрокиДоходов Цикл
							ЗаполнитьЗначенияСвойств(НовыйДок.СведенияОЗаработке.Добавить(), СтрокаДоходов);
							ТаблицаДоходов.Удалить(СтрокаДоходов);
						КонецЦикла;
					КонецЕсли; 
					
				КонецЦикла;
				
				// дописываем ЗЛ без стажа и взносов, но с доходами
				Если ОтчетныйПериод >= ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() И ТаблицаДоходов.Количество() > 0 Тогда
					
					КолонкиЗастрахованного = "НетСтраховогоНомера,ФизЛицо,Наименование,СтраховойНомерПФР,КатегорияЗастрахованныхЛиц, ТипДоговора,Фамилия,Имя,Отчество";
					ТаблицаСотрудников = ТаблицаДоходов.Скопировать(,КолонкиЗастрахованного);
					ТаблицаСотрудников.Свернуть(КолонкиЗастрахованного,);
					ТипДоговора = "";
					КатегорияЗЛ = "";
					НовыйДок = Неопределено;
					СтруктураПоиска = Новый Структура("ФизЛицо");
					
					Для каждого СтрокаТЗ Из ТаблицаСотрудников Цикл
						
						// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
						Если СтрокаТЗ.НетСтраховогоНомера Тогда
							Если СписокФизЛицБезСтрахНомеров.НайтиПоЗначению(СтрокаТЗ.ФизЛицо) = Неопределено Тогда
								СписокФизЛицБезСтрахНомеров.Добавить(СтрокаТЗ.ФизЛицо, СтрокаТЗ.Наименование);
							КонецЕсли;
							Продолжить;
						КонецЕсли;	
						
						Если КатегорияЗЛ <> СтрокаТЗ.КатегорияЗастрахованныхЛиц Или ТипДоговора <> СтрокаТЗ.ТипДоговора Тогда
							
							Если НовыйДок = Неопределено Или НовыйДок.РаботникиОрганизации.Количество() <> 0 Тогда
								НовыйДок = СоздатьСЗВ64(Истина, ОбъектАДВ62, СтруктураРеквизитов);
								ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"КатегорияЗастрахованныхЛиц, ТипДоговора");
								СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
							КонецЕсли;
							
							ТипДоговора = СтрокаТЗ.ТипДоговора;
							КатегорияЗЛ = СтрокаТЗ.КатегорияЗастрахованныхЛиц;
							
						КонецЕсли;
						
						Если НовыйДок.РаботникиОрганизации.Количество() = 200 Тогда
							
							НовыйДок = СоздатьСЗВ64(Истина, ОбъектАДВ62, СтруктураРеквизитов);
							ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"КатегорияЗастрахованныхЛиц, ТипДоговора");
							СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
							
						КонецЕсли; 
						
						СтрокаТабличнойЧасти = НовыйДок.РаботникиОрганизации.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТЗ);
						ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТЗ);
						Фамилия = СтрокаТЗ.Фамилия;
						Имя = СтрокаТЗ.Имя;
						Отчество = СтрокаТЗ.Отчество;
						Если Не ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
							ОбщегоНазначенияЗК.ФамилияИнициалыФизЛица(СтрокаТЗ.Наименование,Фамилия,Имя,Отчество);
						КонецЕсли;
						СтрокаТабличнойЧасти.Фамилия = Фамилия;
						СтрокаТабличнойЧасти.Имя = Имя;
						СтрокаТабличнойЧасти.Отчество = Отчество;
						
						Для каждого СтрокаДоходов Из ТаблицаДоходов.НайтиСтроки(СтруктураПоиска) Цикл
							ЗаполнитьЗначенияСвойств(НовыйДок.СведенияОЗаработке.Добавить(), СтрокаДоходов)
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЕсли; 
				
				Если СписокФизЛицБезСтрахНомеров.Количество() > 0 Тогда
					РодительскаяСтрока = ОбработкаКомментариев.ДобавитьСообщение("Следующие физические лица не включены в пачки документов перс.учета из-за отсутствия страховых номеров ПФР:", Перечисления.ВидыСообщений.Ошибка);
					Для Каждого ЭлементСписка Из СписокФизЛицБезСтрахНомеров Цикл
						МассивРасшифровки = Новый Массив;
						МассивРасшифровки.Добавить(Новый Структура("Представление, Расшифровка",  ЭлементСписка.Представление, ЭлементСписка.Значение));
						ОбработкаКомментариев.ДобавитьСообщение("", Перечисления.ВидыСообщений.Информация, МассивРасшифровки, РодительскаяСтрока);
					КонецЦикла;
				КонецЕсли; 
				
				Возврат ТекущаяСтрока
				
			Иначе
				
				ТаблицаСтажа.Свернуть("ФизЛицо,Фамилия,Имя,Отчество,КатегорияЗастрахованныхЛиц,Наименование,НетСтраховогоНомера,СтраховойНомерПФР,ТерриториальныеУсловия","НачисленоСтраховая,НачисленоНакопительная,УплаченоСтраховая,УплаченоНакопительная");
				
				КатегорияЗЛ = ТаблицаСтажа[0].КатегорияЗастрахованныхЛиц;
				ТерриториальныеУсловия = ТаблицаСтажа[0].ТерриториальныеУсловия;
				НовыйДок = СоздатьСПВ(СтруктураРеквизитов, КатегорияЗЛ);
				СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
				ТекущаяСтрока = ПачкиСПВ[ПачкиСПВ.Количество() - 1];
				
				Для каждого СтрокаТЗ Из ТаблицаСтажа Цикл
					
					Если КатегорияЗЛ <> СтрокаТЗ.КатегорияЗастрахованныхЛиц или ТерриториальныеУсловия <> СтрокаТЗ.ТерриториальныеУсловия Тогда
						
						Если НовыйДок.РаботникиОрганизации.Количество() <> 0 Тогда
							НовыйДок.РассчитатьВзносы();
							НовыйДок = СоздатьСПВ(СтруктураРеквизитов, СтрокаТЗ.КатегорияЗастрахованныхЛиц);
							СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
						КонецЕсли;
						
						КатегорияЗЛ = СтрокаТЗ.КатегорияЗастрахованныхЛиц;
						ТерриториальныеУсловия = СтрокаТЗ.ТерриториальныеУсловия;
						
					КонецЕсли;
					
					// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
					Если СтрокаТЗ.НетСтраховогоНомера Тогда
						СписокФизЛицБезСтрахНомеров.Добавить(СтрокаТЗ.ФизЛицо, СтрокаТЗ.Наименование);
						Продолжить;
					КонецЕсли;	
					
					Если НовыйДок.РаботникиОрганизации.Количество() = 200 Тогда
						
						НовыйДок.РассчитатьВзносы();
						НовыйДок = СоздатьСПВ(СтруктураРеквизитов, СтрокаТЗ.КатегорияЗастрахованныхЛиц);
						СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
						
					КонецЕсли; 
					
					СтрокаТабличнойЧасти = НовыйДок.РаботникиОрганизации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТЗ);
					Фамилия = СтрокаТЗ.Фамилия;
					Имя = СтрокаТЗ.Имя;
					Отчество = СтрокаТЗ.Отчество;
					Если Не ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
						ОбщегоНазначенияЗК.ФамилияИнициалыФизЛица(СтрокаТЗ.Наименование,Фамилия,Имя,Отчество);
					КонецЕсли;
					СтрокаТабличнойЧасти.Фамилия = Фамилия;
					СтрокаТабличнойЧасти.Имя = Имя;
					СтрокаТабличнойЧасти.Отчество = Отчество;
					СтрокаПенсионера = Пенсионеры.Найти(СтрокаТабличнойЧасти.ФизЛицо,"ФизЛицо");
					Если СтрокаПенсионера <> Неопределено Тогда
						СтрокаТабличнойЧасти.ДатаСоставления = СтрокаПенсионера.ДатаСоставления
					КонецЕсли;
					
				КонецЦикла;
				
				НовыйДок.РассчитатьВзносы();
				
			КонецЕсли;
			
		Иначе
			Если ТипСведений <> Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Или ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
				МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("По организации " + ОбщегоНазначенияЗК.ПолучитьЗначениеРеквизита(Организация,"Наименование") + " не обнаружено сведений о стаже и взносах!", Перечисления.ВидыСообщений.Ошибка));
			Иначе
				
				РезультатЗапроса = ПроцедурыПерсонифицированногоУчетаПолныеПрава.ДанныеОДоходахЗаОтчетныеПериоды(ОтчетныйПериод, ОтчетныйПериод, Организация, ДатаСозданияДокументов);
				Если РезультатЗапроса.Пустой() Тогда
					МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("По организации " + ОбщегоНазначенияЗК.ПолучитьЗначениеРеквизита(Организация,"Наименование") + " не обнаружено сведений о стаже, взносах и заработке!", Перечисления.ВидыСообщений.Ошибка));
					ВывестиСообщенияОбОшибках(МассивСообщений);
					Возврат Неопределено
				КонецЕсли;
				
				ТаблицаДоходов = РезультатЗапроса.Выгрузить();

				КолонкиЗастрахованного = "НетСтраховогоНомера,ФизЛицо,Наименование,СтраховойНомерПФР,КатегорияЗастрахованныхЛиц, ТипДоговора, Фамилия, Имя, Отчество";
				ТаблицаСотрудников = ТаблицаДоходов.Скопировать(,КолонкиЗастрахованного);
				ТаблицаСотрудников.Свернуть(КолонкиЗастрахованного,);
				ОбъектАДВ62 = СоздатьАДВ(Ложь, СтруктураРеквизитов);
				ОбъектАДВ62.РасчетРСВ1 = СсылкаНаДокументКомплекта;
				СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
				ТекущаяСтрока = ПачкиДокументов[ПачкиДокументов.Количество() - 1];
				
				ТипДоговора = "";
				КатегорияЗЛ = "";
				НовыйДок = Неопределено;
				СтруктураПоиска = Новый Структура("ФизЛицо");
				
				Для каждого СтрокаТЗ Из ТаблицаСотрудников Цикл
					
					// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
					Если СтрокаТЗ.НетСтраховогоНомера Тогда
						СписокФизЛицБезСтрахНомеров.Добавить(СтрокаТЗ.ФизЛицо, СтрокаТЗ.Наименование);
						Продолжить;
					КонецЕсли;	
					
					Если КатегорияЗЛ <> СтрокаТЗ.КатегорияЗастрахованныхЛиц Или ТипДоговора <> СтрокаТЗ.ТипДоговора Тогда
						
						Если НовыйДок = Неопределено Или НовыйДок.РаботникиОрганизации.Количество() <> 0 Тогда
							НовыйДок = СоздатьСЗВ64(Истина, ОбъектАДВ62, СтруктураРеквизитов);
							ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"КатегорияЗастрахованныхЛиц, ТипДоговора");
							СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
						КонецЕсли;
						
						ТипДоговора = СтрокаТЗ.ТипДоговора;
						КатегорияЗЛ = СтрокаТЗ.КатегорияЗастрахованныхЛиц;
						
					КонецЕсли;
					
					Если НовыйДок.РаботникиОрганизации.Количество() = 200 Тогда
						
						НовыйДок = СоздатьСЗВ64(Истина, ОбъектАДВ62, СтруктураРеквизитов);
						ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"КатегорияЗастрахованныхЛиц, ТипДоговора");
						СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
						
					КонецЕсли; 
					
					СтрокаТабличнойЧасти = НовыйДок.РаботникиОрганизации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТЗ);
					ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрокаТЗ);
					Фамилия = СтрокаТЗ.Фамилия;
					Имя = СтрокаТЗ.Имя;
					Отчество = СтрокаТЗ.Отчество;
					Если Не ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
						ОбщегоНазначенияЗК.ФамилияИнициалыФизЛица(СтрокаТЗ.Наименование,Фамилия,Имя,Отчество);
					КонецЕсли;
					СтрокаТабличнойЧасти.Фамилия = Фамилия;
					СтрокаТабличнойЧасти.Имя = Имя;
					СтрокаТабличнойЧасти.Отчество = Отчество;
					
					Для каждого СтрокаДоходов Из ТаблицаДоходов.НайтиСтроки(СтруктураПоиска) Цикл
						ЗаполнитьЗначенияСвойств(НовыйДок.СведенияОЗаработке.Добавить(), СтрокаДоходов)
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли; 
		КонецЕсли;
		
	Иначе
		
		РезультатЗапроса = ПроцедурыПерсонифицированногоУчетаПолныеПрава.ДанныеОДоходах(ОтчетныйГод, Организация, ДатаСозданияДокументов);
		Если РезультатЗапроса.Пустой() Тогда
			МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("По организации " + ОбщегоНазначенияЗК.ПолучитьЗначениеРеквизита(Организация,"Наименование") + " не обнаружено сведений о заработке!", Перечисления.ВидыСообщений.Ошибка));
			ВывестиСообщенияОбОшибках(МассивСообщений);
			Возврат Неопределено
		КонецЕсли;
		
		Если ДатаСозданияДокументов < НачалоДня(Дата(ОтчетныйГод, 1, 1)) Тогда
			МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("При расчете сумм заработка учтены данные, зарегистрированные по " + Формат(ДатаСозданияДокументов,"ДЛФ=DD"), Перечисления.ВидыСообщений.ВажнаяИнформация));
		КонецЕсли;
		
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
			
		Выборка = РезультатЗапроса.Выбрать();
		БылоСтрок = ПачкиСЗВ63.Количество();
		Пока Выборка.СледующийПоЗначениюПоля("КатегорияЗастрахованныхЛиц") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("ТипДоговора") Цикл
				
				НовыйДок = СоздатьСЗВ63(СтруктураРеквизитов);
				ЗаполнитьЗначенияСвойств(НовыйДок,Выборка,"КатегорияЗастрахованныхЛиц,ТипДоговора");
				СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
                НовыйДок.ОписьАДВ62 = СсылкаНаДокументКомплекта;
				Пока Выборка.СледующийПоЗначениюПоля("Порядок") Цикл
					Пока Выборка.СледующийПоЗначениюПоля("ФизЛицо") Цикл
						
						// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
						Если Выборка.НетСтраховогоНомера Тогда
							СписокФизЛицБезСтрахНомеров.Добавить(Выборка.ФизЛицо, Выборка.Порядок);
							Продолжить;
						КонецЕсли;	
						
						Если НовыйДок.СотрудникиОрганизации.Количество() = 200 Тогда
							НовыйДок = СоздатьСЗВ63(СтруктураРеквизитов);
							ЗаполнитьЗначенияСвойств(НовыйДок, Выборка, "КатегорияЗастрахованныхЛиц,ТипДоговора");
							СтруктураРеквизитов.Дата = СтруктураРеквизитов.Дата + 1;
			                НовыйДок.ОписьАДВ62 = СсылкаНаДокументКомплекта;
						КонецЕсли; 
					
						СтрокаТабличнойЧасти = НовыйДок.СотрудникиОрганизации.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
						Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Фамилия + СтрокаТабличнойЧасти.Имя + СтрокаТабличнойЧасти.Отчество) Тогда
							Фамилия = ""; Имя = ""; Отчество = "";
							ОбщегоНазначенияЗК.ФамилияИнициалыФизЛица(Выборка.Порядок,Фамилия,Имя,Отчество);
							СтрокаТабличнойЧасти.Фамилия = Фамилия;
							СтрокаТабличнойЧасти.Имя = Имя;
							СтрокаТабличнойЧасти.Отчество = Отчество;
						КонецЕсли;
						
						Пока Выборка.Следующий() Цикл
							ЗаполнитьЗначенияСвойств(НовыйДок.СведенияОЗаработке.Добавить(), Выборка);
						КонецЦикла;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ТекущаяСтрока = ПачкиСЗВ63[БылоСтрок];
		
	КонецЕсли;
	
	Если СписокФизЛицБезСтрахНомеров.Количество() > 0 Тогда
		
		МассивФизЛиц = Новый Массив;
		Для Каждого ЭлементСписка Из СписокФизЛицБезСтрахНомеров Цикл
			МассивФизЛиц.Добавить(Новый Структура("Представление, Расшифровка", ЭлементСписка.Представление, ЭлементСписка.Значение));
		КонецЦикла;
		МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("Следующие физические лица не включены в пачки документов перс.учета из-за отсутствия страховых номеров ПФР:", Перечисления.ВидыСообщений.ВажнаяИнформация, МассивФизЛиц));
		
	КонецЕсли; 
	
	Если МассивСообщений.Количество() > 0 Тогда
		ВывестиСообщенияОбОшибках(МассивСообщений);
	КонецЕсли; 
	
	Возврат ТекущаяСтрока
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

Процедура УдалитьПустойЗаголовок(ДеревоСообщений)

	ПоследнееСообщение = ДеревоСообщений.Строки[ДеревоСообщений.Строки.Количество() - 1];
	Если ПоследнееСообщение.Строки.Количество() = 0 Тогда
		ДеревоСообщений.Строки.Удалить(ПоследнееСообщение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДокументКакПринятыйПФР(Пачка) Экспорт

	Если Не ЗначениеЗаполнено(Пачка) Тогда
		Возврат
	КонецЕсли;
	
	ДокументОбъект = СоответствиеСсылокИОбъектов[Пачка];
	Попытка
		
		Если ТипЗнч(Пачка) = Тип("ДокументСсылка.ПередачаСЗВ4ВПФР") Тогда
			
			ИмяТЧ = ?(ДокументОбъект.ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией(),"ПачкиДокументов","ПачкиДокументов2013");
			Для Каждого СтрокаДокумента Из ДокументОбъект[ИмяТЧ] Цикл
				ДокументСЗВ = СоответствиеСсылокИОбъектов[СтрокаДокумента.ДокументПачка];
				ДокументСЗВ.Записать(РежимЗаписиДокумента.Проведение);
				ДокументСЗВ.ПринятоВПФР = Истина;
				ДокументСЗВ.Записать(РежимЗаписиДокумента.Запись);
			КонецЦикла;
			
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ДокументОбъект.ПринятоВПФР = Истина;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
	Исключение
		ОбщегоНазначенияЗК.ПоказатьДиалогСИнформациейОбОшибке(ОбщегоНазначенияЗК.ПолучитьПричинуОшибки(ИнформацияОбОшибке()));
		ДокументОбъект.ПринятоВПФР = Ложь;
		
	КонецПопытки;
	
	Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ И ТипЗнч(Пачка) = Тип("ДокументСсылка.ПередачаСЗВ4ВПФР") Тогда
		Если ДокументОбъект.ПринятоВПФР И Не ДокументОбъект.НеСодержитСЗВ Тогда
			 НаборЗаписей = РегистрыСведений.СведенияПринятыеПФР.СоздатьНаборЗаписей();
			 НаборЗаписей.Отбор.Организация.Установить(ДокументОбъект.Организация);
			 НаборЗаписей.Отбор.ОтчетныйПериодПерсучетаПФР.Установить(ДокументОбъект.ОтчетныйПериод);
			 СтрокаНабора = НаборЗаписей.Добавить();
			 СтрокаНабора.Организация = ДокументОбъект.Организация;
			 СтрокаНабора.ОтчетныйПериодПерсучетаПФР = ДокументОбъект.ОтчетныйПериод;
			 СтрокаНабора.КомплектДокументов = Пачка;
			 НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхАДВ11, ТаблицаУдаленныхСЗВ = Неопределено) Экспорт
	
	ЗаменяемаяСсылка = ЭлементСоответствия.Ключ;
	НовыйДокОбъект = ЭлементСоответствия.Значение;
	
	Если ТипЗнч(ЗаменяемаяСсылка) = Тип("ДокументСсылка.СведенияОТрудовомСтажеИЗаработкеСЗВ4")Тогда
		Если ТаблицаУдаленныхСЗВ.Количество() > 0  Тогда
			УдаленныйДокОбъект = ТаблицаУдаленныхСЗВ[0].Ссылка.ПолучитьОбъект();
			ТаблицаУдаленныхСЗВ.Удалить(0);
			ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект, НовыйДокОбъект, , "Проведен");
			УдаленныйДокОбъект.РаботникиОрганизации.Очистить();
			Для Каждого СтрокаТЧ Из НовыйДокОбъект.РаботникиОрганизации Цикл
				ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект.РаботникиОрганизации.Добавить(),СтрокаТЧ);
			КонецЦикла;
			УдаленныйДокОбъект.Записать();
			НоваяСсылка = УдаленныйДокОбъект.Ссылка;
			Если ДокументОбъектСЗВ6_1и2.ЭтоНовый() Тогда
				Если ДокументОбъектСЗВ6_1и2.ПолучитьСсылкуНового() = ЗаменяемаяСсылка Тогда
					ДокументОбъектСЗВ6_1и2 = УдаленныйДокОбъект
				КонецЕсли;
			Иначе
				Если ДокументОбъектСЗВ6_1и2.Ссылка = ЗаменяемаяСсылка Тогда
					ДокументОбъектСЗВ6_1и2 = УдаленныйДокОбъект
				КонецЕсли;
			КонецЕсли;
			СтрокаПачки = ПачкиДокументов.Найти(ЗаменяемаяСсылка, "Пачка");
			Если СтрокаПачки <> Неопределено Тогда
				СтрокаПачки.Пачка = НоваяСсылка
			Иначе
				Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("ДокументСсылка.ПередачаСЗВ4ВПФР") Тогда
						ДокАДВ = ЭлементСоответствия.Значение;
						Если ДокАДВ.ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
							СтрокаТабличнойЧастиДокументаПередачи =  ДокАДВ.ПачкиДокументов.Найти(ЗаменяемаяСсылка, "ДокументПачка");
						Иначе
							СтрокаТабличнойЧастиДокументаПередачи =  ДокАДВ.ПачкиДокументов2013.Найти(ЗаменяемаяСсылка, "ДокументПачка");
						КонецЕсли;
						Если СтрокаТабличнойЧастиДокументаПередачи <> Неопределено Тогда
							СтрокаТабличнойЧастиДокументаПередачи.ДокументПачка = НоваяСсылка;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
			СоответствиеСсылокИОбъектов.Удалить(ЗаменяемаяСсылка);
			СоответствиеСсылокИОбъектов.Вставить(НоваяСсылка, УдаленныйДокОбъект);
		Иначе
			НовыйДокОбъект.Записать();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗаменяемаяСсылка) = Тип("ДокументСсылка.ПачкаДокументовСЗВ_6_4")Тогда
		Если ТаблицаУдаленныхСЗВ.Количество() > 0  Тогда
			УдаленныйДокОбъект = ТаблицаУдаленныхСЗВ[0].Ссылка.ПолучитьОбъект();
			ТаблицаУдаленныхСЗВ.Удалить(0);
			ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект, НовыйДокОбъект, , "Проведен");
			УдаленныйДокОбъект.РаботникиОрганизации.Очистить();
			Для Каждого СтрокаТЧ Из НовыйДокОбъект.РаботникиОрганизации Цикл
				ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект.РаботникиОрганизации.Добавить(),СтрокаТЧ);
			КонецЦикла;
			УдаленныйДокОбъект.СведенияОЗаработке.Очистить();
			Для Каждого СтрокаТЧ Из НовыйДокОбъект.СведенияОЗаработке Цикл
				ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект.СведенияОЗаработке.Добавить(),СтрокаТЧ);
			КонецЦикла;
			УдаленныйДокОбъект.Записать();
			НоваяСсылка = УдаленныйДокОбъект.Ссылка;
			Если ДокументОбъектСЗВ64.ЭтоНовый() Тогда
				Если ДокументОбъектСЗВ64.ПолучитьСсылкуНового() = ЗаменяемаяСсылка Тогда
					ДокументОбъектСЗВ64 = УдаленныйДокОбъект
				КонецЕсли;
			Иначе
				Если ДокументОбъектСЗВ64.Ссылка = ЗаменяемаяСсылка Тогда
					ДокументОбъектСЗВ64 = УдаленныйДокОбъект
				КонецЕсли;
			КонецЕсли;
			СтрокаПачки = ПачкиДокументов.Найти(ЗаменяемаяСсылка, "Пачка");
			Если СтрокаПачки <> Неопределено Тогда
				СтрокаПачки.Пачка = НоваяСсылка
			Иначе
				Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("ДокументСсылка.ПередачаСЗВ4ВПФР") Тогда
						ДокАДВ = ЭлементСоответствия.Значение;
						Если ДокАДВ.ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
							СтрокаТабличнойЧастиДокументаПередачи =  ДокАДВ.ПачкиДокументов.Найти(ЗаменяемаяСсылка, "ДокументПачка");
						Иначе
							СтрокаТабличнойЧастиДокументаПередачи =  ДокАДВ.ПачкиДокументов2013.Найти(ЗаменяемаяСсылка, "ДокументПачка");
						КонецЕсли;
						Если СтрокаТабличнойЧастиДокументаПередачи <> Неопределено Тогда
							СтрокаТабличнойЧастиДокументаПередачи.ДокументПачка = НоваяСсылка;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
			СоответствиеСсылокИОбъектов.Удалить(ЗаменяемаяСсылка);
			СоответствиеСсылокИОбъектов.Вставить(НоваяСсылка, УдаленныйДокОбъект);
		Иначе
			НовыйДокОбъект.Записать();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗаменяемаяСсылка) = Тип("ДокументСсылка.ПередачаСЗВ4ВПФР") Тогда
		Если ТаблицаУдаленныхАДВ11.Количество() > 0  Тогда
			УдаленныйДокОбъект = ТаблицаУдаленныхАДВ11[0].Ссылка.ПолучитьОбъект();
			ТаблицаУдаленныхАДВ11.Удалить(0);
			ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект, НовыйДокОбъект, , "Проведен");
			УдаленныйДокОбъект.ПачкиДокументов.Очистить();
			УдаленныйДокОбъект.ПачкиДокументов2013.Очистить();
			ИмяТЧ = ?(НовыйДокОбъект.ОтчетныйПериод < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией(),"ПачкиДокументов","ПачкиДокументов2013");
			Для Каждого СтрокаТЧ Из НовыйДокОбъект[ИмяТЧ] Цикл
				ДобавляемаяСтрока = УдаленныйДокОбъект[ИмяТЧ].Добавить();
				ДобавляемаяСтрока.ДокументПачка = СтрокаТЧ.ДокументПачка;
			КонецЦикла;
			УдаленныйДокОбъект.СведенияОЗадолженности.Очистить();
			Для Каждого СтрокаТЧ Из НовыйДокОбъект.СведенияОЗадолженности Цикл
				ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект.СведенияОЗадолженности.Добавить(), СтрокаТЧ);
			КонецЦикла;
			УдаленныйДокОбъект.Записать();
			НоваяСсылка = УдаленныйДокОбъект.Ссылка;
			Если ДокументОбъектАДВ11.ЭтоНовый() Тогда
				Если ДокументОбъектАДВ11.ПолучитьСсылкуНового() = ЗаменяемаяСсылка Тогда
					ДокументОбъектАДВ11 = УдаленныйДокОбъект
				КонецЕсли;
			Иначе
				Если ДокументОбъектАДВ11.Ссылка = ЗаменяемаяСсылка Тогда
					ДокументОбъектАДВ11 = УдаленныйДокОбъект
				КонецЕсли;
			КонецЕсли;
			СтрокаПачки = ПачкиДокументов.Найти(ЗаменяемаяСсылка, "Пачка");
			Если СтрокаПачки <> Неопределено Тогда
				СтрокаПачки.Пачка = НоваяСсылка
			КонецЕсли;
			СоответствиеСсылокИОбъектов.Удалить(ЗаменяемаяСсылка);
			СоответствиеСсылокИОбъектов.Вставить(НоваяСсылка, УдаленныйДокОбъект);
		Иначе
			НовыйДокОбъект.Записать();
		КонецЕсли;
	ИначеЕсли ТипЗНч(ЗаменяемаяСсылка) = Тип("ДокументСсылка.СведенияОВзносахИСтраховомСтажеСПВ1") Тогда
		Если ТаблицаУдаленныхАДВ11.Количество() > 0  Тогда
			УдаленныйДокОбъект = ТаблицаУдаленныхАДВ11[0].Ссылка.ПолучитьОбъект();
			ТаблицаУдаленныхАДВ11.Удалить(0);
			ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект, НовыйДокОбъект, , "Проведен");
			УдаленныйДокОбъект.РаботникиОрганизации.Очистить();
			Для Каждого СтрокаТЧ Из НовыйДокОбъект.РаботникиОрганизации Цикл
				ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект.РаботникиОрганизации.Добавить(),СтрокаТЧ);
			КонецЦикла;
			УдаленныйДокОбъект.Записать();
			НоваяСсылка = УдаленныйДокОбъект.Ссылка;
			Если ДокументОбъектСПВ.ЭтоНовый() Тогда
				Если ДокументОбъектСПВ.ПолучитьСсылкуНового() = ЗаменяемаяСсылка Тогда
					ДокументОбъектСПВ = УдаленныйДокОбъект
				КонецЕсли;
			Иначе
				Если ДокументОбъектСПВ.Ссылка = ЗаменяемаяСсылка Тогда
					ДокументОбъектСПВ = УдаленныйДокОбъект
				КонецЕсли;
			КонецЕсли;
			СтрокаПачки = ПачкиСПВ.Найти(ЗаменяемаяСсылка, "Пачка");
			Если СтрокаПачки <> Неопределено Тогда
				СтрокаПачки.Пачка = НоваяСсылка
			КонецЕсли;
			СоответствиеСсылокИОбъектов.Удалить(ЗаменяемаяСсылка);
			СоответствиеСсылокИОбъектов.Вставить(НоваяСсылка, УдаленныйДокОбъект);
		Иначе
			НовыйДокОбъект.Записать();
		КонецЕсли;
	ИначеЕсли ТипЗНч(ЗаменяемаяСсылка) = Тип("ДокументСсылка.СведенияОНачисленномЗаработкеСЗВ63") Тогда
		Если ТаблицаУдаленныхАДВ11.Количество() > 0  Тогда
			УдаленныйДокОбъект = ТаблицаУдаленныхАДВ11[0].Ссылка.ПолучитьОбъект();
			ТаблицаУдаленныхАДВ11.Удалить(0);
			ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект, НовыйДокОбъект, , "Проведен");
			УдаленныйДокОбъект.СотрудникиОрганизации.Очистить();
			Для Каждого СтрокаТЧ Из НовыйДокОбъект.СотрудникиОрганизации Цикл
				ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект.СотрудникиОрганизации.Добавить(),СтрокаТЧ);
			КонецЦикла;
			УдаленныйДокОбъект.СведенияОЗаработке.Очистить();
			Для Каждого СтрокаТЧ Из НовыйДокОбъект.СведенияОЗаработке Цикл
				ЗаполнитьЗначенияСвойств(УдаленныйДокОбъект.СведенияОЗаработке.Добавить(),СтрокаТЧ);
			КонецЦикла;
			УдаленныйДокОбъект.Записать();
			НоваяСсылка = УдаленныйДокОбъект.Ссылка;
			Если ДокументОбъектСЗВ63.ЭтоНовый() Тогда
				Если ДокументОбъектСЗВ63.ПолучитьСсылкуНового() = ЗаменяемаяСсылка Тогда
					ДокументОбъектСЗВ63 = УдаленныйДокОбъект
				КонецЕсли;
			Иначе
				Если ДокументОбъектСЗВ63.Ссылка = ЗаменяемаяСсылка Тогда
					ДокументОбъектСЗВ63 = УдаленныйДокОбъект
				КонецЕсли;
			КонецЕсли;
			СтрокаПачки = ПачкиСЗВ63.Найти(ЗаменяемаяСсылка, "Пачка");
			Если СтрокаПачки <> Неопределено Тогда
				СтрокаПачки.Пачка = НоваяСсылка
			КонецЕсли;
			СоответствиеСсылокИОбъектов.Удалить(ЗаменяемаяСсылка);
			СоответствиеСсылокИОбъектов.Вставить(НоваяСсылка, УдаленныйДокОбъект);
		Иначе
			НовыйДокОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

Процедура СохранитьДанные(УдаляемыеДокументы, ТипСведений, Организация, ВыполнятьСохранениеСведенийПринятыхВПФР, ОтдельныйДокумент = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	// Сохраняем измененные документы
	Если ОтдельныйДокумент = Неопределено Тогда
		Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
			Если НЕ ЭлементСоответствия.Значение.ЭтоНовый() И ЭлементСоответствия.Значение.Модифицированность() Тогда
				ЭлементСоответствия.Значение.Записать(?(ЭлементСоответствия.Значение.Проведен,РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Помечаем на удаление удаляемые объекты
	Если УдаляемыеДокументы <> Неопределено Тогда
		Пока УдаляемыеДокументы.Следующий() Цикл
			ДокОбъект = УдаляемыеДокументы.Ссылка.ПолучитьОбъект();
			ДокОбъект.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	// Записываем в базу новые, только созданные документы на место удаленных документов
	Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПередачаСЗВ4вПФР.Ссылка
		|ИЗ
		|	Документ.ПередачаСЗВ4вПФР КАК ПередачаСЗВ4вПФР
		|ГДЕ
		|	ПередачаСЗВ4вПФР.ПометкаУдаления
		|	И ПередачаСЗВ4вПФР.Организация = &Организация";
		ТаблицаУдаленныхАДВ11 = Запрос.Выполнить().Выгрузить();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4 КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4
		|ГДЕ
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПометкаУдаления
		|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4.Организация = &Организация";
		ТаблицаУдаленныхСЗВ = Запрос.Выполнить().Выгрузить();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПачкаДокументовСЗВ_6_4.Ссылка
		|ИЗ
		|	Документ.ПачкаДокументовСЗВ_6_4 КАК ПачкаДокументовСЗВ_6_4
		|ГДЕ
		|	ПачкаДокументовСЗВ_6_4.ПометкаУдаления
		|	И ПачкаДокументовСЗВ_6_4.Организация = &Организация";
		ТаблицаУдаленныхСЗВ64 = Запрос.Выполнить().Выгрузить();
		
		Если ОтдельныйДокумент = Неопределено Тогда
			
			Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
				Если ЭлементСоответствия.Значение.ЭтоНовый() Тогда
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("ДокументСсылка.ПачкаДокументовСЗВ_6_4") Тогда
						ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхАДВ11, ТаблицаУдаленныхСЗВ64);
					Иначе
						ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхАДВ11, ТаблицаУдаленныхСЗВ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
				Если НЕ ЭлементСоответствия.Значение.ЭтоНовый() И ЭлементСоответствия.Значение.Модифицированность() Тогда
					ЭлементСоответствия.Значение.Записать(?(ЭлементСоответствия.Значение.Проведен,РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
				Если ЭлементСоответствия.Ключ = ОтдельныйДокумент Тогда
					Если ТипЗнч(ЭлементСоответствия.Ключ) = Тип("ДокументСсылка.ПачкаДокументовСЗВ_6_4") Тогда
						ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхАДВ11, ТаблицаУдаленныхСЗВ64);
					Иначе
						ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхАДВ11, ТаблицаУдаленныхСЗВ);
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипСведений = Перечисления.ТипыСведенийСЗВ.ПЕНСИОННАЯ Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОВзносахИСтраховомСтажеСПВ1.Ссылка
		|ИЗ
		|	Документ.СведенияОВзносахИСтраховомСтажеСПВ1 КАК СведенияОВзносахИСтраховомСтажеСПВ1
		|ГДЕ
		|	СведенияОВзносахИСтраховомСтажеСПВ1.ПометкаУдаления
		|	И СведенияОВзносахИСтраховомСтажеСПВ1.Организация = &Организация";
		ТаблицаУдаленныхСПВ = Запрос.Выполнить().Выгрузить();
		Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
			
			Если ОтдельныйДокумент = Неопределено Тогда
				Если ЭлементСоответствия.Значение.ЭтоНовый() Тогда
					ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхСПВ);
				КонецЕсли;
			ИначеЕсли ЭлементСоответствия.Ключ = ОтдельныйДокумент Тогда
				ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхСПВ);
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОНачисленномЗаработкеСЗВ63.Ссылка
		|ИЗ
		|	Документ.СведенияОНачисленномЗаработкеСЗВ63 КАК СведенияОНачисленномЗаработкеСЗВ63
		|ГДЕ
		|	СведенияОНачисленномЗаработкеСЗВ63.ПометкаУдаления
		|	И СведенияОНачисленномЗаработкеСЗВ63.Организация = &Организация";
		ТаблицаУдаленныхСЗВ = Запрос.Выполнить().Выгрузить();
		Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
			
			Если ОтдельныйДокумент = Неопределено Тогда
				Если ЭлементСоответствия.Значение.ЭтоНовый() Тогда
					ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхСЗВ);
				КонецЕсли;
			ИначеЕсли ЭлементСоответствия.Ключ = ОтдельныйДокумент Тогда
				ЗаписатьНовыйДокумент(ЭлементСоответствия, ТаблицаУдаленныхСЗВ);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Запишем сведения о документах, принятых в ПФР
	Если ВыполнятьСохранениеСведенийПринятыхВПФР Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СписокПериодов",	МассивПрошлыхПериодов);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияПринятыеПФР.Организация,
		|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР,
		|	СведенияПринятыеПФР.КомплектДокументов
		|ИЗ
		|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
		|ГДЕ
		|	СведенияПринятыеПФР.Организация = &Организация
		|	И (НЕ СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР В (&СписокПериодов))";
		
		НаборЗаписей = РегистрыСведений.СведенияПринятыеПФР.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Для Каждого ПрошлыйПериод из МассивПрошлыхПериодов Цикл
			СтрокаПачки = ПачкиДокументов.Найти(ПрошлыйПериод, "ОтчетныйПериод");
			Если СтрокаПачки <> Неопределено Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Организация					= Организация;
				Запись.ОтчетныйПериодПерсучетаПФР	= ПрошлыйПериод;
				Запись.КомплектДокументов			= СтрокаПачки.Пачка;
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ДокументыБылиМодифицированы() Экспорт

	ДокументыМодифицированы = Ложь;
	
	Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
		Если ЭлементСоответствия.Значение.Модифицированность() Тогда
			ДокументыМодифицированы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДокументыМодифицированы

КонецФункции // ДокументыМодифицированы()

Функция КоличествоПринятыхПФРДокументов() Экспорт

	Возврат ПачкиДокументов.Количество() - ПачкиДокументов.НайтиСтроки(Новый Структура("ОтчетныйПериод", ОтчетныйПериод)).Количество();

КонецФункции // КоличествоПринятыхПФРДокументов()

Функция НеиспользуемыеДокументы(ТипСведений, Организация, ОтчетныйПериод, ОтчетныйГод) Экспорт

	СписокДокументовДерева = Новый Массив;
	Для каждого ЭлементСоответствия Из СоответствиеСсылокИОбъектов Цикл
		СписокДокументовДерева.Добавить(ЭлементСоответствия.Ключ);
	КонецЦикла;
	
	// получаем список удаляемых документов
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокДокументовДерева", СписокДокументовДерева);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4 КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4
		|ГДЕ
		|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Организация = &Организация
		|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод = &ОтчетныйПериод
		|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПометкаУдаления
		|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка В (&СписокДокументовДерева)
		|	И НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.СпециальныйДокумент2010года
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаСЗВ4вПФР.Ссылка
		|ИЗ
		|	Документ.ПередачаСЗВ4вПФР КАК ПередачаСЗВ4вПФР
		|ГДЕ
		|	ПередачаСЗВ4вПФР.Организация = &Организация
		|	И ПередачаСЗВ4вПФР.ОтчетныйПериод = &ОтчетныйПериод
		|	И НЕ ПередачаСЗВ4вПФР.ПометкаУдаления
		|	И НЕ ПередачаСЗВ4вПФР.СпециальныйДокумент2010года
		|	И НЕ ПередачаСЗВ4вПФР.Ссылка В (&СписокДокументовДерева)
		|	И НЕ ПередачаСЗВ4вПФР.НеСодержитСЗВ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПачкаДокументовСЗВ_6_4.Ссылка
		|ИЗ
		|	Документ.ПачкаДокументовСЗВ_6_4 КАК ПачкаДокументовСЗВ_6_4
		|ГДЕ
		|	ПачкаДокументовСЗВ_6_4.Организация = &Организация
		|	И ПачкаДокументовСЗВ_6_4.ОтчетныйПериод = &ОтчетныйПериод
		|	И НЕ ПачкаДокументовСЗВ_6_4.ПометкаУдаления
		|	И НЕ ПачкаДокументовСЗВ_6_4.Ссылка В (&СписокДокументовДерева)";
	
	ИначеЕсли ТипСведений = Перечисления.ТипыСведенийСЗВ.ПЕНСИОННАЯ Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОВзносахИСтраховомСтажеСПВ1.Ссылка
		|ИЗ
		|	Документ.СведенияОВзносахИСтраховомСтажеСПВ1 КАК СведенияОВзносахИСтраховомСтажеСПВ1
		|ГДЕ
		|	СведенияОВзносахИСтраховомСтажеСПВ1.Организация = &Организация
		|	И СведенияОВзносахИСтраховомСтажеСПВ1.ОтчетныйПериод = &ОтчетныйПериод
		|	И (НЕ СведенияОВзносахИСтраховомСтажеСПВ1.ПометкаУдаления)
		|	И (НЕ СведенияОВзносахИСтраховомСтажеСПВ1.Ссылка В (&СписокДокументовДерева))";
		
	Иначе
		Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйГод);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияОНачисленномЗаработкеСЗВ63.Ссылка
		|ИЗ
		|	Документ.СведенияОНачисленномЗаработкеСЗВ63 КАК СведенияОНачисленномЗаработкеСЗВ63
		|ГДЕ
		|	СведенияОНачисленномЗаработкеСЗВ63.Организация = &Организация
		|	И СведенияОНачисленномЗаработкеСЗВ63.ОтчетныйПериод = &ОтчетныйПериод
		|	И (НЕ СведенияОНачисленномЗаработкеСЗВ63.ПометкаУдаления)
		|	И (НЕ СведенияОНачисленномЗаработкеСЗВ63.Ссылка В (&СписокДокументовДерева))";
		
	КонецЕсли;
	УдаляемыеДокументы = Запрос.Выполнить().Выбрать();
	
	Возврат УдаляемыеДокументы
	
КонецФункции // НеиспользуемыеДокументы()

Функция ПодобранПолныйКомплектПринятыхПФРДокументов() Экспорт

	КоличествоДоковПрошлогоПериода = КоличествоПринятыхПФРДокументов();
	Возврат МассивПрошлыхПериодов.Количество() = 0 Или КоличествоДоковПрошлогоПериода = МассивПрошлыхПериодов.Количество()

КонецФункции // ПодобранПолныйКомплектПринятыхПФРДокументов()

Функция ДочерниеКатегории(Категория, СоответствиеКатегорий)
	
	СтрокаСообщения = "";
	Для каждого ЭлементСоответствияКатегорий Из СоответствиеКатегорий Цикл
		Если Категория = ЭлементСоответствияКатегорий.Значение Тогда
			СтрокаСообщения = СтрокаСообщения + ?(ПустаяСтрока(СтрокаСообщения),"",", ") + ОбщегоНазначенияЗК.ПолучитьИмяЭлементаПеречисленияПоЗначению(ЭлементСоответствияКатегорий.Ключ)
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаСообщения
	
КонецФункции 

Функция ПроверитьКомплектДокументов(ПачкаАДВ62, СообщатьОбУспехе = Ложь) Экспорт
	
	СоответствиеКатегорий = ПроцедурыПерсонифицированногоУчета.СоответствиеКатегорийИностранцевКатегориямРоссиян();

	ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
	ДеревоСообщений = ОбработкаКомментариев.Сообщения;
	
	ДокументОбъект = СоответствиеСсылокИОбъектов[ПачкаАДВ62];
	ОтчетныйПериодАДВ62 = ДокументОбъект.ОтчетныйПериод;
    ДеревоАДВ62 = Неопределено;
	
	РСВ1 = ДокументОбъект.РасчетРСВ1;
	ПоказателиОтчета = Неопределено;
	
	// проверка отдельных документов
	
	// РСВ-1
	ЕстьОшибкиРСВ1 = Ложь;
	ЕстьЗамечанияРСВ1 = Ложь;
	Если ЗначениеЗаполнено(РСВ1) Тогда
		
		РазделПроверкиРСВ1 = ОбработкаКомментариев.ДобавитьСообщение("Проверка расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
		ФормаРасчетаРСВ1 = ФормаРасчетаРСВ1(РСВ1);
		Если ФормаРасчетаРСВ1 = Неопределено Тогда
			ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Не удалось открыть сохраненные данные расчета РСВ-1!", ЕстьОшибкиРСВ1,,,,РазделПроверкиРСВ1);
		Иначе
			
			ОтчетныйПериодРСВ1 = ПроцедурыПерсонифицированногоУчета.НачалоОтчетногоПериодаПерсучета(ФормаРасчетаРСВ1.мДатаКонцаПериодаОтчета);
			
			СтрокаОписанияФормы = ФормаРасчетаРСВ1.мТаблицаФормОтчета.Найти(ФормаРасчетаРСВ1.мВыбраннаяФорма, "ФормаОтчета");
			Если СтрокаОписанияФормы = Неопределено Тогда
				ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Указанный в Описи АДВ-6-2 Расчет РСВ-1 оформлен по неопознанной форме! Необходимо заполнить новый экземпляр Расчета по действующей форме и указать его в Описи АДВ-6-2.", ЕстьОшибкиРСВ1,,,,РазделПроверкиРСВ1);
			Иначе
				
				Если ЗначениеЗаполнено(СтрокаОписанияФормы.ДатаКонецДействия) И СтрокаОписанияФормы.ДатаКонецДействия < ОтчетныйПериодРСВ1 Тогда // форма устарела
					ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Указанный в Описи АДВ-6-2 Расчет РСВ-1 оформлен по устаревшей форме! Необходимо заполнить новый экземпляр Расчета по действующей форме и указать его в Описи АДВ-6-2.", ЕстьОшибкиРСВ1,,,,РазделПроверкиРСВ1);
				Иначе
					
					РСВ1Объект = ФормаРасчетаРСВ1.мСохраненныйДок;
					ЕстьОшибкиРСВ1 = Не ФормаРасчетаРСВ1.ПроверитьПоказатели();
					
					Если ЕстьОшибкиРСВ1 Тогда
						Для каждого СтрокаОшибки Из ФормаРасчетаРСВ1.ТаблицаСообщений Цикл
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(СтрокаОшибки.Описание,,,,,РазделПроверкиРСВ1);
						КонецЦикла;
					КонецЕсли;
					
					Если РСВ1Объект.Организация = ДокументОбъект.Организация Тогда
						Данные = РСВ1Объект.ДанныеОтчета.Получить();
						ИмяРаздела = "ПолеТабличногоДокументаТитульный";
						ИмяПоля = "НомРег1";
						Значение = Неопределено;
						Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("ПоказателиОтчета",Значение) Тогда
							ПоказателиОтчета = Значение;
							Если ТипЗнч(ПоказателиОтчета) = Тип("Структура") И ПоказателиОтчета.Свойство(ИмяРаздела,Значение) Тогда
								Если ТипЗнч(Значение) = Тип("Структура") И Значение.Свойство(ИмяПоля,Значение) Тогда
								Иначе 
									ПоказателиОтчета = Неопределено;
								КонецЕсли;	
							Иначе 
								ПоказателиОтчета = Неопределено;
							КонецЕсли;
						Иначе 
							ПоказателиОтчета = Неопределено;
						КонецЕсли;
						Если ПоказателиОтчета = Неопределено Тогда
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Не удалось разобрать данные указанного в Описи АДВ-6-2 Расчета РСВ-1!", ЕстьОшибкиРСВ1,,,,РазделПроверкиРСВ1);
						Иначе	
							
							ТитульныйЛист = ПоказателиОтчета.ПолеТабличногоДокументаТитульный;
							ИННизРСВ1 = "";
							Для Сч = 1 По 12 Цикл
								ИННизРСВ1 = ИННизРСВ1 + ТитульныйЛист["ИНН" + Сч];
							КонецЦикла;
							ИННизРСВ1 = СтрЗаменить(ИННизРСВ1, "-","");
							КППизРСВ1 = "";
							Для Сч = 1 По 9 Цикл
								КППизРСВ1 = КППизРСВ1 + ТитульныйЛист["КПП" + Сч];
							КонецЦикла;
							КППизРСВ1 = СтрЗаменить(КППизРСВ1, "-","");
							РегНомерПФРизРСВ1 = "";
							Для Сч = 1 По 14 Цикл
								РегНомерПФРизРСВ1 = РегНомерПФРизРСВ1 + ТитульныйЛист["НомРег" + Сч];
							КонецЦикла;
							
							Если ОтчетныйПериодРСВ1 < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда // за 2010 и 2011 годы
								
								СоответствиеКодовТарифа = Новый Соответствие;
								СоответствиеКодовТарифа.Вставить("01", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								СоответствиеКодовТарифа.Вставить("02", Перечисления.КатегорииЗастрахованныхЛицПФР.СХ);
								СоответствиеКодовТарифа.Вставить("03", Перечисления.КатегорииЗастрахованныхЛицПФР.ООИ);
								СоответствиеКодовТарифа.Вставить("04", Перечисления.КатегорииЗастрахованныхЛицПФР.ЕСХН);
								СоответствиеКодовТарифа.Вставить("51", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								СоответствиеКодовТарифа.Вставить("36", Перечисления.КатегорииЗастрахованныхЛицПФР.ТВЭЗ);
								СоответствиеКодовТарифа.Вставить("06", Перечисления.КатегорииЗастрахованныхЛицПФР.ОДИТ);
								СоответствиеКодовТарифа.Вставить("07", Перечисления.КатегорииЗастрахованныхЛицПФР.ПНЭД);
								СоответствиеКодовТарифа.Вставить("08", Перечисления.КатегорииЗастрахованныхЛицПФР.ХО);
								СоответствиеКодовТарифа.Вставить("09", Перечисления.КатегорииЗастрахованныхЛицПФР.СМИ);
								СоответствиеКодовТарифа.Вставить("10", Перечисления.КатегорииЗастрахованныхЛицПФР.ИЦС);
								
								Строки210РСВ1 = Новый Соответствие;
								Строки216РСВ1 = Новый Соответствие;
								Для каждого ЗначениеПеречисления Из Перечисления.КатегорииЗастрахованныхЛицПФР Цикл
									Строки210РСВ1.Вставить(ЗначениеПеречисления, 0);
									Строки216РСВ1.Вставить(ЗначениеПеречисления, 0);
								КонецЦикла;
								
								НачисленоРСВ1НаСтраховую = 0;
								НачисленоРСВ1НаНакопительную = 0;
								
								ЗадолженностьНаСтраховуюНаНачалоПериода = 0;
								ЗадолженностьНаНакопительнуюНаНачалоПериода = 0;
								ЗадолженностьНаСтраховуюНаКонецПериода = 0;
								ЗадолженностьНаНакопительнуюНаКонецПериода = 0;
								
								УплаченоРСВ1НаСтраховую = 0;
								УплаченоРСВ1НаНакопительную = 0;
								
								Строка200РСВ1 = 0;
								Строка210РСВ1 = 0;
								Строка216РСВ1 = 0;
								УменьшенныйОбъектОбложенияРСВ1 = 0;
								ОблагаемаяБазаРСВ1 = 0;
								
								Разделы = Данные.ДанныеМногостраничныхРазделов.Раздел12;
								Для каждого ЛистДанных Из Разделы Цикл
									ПоказателиРазделов = ЛистДанных.Данные;
									
									КодТарифа = ПоказателиРазделов.П000200001001_1 + ПоказателиРазделов.П000200001001_2;
									ЗначениеПеречисления = СоответствиеКодовТарифа[КодТарифа];
									Если Не ЗначениеЗаполнено(ЗначениеПеречисления) Тогда
										Продолжить;
									КонецЕсли;
									
									НачисленоРСВ1НаСтраховую = НачисленоРСВ1НаСтраховую + ПоказателиРазделов.П000100011403;
									НачисленоРСВ1НаНакопительную = НачисленоРСВ1НаНакопительную + ПоказателиРазделов.П000100011404;
									
									ЗадолженностьНаСтраховуюНаНачалоПериода = ЗадолженностьНаСтраховуюНаНачалоПериода + ПоказателиРазделов.П000100010003 + (ПоказателиРазделов.П000100011003 - ПоказателиРазделов.П000100011403) - (ПоказателиРазделов.П000100014003 - ПоказателиРазделов.П000100014403);
									ЗадолженностьНаНакопительнуюНаНачалоПериода = ЗадолженностьНаНакопительнуюНаНачалоПериода + ПоказателиРазделов.П000100010004 + (ПоказателиРазделов.П000100011004 - ПоказателиРазделов.П000100011404) - (ПоказателиРазделов.П000100014004 - ПоказателиРазделов.П000100014404);
									ЗадолженностьНаСтраховуюНаКонецПериода = ЗадолженностьНаСтраховуюНаКонецПериода + ПоказателиРазделов.П000100015003;
									ЗадолженностьНаНакопительнуюНаКонецПериода = ЗадолженностьНаНакопительнуюНаКонецПериода + ПоказателиРазделов.П000100015004;
									
									УплаченоРСВ1НаСтраховую = УплаченоРСВ1НаСтраховую + ПоказателиРазделов.П000100014403;
									УплаченоРСВ1НаНакопительную = УплаченоРСВ1НаНакопительную + ПоказателиРазделов.П000100014404;
									
									Строка200РСВ1 = Строка200РСВ1 + ПоказателиРазделов.П000200020003;
									Строка210РСВ1 = Строка210РСВ1 + ПоказателиРазделов.П000200021003;
									Строка216РСВ1 = Строка216РСВ1 + ПоказателиРазделов.П000200021603;
									Строки210РСВ1.Вставить(ЗначениеПеречисления, Строки210РСВ1[ЗначениеПеречисления] + ПоказателиРазделов.П000200021003);
									Строки216РСВ1.Вставить(ЗначениеПеречисления, Строки216РСВ1[ЗначениеПеречисления] + ПоказателиРазделов.П000200021603);
									УменьшенныйОбъектОбложенияРСВ1 = УменьшенныйОбъектОбложенияРСВ1 + ПоказателиРазделов.П000200020003 - ПоказателиРазделов.П000200021003 - ПоказателиРазделов.П000200021403 - ПоказателиРазделов.П000200021503 - ПоказателиРазделов.П000200021603;
									ОблагаемаяБазаРСВ1 = ОблагаемаяБазаРСВ1 + ПоказателиРазделов.П000200022003 + ПоказателиРазделов.П000200022103;
								КонецЦикла; 
								
								УплаченоРСВ1НаСтраховую = УплаченоРСВ1НаСтраховую - ?(ЗадолженностьНаСтраховуюНаКонецПериода < 0, -ЗадолженностьНаСтраховуюНаКонецПериода, 0) + ?(ЗадолженностьНаСтраховуюНаНачалоПериода < 0, -ЗадолженностьНаСтраховуюНаНачалоПериода,0);
								УплаченоРСВ1НаНакопительную = УплаченоРСВ1НаНакопительную - ?(ЗадолженностьНаНакопительнуюНаКонецПериода < 0, -ЗадолженностьНаНакопительнуюНаКонецПериода, 0) + ?(ЗадолженностьНаНакопительнуюНаНачалоПериода < 0, -ЗадолженностьНаНакопительнуюНаНачалоПериода,0);
								
								Раздел3 = ПоказателиОтчета.ПолеТабличногоДокументаРаздел30;
								Строка300РСВ1 = Раздел3.П000300030003;
								Строка310РСВ1 = Раздел3.П000300031003;
								Строка316РСВ1 = Раздел3.П000300031603;
								УменьшенныйОбъектОбложенияИнвалидовРСВ1 = Раздел3.П000300030003 - Раздел3.П000300031003 - Раздел3.П000300031403 - Раздел3.П000300031503 - Раздел3.П000300031603;
								ОблагаемаяБазаИнвалидовРСВ1 = Раздел3.П000300032003 + Раздел3.П000300032103;
								
								Если Не ЕстьОшибкиРСВ1 И Не ЕстьЗамечанияРСВ1 Тогда
									ОбработкаКомментариев.ДобавитьСообщение("Ошибок не обнаружено.", Перечисления.ВидыСообщений.Информация, , РазделПроверкиРСВ1);		
								КонецЕсли;
								
							ИначеЕсли ОтчетныйПериодРСВ1 < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() И СтрокаОписанияФормы.ФормаОтчета = "ФормаОтчета2012Кв1" Тогда // 2012 год
								
								КоличествоЗастрахованных = 0;
								СтрокаЧисла = "";
								Для Сч = 1 По 6 Цикл
									Цифра = ТитульныйЛист["КолЗастрахованных" + Сч];
									Если ЗначениеЗаполнено(Цифра) Тогда
										СтрокаЧисла = СтрокаЧисла + Цифра
									КонецЕсли;
								КонецЦикла;
								Если ЗначениеЗаполнено(СтрокаЧисла) Тогда
									КоличествоЗастрахованных = Число(СтрокаЧисла)
								КонецЕсли;
								Если КоличествоЗастрахованных = 0 Тогда
									ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Количество застрахованных лиц должно быть больше нуля!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРСВ1);
								КонецЕсли;
								
								СредняяЧисленность = 0;
								СтрокаЧисла = "";
								Для Сч = 1 По 6 Цикл
									Цифра = ТитульныйЛист["СрСписЧисл" + Сч];
									Если ЗначениеЗаполнено(Цифра) Тогда
										СтрокаЧисла = СтрокаЧисла + Цифра
									КонецЕсли;
								КонецЦикла;
								Если ЗначениеЗаполнено(СтрокаЧисла) Тогда
									СредняяЧисленность = Число(СтрокаЧисла)
								КонецЕсли;
								Если СредняяЧисленность = 0 Тогда
									ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Среднесписочная численность должна быть больше нуля!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРСВ1);
								КонецЕсли;
								
								СоответствиеКодовТарифа = Новый Соответствие;
								СоответствиеКодовТарифа.Вставить("01", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								СоответствиеКодовТарифа.Вставить("03", Перечисления.КатегорииЗастрахованныхЛицПФР.ООИ);
								СоответствиеКодовТарифа.Вставить("04", Перечисления.КатегорииЗастрахованныхЛицПФР.ЕСХН);
								СоответствиеКодовТарифа.Вставить("06", Перечисления.КатегорииЗастрахованныхЛицПФР.ОДИТ);
								СоответствиеКодовТарифа.Вставить("07", Перечисления.КатегорииЗастрахованныхЛицПФР.ПНЭД);
								СоответствиеКодовТарифа.Вставить("08", Перечисления.КатегорииЗастрахованныхЛицПФР.ХО);
								СоответствиеКодовТарифа.Вставить("09", Перечисления.КатегорииЗастрахованныхЛицПФР.СМИ);
								СоответствиеКодовТарифа.Вставить("10", Перечисления.КатегорииЗастрахованныхЛицПФР.ИЦС);
								СоответствиеКодовТарифа.Вставить("11", Перечисления.КатегорииЗастрахованныхЛицПФР.АСБ);
								СоответствиеКодовТарифа.Вставить("12", Перечисления.КатегорииЗастрахованныхЛицПФР.АСБ);
								СоответствиеКодовТарифа.Вставить("13", Перечисления.КатегорииЗастрахованныхЛицПФР.АСБ);
								СоответствиеКодовТарифа.Вставить("14", Перечисления.КатегорииЗастрахованныхЛицПФР.ИНЖУ);
								СоответствиеКодовТарифа.Вставить("15", Перечисления.КатегорииЗастрахованныхЛицПФР.ЧЭС);
								СоответствиеКодовТарифа.Вставить("18", Перечисления.КатегорииЗастрахованныхЛицПФР.СХ);
								СоответствиеКодовТарифа.Вставить("19", Перечисления.КатегорииЗастрахованныхЛицПФР.ХМН);
								СоответствиеКодовТарифа.Вставить("20", Перечисления.КатегорииЗастрахованныхЛицПФР.ХМН);
								СоответствиеКодовТарифа.Вставить("36", Перечисления.КатегорииЗастрахованныхЛицПФР.ТВЭЗ);
								СоответствиеКодовТарифа.Вставить("52", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								СоответствиеКодовТарифа.Вставить("53", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								
								СоответствиеТарифов = Новый Соответствие;
								СоответствиеТарифов.Вставить("01", Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим);
								СоответствиеТарифов.Вставить("03", Перечисления.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов);
								СоответствиеТарифов.Вставить("04", Перечисления.ТарифыСтраховыхВзносов.ЕСХН);
								СоответствиеТарифов.Вставить("06", Перечисления.ТарифыСтраховыхВзносов.ITОрганизации);
								СоответствиеТарифов.Вставить("07", Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство);
								СоответствиеТарифов.Вставить("08", Перечисления.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов);
								СоответствиеТарифов.Вставить("09", Перечисления.ТарифыСтраховыхВзносов.СМИ);
								СоответствиеТарифов.Вставить("10", Перечисления.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково);
								СоответствиеТарифов.Вставить("11", Перечисления.ТарифыСтраховыхВзносов.ДляФармацевтовАптек);
								СоответствиеТарифов.Вставить("12", Перечисления.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации);
								СоответствиеТарифов.Вставить("13", Перечисления.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации);
								СоответствиеТарифов.Вставить("14", Перечисления.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги);
								СоответствиеТарифов.Вставить("15", Перечисления.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ);
								СоответствиеТарифов.Вставить("18", Перечисления.ТарифыСтраховыхВзносов.СельХозПроизводители);
								СоответствиеТарифов.Вставить("19", Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы);
								СоответствиеТарифов.Вставить("20", Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы);
								СоответствиеТарифов.Вставить("36", Перечисления.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны);
								СоответствиеТарифов.Вставить("52", Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим);
								СоответствиеТарифов.Вставить("53", Перечисления.ТарифыСтраховыхВзносов.ЕНВД);
								
								ТаблицаТарифов = РасчетСтраховыхВзносов.ТекущиеТарифыСтраховыхВзносовПоВидамТарифа(ОтчетныйПериодРСВ1);
								
								Раздел1 = ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
								
								НачисленоРСВ1НаСтраховую = Раздел1.П000100011403;
								НачисленоРСВ1НаНакопительную = Раздел1.П000100011404;
								УплаченоРСВ1НаСтраховую = Раздел1.П000100014403;
								УплаченоРСВ1НаНакопительную = Раздел1.П000100014404;
								
								ЗадолженностьНаСтраховуюНаНачалоПериода = Раздел1.П000100010003 + (Раздел1.П000100011003 - Раздел1.П000100011403) - (Раздел1.П000100014003 - Раздел1.П000100014403);
								ЗадолженностьНаНакопительнуюНаНачалоПериода = Раздел1.П000100010004 + (Раздел1.П000100011004 - Раздел1.П000100011404) - (Раздел1.П000100014004 - Раздел1.П000100014404);
								ЗадолженностьНаСтраховуюНаКонецПериода = Раздел1.П000100015003;
								ЗадолженностьНаНакопительнуюНаКонецПериода = Раздел1.П000100015004;
								
								УплаченоРСВ1НаСтраховую = УплаченоРСВ1НаСтраховую - ?(ЗадолженностьНаСтраховуюНаКонецПериода < 0, -ЗадолженностьНаСтраховуюНаКонецПериода, 0) + ?(ЗадолженностьНаСтраховуюНаНачалоПериода < 0, -ЗадолженностьНаСтраховуюНаНачалоПериода,0);
								УплаченоРСВ1НаНакопительную = УплаченоРСВ1НаНакопительную - ?(ЗадолженностьНаНакопительнуюНаКонецПериода < 0, -ЗадолженностьНаНакопительнуюНаКонецПериода, 0) + ?(ЗадолженностьНаНакопительнуюНаНачалоПериода < 0, -ЗадолженностьНаНакопительнуюНаНачалоПериода,0);
								
								НачисленоРСВ1НаСтраховуюПоТарифам = Новый Соответствие;
								НачисленоРСВ1НаНакопительнуюПоТарифам = Новый Соответствие;
								ПоказателиНеоблагаемыхДоходов = Новый Соответствие;
								НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам = Новый Соответствие;
								
								ОбъектОбложенияРСВ1 = 0;
								УменьшенныйОбъектОбложенияРСВ1 = 0;
								ОблагаемаяБазаРСВ1 = 0;
								
								ОбъектОбложенияРСВ1Льготный = 0;
								УменьшенныйОбъектОбложенияРСВ1Льготный = 0;
								ОблагаемаяБазаРСВ1Льготная = 0;
								
								Строка25203 = 0;
								Строка25204 = 0;
								Строка25205 = 0;
								Строка25206 = 0;
								
								Разделы = Данные.ДанныеМногостраничныхРазделов.Раздел2;
								Для каждого ЛистДанных Из Разделы Цикл
									
									ПоказателиРазделов = ЛистДанных.Данные;
									
									КодТарифа = ПоказателиРазделов.П000200001001 + ПоказателиРазделов.П000200001002;
									ЗначениеПеречисления = СоответствиеКодовТарифа[КодТарифа];
									Если ЗначениеПеречисления = Неопределено Тогда
										Продолжить;
									КонецЕсли;
									
									НачисленоРСВ1НаСтраховуюПоТарифам.Вставить(ЗначениеПеречисления, ?(НачисленоРСВ1НаСтраховуюПоТарифам[ЗначениеПеречисления] = Неопределено, 0, НачисленоРСВ1НаСтраховуюПоТарифам[ЗначениеПеречисления]) + ПоказателиРазделов.П000200025004 + ПоказателиРазделов.П000200025005 + ПоказателиРазделов.П000200025006);
									НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам.Вставить(ЗначениеПеречисления, ?(НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[ЗначениеПеречисления] = Неопределено, 0, НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[ЗначениеПеречисления]) + ПоказателиРазделов.П000200025003);
									НачисленоРСВ1НаНакопительнуюПоТарифам.Вставить(ЗначениеПеречисления, ?(НачисленоРСВ1НаНакопительнуюПоТарифам[ЗначениеПеречисления] = Неопределено, 0, НачисленоРСВ1НаНакопительнуюПоТарифам[ЗначениеПеречисления]) + ПоказателиРазделов.П000200025104 + ПоказателиРазделов.П000200025105 + ПоказателиРазделов.П000200025106);
									
									ПоказателиНеоблагаемыхДоходов.Вставить(ЗначениеПеречисления, ?(ПоказателиНеоблагаемыхДоходов[ЗначениеПеречисления] = Неопределено, 0, ПоказателиНеоблагаемыхДоходов[ЗначениеПеречисления])
											+ ПоказателиРазделов.П000200021103 + ПоказателиРазделов.П000200021203 + ПоказателиРазделов.П000200021303
											+ ПоказателиРазделов.П000200022103 + ПоказателиРазделов.П000200022203 + ПоказателиРазделов.П000200022303
											+ ?(ЗначениеПеречисления = Перечисления.КатегорииЗастрахованныхЛицПФР.НР, 0, ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303));
											
									Если ЗначениеПеречисления = Перечисления.КатегорииЗастрахованныхЛицПФР.НР Тогда
										ОбъектОбложенияРСВ1 = ОбъектОбложенияРСВ1 + ПоказателиРазделов.П000200020103 + ПоказателиРазделов.П000200020203 + ПоказателиРазделов.П000200020303;
										УменьшенныйОбъектОбложенияРСВ1 = УменьшенныйОбъектОбложенияРСВ1 + ПоказателиРазделов.П000200020103 + ПоказателиРазделов.П000200020203 + ПоказателиРазделов.П000200020303 
												- ПоказателиРазделов.П000200021103 - ПоказателиРазделов.П000200021203 - ПоказателиРазделов.П000200021303;
										ОблагаемаяБазаРСВ1 = ОблагаемаяБазаРСВ1 + ПоказателиРазделов.П000200024003 + ПоказателиРазделов.П000200024103 + ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303;
									Иначе
										ОбъектОбложенияРСВ1Льготный = ОбъектОбложенияРСВ1Льготный + ПоказателиРазделов.П000200020103 + ПоказателиРазделов.П000200020203 + ПоказателиРазделов.П000200020303;
										УменьшенныйОбъектОбложенияРСВ1Льготный = УменьшенныйОбъектОбложенияРСВ1Льготный + ПоказателиРазделов.П000200020103 + ПоказателиРазделов.П000200020203 + ПоказателиРазделов.П000200020303 
												- ПоказателиРазделов.П000200021103 - ПоказателиРазделов.П000200021203 - ПоказателиРазделов.П000200021303 
												- ПоказателиРазделов.П000200023103 - ПоказателиРазделов.П000200023203 - ПоказателиРазделов.П000200023303;
										ОблагаемаяБазаРСВ1Льготная = ОблагаемаяБазаРСВ1Льготная + ПоказателиРазделов.П000200024003 + ПоказателиРазделов.П000200024103;
									КонецЕсли;
									
									Строка25203 = Строка25203 + ПоказателиРазделов.П000200025203;
									Строка25204 = Строка25204 + ПоказателиРазделов.П000200025204;
									Строка25205 = Строка25205 + ПоказателиРазделов.П000200025205;
									Строка25206 = Строка25206 + ПоказателиРазделов.П000200025206;
									
								КонецЦикла; 
								
								НачисленоРСВ1НаСтраховую = НачисленоРСВ1НаСтраховую - Строка25204 - Строка25205 - Строка25206;
								
								//Проверки Расчета
								
								Для каждого ЛистДанных Из Разделы Цикл
									ПоказателиРазделов = ЛистДанных.Данные;
									
									КодТарифа = ПоказателиРазделов.П000200001001 + ПоказателиРазделов.П000200001002;
									
									РазделПроверкиРаздела2РСВ1 = ОбработкаКомментариев.ДобавитьСообщение("Проверка Раздела 2 с кодом тарифа " + КодТарифа, Перечисления.ВидыСообщений.Информация,,РазделПроверкиРСВ1);
									
									Тариф = СоответствиеТарифов[КодТарифа];
									Если Тариф = Неопределено Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя «Кода тарифа» (" + КодТарифа + ") не соответствует справочнику кодов тарифов!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
										Продолжить;
									КонецЕсли;
									
									СтрокаТарифа = ТаблицаТарифов.Найти(Тариф,"ВидТарифа");
									ТарифССуммПревышения = ?(Тариф = Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим Или Тариф = Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим Или Тариф = Перечисления.ТарифыСтраховыхВзносов.ЕНВД, 10, 0);
									
									ДопустимоеРасхождение = 0.005 * КоличествоЗастрахованных;
									СообщениеОРасхожденииУжеВыводилось = Ложь;
									
									// специальные проверки для разных тарифов
									
									Если Тариф = Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим Или Тариф = Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим Или Тариф = Перечисления.ТарифыСтраховыхВзносов.ЕНВД Тогда // коды тарифа 01, 52, 53 
										Если ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303 > 0 И ПоказателиРазделов.П000200025203 = 0 Тогда
											ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Если при указанном коде тарифа 01, 52, 53 сумма значений гр.3 строк 231, 232, 233 больше 0, то и значение в гр.3 строки 252 раздела 2 должно быть больше 0!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										Если ПоказателиРазделов.П000200023104 + ПоказателиРазделов.П000200023204 + ПоказателиРазделов.П000200023304 > 0 И ПоказателиРазделов.П000200025204 = 0 Тогда
											ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Если при указанном коде тарифа 01, 52, 53 сумма значений гр.4 строк 231, 232, 233 больше 0, то и значение в гр.4 строки 252 раздела 2 должно быть больше 0!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										Если ПоказателиРазделов.П000200023105 + ПоказателиРазделов.П000200023205 + ПоказателиРазделов.П000200023305 > 0 И ПоказателиРазделов.П000200025205 = 0 Тогда
											ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Если при указанном коде тарифа 01, 52, 53 сумма значений гр.5 строк 231, 232, 233 больше 0, то и значение в гр.5 строки 252 раздела 2 должно быть больше 0!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										Если ПоказателиРазделов.П000200023106 + ПоказателиРазделов.П000200023206 + ПоказателиРазделов.П000200023306 > 0 И ПоказателиРазделов.П000200025206 = 0 Тогда
											ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Если при указанном коде тарифа 01, 52, 53 сумма значений гр.6 строк 231, 232, 233 больше 0, то и значение в гр.6 строки 252 раздела 2 должно быть больше 0!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
									КонецЕсли;
									
									// проверки, независящие от вида тарифа
									
									//строка 240
									Если ПоказателиРазделов.П000200024003 <> ПоказателиРазделов.П000200020103 + ПоказателиРазделов.П000200020303 - ПоказателиРазделов.П000200021103 - ПоказателиРазделов.П000200021303 - ПоказателиРазделов.П000200022103 - ПоказателиРазделов.П000200022303 - ПоказателиРазделов.П000200023103 - ПоказателиРазделов.П000200023303 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.3 строки 240 должно быть равно: строка 201 плюс строка 203, минус строка 211, минус строка 213, минус строка 221, минус строка 223, минус строка 231, минус строка 233 по гр.3!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									Если ПоказателиРазделов.П000200024004 <> ПоказателиРазделов.П000200020104 + ПоказателиРазделов.П000200020304 - ПоказателиРазделов.П000200021104 - ПоказателиРазделов.П000200021304 - ПоказателиРазделов.П000200022104 - ПоказателиРазделов.П000200022304 - ПоказателиРазделов.П000200023104 - ПоказателиРазделов.П000200023304 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.4 строки 240 должно быть равно: строка 201 плюс строка 204, минус строка 211, минус строка 213, минус строка 221, минус строка 223, минус строка 231, минус строка 233 по гр.4!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									Если ПоказателиРазделов.П000200024005 <> ПоказателиРазделов.П000200020105 + ПоказателиРазделов.П000200020305 - ПоказателиРазделов.П000200021105 - ПоказателиРазделов.П000200021305 - ПоказателиРазделов.П000200022105 - ПоказателиРазделов.П000200022305 - ПоказателиРазделов.П000200023105 - ПоказателиРазделов.П000200023305 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.5 строки 240 должно быть равно: строка 201 плюс строка 205, минус строка 211, минус строка 213, минус строка 221, минус строка 223, минус строка 231, минус строка 233 по гр.5!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									Если ПоказателиРазделов.П000200024006 <> ПоказателиРазделов.П000200020106 + ПоказателиРазделов.П000200020306 - ПоказателиРазделов.П000200021106 - ПоказателиРазделов.П000200021306 - ПоказателиРазделов.П000200022106 - ПоказателиРазделов.П000200022306 - ПоказателиРазделов.П000200023106 - ПоказателиРазделов.П000200023306 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.6 строки 240 должно быть равно: строка 201 плюс строка 206, минус строка 211, минус строка 213, минус строка 221, минус строка 223, минус строка 231, минус строка 233 по гр.6!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									//строка 241
									Если ПоказателиРазделов.П000200024103 <> ПоказателиРазделов.П000200020203 - ПоказателиРазделов.П000200021203 - ПоказателиРазделов.П000200022203 - ПоказателиРазделов.П000200023203 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.3 строки 241 должно быть равно: строка 202 минус строка 212, минус строка 222, минус строка 232 по гр.3!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									Если ПоказателиРазделов.П000200024104 <> ПоказателиРазделов.П000200020204 - ПоказателиРазделов.П000200021204 - ПоказателиРазделов.П000200022204 - ПоказателиРазделов.П000200023204 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.4 строки 241 должно быть равно: строка 202 минус строка 212, минус строка 222, минус строка 232 по гр.4!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									Если ПоказателиРазделов.П000200024105 <> ПоказателиРазделов.П000200020205 - ПоказателиРазделов.П000200021205 - ПоказателиРазделов.П000200022205 - ПоказателиРазделов.П000200023205 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.5 строки 241 должно быть равно: строка 202 минус строка 212, минус строка 222, минус строка 232 по гр.5!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									Если ПоказателиРазделов.П000200024106 <> ПоказателиРазделов.П000200020206 - ПоказателиРазделов.П000200021206 - ПоказателиРазделов.П000200022206 - ПоказателиРазделов.П000200023206 Тогда
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.6 строки 241 должно быть равно: строка 202 минус строка 212, минус строка 222, минус строка 232 по гр.6!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									
									//строка 250
									РасчетноеЗначение = Окр(ПоказателиРазделов.П000200024003 * СтрокаТарифа.ПФР / 100, 2) + Окр(ПоказателиРазделов.П000200024103 * (СтрокаТарифа.ПФР - СтрокаТарифа.ПФРНакопительная) / 100, 2);
									Разность = Макс(ПоказателиРазделов.П000200025003 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025003);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.3 строки 250 (" + Формат(ПоказателиРазделов.П000200025003,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200024003 - ПоказателиРазделов.П000200024005 - ПоказателиРазделов.П000200024006) * СтрокаТарифа.ПФР / 100, 2) + Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * (СтрокаТарифа.ПФР - СтрокаТарифа.ПФРНакопительная) / 100, 2)
									- (Окр((ПоказателиРазделов.П000200024003 - ПоказателиРазделов.П000200024004 - ПоказателиРазделов.П000200024005 - ПоказателиРазделов.П000200024006) * СтрокаТарифа.ПФР / 100, 2) + Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024104 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * (СтрокаТарифа.ПФР - СтрокаТарифа.ПФРНакопительная) / 100, 2));
									Разность = Макс(ПоказателиРазделов.П000200025004 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025004);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.4 строки 250 (" + Формат(ПоказателиРазделов.П000200025004,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200024003 - ПоказателиРазделов.П000200024006) * СтрокаТарифа.ПФР / 100, 2) + Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024106) * (СтрокаТарифа.ПФР - СтрокаТарифа.ПФРНакопительная) / 100, 2)
									- (Окр((ПоказателиРазделов.П000200024003 - ПоказателиРазделов.П000200024004 - ПоказателиРазделов.П000200024005 - ПоказателиРазделов.П000200024006) * СтрокаТарифа.ПФР / 100, 2) + Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024104 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * (СтрокаТарифа.ПФР - СтрокаТарифа.ПФРНакопительная) / 100, 2))
									- ПоказателиРазделов.П000200025004;
									Разность = Макс(ПоказателиРазделов.П000200025005 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025005);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.5 строки 250 (" + Формат(ПоказателиРазделов.П000200025005,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр(ПоказателиРазделов.П000200024003 * СтрокаТарифа.ПФР / 100, 2) + Окр(ПоказателиРазделов.П000200024103 * (СтрокаТарифа.ПФР - СтрокаТарифа.ПФРНакопительная) / 100, 2)
									- (Окр((ПоказателиРазделов.П000200024003 - ПоказателиРазделов.П000200024004 - ПоказателиРазделов.П000200024005 - ПоказателиРазделов.П000200024006) * СтрокаТарифа.ПФР / 100, 2) + Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024104 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * (СтрокаТарифа.ПФР - СтрокаТарифа.ПФРНакопительная) / 100, 2))
									- ПоказателиРазделов.П000200025004 - ПоказателиРазделов.П000200025005;
									Разность = Макс(ПоказателиРазделов.П000200025006 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025006);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.6 строки 250 (" + Формат(ПоказателиРазделов.П000200025006,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									//строка 251
									РасчетноеЗначение = Окр(ПоказателиРазделов.П000200024103 * СтрокаТарифа.ПФРНакопительная / 100, 2);
									Разность = Макс(ПоказателиРазделов.П000200025103 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025103);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.3 строки 251 (" + Формат(ПоказателиРазделов.П000200025103,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * СтрокаТарифа.ПФРНакопительная / 100, 2)
									- Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024104 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * СтрокаТарифа.ПФРНакопительная / 100, 2);
									Разность = Макс(ПоказателиРазделов.П000200025104 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025104);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.4 строки 251 (" + Формат(ПоказателиРазделов.П000200025104,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024106) * СтрокаТарифа.ПФРНакопительная / 100, 2)
									- Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024104 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * СтрокаТарифа.ПФРНакопительная / 100, 2)
									- ПоказателиРазделов.П000200025104;
									Разность = Макс(ПоказателиРазделов.П000200025105 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025105);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.5 строки 251 (" + Формат(ПоказателиРазделов.П000200025105,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр(ПоказателиРазделов.П000200024103 * СтрокаТарифа.ПФРНакопительная / 100, 2)
									- Окр((ПоказателиРазделов.П000200024103 - ПоказателиРазделов.П000200024104 - ПоказателиРазделов.П000200024105 - ПоказателиРазделов.П000200024106) * СтрокаТарифа.ПФРНакопительная / 100, 2)
									- ПоказателиРазделов.П000200025104 - ПоказателиРазделов.П000200025105;
									Разность = Макс(ПоказателиРазделов.П000200025106 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025106);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.6 строки 251 (" + Формат(ПоказателиРазделов.П000200025106,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									//строка 252
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303) * ТарифССуммПревышения / 100, 2);
									Разность = Макс(ПоказателиРазделов.П000200025203 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025203);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.3 строки 252 (" + Формат(ПоказателиРазделов.П000200025203,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303 - (ПоказателиРазделов.П000200023105 + ПоказателиРазделов.П000200023205 + ПоказателиРазделов.П000200023305) - (ПоказателиРазделов.П000200023106 + ПоказателиРазделов.П000200023206 + ПоказателиРазделов.П000200023306)) * ТарифССуммПревышения / 100, 2)
									- Окр((ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303 - (ПоказателиРазделов.П000200023104 + ПоказателиРазделов.П000200023204 + ПоказателиРазделов.П000200023304) - (ПоказателиРазделов.П000200023105 + ПоказателиРазделов.П000200023205 + ПоказателиРазделов.П000200023305) - (ПоказателиРазделов.П000200023106 + ПоказателиРазделов.П000200023206 + ПоказателиРазделов.П000200023306)) * ТарифССуммПревышения / 100, 2);
									Разность = Макс(ПоказателиРазделов.П000200025204 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025204);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.4 строки 252 (" + Формат(ПоказателиРазделов.П000200025204,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303 - (ПоказателиРазделов.П000200023106 + ПоказателиРазделов.П000200023206 + ПоказателиРазделов.П000200023306)) * ТарифССуммПревышения / 100, 2)
									- Окр((ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303 - (ПоказателиРазделов.П000200023104 + ПоказателиРазделов.П000200023204 + ПоказателиРазделов.П000200023304) - (ПоказателиРазделов.П000200023105 + ПоказателиРазделов.П000200023205 + ПоказателиРазделов.П000200023305) - (ПоказателиРазделов.П000200023106 + ПоказателиРазделов.П000200023206 + ПоказателиРазделов.П000200023306)) * ТарифССуммПревышения / 100, 2)
									- ПоказателиРазделов.П000200025204;
									Разность = Макс(ПоказателиРазделов.П000200025205 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025205);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.5 строки 252 (" + Формат(ПоказателиРазделов.П000200025205,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303) * ТарифССуммПревышения / 100, 2)
									- Окр((ПоказателиРазделов.П000200023103 + ПоказателиРазделов.П000200023203 + ПоказателиРазделов.П000200023303 - (ПоказателиРазделов.П000200023104 + ПоказателиРазделов.П000200023204 + ПоказателиРазделов.П000200023304) - (ПоказателиРазделов.П000200023105 + ПоказателиРазделов.П000200023205 + ПоказателиРазделов.П000200023305) - (ПоказателиРазделов.П000200023106 + ПоказателиРазделов.П000200023206 + ПоказателиРазделов.П000200023306)) * ТарифССуммПревышения / 100, 2)
									- ПоказателиРазделов.П000200025204 - ПоказателиРазделов.П000200025205;
									Разность = Макс(ПоказателиРазделов.П000200025206 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200025206);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.6 строки 252 (" + Формат(ПоказателиРазделов.П000200025206,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									//строка 276
									РасчетноеЗначение = Окр(ПоказателиРазделов.П000200027503 * СтрокаТарифа.ФФОМС / 100, 2);
									Разность = Макс(ПоказателиРазделов.П000200027603 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200027603);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.3 строки 276 (" + Формат(ПоказателиРазделов.П000200027603,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200027503 - ПоказателиРазделов.П000200027505 - ПоказателиРазделов.П000200027506) * СтрокаТарифа.ФФОМС / 100, 2)
									- Окр((ПоказателиРазделов.П000200027503 - ПоказателиРазделов.П000200027504 - ПоказателиРазделов.П000200027505 - ПоказателиРазделов.П000200027506) * СтрокаТарифа.ФФОМС / 100, 2);
									Разность = Макс(ПоказателиРазделов.П000200027604 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200027604);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.4 строки 276 (" + Формат(ПоказателиРазделов.П000200027604,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр((ПоказателиРазделов.П000200027503 - ПоказателиРазделов.П000200027506) * СтрокаТарифа.ФФОМС / 100, 2)
									- Окр((ПоказателиРазделов.П000200027503 - ПоказателиРазделов.П000200027504 - ПоказателиРазделов.П000200027505 - ПоказателиРазделов.П000200027506) * СтрокаТарифа.ФФОМС / 100, 2)
									- ПоказателиРазделов.П000200027604;
									Разность = Макс(ПоказателиРазделов.П000200027605 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200027605);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.5 строки 276 (" + Формат(ПоказателиРазделов.П000200027605,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									РасчетноеЗначение = Окр(ПоказателиРазделов.П000200027503 * СтрокаТарифа.ФФОМС / 100, 2)
									- Окр((ПоказателиРазделов.П000200027503 - ПоказателиРазделов.П000200027504 - ПоказателиРазделов.П000200027505 - ПоказателиРазделов.П000200027506) * СтрокаТарифа.ФФОМС / 100, 2)
									- ПоказателиРазделов.П000200027604 - ПоказателиРазделов.П000200027605;
									Разность = Макс(ПоказателиРазделов.П000200027606 - РасчетноеЗначение, РасчетноеЗначение - ПоказателиРазделов.П000200027606);
									Если Разность > ДопустимоеРасхождение Тогда
										Если Не СообщениеОРасхожденииУжеВыводилось Тогда
											СообщениеОРасхожденииУжеВыводилось = Истина;
											ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей строк начисленных взносов и расчетных значений, определяемых исходя из облагаемой базы и тарифа, составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделПроверкиРаздела2РСВ1);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Значение показателя в гр.6 строки 276 (" + Формат(ПоказателиРазделов.П000200027606,"ЧДЦ=2; ЧН=0.00") + ") и расчетное значение, определенное исходя из облагаемой базы и тарифа (" + Формат(РасчетноеЗначение,"ЧДЦ=2; ЧН=0.00") + "), различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРаздела2РСВ1);
									КонецЕсли;
									
									Если РазделПроверкиРаздела2РСВ1.Строки.Количество() = 0 Тогда
										ОбработкаКомментариев.ДобавитьСообщение("Ошибок не обнаружено.", Перечисления.ВидыСообщений.Информация, , РазделПроверкиРаздела2РСВ1);		
									КонецЕсли;
									
								КонецЦикла; 
								
							ИначеЕсли СтрокаОписанияФормы.ФормаОтчета = "ФормаОтчета2013Кв1" Тогда
								
								КоличествоЗастрахованных = 0;
								СтрокаЧисла = "";
								Для Сч = 1 По 6 Цикл
									Цифра = ТитульныйЛист["КолЗастрахованных" + Сч];
									Если ЗначениеЗаполнено(Цифра) Тогда
										СтрокаЧисла = СтрокаЧисла + Цифра
									КонецЕсли;
								КонецЦикла;
								Если ЗначениеЗаполнено(СтрокаЧисла) Тогда
									КоличествоЗастрахованных = Число(СтрокаЧисла)
								КонецЕсли;
								Если КоличествоЗастрахованных = 0 Тогда
									ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Количество застрахованных лиц должно быть больше нуля!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРСВ1);
								КонецЕсли;
								
								СредняяЧисленность = 0;
								СтрокаЧисла = "";
								Для Сч = 1 По 6 Цикл
									Цифра = ТитульныйЛист["СрСписЧисл" + Сч];
									Если ЗначениеЗаполнено(Цифра) Тогда
										СтрокаЧисла = СтрокаЧисла + Цифра
									КонецЕсли;
								КонецЦикла;
								Если ЗначениеЗаполнено(СтрокаЧисла) Тогда
									СредняяЧисленность = Число(СтрокаЧисла)
								КонецЕсли;
								Если СредняяЧисленность = 0 Тогда
									ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Среднесписочная численность должна быть больше нуля!", ЕстьЗамечанияРСВ1,,,,РазделПроверкиРСВ1);
								КонецЕсли;
								
								СоответствиеКодовТарифа = Новый Соответствие;
								СоответствиеКодовТарифа.Вставить("01", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								СоответствиеКодовТарифа.Вставить("03", Перечисления.КатегорииЗастрахованныхЛицПФР.ООИ);
								СоответствиеКодовТарифа.Вставить("04", Перечисления.КатегорииЗастрахованныхЛицПФР.ЕСХН);
								СоответствиеКодовТарифа.Вставить("06", Перечисления.КатегорииЗастрахованныхЛицПФР.ОДИТ);
								СоответствиеКодовТарифа.Вставить("07", Перечисления.КатегорииЗастрахованныхЛицПФР.ПНЭД);
								СоответствиеКодовТарифа.Вставить("08", Перечисления.КатегорииЗастрахованныхЛицПФР.ХО);
								СоответствиеКодовТарифа.Вставить("09", Перечисления.КатегорииЗастрахованныхЛицПФР.СМИ);
								СоответствиеКодовТарифа.Вставить("10", Перечисления.КатегорииЗастрахованныхЛицПФР.ИЦС);
								СоответствиеКодовТарифа.Вставить("11", Перечисления.КатегорииЗастрахованныхЛицПФР.АСБ);
								СоответствиеКодовТарифа.Вставить("12", Перечисления.КатегорииЗастрахованныхЛицПФР.АСБ);
								СоответствиеКодовТарифа.Вставить("13", Перечисления.КатегорииЗастрахованныхЛицПФР.АСБ);
								СоответствиеКодовТарифа.Вставить("14", Перечисления.КатегорииЗастрахованныхЛицПФР.ИНЖУ);
								СоответствиеКодовТарифа.Вставить("15", Перечисления.КатегорииЗастрахованныхЛицПФР.ЧЭС);
								СоответствиеКодовТарифа.Вставить("16", Перечисления.КатегорииЗастрахованныхЛицПФР.АСБ);
								СоответствиеКодовТарифа.Вставить("18", Перечисления.КатегорииЗастрахованныхЛицПФР.СХ);
								СоответствиеКодовТарифа.Вставить("19", Перечисления.КатегорииЗастрахованныхЛицПФР.ХМН);
								СоответствиеКодовТарифа.Вставить("20", Перечисления.КатегорииЗастрахованныхЛицПФР.ХМН);
								СоответствиеКодовТарифа.Вставить("36", Перечисления.КатегорииЗастрахованныхЛицПФР.ТВЭЗ);
								СоответствиеКодовТарифа.Вставить("52", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								СоответствиеКодовТарифа.Вставить("53", Перечисления.КатегорииЗастрахованныхЛицПФР.НР);
								
								СоответствиеТарифов = Новый Соответствие;
								СоответствиеТарифов.Вставить("01", Перечисления.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим);
								СоответствиеТарифов.Вставить("03", Перечисления.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов);
								СоответствиеТарифов.Вставить("04", Перечисления.ТарифыСтраховыхВзносов.ЕСХН);
								СоответствиеТарифов.Вставить("06", Перечисления.ТарифыСтраховыхВзносов.ITОрганизации);
								СоответствиеТарифов.Вставить("07", Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство);
								СоответствиеТарифов.Вставить("08", Перечисления.ТарифыСтраховыхВзносов.ХозОбществаБюджетныхВУЗов);
								СоответствиеТарифов.Вставить("09", Перечисления.ТарифыСтраховыхВзносов.СМИ);
								СоответствиеТарифов.Вставить("10", Перечисления.ТарифыСтраховыхВзносов.УчастникПроектаИнновационныйЦентрСколково);
								СоответствиеТарифов.Вставить("11", Перечисления.ТарифыСтраховыхВзносов.ДляФармацевтовАптек);
								СоответствиеТарифов.Вставить("12", Перечисления.ТарифыСтраховыхВзносов.НекоммерческиеОрганизации);
								СоответствиеТарифов.Вставить("13", Перечисления.ТарифыСтраховыхВзносов.БлаготворительныеОрганизации);
								СоответствиеТарифов.Вставить("14", Перечисления.ТарифыСтраховыхВзносов.ОрганизацииОказывающиеИнжиниринговыеУслуги);
								СоответствиеТарифов.Вставить("16", Перечисления.ТарифыСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент);
								СоответствиеТарифов.Вставить("15", Перечисления.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ);
								СоответствиеТарифов.Вставить("18", Перечисления.ТарифыСтраховыхВзносов.СельХозПроизводители);
								СоответствиеТарифов.Вставить("19", Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы);
								СоответствиеТарифов.Вставить("20", Перечисления.ТарифыСтраховыхВзносов.НародныеХудожественныеПромыслы);
								СоответствиеТарифов.Вставить("36", Перечисления.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны);
								СоответствиеТарифов.Вставить("52", Перечисления.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим);
								СоответствиеТарифов.Вставить("53", Перечисления.ТарифыСтраховыхВзносов.ЕНВД);
								
								ТаблицаТарифов = РасчетСтраховыхВзносов.ТекущиеТарифыСтраховыхВзносовПоВидамТарифа(ОтчетныйПериодРСВ1);
								
								Раздел1 = ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
								
								НачисленоРСВ1НаСтраховую = Раздел1.П000100011403;
								НачисленоРСВ1НаНакопительную = Раздел1.П000100011404;
								УплаченоРСВ1НаСтраховую = Раздел1.П000100014403;
								УплаченоРСВ1НаНакопительную = Раздел1.П000100014404;
								
								ЗадолженностьНаСтраховуюНаНачалоПериода = Раздел1.П000100010003 + (Раздел1.П000100011003 - Раздел1.П000100011403) - (Раздел1.П000100014003 - Раздел1.П000100014403);
								ЗадолженностьНаНакопительнуюНаНачалоПериода = Раздел1.П000100010004 + (Раздел1.П000100011004 - Раздел1.П000100011404) - (Раздел1.П000100014004 - Раздел1.П000100014404);
								ЗадолженностьНаСтраховуюНаКонецПериода = Раздел1.П000100015003;
								ЗадолженностьНаНакопительнуюНаКонецПериода = Раздел1.П000100015004;
								
								УплаченоРСВ1НаСтраховую = УплаченоРСВ1НаСтраховую - ?(ЗадолженностьНаСтраховуюНаКонецПериода < 0, -ЗадолженностьНаСтраховуюНаКонецПериода, 0) + ?(ЗадолженностьНаСтраховуюНаНачалоПериода < 0, -ЗадолженностьНаСтраховуюНаНачалоПериода,0);
								УплаченоРСВ1НаНакопительную = УплаченоРСВ1НаНакопительную - ?(ЗадолженностьНаНакопительнуюНаКонецПериода < 0, -ЗадолженностьНаНакопительнуюНаКонецПериода, 0) + ?(ЗадолженностьНаНакопительнуюНаНачалоПериода < 0, -ЗадолженностьНаНакопительнуюНаНачалоПериода,0);
								
								НачисленоРСВ1НаСтраховуюПоТарифам = Новый Соответствие;
								НачисленоРСВ1НаНакопительнуюПоТарифам = Новый Соответствие;
								ПоказателиНеоблагаемыхДоходов = Новый Соответствие;
								НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам = Новый Соответствие;
								
								ОбъектОбложенияРСВ1 = 0;
								УменьшенныйОбъектОбложенияРСВ1 = 0;
								ОблагаемаяБазаРСВ1 = 0;
								
								ОбъектОбложенияРСВ1Льготный = 0;
								УменьшенныйОбъектОбложенияРСВ1Льготный = 0;
								ОблагаемаяБазаРСВ1Льготная = 0;
								
								Строка25204 = 0;
								Строка25205 = 0;
								Строка25206 = 0;
								
								Разделы = Данные.ДанныеМногостраничныхРазделов.Раздел2;
								Для каждого ЛистДанных Из Разделы Цикл
									
									ПоказателиРазделов = ЛистДанных.Данные;
									
									КодТарифа = ПоказателиРазделов.П000200001001 + ПоказателиРазделов.П000200001002;
									ЗначениеПеречисления = СоответствиеКодовТарифа[КодТарифа];
									Если ЗначениеПеречисления = Неопределено Тогда
										Продолжить;
									КонецЕсли;
									
									НачисленоРСВ1НаСтраховуюПоТарифам.Вставить(ЗначениеПеречисления, ?(НачисленоРСВ1НаСтраховуюПоТарифам[ЗначениеПеречисления] = Неопределено, 0, НачисленоРСВ1НаСтраховуюПоТарифам[ЗначениеПеречисления]) + ПоказателиРазделов.П000210025004 + ПоказателиРазделов.П000210025005 + ПоказателиРазделов.П000210025006);
									НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам.Вставить(ЗначениеПеречисления, ?(НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[ЗначениеПеречисления] = Неопределено, 0, НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[ЗначениеПеречисления]) + ПоказателиРазделов.П000210025003);
									НачисленоРСВ1НаНакопительнуюПоТарифам.Вставить(ЗначениеПеречисления, ?(НачисленоРСВ1НаНакопительнуюПоТарифам[ЗначениеПеречисления] = Неопределено, 0, НачисленоРСВ1НаНакопительнуюПоТарифам[ЗначениеПеречисления]) + ПоказателиРазделов.П000210025104 + ПоказателиРазделов.П000210025105 + ПоказателиРазделов.П000210025106);
									
									ПоказателиНеоблагаемыхДоходов.Вставить(ЗначениеПеречисления, ?(ПоказателиНеоблагаемыхДоходов[ЗначениеПеречисления] = Неопределено, 0, ПоказателиНеоблагаемыхДоходов[ЗначениеПеречисления])
											+ ПоказателиРазделов.П000210021104 + ПоказателиРазделов.П000210021204 + ПоказателиРазделов.П000210021304
											+ ПоказателиРазделов.П000210022104 + ПоказателиРазделов.П000210022204 + ПоказателиРазделов.П000210022304
											+ ПоказателиРазделов.П000210021105 + ПоказателиРазделов.П000210021205 + ПоказателиРазделов.П000210021305
											+ ПоказателиРазделов.П000210022105 + ПоказателиРазделов.П000210022205 + ПоказателиРазделов.П000210022305
											+ ПоказателиРазделов.П000210021106 + ПоказателиРазделов.П000210021206 + ПоказателиРазделов.П000210021306
											+ ПоказателиРазделов.П000210022106 + ПоказателиРазделов.П000210022206 + ПоказателиРазделов.П000210022306
											+ ?(ЗначениеПеречисления = Перечисления.КатегорииЗастрахованныхЛицПФР.НР, 0,  
											ПоказателиРазделов.П000210023104 + ПоказателиРазделов.П000210023204 + ПоказателиРазделов.П000210023304
											+ ПоказателиРазделов.П000210023105 + ПоказателиРазделов.П000210023205 + ПоказателиРазделов.П000210023305
											+ ПоказателиРазделов.П000210023106 + ПоказателиРазделов.П000210023206 + ПоказателиРазделов.П000210023306));
											
									Если ЗначениеПеречисления = Перечисления.КатегорииЗастрахованныхЛицПФР.НР Тогда
										ОбъектОбложенияРСВ1 = ОбъектОбложенияРСВ1 + ПоказателиРазделов.П000210020104 + ПоказателиРазделов.П000210020204 + ПоказателиРазделов.П000210020304
												 + ПоказателиРазделов.П000210020105 + ПоказателиРазделов.П000210020205 + ПоказателиРазделов.П000210020305
												 + ПоказателиРазделов.П000210020106 + ПоказателиРазделов.П000210020206 + ПоказателиРазделов.П000210020306;
										УменьшенныйОбъектОбложенияРСВ1 = УменьшенныйОбъектОбложенияРСВ1 + ПоказателиРазделов.П000210020104 + ПоказателиРазделов.П000210020204 + ПоказателиРазделов.П000210020304 
												- ПоказателиРазделов.П000210021104 - ПоказателиРазделов.П000210021204 - ПоказателиРазделов.П000210021304
												- ПоказателиРазделов.П000210022104 - ПоказателиРазделов.П000210022204 - ПоказателиРазделов.П000210022304
												+ ПоказателиРазделов.П000210020105 + ПоказателиРазделов.П000210020205 + ПоказателиРазделов.П000210020305 
												- ПоказателиРазделов.П000210021105 - ПоказателиРазделов.П000210021205 - ПоказателиРазделов.П000210021305
												- ПоказателиРазделов.П000210022105 - ПоказателиРазделов.П000210022205 - ПоказателиРазделов.П000210022305
												+ ПоказателиРазделов.П000210020106 + ПоказателиРазделов.П000210020206 + ПоказателиРазделов.П000210020306 
												- ПоказателиРазделов.П000210021106 - ПоказателиРазделов.П000210021206 - ПоказателиРазделов.П000210021306
												- ПоказателиРазделов.П000210022106 - ПоказателиРазделов.П000210022206 - ПоказателиРазделов.П000210022306;
										ОблагаемаяБазаРСВ1 = ОблагаемаяБазаРСВ1 + ПоказателиРазделов.П000210024004 + ПоказателиРазделов.П000210024104 
											+ ПоказателиРазделов.П000210024005 + ПоказателиРазделов.П000210024105 + ПоказателиРазделов.П000210024006 + ПоказателиРазделов.П000210024106
											+ ПоказателиРазделов.П000210023104 + ПоказателиРазделов.П000210023204 + ПоказателиРазделов.П000210023304
											+ ПоказателиРазделов.П000210023105 + ПоказателиРазделов.П000210023205 + ПоказателиРазделов.П000210023305
											+ ПоказателиРазделов.П000210023106 + ПоказателиРазделов.П000210023206 + ПоказателиРазделов.П000210023306;
									Иначе
										ОбъектОбложенияРСВ1Льготный = ОбъектОбложенияРСВ1Льготный + ПоказателиРазделов.П000210020104 + ПоказателиРазделов.П000210020204 + ПоказателиРазделов.П000210020304
												 + ПоказателиРазделов.П000210020105 + ПоказателиРазделов.П000210020205 + ПоказателиРазделов.П000210020305
												 + ПоказателиРазделов.П000210020106 + ПоказателиРазделов.П000210020206 + ПоказателиРазделов.П000210020306;
										УменьшенныйОбъектОбложенияРСВ1Льготный = УменьшенныйОбъектОбложенияРСВ1Льготный + ПоказателиРазделов.П000210020104 + ПоказателиРазделов.П000210020204 + ПоказателиРазделов.П000210020304 
												- ПоказателиРазделов.П000210021104 - ПоказателиРазделов.П000210021204 - ПоказателиРазделов.П000210021304
												- ПоказателиРазделов.П000210022104 - ПоказателиРазделов.П000210022204 - ПоказателиРазделов.П000210022304
												- ПоказателиРазделов.П000210023104 - ПоказателиРазделов.П000210023204 - ПоказателиРазделов.П000210023304
												+ ПоказателиРазделов.П000210020105 + ПоказателиРазделов.П000210020205 + ПоказателиРазделов.П000210020305 
												- ПоказателиРазделов.П000210021105 - ПоказателиРазделов.П000210021205 - ПоказателиРазделов.П000210021305
												- ПоказателиРазделов.П000210022105 - ПоказателиРазделов.П000210022205 - ПоказателиРазделов.П000210022305
												- ПоказателиРазделов.П000210023105 - ПоказателиРазделов.П000210023205 - ПоказателиРазделов.П000210023305
												+ ПоказателиРазделов.П000210020106 + ПоказателиРазделов.П000210020206 + ПоказателиРазделов.П000210020306 
												- ПоказателиРазделов.П000210021106 - ПоказателиРазделов.П000210021206 - ПоказателиРазделов.П000210021306
												- ПоказателиРазделов.П000210022106 - ПоказателиРазделов.П000210022206 - ПоказателиРазделов.П000210022306
												- ПоказателиРазделов.П000210023106 - ПоказателиРазделов.П000210023206 - ПоказателиРазделов.П000210023306;
										ОблагаемаяБазаРСВ1Льготная = ОблагаемаяБазаРСВ1Льготная + ПоказателиРазделов.П000210024004 + ПоказателиРазделов.П000210024104 + ПоказателиРазделов.П000210024005 + ПоказателиРазделов.П000210024105 + ПоказателиРазделов.П000210024006 + ПоказателиРазделов.П000210024106;
									КонецЕсли;
									
									Строка25204 = Строка25204 + ПоказателиРазделов.П000210025204;
									Строка25205 = Строка25205 + ПоказателиРазделов.П000210025205;
									Строка25206 = Строка25206 + ПоказателиРазделов.П000210025206;

								КонецЦикла; 
								
								Раздел22 = ПоказателиОтчета.ПолеТабличногоДокументаРаздел22;
								Строка283 = Раздел22.П000220028304 + Раздел22.П000220028305 + Раздел22.П000220028306;
								Строка293 = Раздел22.П000230029304 + Раздел22.П000230029305 + Раздел22.П000230029306;
									
								НачисленоРСВ1НаСтраховую = НачисленоРСВ1НаСтраховую - Строка25204 - Строка25205 - Строка25206;
								
							Иначе
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Указанный в Описи АДВ-6-2 Расчет РСВ-1 оформлен по неопознанной форме! Необходимо заполнить новый экземпляр Расчета по действующей форме и указать его в Описи АДВ-6-2.", ЕстьОшибкиРСВ1,,,,РазделПроверкиРСВ1);
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// АДВ-6-2
	ЕстьОшибкиАДВ62 = Ложь;
	ДокументОбъект.ПроверитьПравильностьЗаполненияДокумента(ЕстьОшибкиАДВ62);
	Если Не ЕстьОшибкиАДВ62 Тогда
		ЕстьОшибки = Ложь;
		ДеревоАДВ62 = ПроцедурыПерсонифицированногоУчета.ПреобразоватьВДеревоXML(РегламентированнаяОтчетность.ПолучитьТекстФайла(ДокументОбъект, ЕстьОшибки));
		Если ДеревоАДВ62 <> Неопределено Тогда
			ДеревоАДВ62 = ДеревоАДВ62.Строки.Найти("ФайлПФР","Имя");
		КонецЕсли;
		Если ДеревоАДВ62 <> Неопределено Тогда
			ДеревоАДВ62 = ДеревоАДВ62.Строки.Найти("ПачкаВходящихДокументов","Имя");
		КонецЕсли;
		Если ДеревоАДВ62 <> Неопределено Тогда
			СтрокаОписи = ДеревоАДВ62.Строки.Найти("ВХОДЯЩАЯ_ОПИСЬ_ПО_СТРАХОВЫМ_ВЗНОСАМ", "Имя");
			ДеревоАДВ62 = ДеревоАДВ62.Строки.Найти("ОПИСЬ_СВЕДЕНИЙ_ПЕРЕДАВАЕМЫХ_СТРАХОВАТЕЛЕМ", "Имя");
		КонецЕсли;
		Если ДеревоАДВ62 <> Неопределено Тогда // ДеревоАДВ62 теперь содержит только тег ОПИСЬ_СВЕДЕНИЙ_ПЕРЕДАВАЕМЫХ_СТРАХОВАТЕЛЕМ
			ИнформацияОПачкеАДВ62 = ПроцедурыПерсонифицированногоУчета.ДанныеОписиАДВ_6_3(СтрокаОписи);
			СтрокиИсходныхПачек = ДеревоАДВ62.Строки.НайтиСтроки(Новый Структура("Имя","СведенияОбИсходныхСведениях"));
			ВсегоКатегорийАДВ62 = 0;
			НачисленоАДВ62НаСтраховую = 0;
			НачисленоАДВ62НаНакопительную = 0;
			НачисленоЧленамЭкипажейСудовНаСтраховую = 0;
			НачисленоЧленамЭкипажейСудовНаНакопительную = 0;
			УплаченоАДВ62НаСтраховую = 0;
			УплаченоАДВ62НаНакопительную = 0;
			МассивКатегорий = Новый Массив;
			Для каждого СтрокаДерева Из СтрокиИсходныхПачек Цикл
				Если ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаДерева, "ТипСтрокиОсведениях") = "ПО КАТЕГОРИИ" Тогда
					ВсегоКатегорийАДВ62 = ВсегоКатегорийАДВ62 + 1;
					КодКатегории = ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаДерева, "КодКатегории");
					МассивКатегорий.Добавить(КодКатегории);
					Если КодКатегории = "ЧЭС" Или КодКатегории = "ВЖЭС" Или КодКатегории = "ВПЭС" Тогда
						СтрокаНаСтраховую = СтрокаДерева.Строки.Найти("СуммаВзносовНаСтраховую", "Имя");
						СтрокаНаНакопительную = СтрокаДерева.Строки.Найти("СуммаВзносовНаНакопительную", "Имя");
						Если СтрокаНаСтраховую <> Неопределено Тогда
							НачисленоЧленамЭкипажейСудовНаСтраховую = НачисленоЧленамЭкипажейСудовНаСтраховую + Число(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаНаСтраховую, "Начислено"));
						КонецЕсли;
						Если СтрокаНаНакопительную <> Неопределено Тогда
							НачисленоЧленамЭкипажейСудовНаНакопительную = НачисленоЧленамЭкипажейСудовНаНакопительную + Число(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаНаНакопительную, "Начислено"));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаДерева, "ТипСтрокиОсведениях") = "ПО СТРАХОВАТЕЛЮ" Тогда
					СтрокаНаСтраховую = СтрокаДерева.Строки.Найти("СуммаВзносовНаСтраховую", "Имя");
					СтрокаНаНакопительную = СтрокаДерева.Строки.Найти("СуммаВзносовНаНакопительную", "Имя");
					Если СтрокаНаСтраховую <> Неопределено Тогда
						НачисленоАДВ62НаСтраховую = Число(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаНаСтраховую, "Начислено"));
						УплаченоАДВ62НаСтраховую = Число(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаНаСтраховую, "Уплачено"));
					КонецЕсли;
					Если СтрокаНаНакопительную <> Неопределено Тогда
						НачисленоАДВ62НаНакопительную = Число(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаНаНакопительную, "Начислено"));
						УплаченоАДВ62НаНакопительную = Число(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаНаНакопительную, "Уплачено"));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			СтрокиКорректирующихПачек = ДеревоАДВ62.Строки.НайтиСтроки(Новый Структура("Имя","СведенияОкорректирующихСведениях"));
			Для каждого СтрокаДерева Из СтрокиКорректирующихПачек Цикл
				Если ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаДерева, "ТипСтрокиОсведениях") = "ПО КАТЕГОРИИ" Тогда
					КодКатегории = ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(СтрокаДерева, "КодКатегории");
					Если МассивКатегорий.Найти(КодКатегории) = Неопределено Тогда
						ВсегоКатегорийАДВ62 = ВсегоКатегорийАДВ62 + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе 
			ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Не удалось разобрать сохраненный файл Описи АДВ-6-2!", ЕстьОшибкиАДВ62);
		КонецЕсли;
	КонецЕсли;
	УдалитьПустойЗаголовок(ДеревоСообщений);
	
	// СЗВ-6-1,2
	ЕстьОшибкиСЗВ6 = Ложь;
	ЕстьОшибкиРасчетаСЗВ6 = Ложь;
	НачисленоСЗВ6НаСтраховую = Новый Соответствие;
	НачисленоСЗВ6НаНакопительную = Новый Соответствие;
	ОбъектОбложенияПоФормамСЗВ64 = 0;
	ОбъектОбложенияПоФормамСЗВ64Льготный = 0;
	ОблагаемаяБазаПоФормамСЗВ64 = 0;
	ОблагаемаяБазаПоФормамСЗВ64Льготная = 0;
	ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах = 0;
	ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах = 0;
	МассивКатегорий = Новый Массив;
	ИмяТЧ = ?(ОтчетныйПериодАДВ62 < ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией(),"ПачкиДокументов","ПачкиДокументов2013");
	Для каждого ПачкаСЗВ6 Из ДокументОбъект[ИмяТЧ] Цикл
		ДокументСЗВ6 = СоответствиеСсылокИОбъектов[ПачкаСЗВ6.ДокументПачка];
		ДокументСЗВ6.ПроверитьПравильностьЗаполненияДокумента(ЕстьОшибкиСЗВ6);
		Если ДокументСЗВ6.ТипСведенийСЗВ <> Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
			Продолжить;
		КонецЕсли;
		РодительскаяКатегорияЗастрахованныхЛиц = СоответствиеКатегорий[ДокументСЗВ6.КатегорияЗастрахованныхЛиц];
		Если МассивКатегорий.Найти(РодительскаяКатегорияЗастрахованныхЛиц) = Неопределено Тогда
			МассивКатегорий.Добавить(РодительскаяКатегорияЗастрахованныхЛиц);
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОшибкиСЗВ6 Тогда
		Для каждого Значение Из МассивКатегорий Цикл
		    НачисленоСЗВ6НаСтраховую.Вставить(Значение, 0);
		    НачисленоСЗВ6НаНакопительную.Вставить(Значение, 0);
		КонецЦикла;
		Для каждого ПачкаСЗВ6 Из ДокументОбъект[ИмяТЧ] Цикл
			ДокументСЗВ6 = СоответствиеСсылокИОбъектов[ПачкаСЗВ6.ДокументПачка];
			Если ДокументСЗВ6.ТипСведенийСЗВ <> Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
				Продолжить;
			КонецЕсли;
			РодительскаяКатегорияЗастрахованныхЛиц = СоответствиеКатегорий[ДокументСЗВ6.КатегорияЗастрахованныхЛиц];
			НачисленоСЗВ6НаСтраховую.Вставить(РодительскаяКатегорияЗастрахованныхЛиц, НачисленоСЗВ6НаСтраховую[РодительскаяКатегорияЗастрахованныхЛиц] + ДокументСЗВ6.РаботникиОрганизации.Итог("НачисленоСтраховая"));
		    НачисленоСЗВ6НаНакопительную.Вставить(РодительскаяКатегорияЗастрахованныхЛиц, НачисленоСЗВ6НаНакопительную[РодительскаяКатегорияЗастрахованныхЛиц] + ДокументСЗВ6.РаботникиОрганизации.Итог("НачисленоНакопительная"));
			Если ОтчетныйПериодАДВ62 >= ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
				ДанныеОЗаработке = ДокументСЗВ6.СведенияОЗаработке;
				ВыплатВсего = ДанныеОЗаработке.Итог("Заработок");
				ВыплатОблагаемых = ДанныеОЗаработке.Итог("ОблагаетсяВзносамиДоПредельнойВеличины");
				ВыплатОблагаемыхПревышающих = ДанныеОЗаработке.Итог("ОблагаетсяВзносамиСвышеПредельнойВеличины");
				ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах = ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах + ДанныеОЗаработке.Итог("ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах");
				ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах = ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах + ДанныеОЗаработке.Итог("ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах");
				Если РодительскаяКатегорияЗастрахованныхЛиц = Перечисления.КатегорииЗастрахованныхЛицПФР.НР Тогда
					ОбъектОбложенияПоФормамСЗВ64 = ОбъектОбложенияПоФормамСЗВ64 + ВыплатВсего;
					ОблагаемаяБазаПоФормамСЗВ64 = ОблагаемаяБазаПоФормамСЗВ64 + ВыплатОблагаемых + ВыплатОблагаемыхПревышающих;
				Иначе
					ОбъектОбложенияПоФормамСЗВ64Льготный = ОбъектОбложенияПоФормамСЗВ64Льготный + ВыплатВсего;
					ОблагаемаяБазаПоФормамСЗВ64Льготная = ОблагаемаяБазаПоФормамСЗВ64Льготная + ВыплатОблагаемых;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ПодобранПолныйКомплектПринятыхПФРДокументов() Тогда
		ПропущенныеПериоды = "";
		Для Каждого РасчетныйПериод Из МассивПрошлыхПериодов Цикл
			Если ПачкиДокументов.Найти(РасчетныйПериод, "ОтчетныйПериод") = Неопределено Тогда
				ПропущенныеПериоды = ПропущенныеПериоды + ПроцедурыПерсонифицированногоУчета.ОписаниеОтчетногоПериодаДляПоказа(РасчетныйПериод) + ", "
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Подобраны не все переданные ранее в ПФР сведения! Отсутствуют сведения за периоды: " + Лев(ПропущенныеПериоды, СтрДлина(ПропущенныеПериоды)-2), ЕстьОшибкиРасчетаСЗВ6);
	КонецЕсли;
	
	ЕстьОшибкиСЗВ63 = Ложь;
	ЕстьОшибкиРСВ1_СЗВ63 = Ложь;
	ЕстьОшибкиАДВ62_СЗВ63 = Ложь;
	ЕстьОшибкиАДВ62_РСВ1 = Ложь;
	
	Если ОтчетныйПериодАДВ62 >= ПроведениеРасчетов.ДатаРасширенияПеречняЛьготныхТарифовСтраховыхВзносов() Тогда
		
		// проверка полноты комплекта
		РазделПроверкиКомплекта = Неопределено;
		
		Если Не ЗначениеЗаполнено(РСВ1) Тогда
			РазделПроверкиКомплекта = ОбработкаКомментариев.ДобавитьСообщение("Проверка полноты комплекта представляемых документов", Перечисления.ВидыСообщений.Информация);
			ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Не указан подаваемый вместе с Описью АДВ-6-2 Расчет РСВ-1!", ЕстьОшибкиРСВ1,,,,РазделПроверкиКомплекта);
		КонецЕсли;
		
		Если ОтчетныйПериодАДВ62 >= ПроведениеРасчетов.ДатаВводаДополнительногоТарифаЗаРаботыСДосрочнойПенсией() Тогда
			
			// Сверка отдельных реквизитов Описи сведений персонифицированного учета (формы АДВ-6-2) и Расчета по начисленным и уплаченным страховым взносам (форма РСВ-1)
			
			Если Не ЕстьОшибкиСЗВ6 И Не ЕстьОшибкиАДВ62 И Не ЕстьОшибкиРСВ1 Тогда
				
				РазделСверкиРСВ1иАДВ62 = Неопределено;
				
				Если РСВ1Объект.Организация <> ДокументОбъект.Организация Тогда
					РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
					ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Расчет РСВ-1 оформлен на " + ОбщегоНазначенияЗК.ПреобразоватьСтрокуИнтерфейса("другую организацию!"), ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
				Иначе
					
					ИННизАДВ62 = СокрЛП(ИнформацияОПачкеАДВ62.ИНН);
					Если СокрЛП(ИННизРСВ1) <> ИННизАДВ62 Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и Расчете РСВ-1 не совпадает ИНН!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					Если СокрЛП(КППизРСВ1) <> СокрЛП(ИнформацияОПачкеАДВ62.КПП) Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и Расчете РСВ-1 не совпадает КПП!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					Если СокрЛП(РегНомерПФРизРСВ1) <> СокрЛП(ИнформацияОПачкеАДВ62.РегНомерПФР) Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и Расчете РСВ-1 не совпадает регистрационный номер страхователя в ПФР!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ОтчетныйПериодРСВ1 <> ОтчетныйПериодАДВ62 Тогда
					
					Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
						РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
					КонецЕсли;
					ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Период Расчета РСВ-1 не соответствует отчетному периоду Описи АДВ-6-2", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					
				Иначе	
					
					// Правило 1. По всем формам СЗВ-6-4 (при их наличии) по категориям застрахованных лиц «НР», «ВЖНР» и «ВПНР» значение строки «Всего за последние три месяца отчетного периода, в т.ч.» графы ««Сумма выплат и иных вознаграждений» раздела  «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица»,  увеличенное  на 1 рубль, должно быть больше или равно сумме показателей граф 4, 5, 6 строк 201, 202, 203 формы РСВ-1, уменьшенной на показатели граф 4, 5, 6 строк «211», «212», «213», «221», «222» и «223» формы РСВ-1.
					Если ОбъектОбложенияПоФормамСЗВ64 + 1 < УменьшенныйОбъектОбложенияРСВ1 Тогда
						РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма заработка, указанная в формах СЗВ-6-4 с категориями «НР», «ВЖНР» и «ВПНР», меньше облагаемых взносами в ПФР сумм, указанных в разделе 2 Расчета РСВ-1 с кодами тарифа 01, 52 и 53!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
					КонецЕсли;
					
					// Значение строки «Всего за последние три месяца отчетного периода, в т.ч.» графы «В том числе на которые начислены страховые взносы на обязательное пенсионное страхование» должно равняться сумме значений граф 4, 5, 6 строк «240»,«241», «231», «232», «233» формы РСВ-1,  с погрешностью, равной 1 рублю
					ДопустимоеРасхождение = 1;
					Разность = Макс(ОблагаемаяБазаПоФормамСЗВ64 - ОблагаемаяБазаРСВ1, ОблагаемаяБазаРСВ1 - ОблагаемаяБазаПоФормамСЗВ64);
					Если Разность > ДопустимоеРасхождение Тогда
						Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
							РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы, указанная в формах СЗВ-6-4 с категориями «НР», «ВЖНР» и «ВПНР» (" + Формат(ОблагаемаяБазаПоФормамСЗВ64,"ЧДЦ=2") + "), и сумма показателей колонок ""1, 2 и 3 месяц"" по строкам 240, 241, 231, 232 и 233 раздела 2 Расчета РСВ-1 с кодами тарифа 01, 52 и 53 (" + Формат(ОблагаемаяБазаРСВ1,"ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
					КонецЕсли;
					
					// Правило 1. По всем формам СЗВ-6-4 (при их наличии) по всем категориям ЗЛ значение строки «Всего за последние три месяца отчетного периода, в т.ч.» графы ««Сумма выплат и иных вознаграждений» раздела  «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица»,  увеличенное  на 1 рубль, должно быть больше или равно сумме показателей граф 4, 5, 6 строк 201, 202, 203 формы РСВ-1, уменьшенной на показатели граф 4, 5, 6 строк «211», «212», «213», «221», «222» и «223» формы РСВ-1.
					Если ОбъектОбложенияПоФормамСЗВ64Льготный + 1 < УменьшенныйОбъектОбложенияРСВ1Льготный Тогда
						Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
							РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма заработка, указанная в формах СЗВ-6-4 по всем категориям, кроме «НР», «ВЖНР» и «ВПНР», меньше облагаемых взносами в ПФР сумм, указанных в разделе 2 Расчета РСВ-1 по всем кодам тарифа, кроме 01, 52 и 53!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
					КонецЕсли;
					
					// Значение строки «Всего за последние три месяца отчетного периода, в т.ч.» графы «в том числе на которые начислены страховые взносы на обязательное пенсионное страхование» должно равняться сумме значений граф 4, 5, 6 строк 240, 241 формы РСВ-1 кроме разделов « с кодами тарифов 01, 52 и 53 с погрешностью, равной  1 рублю.
					ДопустимоеРасхождение = 1;
					Разность = Макс(ОблагаемаяБазаПоФормамСЗВ64Льготная - ОблагаемаяБазаРСВ1Льготная, ОблагаемаяБазаРСВ1Льготная - ОблагаемаяБазаПоФормамСЗВ64Льготная);
					Если Разность > ДопустимоеРасхождение Тогда
						Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
							РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы, указанная в формах СЗВ-6-4 по всем категориям, кроме «НР», «ВЖНР» и «ВПНР» (" + Формат(ОблагаемаяБазаПоФормамСЗВ64Льготная,"ЧДЦ=2") + "), и сумма показателей колонок ""1, 2 и 3 месяц"" по строкам 240 и 241 раздела 2 Расчета РСВ-1 по всем кодам тарифа, кроме 01, 52 и 53, (" + Формат(ОблагаемаяБазаРСВ1Льготная,"ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
					КонецЕсли;
					
					// Правило 2. По всем формам СЗВ-6-4 по всем категориям ЗЛ сумма значений строк «Всего за последние три месяца отчетного периода, в т.ч.» графы ««Сумма выплат и иных вознаграждений» раздела  «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» должна быть равна сумме значений строк «Всего за последние три месяца отчетного периода, в т.ч.» графы в графе «в том числе на которые начислены страховые взносы на обязательное пенсионное страхование» при условии при условии, что показатели граф 4, 5, 6  строки «211», «212», «213», «221», «222», «223»,  формы РСВ-1 за отчетный период равны нулю (при наличии в форме РСВ-1 нескольких Разделов 2 оцениваются графы 4, 5, 6 строки «211», «212», «213», «221», «222» и «223» каждого из Разделов 2 формы РСВ-1).
					Для каждого ПачкаСЗВ6 Из ДокументОбъект[ИмяТЧ] Цикл
						
						ДокументСЗВ6 = СоответствиеСсылокИОбъектов[ПачкаСЗВ6.ДокументПачка];
						Если ДокументСЗВ6.ТипСведенийСЗВ <> Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
							Продолжить;
						КонецЕсли;
						
						РодительскаяКатегорияЗастрахованныхЛиц = СоответствиеКатегорий[ДокументСЗВ6.КатегорияЗастрахованныхЛиц];
						Если ПоказателиНеоблагаемыхДоходов[РодительскаяКатегорияЗастрахованныхЛиц] = 0 Тогда
							
							ТаблицаДоходов = ДокументСЗВ6.СведенияОЗаработке.Выгрузить();
							ТаблицаДоходов.Свернуть("ФизЛицо","Заработок,ОблагаетсяВзносамиДоПредельнойВеличины,ОблагаетсяВзносамиСвышеПредельнойВеличины");
							
							Для каждого СтрокаФЛ Из ТаблицаДоходов Цикл
								
								Если СтрокаФЛ.Заработок <> СтрокаФЛ.ОблагаетсяВзносамиДоПредельнойВеличины + ?(РодительскаяКатегорияЗастрахованныхЛиц = Перечисления.КатегорииЗастрахованныхЛицПФР.НР, СтрокаФЛ.ОблагаетсяВзносамиСвышеПредельнойВеличины, 0) Тогда
									
									Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
										РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
									КонецЕсли;
									
									НачалоСообщения = "Для застрахованного " + СокрЛП(ОбщегоНазначенияЗК.ПолучитьЗначениеРеквизита(СтрокаФЛ.ФизЛицо,"Наименование")) + " из пачки СЗВ-6-4 № " + ДокументСЗВ6.НомерПачки + ": ";
									ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщения + "общая сумма заработка и общая сумма облагаемой базы должны быть равны", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
								КонецЕсли;
								
							КонецЦикла;
							
						КонецЕсли;	
						
					КонецЦикла;
						
					// Правило 3. Сумма показателей строк «201», «202», «203» формы РСВ-1 должна быть равна сумме значений итоговой строки в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-4 по всем категориям застрахованных лиц
					Если ОбъектОбложенияПоФормамСЗВ64 + ОбъектОбложенияПоФормамСЗВ64Льготный <> ОбъектОбложенияРСВ1 + ОбъектОбложенияРСВ1Льготный Тогда 
						Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
							РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Сумма показателей строк «201», «202», «203» формы РСВ-1 должна быть равна сумме значений итоговых строк в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-4.
						|Невыполнение условия допускается при наличии выплат в пользу наемных работников, за которых не представляются формы СЗВ-6-4: выплаты в пользу военнослужащих, предусмотренные п.п. 14) части 2 статьи 9 Федерального закона от 24 июля 2009 года № 212-ФЗ; выплаты в пользу прокуроров, следователей, федеральных или мировых судей, предусмотренные п.1) части 3 статьи 9 указанного Федерального закона, в том числе с сумм, превышающих предельную базу для начисления страховых взносов. В остальных случаях невыполнение условия является ошибкой и подлежит исправлению.", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);

					КонецЕсли;
					
					// По всем формам СЗВ-6-4 значение итоговой строки показателя «Сумма выплат и иных вознаграждений, начисленных застрахованному лицу, занятому на видах работ, указанных в подпункте 1 пункта 1 статьи 27 Федерального закона «О трудовых пенсиях в Российской Федерации»»,  должно быть равно сумме показателей граф 4, 5, 6 строки 283 РСВ-1.
					Если ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах <> Строка283 Тогда
						Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
							РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы взносов по дополнительному тарифу за занятых на вредных и подземных работах (подпункт 1 пункта 1 статьи 27 Федерального закона «О трудовых пенсиях в Российской Федерации»), указанная в формах СЗВ-6-4 (" + Формат(ОблагаетсяВзносамиЗаЗанятыхНаПодземныхИВредныхРаботах,"ЧДЦ=2") + "), и сумма показателей колонок ""1, 2 и 3 месяц"" по строке 283 раздела 2.2 Расчета РСВ-1 (" + Формат(Строка283,"ЧДЦ=2") + ") не совпадают!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
					КонецЕсли;
					
					// По всем формам СЗВ-6-4 значение итоговой строки показателя «Сумма выплат и иных вознаграждений, начисленных застрахованному лицу, занятому на видах работ, указанных в подпункте 2-18 пункта 1 статьи 27 Федерального закона «О трудовых пенсиях в Российской Федерации»»,  должно быть равно сумме показателей граф 4, 5, 6 строки 293 РСВ-1.
					Если ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах <> Строка293 Тогда
						Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
							РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-4 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы взносов по дополнительному тарифу за занятых на тяжелых работах (подпункты 2-18 пункта 1 статьи 27 Федерального закона «О трудовых пенсиях в Российской Федерации»), указанная в формах СЗВ-6-4 (" + Формат(ОблагаетсяВзносамиЗаЗанятыхНаТяжелыхИПрочихРаботах,"ЧДЦ=2") + "), и сумма показателей колонок ""1, 2 и 3 месяц"" по строке 293 раздела 2.3 Расчета РСВ-1 (" + Формат(Строка293,"ЧДЦ=2") + ") не совпадают!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
					КонецЕсли;
					
					ДопустимоеРасхождение = 0.015 * КоличествоЗастрахованных;
					СообщениеОРасхожденииУжеВыводилось = Ложь;
					
					//Значение показателя  «Начислено» в графе «Сумма страховых взносов на страховую часть  трудовой пен-сии», строки «Итого по страхователю»  раздела «Сведения об исходных сведениях» Описи сведений АДВ-6-2, уменьшенное на значения соответствующих показателей строки с кодом категории застрахованного лица «ЧЭС», «ВЖЭС» и «ВПЭС», должно быть  равно (в пределах значения равного 1 копейка, умноженная на количество застрахованных лиц, умноженное на 3) значению показателя  строки 114   «Итого подлежит уплате за последние 3 месяца (сумма строк 111+112+113)» » по графе 3  Раздела 1 Расчета по начисленным и уплаченным страховым взносам РСВ-1 уменьшенного на сумму значений граф 4, 5 и 6 строки 252 раздела 2 Расчета по начисленным и уплаченным страховым взносам (РСВ-1)
					Разность = Макс(НачисленоРСВ1НаСтраховую - (НачисленоАДВ62НаСтраховую - НачисленоЧленамЭкипажейСудовНаСтраховую), НачисленоАДВ62НаСтраховую - НачисленоЧленамЭкипажейСудовНаСтраховую - НачисленоРСВ1НаСтраховую);
					Если Разность > ДопустимоеРасхождение Тогда
						Если Не СообщениеОРасхожденииУжеВыводилось Тогда
							Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
								РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							СообщениеОРасхожденииУжеВыводилось = Истина;
							ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей начисленных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на страховую часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаСтраховую, "ЧДЦ=2") + ") и Описи АДВ-6-2 (" + Формат(НачисленоАДВ62НаСтраховую - НачисленоЧленамЭкипажейСудовНаСтраховую, "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					Разность = Макс(НачисленоРСВ1НаНакопительную - (НачисленоАДВ62НаНакопительную - НачисленоЧленамЭкипажейСудовНаНакопительную), НачисленоАДВ62НаНакопительную - НачисленоЧленамЭкипажейСудовНаНакопительную - НачисленоРСВ1НаНакопительную);
					Если Разность > ДопустимоеРасхождение Тогда
						Если Не СообщениеОРасхожденииУжеВыводилось Тогда
							Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
								РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							СообщениеОРасхожденииУжеВыводилось = Истина;
							ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей начисленных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на накопительную часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаНакопительную, "ЧДЦ=2") + ") и Описи АДВ-6-2 (" + Формат(НачисленоАДВ62НаНакопительную - НачисленоЧленамЭкипажейСудовНаНакопительную, "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					
					Если НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[Перечисления.КатегорииЗастрахованныхЛицПФР.НР] <> Неопределено Тогда // в расчете РСВ-1 присутствуют разделы с кодами тарифов «01», «52», «53» 
						Если УплаченоРСВ1НаСтраховую + 1 < УплаченоАДВ62НаСтраховую Тогда
							Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
								РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на страховую часть пенсии в Описи АДВ-6-2 превысила сумму уплаченных взносов на страховую часть в Расчете РСВ-1!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
					КонецЕсли;
					ДопустимоеРасхождение = 1;
					СообщениеОРасхожденииУжеВыводилось = Ложь;
					Если НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[Перечисления.КатегорииЗастрахованныхЛицПФР.НР] = Неопределено Тогда // в расчете РСВ-1 отсутствуют разделы с кодами тарифов «01», «52», «53» 
						Разность = Макс(УплаченоРСВ1НаСтраховую - УплаченоАДВ62НаСтраховую, УплаченоАДВ62НаСтраховую - УплаченоРСВ1НаСтраховую);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей уплаченных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на страховую часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
					КонецЕсли;
					Разность = Макс(УплаченоРСВ1НаНакопительную - УплаченоАДВ62НаНакопительную, УплаченоАДВ62НаНакопительную - УплаченоРСВ1НаНакопительную);
					Если Разность > ДопустимоеРасхождение Тогда
						Если Не СообщениеОРасхожденииУжеВыводилось Тогда
							Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
								РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							СообщениеОРасхожденииУжеВыводилось = Истина;
							ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей уплаченных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на накопительную часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					
					// При наличии в РСВ-1 указанных кодов тарифа обязательно должны быть формы СЗВ с соответствующими кодами категорий застрахованных лиц.
					СтрокаКатегорий = "";
					Для каждого Элемент Из НачисленоРСВ1НаСтраховуюПоТарифам Цикл
						Если ЗначениеЗаполнено(Элемент.Значение) И НачисленоСЗВ6НаСтраховую[Элемент.Ключ] = Неопределено Тогда
							СтрокаКатегорий = СтрокаКатегорий + ?(ПустаяСтрока(СтрокаКатегорий),"",",") + ДочерниеКатегории(Элемент.Ключ, СоответствиеКатегорий)
						КонецЕсли;
					КонецЦикла;
					Если ЗначениеЗаполнено(СтрокаКатегорий) Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Отсутствуют документы СЗВ-6-4 по категориям " + СтрокаКатегорий + ", соответствующим указанным в Расчете РСВ-1 кодам тарифа!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					
					// Сумма страховой части начисленных взносов по указанным категориям застрахованных лиц (по формам СЗВ-6-1, СЗВ-6-2) должна равняться (в пределах значения равного 0,5 копейки, умноженной на количество застрахованных лиц и округленное до целых копеек). сумме начисленных взносов по строкам 250 (графы 4,5,6) для указанных  кодов  тарифа форма РСВ-1
					// Сумма накопительной части начисленных взносов по указанным категориям застрахованных лиц (по формам СЗВ-6-1, СЗВ-6-2) должна равняться (в пределах значения равного 0,5 копейки, умноженной на количество застрахованных лиц и округленное до целых копеек). сумме начисленных взносов по строке 251 (графы 4,5,6) для указанных  кодов  тарифа форма РСВ-1
					ДопустимоеРасхождение = Окр(КоличествоЗастрахованных / 2) / 100;
					СообщениеОРасхожденииУжеВыводилось = Ложь;
					СтрокаКатегорий = "";
					Для каждого Значение Из МассивКатегорий Цикл
						Если НачисленоРСВ1НаСтраховуюПоТарифам[Значение] = Неопределено Тогда
							Если Значение <> Перечисления.КатегорииЗастрахованныхЛицПФР.ЧЭС И ЗначениеЗаполнено(НачисленоСЗВ6НаСтраховую[Значение]) Тогда
								СтрокаКатегорий = СтрокаКатегорий + ?(ПустаяСтрока(СтрокаКатегорий),"",",") + ДочерниеКатегории(Значение, СоответствиеКатегорий);
							КонецЕсли;
							Продолжить;
						КонецЕсли;
						Если Значение = Перечисления.КатегорииЗастрахованныхЛицПФР.ЧЭС Тогда
							Продолжить;
						КонецЕсли;
						Разность = Макс(НачисленоРСВ1НаСтраховуюПоТарифам[Значение] - НачисленоСЗВ6НаСтраховую[Значение], НачисленоСЗВ6НаСтраховую[Значение] - НачисленоРСВ1НаСтраховуюПоТарифам[Значение]);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей Расчета РСВ-1 и документов СЗВ-6-4 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на страховую часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаСтраховуюПоТарифам[Значение], "ЧДЦ=2") + ") и документах СЗВ-6-4 по категориям " + ДочерниеКатегории(Значение, СоответствиеКатегорий) + " (" + Формат(НачисленоСЗВ6НаСтраховую[Значение], "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						Разность = Макс(НачисленоРСВ1НаНакопительнуюПоТарифам[Значение] - НачисленоСЗВ6НаНакопительную[Значение], НачисленоСЗВ6НаНакопительную[Значение] - НачисленоРСВ1НаНакопительнуюПоТарифам[Значение]);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей Расчета РСВ-1 и документов СЗВ-6-4 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на накопительную часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаНакопительнуюПоТарифам[Значение], "ЧДЦ=2") + ") и документах СЗВ-6-4 по категориям " + ДочерниеКатегории(Значение, СоответствиеКатегорий) + " (" + Формат(НачисленоСЗВ6НаНакопительную[Значение], "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
					КонецЦикла;
					Если ЗначениеЗаполнено(СтрокаКатегорий) Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Расчете РСВ-1 отсутствует Раздел 2 с кодом тарифа, соответствующим категориям " + СтрокаКатегорий + "!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
						
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе // 2011-2012 годы
			
			// СЗВ-6-3
			СоответствиеСсылокИОбъектовСЗВ63 = Новый Соответствие;
			СоответствиеСсылокИФайловСЗВ63 = Новый Соответствие;
			ВыборкаСЗВ63 = СЗВ63ЗаГод(ДокументОбъект);
			Если ВыборкаСЗВ63 <> Неопределено Тогда
				Пока ВыборкаСЗВ63.Следующий() Цикл
					
					ОбъектСЗВ63 = ВыборкаСЗВ63.Ссылка.ПолучитьОбъект();
					СоответствиеСсылокИОбъектовСЗВ63.Вставить(ВыборкаСЗВ63.Ссылка, ОбъектСЗВ63);
					
					ЕстьОшибки = Ложь;
					ОбъектСЗВ63.ПроверитьПравильностьЗаполненияДокумента(ЕстьОшибки);
					Если ЕстьОшибки Тогда
						ЕстьОшибкиСЗВ63 = Истина;
					Иначе 				
						ДеревоСЗВ63 = ПроцедурыПерсонифицированногоУчета.ПреобразоватьВДеревоXML(РегламентированнаяОтчетность.ПолучитьТекстФайла(ОбъектСЗВ63, ЕстьОшибки));
						Если ДеревоСЗВ63 <> Неопределено Тогда
							ДеревоСЗВ63 = ДеревоСЗВ63.Строки.Найти("ФайлПФР","Имя");
						КонецЕсли;
						Если ДеревоСЗВ63 <> Неопределено Тогда
							ДеревоСЗВ63 = ДеревоСЗВ63.Строки.Найти("ПачкаВходящихДокументов","Имя");
						КонецЕсли;
						Если ДеревоСЗВ63 <> Неопределено Тогда // ДеревоСЗВ63 теперь содержит только тег ПачкаВходящихДокументов
							СоответствиеСсылокИФайловСЗВ63.Вставить(ВыборкаСЗВ63.Ссылка, ДеревоСЗВ63);
						Иначе 
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Не удалось разобрать сохраненный файл формы СЗВ-6-3 № " + ОбъектСЗВ63.НомерПачки + "!", ЕстьОшибкиСЗВ63);
						КонецЕсли;
					КонецЕсли;
					УдалитьПустойЗаголовок(ДеревоСообщений);
					
				КонецЦикла;
			КонецЕсли;
			
			Если ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериодАДВ62) = КонецГода(ОтчетныйПериодАДВ62) И ВыборкаСЗВ63.Количество() = 0 Тогда
				Если РазделПроверкиКомплекта = Неопределено Тогда
					РазделПроверкиКомплекта = ОбработкаКомментариев.ДобавитьСообщение("Проверка полноты комплекта представляемых документов", Перечисления.ВидыСообщений.Информация);
				КонецЕсли;
				ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Не подготовлены подаваемые вместе с Описью АДВ-6-2 сведения СЗВ-6-3!", ЕстьОшибкиСЗВ63,,,,РазделПроверкиКомплекта);
			КонецЕсли;
			
			// перекрестная проверка документов
			
			// дополнительные проверки для отчетного периода "Календарный год"
			Если Не ЕстьОшибкиСЗВ63 И ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериодАДВ62) = КонецГода(ОтчетныйПериодАДВ62) Тогда 
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);
				ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеВидаЗастрахованныхКатегории(Запрос.МенеджерВременныхТаблиц);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
				|ПОМЕСТИТЬ ВТФормыСЗВ_6_12
				|ИЗ
				|	Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
				|ГДЕ
				|	ПередачаСЗВ4вПФРПачкиДокументов.Ссылка = &Ссылка
				|	И ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
				|ПОМЕСТИТЬ ВТКорректирующиеФормыИзТекущегоПериода
				|ИЗ
				|	Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
				|ГДЕ
				|	ПередачаСЗВ4вПФРПачкиДокументов.Ссылка = &Ссылка
				|	И ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ)
				|	И ГОД(ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КорректируемыйПериод) = &ОтчетныйГод
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СведенияПринятыеПФР.КомплектДокументов КАК Опись
				|ПОМЕСТИТЬ ВТПредыдущиеОписиАДВ62
				|ИЗ
				|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
				|ГДЕ
				|	СведенияПринятыеПФР.Организация = &Организация
				|	И ГОД(СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР) = &ОтчетныйГод
				|	И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
				|ПОМЕСТИТЬ ВТПредыдущиеФормыСЗВ_6_12
				|ИЗ
				|	Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
				|ГДЕ
				|	ПередачаСЗВ4вПФРПачкиДокументов.Ссылка В
				|			(ВЫБРАТЬ
				|				ПредыдущиеОписиАДВ62.Опись
				|			ИЗ
				|				ВТПредыдущиеОписиАДВ62 КАК ПредыдущиеОписиАДВ62)
				|	И ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ <> ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ОТМЕНЯЮЩАЯ)
				|	И (ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
				|			ИЛИ ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ)
				|				И ГОД(ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка.КорректируемыйПериод) = &ОтчетныйГод)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	МИНИМУМ(СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов,
				|	СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
				|ПОМЕСТИТЬ ВТТарифПоКатегории
				|ИЗ
				|	ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
				|ГДЕ
				|	&ОтчетныйГод МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо
				|
				|СГРУППИРОВАТЬ ПО
				|	СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.Ссылка,
				|	Застрахованные.ФизЛицо,
				|	МАКСИМУМ(СоответствиеВидаЗастрахованныхКатегории.ИсходнаяКатегорияЗастрахованныхЛиц) КАК КатегорияДляОпределенияТарифа,
				|	Застрахованные.СтраховойНомерПФР,
				|	Застрахованные.Фамилия,
				|	Застрахованные.Имя,
				|	Застрахованные.Отчество,
				|	Застрахованные.НомерСтроки,
				|	ВЫБОР
				|		КОГДА Застрахованные.Ссылка.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.НР), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПНР), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖНР))
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК ЭтоЛьготныеКатегории,
				|	Застрахованные.Ссылка.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц
				|ПОМЕСТИТЬ ВТФормыСЗВ_6_3
				|ИЗ
				|	Документ.СведенияОНачисленномЗаработкеСЗВ63.СотрудникиОрганизации КАК Застрахованные
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеВидаЗастрахованныхКатегории КАК СоответствиеВидаЗастрахованныхКатегории
				|		ПО Застрахованные.Ссылка.КатегорияЗастрахованныхЛиц = СоответствиеВидаЗастрахованныхКатегории.КатегорияЗастрахованныхЛиц
				|ГДЕ
				|	Застрахованные.Ссылка.ОписьАДВ62 = &Ссылка
				|	И Застрахованные.Ссылка.ОтчетныйПериод = &ОтчетныйГод
				|	И Застрахованные.Ссылка.Организация = &Организация
				|	И Застрахованные.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
				|	И НЕ Застрахованные.Ссылка.ПометкаУдаления
				|
				|СГРУППИРОВАТЬ ПО
				|	Застрахованные.Ссылка,
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.СтраховойНомерПФР,
				|	Застрахованные.Фамилия,
				|	Застрахованные.Имя,
				|	Застрахованные.Отчество,
				|	Застрахованные.НомерСтроки,
				|	Застрахованные.Ссылка.КатегорияЗастрахованныхЛиц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.Ссылка,
				|	Застрахованные.НомерСтроки,
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.Ссылка.КатегорияЗастрахованныхЛиц,
				|	Застрахованные.НачисленоСтраховая + Застрахованные.НачисленоНакопительная КАК НачисленоВзносов,
				|	Застрахованные.СтраховойНомерПФР,
				|	Застрахованные.Фамилия,
				|	Застрахованные.Имя,
				|	Застрахованные.Отчество
				|ПОМЕСТИТЬ ВТЗастрахованныеСЗВ_6_12
				|ИЗ
				|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК Застрахованные
				|ГДЕ
				|	Застрахованные.Ссылка В
				|			(ВЫБРАТЬ
				|				ФормыСЗВ_6_12.ДокументПачка
				|			ИЗ
				|				ВТФормыСЗВ_6_12 КАК ФормыСЗВ_6_12)
				|	И (Застрахованные.НачисленоСтраховая <> 0
				|			ИЛИ Застрахованные.НачисленоНакопительная <> 0)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СУММА(ДанныеДокументов.НачисленоВзносов) КАК НачисленоВзносов,
				|	ДанныеДокументов.ФизЛицо,
				|	ДанныеДокументов.КатегорияЗастрахованныхЛиц
				|ПОМЕСТИТЬ ВТЗастрахованныеСЗВ_6_12заГод
				|ИЗ
				|	(ВЫБРАТЬ
				|		Застрахованные.НачисленоСтраховая + Застрахованные.НачисленоНакопительная КАК НачисленоВзносов,
				|		Застрахованные.ФизЛицо КАК ФизЛицо,
				|		Застрахованные.Ссылка.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц
				|	ИЗ
				|		Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК Застрахованные
				|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК КорректирующиеСведения
				|			ПО Застрахованные.ФизЛицо = КорректирующиеСведения.ФизЛицо
				|				И Застрахованные.Ссылка.КатегорияЗастрахованныхЛиц = КорректирующиеСведения.Ссылка.КатегорияЗастрахованныхЛиц
				|				И (КорректирующиеСведения.Ссылка В
				|					(ВЫБРАТЬ
				|						ФормыСЗВ_6_12.ДокументПачка
				|					ИЗ
				|						ВТПредыдущиеФормыСЗВ_6_12 КАК ФормыСЗВ_6_12
				|					ГДЕ
				|						ФормыСЗВ_6_12.ДокументПачка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.КОРРЕКТИРУЮЩАЯ)
				|				
				|					ОБЪЕДИНИТЬ ВСЕ
				|				
				|					ВЫБРАТЬ
				|						НовыеКорректирующиеФормы.ДокументПачка
				|					ИЗ
				|						ВТКорректирующиеФормыИзТекущегоПериода КАК НовыеКорректирующиеФормы))
				|				И (ВЫБОР
				|					КОГДА Застрахованные.Ссылка.ТипСведенийСЗВ = ЗНАЧЕНИЕ(Перечисление.ТипыСведенийСЗВ.ИСХОДНАЯ)
				|						ТОГДА Застрахованные.Ссылка.ОтчетныйПериод
				|					ИНАЧЕ Застрахованные.Ссылка.КорректируемыйПериод
				|				КОНЕЦ = КорректирующиеСведения.Ссылка.КорректируемыйПериод)
				|				И Застрахованные.Ссылка.ОтчетныйПериод < КорректирующиеСведения.Ссылка.ОтчетныйПериод
				|	ГДЕ
				|		Застрахованные.Ссылка В
				|				(ВЫБРАТЬ
				|					ФормыСЗВ_6_12.ДокументПачка
				|				ИЗ
				|					ВТПредыдущиеФормыСЗВ_6_12 КАК ФормыСЗВ_6_12
				|			
				|				ОБЪЕДИНИТЬ ВСЕ
				|			
				|				ВЫБРАТЬ
				|					НовыеКорректирующиеФормы.ДокументПачка
				|				ИЗ
				|					ВТКорректирующиеФормыИзТекущегоПериода КАК НовыеКорректирующиеФормы)
				|		И (Застрахованные.НачисленоСтраховая <> 0
				|				ИЛИ Застрахованные.НачисленоНакопительная <> 0)
				|		И КорректирующиеСведения.ФизЛицо ЕСТЬ NULL 
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ЗастрахованныеПоследнегоКвартала.НачисленоВзносов,
				|		ЗастрахованныеПоследнегоКвартала.ФизЛицо,
				|		ЗастрахованныеПоследнегоКвартала.КатегорияЗастрахованныхЛиц
				|	ИЗ
				|		ВТЗастрахованныеСЗВ_6_12 КАК ЗастрахованныеПоследнегоКвартала) КАК ДанныеДокументов
				|
				|СГРУППИРОВАТЬ ПО
				|	ДанныеДокументов.ФизЛицо,
				|	ДанныеДокументов.КатегорияЗастрахованныхЛиц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.ФизЛицо,
				|	МесяцыГода.Месяц,
				|	ВЫБОР
				|		КОГДА СУММА(ЕСТЬNULL(ЗаработокПоМесяцам.ОблагаетсяВзносами, 0)) > &ПредельнаяВеличина
				|			ТОГДА &ПредельнаяВеличина
				|		ИНАЧЕ СУММА(ЕСТЬNULL(ЗаработокПоМесяцам.ОблагаетсяВзносами, 0))
				|	КОНЕЦ КАК ОблагаетсяВзносами
				|ПОМЕСТИТЬ ВТОблагаемаяБазаНарастающимИтогом
				|ИЗ
				|	ВТФормыСЗВ_6_3 КАК Застрахованные
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			1 КАК Месяц
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			2
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			3
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			4
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			5
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			6
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			7
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			8
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			9
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			10
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			11
				|		
				|		ОБЪЕДИНИТЬ ВСЕ
				|		
				|		ВЫБРАТЬ
				|			12) КАК МесяцыГода
				|		ПО (ИСТИНА)
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОНачисленномЗаработкеСЗВ63.СведенияОЗаработке КАК ЗаработокПоМесяцам
				|		ПО Застрахованные.Ссылка = ЗаработокПоМесяцам.Ссылка
				|			И Застрахованные.ФизЛицо = ЗаработокПоМесяцам.ФизЛицо
				|			И (ЗаработокПоМесяцам.Месяц <= МесяцыГода.Месяц)
				|
				|СГРУППИРОВАТЬ ПО
				|	Застрахованные.ФизЛицо,
				|	МесяцыГода.Месяц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОблагаемаяБазаНарастающимИтогом.ФизЛицо,
				|	ОблагаемаяБазаНарастающимИтогом.Месяц,
				|	ОблагаемаяБазаНарастающимИтогом.ОблагаетсяВзносами - ЕСТЬNULL(ОблагаемаяБазаПредыдущегоМесяца.ОблагаетсяВзносами, 0) КАК ОблагаетсяВзносами
				|ПОМЕСТИТЬ ВТОблагаемаяБазаПомесячноСУчетомПредела
				|ИЗ
				|	ВТОблагаемаяБазаНарастающимИтогом КАК ОблагаемаяБазаНарастающимИтогом
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОблагаемаяБазаНарастающимИтогом КАК ОблагаемаяБазаПредыдущегоМесяца
				|		ПО ОблагаемаяБазаНарастающимИтогом.ФизЛицо = ОблагаемаяБазаПредыдущегоМесяца.ФизЛицо
				|			И (ОблагаемаяБазаНарастающимИтогом.Месяц = ОблагаемаяБазаПредыдущегоМесяца.Месяц + 1)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.ФизЛицо,
				|	ЗаработокПоМесяцам.Месяц,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	Застрахованные.КатегорияДляОпределенияТарифа,
				|	Застрахованные.ЭтоЛьготныеКатегории,
				|	СУММА(ЕСТЬNULL(ЗаработокПоМесяцам.ОблагаетсяВзносами, 0)) КАК ОблагаетсяВзносами
				|ПОМЕСТИТЬ ВТОблагаетсяВзносамиПоКатегориямИМесяцам
				|ИЗ
				|	ВТФормыСЗВ_6_3 КАК Застрахованные
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОНачисленномЗаработкеСЗВ63.СведенияОЗаработке КАК ЗаработокПоМесяцам
				|		ПО Застрахованные.Ссылка = ЗаработокПоМесяцам.Ссылка
				|			И Застрахованные.ФизЛицо = ЗаработокПоМесяцам.ФизЛицо
				|
				|СГРУППИРОВАТЬ ПО
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	Застрахованные.КатегорияДляОпределенияТарифа,
				|	Застрахованные.ЭтоЛьготныеКатегории,
				|	ЗаработокПоМесяцам.Месяц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОблагаетсяВзносамиПоКатегориямИМесяцам.ФизЛицо,
				|	СУММА(ОблагаетсяВзносамиПоКатегориямИМесяцам.ОблагаетсяВзносами) КАК ОблагаетсяВзносами,
				|	ОблагаетсяВзносамиПоКатегориямИМесяцам.Месяц
				|ПОМЕСТИТЬ ВТОблагаетсяВзносамиПоЛьготнымКатегориямИМесяцам
				|ИЗ
				|	ВТОблагаетсяВзносамиПоКатегориямИМесяцам КАК ОблагаетсяВзносамиПоКатегориямИМесяцам
				|ГДЕ
				|	ОблагаетсяВзносамиПоКатегориямИМесяцам.ЭтоЛьготныеКатегории
				|
				|СГРУППИРОВАТЬ ПО
				|	ОблагаетсяВзносамиПоКатегориямИМесяцам.ФизЛицо,
				|	ОблагаетсяВзносамиПоКатегориямИМесяцам.Месяц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.Месяц,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	Застрахованные.КатегорияДляОпределенияТарифа,
				|	ВЫБОР
				|		КОГДА Застрахованные.ЭтоЛьготныеКатегории
				|			ТОГДА Застрахованные.ОблагаетсяВзносами
				|		ИНАЧЕ ВЫБОР
				|				КОГДА Застрахованные.ОблагаетсяВзносами <= ЕСТЬNULL(ОблагаемаяБазаПомесячноСУчетомПредела.ОблагаетсяВзносами, 0) - ЕСТЬNULL(ОблагаетсяВзносамиПоЛьготнымКатегориямИМесяцам.ОблагаетсяВзносами, 0)
				|					ТОГДА Застрахованные.ОблагаетсяВзносами
				|				ИНАЧЕ ЕСТЬNULL(ОблагаемаяБазаПомесячноСУчетомПредела.ОблагаетсяВзносами, 0) - ЕСТЬNULL(ОблагаетсяВзносамиПоЛьготнымКатегориямИМесяцам.ОблагаетсяВзносами, 0)
				|			КОНЕЦ
				|	КОНЕЦ КАК ОблагаетсяВзносами
				|ПОМЕСТИТЬ ВТБазаДляРасчетаВзносовПоСЗВ_6_3
				|ИЗ
				|	ВТОблагаетсяВзносамиПоКатегориямИМесяцам КАК Застрахованные
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОблагаемаяБазаПомесячноСУчетомПредела КАК ОблагаемаяБазаПомесячноСУчетомПредела
				|		ПО Застрахованные.ФизЛицо = ОблагаемаяБазаПомесячноСУчетомПредела.ФизЛицо
				|			И Застрахованные.Месяц = ОблагаемаяБазаПомесячноСУчетомПредела.Месяц
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОблагаетсяВзносамиПоЛьготнымКатегориямИМесяцам КАК ОблагаетсяВзносамиПоЛьготнымКатегориямИМесяцам
				|		ПО Застрахованные.ФизЛицо = ОблагаетсяВзносамиПоЛьготнымКатегориямИМесяцам.ФизЛицо
				|			И Застрахованные.Месяц = ОблагаетсяВзносамиПоЛьготнымКатегориямИМесяцам.Месяц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	ЕСТЬNULL(СУММА(Застрахованные.ОблагаетсяВзносами), 0) * СтавкиТарифа.ПФР / 100 КАК ВзносовКНачислению
				|ПОМЕСТИТЬ ВТВзносыПоЗаработкуСЗВ_6_3
				|ИЗ
				|	ВТБазаДляРасчетаВзносовПоСЗВ_6_3 КАК Застрахованные
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифПоКатегории КАК ТарифПоКатегории
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&КонецГода, ) КАК СтавкиТарифа
				|			ПО (ВЫБОР
				|					КОГДА ТарифПоКатегории.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
				|					ИНАЧЕ ТарифПоКатегории.ВидТарифаСтраховыхВзносов
				|				КОНЕЦ = СтавкиТарифа.ВидТарифа)
				|		ПО Застрахованные.КатегорияДляОпределенияТарифа = ТарифПоКатегории.КатегорияЗастрахованныхЛиц
				|ГДЕ
				|	Застрахованные.Месяц В (10, 11, 12)
				|
				|СГРУППИРОВАТЬ ПО
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	СтавкиТарифа.ПФР
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	ЕСТЬNULL(СУММА(Застрахованные.ОблагаетсяВзносами), 0) * СтавкиТарифа.ПФР / 100 КАК ВзносовКНачислению
				|ПОМЕСТИТЬ ВТВзносыПоЗаработкуСЗВ_6_3заГод
				|ИЗ
				|	ВТБазаДляРасчетаВзносовПоСЗВ_6_3 КАК Застрахованные
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифПоКатегории КАК ТарифПоКатегории
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифСтраховыхВзносов.СрезПоследних(&КонецГода, ) КАК СтавкиТарифа
				|			ПО (ВЫБОР
				|					КОГДА ТарифПоКатегории.ВидТарифаСтраховыхВзносов = ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ДляЧленовЭкипажейМорскихСудовПодФлагомРФ)
				|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)
				|					ИНАЧЕ ТарифПоКатегории.ВидТарифаСтраховыхВзносов
				|				КОНЕЦ = СтавкиТарифа.ВидТарифа)
				|		ПО Застрахованные.КатегорияДляОпределенияТарифа = ТарифПоКатегории.КатегорияЗастрахованныхЛиц
				|
				|СГРУППИРОВАТЬ ПО
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	СтавкиТарифа.ПФР
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
				|	Застрахованные.СтраховойНомерПФР,
				|	Застрахованные.Ссылка.НомерПачки КАК НомерПачки,
				|	СУММА(СведенияОЗаработке.Заработок) КАК Заработок,
				|	СУММА(СведенияОЗаработке.ОблагаетсяВзносами) КАК ОблагаетсяВзносами,
				|	Застрахованные.Фамилия + "" "" + Застрахованные.Имя + "" "" + Застрахованные.Отчество КАК ФИОЗастрахованного,
				|	Застрахованные.НомерСтроки
				|ИЗ
				|	ВТФормыСЗВ_6_3 КАК Застрахованные
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СведенияОНачисленномЗаработкеСЗВ63.СведенияОЗаработке КАК СведенияОЗаработке
				|		ПО Застрахованные.Ссылка = СведенияОЗаработке.Ссылка
				|			И Застрахованные.ФизЛицо = СведенияОЗаработке.ФизЛицо
				|
				|СГРУППИРОВАТЬ ПО
				|	Застрахованные.ФизЛицо,
				|	Застрахованные.КатегорияЗастрахованныхЛиц,
				|	Застрахованные.СтраховойНомерПФР,
				|	Застрахованные.Ссылка,
				|	Застрахованные.Фамилия + "" "" + Застрахованные.Имя + "" "" + Застрахованные.Отчество,
				|	Застрахованные.Ссылка.НомерПачки,
				|	Застрахованные.НомерСтроки
				|
				|УПОРЯДОЧИТЬ ПО
				|	КатегорияЗастрахованныхЛиц,
				|	Застрахованные.Ссылка,
				|	ФИОЗастрахованного
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗастрахованныеСЗВ_6_12.ФизЛицо,
				|	ЗастрахованныеСЗВ_6_12.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
				|	ВЫБОР
				|		КОГДА ЗастрахованныеСЗВ_6_12.НачисленоВзносов - Заработок.ВзносовКНачислению < 0
				|			ТОГДА Заработок.ВзносовКНачислению - ЗастрахованныеСЗВ_6_12.НачисленоВзносов
				|		ИНАЧЕ ЗастрахованныеСЗВ_6_12.НачисленоВзносов - Заработок.ВзносовКНачислению
				|	КОНЕЦ КАК РасхождениеВоВзносах,
				|	Заработок.ВзносовКНачислению,
				|	ЗастрахованныеСЗВ_6_12.НачисленоВзносов,
				|	ЕСТЬNULL(Заработок.ФизЛицо.Наименование, ЗастрахованныеСЗВ_6_12.ФизЛицо.Наименование) КАК ФИОЗастрахованного
				|ИЗ
				|	ВТЗастрахованныеСЗВ_6_12заГод КАК ЗастрахованныеСЗВ_6_12
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВзносыПоЗаработкуСЗВ_6_3заГод КАК Заработок
				|		ПО ЗастрахованныеСЗВ_6_12.ФизЛицо = Заработок.ФизЛицо
				|			И ЗастрахованныеСЗВ_6_12.КатегорияЗастрахованныхЛиц = Заработок.КатегорияЗастрахованныхЛиц
				|ГДЕ
				|	Заработок.ФизЛицо ЕСТЬ НЕ NULL 
				|
				|УПОРЯДОЧИТЬ ПО
				|	ФИОЗастрахованного,
				|	КатегорияЗастрахованныхЛиц
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Застрахованные.Ссылка,
				|	ВЫБОР
				|		КОГДА Застрахованные.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоДоходыИнвалидов,
				|	ВЫБОР
				|		КОГДА Застрахованные.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.НР), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПНР), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖНР))
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК ЭтоЛьготныеКатегории,
				|	СУММА(ЕСТЬNULL(ЗаработокПоМесяцам.ОблагаетсяВзносами, 0)) КАК ОблагаемаяБаза,
				|	СУММА(ЕСТЬNULL(ЗаработокПоМесяцам.Заработок, 0)) КАК Заработок
				|ИЗ
				|	ВТФормыСЗВ_6_3 КАК Застрахованные
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОНачисленномЗаработкеСЗВ63.СведенияОЗаработке КАК ЗаработокПоМесяцам
				|		ПО Застрахованные.Ссылка = ЗаработокПоМесяцам.Ссылка
				|			И Застрахованные.ФизЛицо = ЗаработокПоМесяцам.ФизЛицо
				|
				|СГРУППИРОВАТЬ ПО
				|	ВЫБОР
				|		КОГДА Застрахованные.КатегорияЗастрахованныхЛиц = ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ООИ)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ,
				|	Застрахованные.Ссылка,
				|	ВЫБОР
				|		КОГДА Застрахованные.КатегорияЗастрахованныхЛиц В (ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.НР), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВПНР), ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ВЖНР))
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗастрахованныеСЗВ_6_12.ФизЛицо,
				|	ЗастрахованныеСЗВ_6_12.Ссылка,
				|	ЗастрахованныеСЗВ_6_12.Ссылка.НомерПачки КАК НомерПачкиСЗВ6_12,
				|	ЗастрахованныеСЗВ_6_12.НомерСтроки КАК НомерСтрокиСЗВ6_12,
				|	ВЫБОР
				|		КОГДА ЗастрахованныеСЗВ_6_12.НачисленоВзносов - Заработок.ВзносовКНачислению < 0
				|			ТОГДА Заработок.ВзносовКНачислению - ЗастрахованныеСЗВ_6_12.НачисленоВзносов
				|		ИНАЧЕ ЗастрахованныеСЗВ_6_12.НачисленоВзносов - Заработок.ВзносовКНачислению
				|	КОНЕЦ КАК РасхождениеВоВзносах,
				|	Заработок.ВзносовКНачислению,
				|	ЗастрахованныеСЗВ_6_12.НачисленоВзносов
				|ИЗ
				|	ВТЗастрахованныеСЗВ_6_12 КАК ЗастрахованныеСЗВ_6_12
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВзносыПоЗаработкуСЗВ_6_3 КАК Заработок
				|		ПО ЗастрахованныеСЗВ_6_12.ФизЛицо = Заработок.ФизЛицо
				|			И ЗастрахованныеСЗВ_6_12.КатегорияЗастрахованныхЛиц = Заработок.КатегорияЗастрахованныхЛиц
				|ГДЕ
				|	Заработок.ФизЛицо ЕСТЬ НЕ NULL 
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерПачкиСЗВ6_12,
				|	НомерСтрокиСЗВ6_12
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗастрахованныеСЗВ_6_12.ФизЛицо,
				|	ЗастрахованныеСЗВ_6_12.Ссылка,
				|	ЗастрахованныеСЗВ_6_12.Ссылка.НомерПачки КАК НомерПачкиСЗВ6_12,
				|	ЗастрахованныеСЗВ_6_12.НомерСтроки КАК НомерСтрокиСЗВ6_12,
				|	ФормыСЗВ_6_3.Ссылка.НомерПачки КАК НомерПачкиСЗВ_6_3,
				|	ВЫБОР
				|		КОГДА ФормыСЗВ_6_3.Ссылка ЕСТЬ NULL 
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ОтсуствуетФормаСЗВ63,
				|	ВЫБОР
				|		КОГДА ЗастрахованныеСЗВ_6_12.СтраховойНомерПФР <> ФормыСЗВ_6_3.СтраховойНомерПФР
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК НеСовпадаетСНИЛС,
				|	ВЫБОР
				|		КОГДА ЗастрахованныеСЗВ_6_12.Имя <> ФормыСЗВ_6_3.Имя
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК НеСовпадаетИмя,
				|	ВЫБОР
				|		КОГДА ЗастрахованныеСЗВ_6_12.Отчество <> ФормыСЗВ_6_3.Отчество
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК НеСовпадаетОтчество,
				|	ВЫБОР
				|		КОГДА ЗастрахованныеСЗВ_6_12.Фамилия <> ФормыСЗВ_6_3.Фамилия
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК НеСовпадаетФамилия,
				|	ЗастрахованныеСЗВ_6_12.Фамилия + "" "" + ЗастрахованныеСЗВ_6_12.Имя + "" "" + ЗастрахованныеСЗВ_6_12.Отчество КАК ФИОЗастрахованного
				|ИЗ
				|	ВТЗастрахованныеСЗВ_6_12 КАК ЗастрахованныеСЗВ_6_12
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФормыСЗВ_6_3 КАК ФормыСЗВ_6_3
				|		ПО ЗастрахованныеСЗВ_6_12.ФизЛицо = ФормыСЗВ_6_3.ФизЛицо
				|			И ЗастрахованныеСЗВ_6_12.КатегорияЗастрахованныхЛиц = ФормыСЗВ_6_3.КатегорияЗастрахованныхЛиц
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерПачкиСЗВ6_12,
				|	НомерСтрокиСЗВ6_12,
				|	НомерПачкиСЗВ_6_3
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЕСТЬNULL(ЗастрахованныеСЗВ_6_12.Количество, 0) КАК КоличествоЗастрахованныхСЗВ_6_12,
				|	ЕСТЬNULL(ФормыСЗВ_6_3.Количество, 0) КАК КоличествоФормСЗВ_6_3
				|ИЗ
				|	(ВЫБРАТЬ
				|		1 КАК Поле) КАК СтрокаЗапроса
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СУММА(1) КАК Количество
				|		ИЗ
				|			ВТФормыСЗВ_6_3 КАК ФормыСЗВ_6_3) КАК ФормыСЗВ_6_3
				|		ПО (ИСТИНА)
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			СУММА(1) КАК Количество
				|		ИЗ
				|			ВТЗастрахованныеСЗВ_6_12 КАК ЗастрахованныеСЗВ_6_12) КАК ЗастрахованныеСЗВ_6_12
				|		ПО (ИСТИНА)";
				Запрос.УстановитьПараметр("Ссылка", ПачкаАДВ62);
				Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
				Запрос.УстановитьПараметр("ОтчетныйГод", Год(ОтчетныйПериодАДВ62));
				Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериодАДВ62);
				Запрос.УстановитьПараметр("КонецГода", КонецГода(ОтчетныйПериодАДВ62));
				ПредельнаяСумма = РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.ПолучитьПоследнее(КонецГода(ОтчетныйПериодАДВ62)).РазмерПФР;
				Запрос.УстановитьПараметр("ПредельнаяВеличина", ?(ЗначениеЗаполнено(ПредельнаяСумма),ПредельнаяСумма,0));
				Результаты = Запрос.ВыполнитьПакет();
				ВсегоРезультатов = Результаты.Количество();
				
				// Сверка отдельных реквизитов документов персонифицированного учета «Сведений о сумме выплат и иных вознаграждений, начисляемых плательщиками страховых взносов - страхователями в пользу физического лица» (формы СЗВ-6-3, АДВ-6-4) и Расчета по начисленным и уплаченным страховым взносам (форма РСВ-1)
				РазделСверкиРСВ1иСЗВ63 = Неопределено;
				Если Не ЕстьОшибкиРСВ1 И ОтчетныйПериодРСВ1 = ОтчетныйПериодАДВ62 И РСВ1Объект.Организация = ДокументОбъект.Организация Тогда
					
					Если ОтчетныйПериодАДВ62 < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда
						
						ОбъектОбложенияПоФормамСЗВ63 = 0;
						ОблагаемаяБазаПоФормамСЗВ63 = 0;
						ОбъектОбложенияИнвалидовПоФормамСЗВ63 = 0;
						ОблагаемаяБазаИнвалидовПоФормамСЗВ63 = 0;
						ВыборкаСверкиДоходов = Результаты[ВсегоРезультатов - 4].Выбрать();
						Пока ВыборкаСверкиДоходов.Следующий() Цикл
							Если ВыборкаСверкиДоходов.ЭтоДоходыИнвалидов Тогда
								ОбъектОбложенияИнвалидовПоФормамСЗВ63 = ОбъектОбложенияИнвалидовПоФормамСЗВ63 + ВыборкаСверкиДоходов.Заработок;
								ОблагаемаяБазаИнвалидовПоФормамСЗВ63 = ОблагаемаяБазаИнвалидовПоФормамСЗВ63 + ВыборкаСверкиДоходов.ОблагаемаяБаза;
							Иначе
								ОбъектОбложенияПоФормамСЗВ63 = ОбъектОбложенияПоФормамСЗВ63 + ВыборкаСверкиДоходов.Заработок;
								ОблагаемаяБазаПоФормамСЗВ63 = ОблагаемаяБазаПоФормамСЗВ63 + ВыборкаСверкиДоходов.ОблагаемаяБаза;
							КонецЕсли;
						КонецЦикла;
						
						Если ОбъектОбложенияПоФормамСЗВ63 > 0 Тогда // есть доходы, облагаемые по тарифам отличным от инвалидного
							
							// Правило 4: По всем формам СЗВ-6-3 по всем категориям ЗЛ, за исключением категории застрахованного лица «ООИ»:
							// - значение итоговой строки показателя «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица», увеличенное на 4 рубля, должно быть больше или равно показателям строки «200»  РСВ-1 за календарный год, уменьшенной на показатели строк 210, 214, 215 и 216 РСВ-1.
							Если ОбъектОбложенияПоФормамСЗВ63 + 4 < УменьшенныйОбъектОбложенияРСВ1 Тогда
								РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма заработка, указанная в формах СЗВ-6-3" + ?(ОбъектОбложенияИнвалидовПоФормамСЗВ63 =0, "", " (за исключением форм по категории ООИ)") + ", меньше облагаемых взносами в ПФР сумм, указанных в разделе 2 Расчета РСВ-1!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;
							
							// -  значение итоговой строки показателя  «Из них на которые начислены страховые взносы на обязательное пенсионное страхование» должно равняться сумме значений строк «220» и «221»  РСВ-1 за календарный год (в пределах погрешности 4 рубля) 
							Разность = Макс(ОблагаемаяБазаПоФормамСЗВ63 - ОблагаемаяБазаРСВ1, ОблагаемаяБазаРСВ1 - ОблагаемаяБазаПоФормамСЗВ63);
							ДопустимоеРасхождение = 4; 
							Если Разность > ДопустимоеРасхождение Тогда
								Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
									РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы, указанная в формах СЗВ-6-3" + ?(ОбъектОбложенияИнвалидовПоФормамСЗВ63 =0, "", " (за исключением форм по категории ООИ)") + ", и сумма показателей колонки ""Всего с начала расчетного периода"" по строкам 220 и 221 раздела 2 Расчета РСВ-1 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;
							
							//Правило 4.2 Показатель строки «200» РСВ-1 должен быть равен сумме значений итоговой строки в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-3 по всем категориям ЗЛ,  за исключением категории застрахованного лица «ООИ»  (в пределах погрешности 4 рубля)
							
							ДопустимоеРасхождение = 4;
							Разность = Макс(Строка200РСВ1 - ОбъектОбложенияПоФормамСЗВ63, ОбъектОбложенияПоФормамСЗВ63 - Строка200РСВ1);
							Если Разность > ДопустимоеРасхождение Тогда 
								Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
									РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Показатель строки «200» РСВ-1 должен быть равен сумме значений итоговых строк в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-3 (в пределах погрешности на сумму 4 рубля).
								|Убедитесь, что равенство отсутствует из-за наличия выплат в пользу наемных работников, за которых не представляются формы СЗВ-6-3: выплаты в пользу военнослужащих или иностранных граждан, временно пребывающих на территории РФ, предусмотренные п.п. 14) и 15) части 2 статьи 9 Федерального закона от 24 июля 2009 года №212-ФЗ ; выплаты в пользу прокуроров, следователей, федеральных или мировых судей, предусмотренные п.1) части 3 статьи 9 указанного Федерального закона.
								|В остальных случаях расхождения НЕДОПУСТИМЫ!!!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;
							
						ИначеЕсли ОбъектОбложенияИнвалидовПоФормамСЗВ63 > 0 Тогда // кроме инвалидных, других доходов нет (страхователь с кодом тарифа в РСВ-1 «03» на Титульном листе)
							
							ОбъектОбложенияПоФормамСЗВ63 = ОбъектОбложенияИнвалидовПоФормамСЗВ63;
							ОблагаемаяБазаПоФормамСЗВ63 = ОблагаемаяБазаИнвалидовПоФормамСЗВ63;
							ОбъектОбложенияИнвалидовПоФормамСЗВ63 = 0;
							ОблагаемаяБазаИнвалидовПоФормамСЗВ63 = 0;
							КоличествоПачекИнвалидовСЗВ63 = 0;
							
							// Правило 5: По всем формам СЗВ-6-3 по категории застрахованного лица «ООИ» по страхователям с кодом тарифа в РСВ-1 «03» на Титульном листе расчета:
							// - значение итоговой строки показателя «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица», увеличенное на 4 рубля, должно быть больше или равно сумме показателей в строке «200» и «300»  РСВ-1 за календарный год, уменьшенной на показатели строк 210,214,215,216, 310, 314, 315 и 316 РСВ-1.
							Если ОбъектОбложенияПоФормамСЗВ63 + 4 < УменьшенныйОбъектОбложенияРСВ1 + УменьшенныйОбъектОбложенияИнвалидовРСВ1 Тогда
								РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма заработка, указанная в формах СЗВ-6-3, меньше облагаемых взносами в ПФР сумм, указанных в разделах 2 и 3 Расчета РСВ-1!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;
							
							// - значение итоговой строки показателя  «Из них на которые начислены страховые взносы на обязательное пенсионное страхование» должно равняться  сумме значений строк 220,221,320 и 321 РСВ-1 за календарный год (в пределах 4 рублей)
							Разность = Макс(ОблагаемаяБазаПоФормамСЗВ63 - ОблагаемаяБазаРСВ1 - ОблагаемаяБазаИнвалидовРСВ1, ОблагаемаяБазаРСВ1 + ОблагаемаяБазаИнвалидовРСВ1 - ОблагаемаяБазаПоФормамСЗВ63);
							ДопустимоеРасхождение = 4;
							Если Разность > ДопустимоеРасхождение Тогда
								Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
									РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы, указанная в формах СЗВ-6-3 по категории ООИ, и сумма показателей колонки ""Всего с начала расчетного периода"" по строкам 220 и 221 раздела 2 Расчета РСВ-1 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;
							
							//Правило 5.2 Сумма показателей строки «200» и «300» РСВ-1 должна быть равна сумме значений итоговой строки в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-3 по категории застрахованного лица «ООИ»    по страхователям с кодом тарифа  «03»  в Разделе 2 РСВ-1 (в пределах погрешности на сумму 4 рубля).
							ДопустимоеРасхождение = 4;
							Разность = Макс(Строка200РСВ1 + Строка300РСВ1 - ОбъектОбложенияПоФормамСЗВ63, ОбъектОбложенияПоФормамСЗВ63 - Строка200РСВ1 - Строка300РСВ1);
							Если Разность > ДопустимоеРасхождение Тогда 
								Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
									РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Сумма показателей строк «200» и «300» РСВ-1 должна быть равна сумме значений итоговых строк в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-3  с кодом категории застрахованного лица «ООИ» (в пределах погрешности на сумму  4 рубля).
								|Убедитесь, что равенство отсутствует из-за наличия выплат в пользу наемных работников, за которых не представляются формы СЗВ-6-3: выплаты в пользу военнослужащих или иностранных граждан, временно пребывающих на территории РФ, предусмотренные п.п. 14) и 15) части 2 статьи 9 Федерального закона от 24 июля 2009 года №212-ФЗ ; выплаты в пользу прокуроров, следователей, федеральных или мировых судей, предусмотренные п.1) части 3 статьи 9 указанного Федерального закона.
								|В остальных случаях расхождения НЕДОПУСТИМЫ!!!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;
							
						КонецЕсли;
						
						// Правила 4.1, 5.1
						ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам = Результаты[ВсегоРезультатов - 6].Выбрать();
						Пока ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.Следующий() Цикл
							
							//Правило 4.1. По всем формам СЗВ-6-3 по всем категориям ЗЛ, за исключением категории застрахованного лица «ООИ» сумма значений итоговых строк в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» должна быть равна сумме значений итоговых строк в графе «Из них на которые начислены страховые взносы на обязательное пенсионное страхование» при условии, что показатели строки «210» и строки «216» РСВ-1 за календарный год равны нулю (при наличии в РСВ-1 нескольких Разделов 2 оценивается срока «210» и «216» каждого из Разделов 2).
							//Правило 5.1. По всем формам СЗВ-6-3 по категории застрахованного лица «ООИ». сумма значений итоговых строк в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» должна быть равна сумме значений итоговых строк в графе «Из них на которые начислены страховые взносы на обязательное пенсионное страхование» при условии, что показатели строк «310», «316», «210» и «216»  РСВ-1 за календарный год равны нулю.
							
							Строка210 = Строки210РСВ1.Получить(ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.КатегорияЗастрахованныхЛиц);
							Строка216 = Строки216РСВ1.Получить(ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.КатегорияЗастрахованныхЛиц);
							
							ПроверяемыйПоказатель = ?(Не ЗначениеЗаполнено(Строка210), 0, Строка210) + ?(Не ЗначениеЗаполнено(Строка216), 0, Строка216);
							
							Если ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.КатегорияЗастрахованныхЛиц = Перечисления.КатегорииЗастрахованныхЛицПФР.ООИ Тогда // добавляются строки 216 и 316				
								ПроверяемыйПоказатель = ПроверяемыйПоказатель + Строка310РСВ1 + Строка316РСВ1;								
							КонецЕсли;
							
							Если ПроверяемыйПоказатель = 0 И ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.Заработок <> ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.ОблагаетсяВзносами Тогда
								
								Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
									РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								
								НачалоСообщения = "Для застрахованного " + СокрЛП(ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.ФИОЗастрахованного) + ", указанного в строке " + ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.НомерСтроки + " пачки СЗВ-6-3 № " + ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.НомерПачки + ": ";
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщения + "общая сумма заработка и общая сумма облагаемой базы, должны быть равны", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;	
						КонецЦикла;	
						
					Иначе
						
						ОбъектОбложенияПоФормамСЗВ63 = 0;
						ОбъектОбложенияПоФормамСЗВ63Льготный = 0;
						ОблагаемаяБазаПоФормамСЗВ63 = 0;
						ОблагаемаяБазаПоФормамСЗВ63Льготная = 0;
						ВыборкаСверкиДоходов = Результаты[ВсегоРезультатов - 4].Выбрать();
						Пока ВыборкаСверкиДоходов.Следующий() Цикл
							Если ВыборкаСверкиДоходов.ЭтоЛьготныеКатегории Тогда
								ОбъектОбложенияПоФормамСЗВ63Льготный = ОбъектОбложенияПоФормамСЗВ63Льготный + ВыборкаСверкиДоходов.Заработок;
								ОблагаемаяБазаПоФормамСЗВ63Льготная = ОблагаемаяБазаПоФормамСЗВ63Льготная + ВыборкаСверкиДоходов.ОблагаемаяБаза;
							Иначе
								ОбъектОбложенияПоФормамСЗВ63 = ОбъектОбложенияПоФормамСЗВ63 + ВыборкаСверкиДоходов.Заработок;
								ОблагаемаяБазаПоФормамСЗВ63 = ОблагаемаяБазаПоФормамСЗВ63 + ВыборкаСверкиДоходов.ОблагаемаяБаза;
							КонецЕсли;
						КонецЦикла;
						
						// Правило 1. По всем формам СЗВ-6-3 (при их наличии) по всем категориям ЗЛ  значение итоговой строки показателя «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица»,  должно быть больше или равно сумме показателей строк 201, 202, 203 формы РСВ-1 за календарный год, уменьшенной на показатели строк 211, 212, 213, 231, 232 и 233 формы РСВ-1.
						Если ОбъектОбложенияПоФормамСЗВ63 < УменьшенныйОбъектОбложенияРСВ1 Тогда
							РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма заработка, указанная в формах СЗВ-6-3 с категориями «НР», «ВЖНР» и «ВПНР», меньше облагаемых взносами в ПФР сумм, указанных в разделе 2 Расчета РСВ-1 с кодами тарифа 01, 52 и 53!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
						КонецЕсли;
						
						// значение итоговой строки показателя «Из них на которые начислены страховые взносы на обязательное пенсионное страхование» должно равняться сумме значений строк «240» и «241» формы РСВ-1
						Если ОблагаемаяБазаПоФормамСЗВ63 <> ОблагаемаяБазаРСВ1 Тогда
							Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
								РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы, указанная в формах СЗВ-6-3 с категориями «НР», «ВЖНР» и «ВПНР» (" + Формат(ОблагаемаяБазаПоФормамСЗВ63,"ЧДЦ=2") + "), и сумма показателей колонки ""Всего с начала расчетного периода"" по строкам 240, 241, 231, 232 и 233 раздела 2 Расчета РСВ-1 с кодами тарифа 01, 52 и 53 (" + Формат(ОблагаемаяБазаРСВ1,"ЧДЦ=2") + ") не совпадают!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
						КонецЕсли;
						
						// Правило 1. По всем формам СЗВ-6-3 (при их наличии) по всем категориям ЗЛ  значение итоговой строки показателя «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица»,  должно быть больше или равно сумме показателей строк 201, 202, 203 формы РСВ-1 за календарный год, уменьшенной на показатели строк 211, 212, 213, 231, 232 и 233 формы РСВ-1.
						Если ОбъектОбложенияПоФормамСЗВ63Льготный < УменьшенныйОбъектОбложенияРСВ1Льготный Тогда
							Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
								РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма заработка, указанная в формах СЗВ-6-3 по всем категориям, кроме «НР», «ВЖНР» и «ВПНР», меньше облагаемых взносами в ПФР сумм, указанных в разделе 2 Расчета РСВ-1 по всем кодам тарифа, кроме 01, 52 и 53!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
						КонецЕсли;
						
						// значение итоговой строки показателя «Из них на которые начислены страховые взносы на обязательное пенсионное страхование» должно равняться сумме значений строк «240» и «241» формы РСВ-1
						Если ОблагаемаяБазаПоФормамСЗВ63Льготная <> ОблагаемаяБазаРСВ1Льготная Тогда
							Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
								РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Общая сумма облагаемой базы, указанная в формах СЗВ-6-3 по всем категориям, кроме «НР», «ВЖНР» и «ВПНР» (" + Формат(ОблагаемаяБазаПоФормамСЗВ63Льготная,"ЧДЦ=2") + "), и сумма показателей колонки ""Всего с начала расчетного периода"" по строкам 240 и 241 раздела 2 Расчета РСВ-1 по всем кодам тарифа, кроме 01, 52 и 53, (" + Формат(ОблагаемаяБазаРСВ1Льготная,"ЧДЦ=2") + ") не совпадают!", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
						КонецЕсли;
						
						// Правило 2. По всем формам СЗВ-6-3 по всем категориям ЗЛ сумма значений итоговых строк в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» должна быть равна сумме значений итоговых строк в графе «Из них на которые начислены страховые взносы на обязательное пенсионное страхование» при условии, что показатели строки «211», «212», «213», «221», «222», «223», «231», «232» и «233»  формы РСВ-1 за календарный год равны нулю
						ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам = Результаты[ВсегоРезультатов - 6].Выбрать();
						Пока ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.Следующий() Цикл
							
							ПроверяемыйПоказатель = ПоказателиНеоблагаемыхДоходов[СоответствиеКатегорий[ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.КатегорияЗастрахованныхЛиц]];
							
							Если ПроверяемыйПоказатель = 0 И ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.Заработок <> ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.ОблагаетсяВзносами Тогда
								
								Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
									РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								
								НачалоСообщения = "Для застрахованного " + СокрЛП(ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.ФИОЗастрахованного) + ", указанного в строке " + ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.НомерСтроки + " пачки СЗВ-6-3 № " + ВыборкаСведенияОЗаработкеСЗВ63ПоФизЛицам.НомерПачки + ": ";
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщения + "общая сумма заработка и общая сумма облагаемой базы, должны быть равны", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);
							КонецЕсли;	
							
						КонецЦикла;	
						
						// Правило 3. Сумма показателей строк «201», «202», «203» формы РСВ-1 должна быть равна сумме значений итоговой строки в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-3 по всем категориям застрахованных лиц
						Если ОбъектОбложенияПоФормамСЗВ63 <> ОбъектОбложенияРСВ1 Тогда 
							Если РазделСверкиРСВ1иСЗВ63 = Неопределено Тогда
								РазделСверкиРСВ1иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-3 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Сумма показателей строк «201», «202», «203» формы РСВ-1 должна быть равна сумме значений итоговых строк в графе «Сумма выплат и иных вознаграждений, начисленных в пользу физического лица» по всем формам СЗВ-6-3.
							|Невыполнение условия допускается при наличии выплат в пользу наемных работников, за которых не представляются формы СЗВ-6-3: выплаты в пользу военнослужащих, временно пребывающих на территории РФ, предусмотренные п.п. 14) и 15) части 2 статьи 9 Федерального закона от 24 июля 2009 года № 212-ФЗ; выплаты в пользу прокуроров, следователей, федеральных или мировых судей, предусмотренные п.1) части 3 статьи 9 указанного Федерального закона, в том числе  с сумм, превышающих предельную базу для начисления страховых взносов. В остальных случаях невыполнение условия является ошибкой и подлежит исправлению.", ЕстьОшибкиРСВ1_СЗВ63,,,,РазделСверкиРСВ1иСЗВ63);

						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				// Сверка «Сведений о сумме выплат и иных вознаграждений, начисляемых плательщиками страховых взносов - страхователями в пользу физического лица» (по форме СЗВ-6-3, АДВ-6-4) со сведениями персонифицированного учета о стаже и начисленным и уплаченным страховым взносам (по форме АДВ-6-2, СЗВ-6-2, СЗВ-6-1)
				РазделСверкиАДВ62иСЗВ63 = Неопределено;
				Если Не ЕстьОшибкиАДВ62 И Не ЕстьОшибкиСЗВ6 Тогда
					
					Для каждого Элемент Из СоответствиеСсылокИОбъектовСЗВ63 Цикл
						ОбъектСЗВ63 = Элемент.Значение;
						
						Если ОбъектСЗВ63.Организация <> ДокументОбъект.Организация Тогда
							Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
								РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Пачка СЗВ-6-3 № " + ОбъектСЗВ63.НомерПачки + " оформлена на " + ОбщегоНазначенияЗК.ПреобразоватьСтрокуИнтерфейса("другую организацию!"), ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
						Иначе
							
							ДеревоСЗВ63 = СоответствиеСсылокИФайловСЗВ63[Элемент.Ключ];
							ДеревоСЗВ63 = ДеревоСЗВ63.Строки.Найти("ВХОДЯЩАЯ_ОПИСЬ_ПО_СУММАМ_ВЫПЛАТ", "Имя");
							
							Если СокрЛП(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(ДеревоСЗВ63, "ИНН")) <> СокрЛП(ИнформацияОПачкеАДВ62.ИНН) Тогда
								Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
									РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и пачке СЗВ-6-3 № " + ОбъектСЗВ63.НомерПачки + " не совпадает ИНН!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиАДВ62иСЗВ63);
							КонецЕсли;
							Если СокрЛП(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(ДеревоСЗВ63, "КПП")) <> СокрЛП(ИнформацияОПачкеАДВ62.КПП) Тогда
								Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
									РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и пачке СЗВ-6-3 № " + ОбъектСЗВ63.НомерПачки + " не совпадает КПП!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиАДВ62иСЗВ63);
							КонецЕсли;
							Если СокрЛП(ПроцедурыПерсонифицированногоУчета.ИзвлечьДанное(ДеревоСЗВ63, "РегистрационныйНомер")) <> СокрЛП(ИнформацияОПачкеАДВ62.РегНомерПФР) Тогда
								Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
									РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и пачке СЗВ-6-3 № " + ОбъектСЗВ63.НомерПачки + " не совпадает регистрационный номер страхователя в ПФР!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиАДВ62иСЗВ63);
							КонецЕсли;
							
						КонецЕсли;
						Если ОбъектСЗВ63.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ И ОбъектСЗВ63.ОтчетныйПериод <> Год(ОтчетныйПериодАДВ62) Тогда
							Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
								РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Исходная пачка СЗВ-6-3 № " + ОбъектСЗВ63.НомерПачки + " содержит данные за другой отчетный период!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
						КонецЕсли;
					КонецЦикла;
					
					ВыборкаСверкиКоличества = Результаты[ВсегоРезультатов - 1].Выбрать();
					ВыборкаСверкиКоличества.Следующий();
					Если ВыборкаСверкиКоличества.КоличествоФормСЗВ_6_3 < ВыборкаСверкиКоличества.КоличествоЗастрахованныхСЗВ_6_12 Тогда
						Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
							РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Количество исходных форм СЗВ-6-3 меньше количества исходных форм СЗВ-6-1(2), содержащих ненулевые начисленные взносы!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
					КонецЕсли;
					
					КоличествоПредыдущихПериодовГода = 0;
					ПроверяемыйГод = Год(ОтчетныйПериодАДВ62);
					Для каждого ПрошлыйПериод Из МассивПрошлыхПериодов Цикл
						Если Год(ПрошлыйПериод) = ПроверяемыйГод И ПрошлыйПериод < ОтчетныйПериодАДВ62 Тогда
							КоличествоПредыдущихПериодовГода = КоличествоПредыдущихПериодовГода + 1;
						КонецЕсли;
					КонецЦикла;
					КоличествоПринятыхКомплектовГода = 0;
					Для каждого СтрокаТЧ Из ПачкиДокументов Цикл
						Если Год(СтрокаТЧ.ОтчетныйПериод) = ПроверяемыйГод И СтрокаТЧ.ОтчетныйПериод < ОтчетныйПериодАДВ62 Тогда
							КоличествоПринятыхКомплектовГода = КоличествоПринятыхКомплектовГода + 1;
						КонецЕсли;
					КонецЦикла; 
					
					ВыборкаСверкиЗастрахованных = Результаты[ВсегоРезультатов - 2].Выбрать();
					ВыборкаСверкиВзносов = Результаты[ВсегоРезультатов - 3].Выбрать();
					СтруктураПоиска = Новый Структура("Ссылка, НомерСтрокиСЗВ6_12");
					Пока ВыборкаСверкиЗастрахованных.Следующий() Цикл
						НачалоСообщения = "Для застрахованного " + СокрЛП(ВыборкаСверкиЗастрахованных.ФИОЗастрахованного) + ", указанного в строке " + ВыборкаСверкиЗастрахованных.НомерСтрокиСЗВ6_12 + " пачки СЗВ-6-1(2) № " + ВыборкаСверкиЗастрахованных.НомерПачкиСЗВ6_12 + ": ";
						Если ВыборкаСверкиЗастрахованных.ОтсуствуетФормаСЗВ63 Тогда
							Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
								РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщения + "отсутствуют формы СЗВ-6-3!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
						Иначе 
							НачалоСообщенияНесовпадения = НачалоСообщения + "в пачке СЗВ-6-3 № " + ВыборкаСверкиЗастрахованных.НомерПачкиСЗВ_6_3 + " не совпадает ";
							Если ВыборкаСверкиЗастрахованных.НеСовпадаетСНИЛС Тогда
								Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
									РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщенияНесовпадения + "СНИЛС!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
							КонецЕсли;
							Если ВыборкаСверкиЗастрахованных.НеСовпадаетФамилия Тогда
								Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
									РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщенияНесовпадения + "фамилия!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
							КонецЕсли;
							Если ВыборкаСверкиЗастрахованных.НеСовпадаетИмя Тогда
								Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
									РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщенияНесовпадения + "имя!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
							КонецЕсли;
							Если ВыборкаСверкиЗастрахованных.НеСовпадаетОтчество Тогда
								Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
									РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщенияНесовпадения + "отчество!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
							КонецЕсли;
							
							Если СтруктураПоиска.Ссылка <> ВыборкаСверкиЗастрахованных.Ссылка И СтруктураПоиска.НомерСтрокиСЗВ6_12 <> ВыборкаСверкиЗастрахованных.НомерСтрокиСЗВ6_12 Тогда
								ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаСверкиЗастрахованных);
								// сверка начисленных взносов за текущий отчетный период
								ВыборкаСверкиВзносов.Сбросить();
								Если ВыборкаСверкиВзносов.НайтиСледующий(СтруктураПоиска) Тогда
									Если ВыборкаСверкиВзносов.РасхождениеВоВзносах > 0.03 Тогда
										Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
											РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
										КонецЕсли;
										ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке(НачалоСообщения + " сумма начисленных взносов, указанная в форме СЗВ-6-1,2 (" + Формат(ВыборкаСверкиВзносов.НачисленоВзносов,"ЧДЦ=2; ЧГ=0") + "), отличается от суммы взносов, исчисленной по всем формам СЗВ-6-3 (" + Формат(ВыборкаСверкиВзносов.ВзносовКНачислению,"ЧДЦ=2; ЧГ=0") + "), более чем на 3 копейки!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
									КонецЕсли;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;
					
					// сверка начисленных взносов за год в целом
					ВыборкаСверкиВзносовЗаГод = Результаты[ВсегоРезультатов - 5].Выбрать();
					Пока ВыборкаСверкиВзносовЗаГод.Следующий() Цикл
						Если ВыборкаСверкиВзносовЗаГод.РасхождениеВоВзносах > 0.12 Тогда
							Если РазделСверкиАДВ62иСЗВ63 = Неопределено Тогда
								РазделСверкиАДВ62иСЗВ63 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных форм СЗВ-6-1(2) и сведений о заработке СЗВ-6-3", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Для застрахованного " + СокрЛП(ВыборкаСверкиВзносовЗаГод.ФИОЗастрахованного) + ": сумма начисленных взносов, указанная в формах СЗВ-6-1,2 текущего года по категории ЗЛ " + ВыборкаСверкиВзносовЗаГод.КатегорияЗастрахованныхЛиц + " (" + Формат(ВыборкаСверкиВзносовЗаГод.НачисленоВзносов,"ЧДЦ=2; ЧГ=0") + "), отличается от суммы взносов, исчисленной по всем формам СЗВ-6-3 этой же категории (" + Формат(ВыборкаСверкиВзносовЗаГод.ВзносовКНачислению,"ЧДЦ=2; ЧГ=0") + "), более чем на 12 копеек!", ЕстьОшибкиАДВ62_СЗВ63,,,,РазделСверкиАДВ62иСЗВ63);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
			// Сверка отдельных реквизитов Описи сведений персонифицированного учета (формы АДВ-6-2) и Расчета по начисленным и уплаченным страховым взносам (форма РСВ-1)
			Если Не ЕстьОшибкиСЗВ6 И Не ЕстьОшибкиАДВ62 И Не ЕстьОшибкиРСВ1 Тогда
				
				РазделСверкиРСВ1иАДВ62 = Неопределено;
				
				Если РСВ1Объект.Организация <> ДокументОбъект.Организация Тогда
					РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
					ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Расчет РСВ-1 оформлен на " + ОбщегоНазначенияЗК.ПреобразоватьСтрокуИнтерфейса("другую организацию!"), ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
				Иначе
					
					Если ОтчетныйПериодАДВ62 < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда
						ИННизАДВ62 = ?(СтрДлина(СокрЛП(ИнформацияОПачкеАДВ62.ИНН)) = 10,"00","") + СокрЛП(ИнформацияОПачкеАДВ62.ИНН);
					Иначе
						ИННизАДВ62 = СокрЛП(ИнформацияОПачкеАДВ62.ИНН);
					КонецЕсли;
					Если СокрЛП(ИННизРСВ1) <> ИННизАДВ62 Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и Расчете РСВ-1 не совпадает ИНН!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					Если СокрЛП(КППизРСВ1) <> СокрЛП(ИнформацияОПачкеАДВ62.КПП) Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и Расчете РСВ-1 не совпадает КПП!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					Если СокрЛП(РегНомерПФРизРСВ1) <> СокрЛП(ИнформацияОПачкеАДВ62.РегНомерПФР) Тогда
						Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
							РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
						КонецЕсли;
						ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Описи АДВ-6-2 и Расчете РСВ-1 не совпадает регистрационный номер страхователя в ПФР!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					КонецЕсли;
					
				КонецЕсли;
				
				Если ОтчетныйПериодРСВ1 <> ОтчетныйПериодАДВ62 Тогда
					
					Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
						РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
					КонецЕсли;
					ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Период Расчета РСВ-1 не соответствует отчетному периоду Описи АДВ-6-2", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
					
				Иначе	
					
					Если ОтчетныйПериодАДВ62 < ПроведениеРасчетов.ДатаСниженияТарифовСтраховыхВзносов() Тогда
						
						ДопустимоеРасхождение = ВсегоКатегорийАДВ62;
						СообщениеОРасхожденииУжеВыводилось = Ложь;
						
						Разность = Макс(НачисленоРСВ1НаСтраховую - НачисленоАДВ62НаСтраховую, НачисленоАДВ62НаСтраховую - НачисленоРСВ1НаСтраховую);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В Описи АДВ-6-2 присутствует " + ВсегоКатегорийАДВ62 + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("категория", "категории", "категорий", ВсегоКатегорийАДВ62) + " застрахованных лиц. Допустимое различие показателей Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на страховую часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						Разность = Макс(НачисленоРСВ1НаНакопительную - НачисленоАДВ62НаНакопительную, НачисленоАДВ62НаНакопительную - НачисленоРСВ1НаНакопительную);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В Описи АДВ-6-2 присутствует " + ВсегоКатегорийАДВ62 + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("категория", "категории", "категорий", ВсегоКатегорийАДВ62) + " застрахованных лиц. Допустимое различие показателей Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на накопительную часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						Разность = Макс(УплаченоРСВ1НаСтраховую - УплаченоАДВ62НаСтраховую, УплаченоАДВ62НаСтраховую - УплаченоРСВ1НаСтраховую);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В Описи АДВ-6-2 присутствует " + ВсегоКатегорийАДВ62 + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("категория", "категории", "категорий", ВсегоКатегорийАДВ62) + " застрахованных лиц. Допустимое различие показателей Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на страховую часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						Разность = Макс(УплаченоРСВ1НаНакопительную - УплаченоАДВ62НаНакопительную, УплаченоАДВ62НаНакопительную - УплаченоРСВ1НаНакопительную);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В Описи АДВ-6-2 присутствует " + ВсегоКатегорийАДВ62 + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("категория", "категории", "категорий", ВсегоКатегорийАДВ62) + " застрахованных лиц. Допустимое различие показателей Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на накопительную часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						
					Иначе
						
						ДопустимоеРасхождение = 0.015 * КоличествоЗастрахованных;
						СообщениеОРасхожденииУжеВыводилось = Ложь;
						
						//Значение показателя  «Начислено» в графе «Сумма страховых взносов на страховую часть  трудовой пен-сии», строки «Итого по страхователю»  раздела «Сведения об исходных сведениях» Описи сведений АДВ-6-2, уменьшенное на значения соответствующих показателей строки с кодом категории застрахованного лица «ЧЭС», «ВЖЭС» и «ВПЭС», должно быть  равно (в пределах значения равного 1 копейка, умноженная на количество застрахованных лиц, умноженное на 3) значению показателя  строки 114   «Итого подлежит уплате за последние 3 месяца (сумма строк 111+112+113)» » по графе 3  Раздела 1 Расчета по начисленным и уплаченным страховым взносам РСВ-1 уменьшенного на сумму значений граф 4, 5 и 6 строки 252 раздела 2 Расчета по начисленным и уплаченным страховым взносам (РСВ-1)
						Разность = Макс(НачисленоРСВ1НаСтраховую - (НачисленоАДВ62НаСтраховую - НачисленоЧленамЭкипажейСудовНаСтраховую), НачисленоАДВ62НаСтраховую - НачисленоЧленамЭкипажейСудовНаСтраховую - НачисленоРСВ1НаСтраховую);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей начисленных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на страховую часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаСтраховую, "ЧДЦ=2") + ") и Описи АДВ-6-2 (" + Формат(НачисленоАДВ62НаСтраховую - НачисленоЧленамЭкипажейСудовНаСтраховую, "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						Разность = Макс(НачисленоРСВ1НаНакопительную - (НачисленоАДВ62НаНакопительную - НачисленоЧленамЭкипажейСудовНаНакопительную), НачисленоАДВ62НаНакопительную - НачисленоЧленамЭкипажейСудовНаНакопительную - НачисленоРСВ1НаНакопительную);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей начисленных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на накопительную часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаНакопительную, "ЧДЦ=2") + ") и Описи АДВ-6-2 (" + Формат(НачисленоАДВ62НаНакопительную - НачисленоЧленамЭкипажейСудовНаНакопительную, "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						
						Если НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[Перечисления.КатегорииЗастрахованныхЛицПФР.НР] <> Неопределено Тогда // в расчете РСВ-1 присутствуют разделы с кодами тарифов «01», «52», «53» 
							Если УплаченоРСВ1НаСтраховую + 1 < УплаченоАДВ62НаСтраховую Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на страховую часть пенсии в Описи АДВ-6-2 превысила сумму уплаченных взносов на страховую часть в Расчете РСВ-1!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
						КонецЕсли;
						ДопустимоеРасхождение = 1;
						СообщениеОРасхожденииУжеВыводилось = Ложь;
						Если НачисленоРСВ1НаСтраховуюЗаВесьГодПоТарифам[Перечисления.КатегорииЗастрахованныхЛицПФР.НР] = Неопределено Тогда // в расчете РСВ-1 отсутствуют разделы с кодами тарифов «01», «52», «53» 
							Разность = Макс(УплаченоРСВ1НаСтраховую - УплаченоАДВ62НаСтраховую, УплаченоАДВ62НаСтраховую - УплаченоРСВ1НаСтраховую);
							Если Разность > ДопустимоеРасхождение Тогда
								Если Не СообщениеОРасхожденииУжеВыводилось Тогда
									Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
										РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
									КонецЕсли;
									СообщениеОРасхожденииУжеВыводилось = Истина;
									ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей уплаченных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на страховую часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
						КонецЕсли;
						Разность = Макс(УплаченоРСВ1НаНакопительную - УплаченоАДВ62НаНакопительную, УплаченоАДВ62НаНакопительную - УплаченоРСВ1НаНакопительную);
						Если Разность > ДопустимоеРасхождение Тогда
							Если Не СообщениеОРасхожденииУжеВыводилось Тогда
								Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
									РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
								КонецЕсли;
								СообщениеОРасхожденииУжеВыводилось = Истина;
								ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей уплаченных взносов Расчета РСВ-1 и Описи АДВ-6-2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы уплаченных взносов на накопительную часть пенсии в Расчете РСВ-1 и Описи АДВ-6-2 различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						
						// При наличии в РСВ-1 указанных кодов тарифа обязательно должны быть формы СЗВ с соответствующими кодами категорий застрахованных лиц.
						СтрокаКатегорий = "";
						Для каждого Элемент Из НачисленоРСВ1НаСтраховуюПоТарифам Цикл
							Если ЗначениеЗаполнено(Элемент.Значение) И НачисленоСЗВ6НаСтраховую[Элемент.Ключ] = Неопределено Тогда
								СтрокаКатегорий = СтрокаКатегорий + ?(ПустаяСтрока(СтрокаКатегорий),"",",") + ДочерниеКатегории(Элемент.Ключ, СоответствиеКатегорий)
							КонецЕсли;
						КонецЦикла;
						Если ЗначениеЗаполнено(СтрокаКатегорий) Тогда
							Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
								РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Отсутствуют документы СЗВ-6-1,2 по категориям " + СтрокаКатегорий + ", соответствующим указанным в Расчете РСВ-1 кодам тарифа!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						
						// Сумма страховой части начисленных взносов по указанным категориям застрахованных лиц (по формам СЗВ-6-1, СЗВ-6-2) должна равняться (в пределах значения равного 0,5 копейки, умноженной на количество застрахованных лиц и округленное до целых копеек). сумме начисленных взносов по строкам 250 (графы 4,5,6) для указанных  кодов  тарифа форма РСВ-1
						// Сумма накопительной части начисленных взносов по указанным категориям застрахованных лиц (по формам СЗВ-6-1, СЗВ-6-2) должна равняться (в пределах значения равного 0,5 копейки, умноженной на количество застрахованных лиц и округленное до целых копеек). сумме начисленных взносов по строке 251 (графы 4,5,6) для указанных  кодов  тарифа форма РСВ-1
						ДопустимоеРасхождение = Окр(КоличествоЗастрахованных / 2) / 100;
						СообщениеОРасхожденииУжеВыводилось = Ложь;
						СтрокаКатегорий = "";
						Для каждого Значение Из МассивКатегорий Цикл
							Если НачисленоРСВ1НаСтраховуюПоТарифам[Значение] = Неопределено Тогда
								СтрокаКатегорий = СтрокаКатегорий + ?(ПустаяСтрока(СтрокаКатегорий),"",",") + ДочерниеКатегории(Значение, СоответствиеКатегорий);
								Продолжить;
							КонецЕсли;
							Если Значение = Перечисления.КатегорииЗастрахованныхЛицПФР.ЧЭС Тогда
								Продолжить;
							КонецЕсли;
							Разность = Макс(НачисленоРСВ1НаСтраховуюПоТарифам[Значение] - НачисленоСЗВ6НаСтраховую[Значение], НачисленоСЗВ6НаСтраховую[Значение] - НачисленоРСВ1НаСтраховуюПоТарифам[Значение]);
							Если Разность > ДопустимоеРасхождение Тогда
								Если Не СообщениеОРасхожденииУжеВыводилось Тогда
									Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
										РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
									КонецЕсли;
									СообщениеОРасхожденииУжеВыводилось = Истина;
									ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей Расчета РСВ-1 и документов СЗВ-6-1,2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на страховую часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаСтраховуюПоТарифам[Значение], "ЧДЦ=2") + ") и документах СЗВ-6-1,2 по категориям " + ДочерниеКатегории(Значение, СоответствиеКатегорий) + " (" + Формат(НачисленоСЗВ6НаСтраховую[Значение], "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
							Разность = Макс(НачисленоРСВ1НаНакопительнуюПоТарифам[Значение] - НачисленоСЗВ6НаНакопительную[Значение], НачисленоСЗВ6НаНакопительную[Значение] - НачисленоРСВ1НаНакопительнуюПоТарифам[Значение]);
							Если Разность > ДопустимоеРасхождение Тогда
								Если Не СообщениеОРасхожденииУжеВыводилось Тогда
									Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
										РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
									КонецЕсли;
									СообщениеОРасхожденииУжеВыводилось = Истина;
									ОбработкаКомментариев.ДобавитьСообщение("В РСВ-1 указано " + КоличествоЗастрахованных + " " + ОбщегоНазначенияЗК.ФормаМножественногоЧисла("застрахованное лицо", "застрахованных лица", "застрахованных лиц", КоличествоЗастрахованных) + ". Допустимое различие показателей Расчета РСВ-1 и документов СЗВ-6-1,2 составляет " + ДопустимоеРасхождение + " руб.", Перечисления.ВидыСообщений.Информация,,РазделСверкиРСВ1иАДВ62);
								КонецЕсли;
								ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Суммы начисленных взносов на накопительную часть пенсии в Расчете РСВ-1 (" + Формат(НачисленоРСВ1НаНакопительнуюПоТарифам[Значение], "ЧДЦ=2") + ") и документах СЗВ-6-1,2 по категориям " + ДочерниеКатегории(Значение, СоответствиеКатегорий) + " (" + Формат(НачисленоСЗВ6НаНакопительную[Значение], "ЧДЦ=2") + ") различаются более чем на " + ДопустимоеРасхождение + " руб.!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
							КонецЕсли;
						КонецЦикла;
						Если ЗначениеЗаполнено(СтрокаКатегорий) Тогда
							Если РазделСверкиРСВ1иАДВ62 = Неопределено Тогда
								РазделСверкиРСВ1иАДВ62 = ОбработкаКомментариев.ДобавитьСообщение("Сверка данных Описи АДВ-6-2 и Расчета РСВ-1", Перечисления.ВидыСообщений.Информация);
							КонецЕсли;
							ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("В Расчете РСВ-1 отсутствует Раздел 2 с кодом тарифа, соответствующим категориям " + СтрокаКатегорий + "!", ЕстьОшибкиАДВ62_РСВ1,,,,РазделСверкиРСВ1иАДВ62);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьОшибки = ЕстьОшибкиРСВ1 Или ЕстьЗамечанияРСВ1 Или ЕстьОшибкиАДВ62 Или ЕстьОшибкиСЗВ6 Или ЕстьОшибкиРасчетаСЗВ6 Или ЕстьОшибкиСЗВ63 Или ЕстьОшибкиРСВ1_СЗВ63 Или ЕстьОшибкиАДВ62_СЗВ63 Или ЕстьОшибкиАДВ62_РСВ1;	
	
	Если Не ЕстьОшибки Тогда
		ОбработкаКомментариев.УдалитьСообщения();
		Если СообщатьОбУспехе Тогда
			ОбщегоНазначенияЗК.ВывестиИнформациюОбОшибке("Ошибок не обнаружено!",,,Перечисления.ВидыСообщений.Информация);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОшибки
	
КонецФункции

Функция СЗВ63ЗаГод(ДокументОбъектАДВ62 = Неопределено) Экспорт

	Если ДокументОбъектАДВ62 = Неопределено Тогда
		ДокументОбъектАДВ62 = ДокументОбъектАДВ11
	КонецЕсли;
	ОтчетныйПериодПоиска = ДокументОбъектАДВ62.ОтчетныйПериод;
	
	Если ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериодПоиска) = КонецГода(ОтчетныйПериодПоиска) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОНачисленномЗаработкеСЗВ63.Ссылка
		|ИЗ
		|	Документ.СведенияОНачисленномЗаработкеСЗВ63 КАК СведенияОНачисленномЗаработкеСЗВ63
		|ГДЕ
		|	СведенияОНачисленномЗаработкеСЗВ63.ОписьАДВ62 = &ОписьАДВ62
		|	И (НЕ СведенияОНачисленномЗаработкеСЗВ63.ПометкаУдаления)";
		Запрос.УстановитьПараметр("ОписьАДВ62", ДокументОбъектАДВ62.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
	Иначе 	
		Выборка = Неопределено
	КонецЕсли; 
	
	Возврат Выборка
	
КонецФункции // СЗВ63ЗаГод()

Функция ФормаРасчетаРСВ1(РасчетРСВ1) Экспорт

	ДокументОбъект = РасчетРСВ1.ПолучитьОбъект();
	
	ВыбраннаяФорма = ДокументОбъект.ВыбраннаяФорма;
	
	ОписаниеОтчета = РегламентированнаяОтчетность.РеглОтчеты(ДокументОбъект.ИсточникОтчета);
	Если ОписаниеОтчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Отчет = ОписаниеОтчета.ПолучитьФорму().ЭтотОбъект;
	Отчет.мСохраненныйДок = ДокументОбъект;
	Отчет.мВыбраннаяФорма = ВыбраннаяФорма;
	
	// определяем границы периода построения отчета
	Отчет.мДатаНачалаПериодаОтчета = НачалоДня(ДокументОбъект.ДатаНачала);
	Отчет.мДатаКонцаПериодаОтчета  = КонецДня(ДокументОбъект.ДатаОкончания);
	Отчет.мПериодичность = ДокументОбъект.Периодичность;
	
	Если Отчет.Метаданные().Формы.Найти(СокрП(ВыбраннаяФорма)) <> Неопределено Тогда
		ВыбФормаОтчета = Отчет.ПолучитьФорму(СокрП(ВыбраннаяФорма), , РасчетРСВ1);
	Иначе
		// Если не удалось найти форму с таким названием (могла быть переименована),
		// то по умолчанию выдаем текущую (действующую) форму
		ВыбраннаяФорма = Отчет.мТаблицаФормОтчета[0].ФормаОтчета;
		ВыбФормаОтчета = Отчет.ПолучитьФорму(ВыбраннаяФорма, , РасчетРСВ1);
	КонецЕсли;
	
	ВыбФормаОтчета.Инициализация(Истина);
	
	Возврат ВыбФормаОтчета

КонецФункции // ФормаРасчетаРСВ1()

////////////////////////////////////////////////////////////////////////////////

СоответствиеСсылокИОбъектов = Новый Соответствие;
