////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ДанныеАвтоматическогоЗаполненияПодготовлены(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтролируемыеСделкиОрганизаций.Регистратор
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция УведомлениеЗаполнено(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &Уведомление
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ПодготовитьДанныеАвтоматическогоЗаполнения(Уведомление) Экспорт
	
	МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление);
	
	ТаблицаСделок = ПолучитьТаблицуСделок();
	
	ТаблицаСделок.Очистить();
	ДобавитьСделкиРеализацииТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиРеализацииОтгруженныхТоваров(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияДопРасходов(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиРеализацииУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПолученияУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиАктаОбОказанииУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияТоваровУслугВНТТ(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПередачиОС(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПередачиНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиОтчетаКомитентуОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиОтчетаКомиссионераОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиВозвратаТоваровПоставщику(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиВозвратаТоваровОтПокупателя(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиКорректировкиРеализации(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиКорректировкиПоступления(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиОтчетаКомиссионераОПродажахЗависимымЛицам(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	
	ТаблицаСделок.Колонки.Добавить("Уведомление", Новый ОписаниеТипов("ДокументСсылка.УведомлениеОКонтролируемыхСделках"));
	ТаблицаСделок.ЗаполнитьЗначения(Уведомление, "Уведомление");
	
	КонтролируемыеСделкиНаборЗаписей = РегистрыНакопления.КонтролируемыеСделкиОрганизаций.СоздатьНаборЗаписей();
	КонтролируемыеСделкиНаборЗаписей.Отбор.Регистратор.Значение = Уведомление;

	КонтролируемыеСделкиНаборЗаписей.Загрузить(ТаблицаСделок);
	
	НачатьТранзакцию();
	КонтролируемыеСделкиНаборЗаписей.Записать();
	ОбъектУведомление = Уведомление.ПолучитьОбъект();
	ОбъектУведомление.ДатаФормированияСпискаСделок = ТекущаяДатаСеанса();
	ОбъектУведомление.Записать();
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура СформироватьКонтролируемыеСделкиУведомления(Уведомление) Экспорт
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	
	ТаблицаЛистов1А = ПометитьНаУдалениеКонтролируемыеСделкиУведомления(Уведомление);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияУведомления(Уведомление);
	Запрос.Параметры.Вставить("ВалютаРегламентированногоУчета",
		Константы.ВалютаРегламентированногоУчета.Получить());
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтролируемыеСделки.Организация КАК Организация,
	|	КонтролируемыеСделки.Уведомление КАК УведомлениеОКонтролируемойСделке,
	|	КонтролируемыеСделки.ПериодСделки КАК ДатаСовершенияСделки,
	|	КонтролируемыеСделки.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	КонтролируемыеСделки.Контрагент КАК Контрагент,
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	КонтролируемыеСделки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЕСТЬNULL(Договоры.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|	КОГДА ЕСТЬNULL(КонтролируемыеСделки.Комиссионер, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаСовершенаЧерезКомиссионера,
	|	КонтролируемыеСделки.Комиссионер КАК Комиссионер,
	|	КонтролируемыеСделки.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделки.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.СделкаСНезависимымПосредником КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	КонтролируемыеСделки.СуммаБезНДСВРублях КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Договоры.РасчетыВУсловныхЕдиницах, ЛОЖЬ)
	|			ТОГДА КонтролируемыеСделки.СуммаБезНДСВРублях
	|		ИНАЧЕ КонтролируемыеСделки.СуммаБезНДСВВалютеРасчетов
	|	КОНЕЦ КАК СтоимостьВВалюте,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ КАК Строка135СделкаСРезидентомОЭЗ,
	|	КонтролируемыеСделки.СделкаМорскогоМесторождения КАК Строка136СделкаМорскогоМесторождения,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам КАК Строка137СделкаИнвестиционныйПроект,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС КАК Строка138СделкаОсвобождениеОтНДС,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету КАК Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодНаименованияСделки, """")
	|	КОНЕЦ КАК КодНаименованияСделки,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)) КАК СпособОпределенияЦеныСделки,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.КодУсловийПоставки, """") КАК КодУсловийПоставки,
	|	КонтролируемыеСделки.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемыеСделки.ЕдиницаИзмерения,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки,
	|	КонтролируемыеСделки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки КАК СтранаПроисхожденияПредметаСделки1,
	|	КонтролируемыеСделки.ТипКонтролируемойСделки КАК ТипСделки,
	|	КонтролируемыеСделки.Грузоотправитель КАК Грузоотправитель,
	|	КонтролируемыеСделки.Грузополучатель КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Договоры.РасчетыВУсловныхЕдиницах, ЛОЖЬ)
	|			ТОГДА &ВалютаРегламентированногоУчета
	|		ИНАЧЕ КонтролируемыеСделки.Валюта
	|	КОНЕЦ КАК Валюта,
	|	КонтролируемыеСделки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	КонтролируемыеСделки.Количество КАК Количество,
	|	КонтролируемыеСделки.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	КонтролируемыеСделки.ДатаПроцентнойСтавки КАК ДатаПроцентнойСтавки,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоТНВЭД, """") КАК КодТНВЭД,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоОКП, """") КАК КодОКП,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоОКВЭД, """") КАК КодОКВЭД,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоОКПД2, """") КАК КодОКПД2,
	|	ЕСТЬNULL(ПредметыКонтролируемыхСделок.КодПоОКВЭД2, """") КАК КодОКВЭД2,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки КАК СтранаПроисхожденияПредметаСделки
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО КонтролируемыеСделки.ДоговорКонтрагента = Договоры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОбщейСумме КАК КонтрагентыКонтролируемыеПоОбщейСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоНДПИ КАК КонтрагентыКонтролируемыеПоНДПИ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоСпецРежиму КАК КонтрагентыКонтролируемыеПоСпецРежиму
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоПрибыли КАК КонтрагентыКонтролируемыеПоПрибыли
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОЭЗ КАК КонтрагентыКонтролируемыеПоОЭЗ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоМорскомуМесторождению КАК КонтрагентыКонтролируемыеПоМорскомуМесторождению
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоМорскомуМесторождению.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаМорскогоМесторождения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам КАК КонтрагентыКонтролируемыеПоИнвестиционнымПроектам
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоИнвестиционнымПроектам.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОсвобождениюНДС КАК КонтрагентыКонтролируемыеПоОсвобождениюНДС
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОсвобождениюНДС.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоИнвестиционномуВычету КАК КонтрагентыКонтролируемыеПоИнвестиционномуВычету
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоИнвестиционномуВычету.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ КАК КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|				ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И КонтролируемыеСделки.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И КонтролируемыеСделки.ДоговорКонтрагента = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|		ПО КонтролируемыеСделки.ПредметСделки = ПредметыКонтролируемыхСделок.ПредметСделки
	|ГДЕ
	|	КонтролируемыеСделки.ГоловнойКонтрагент В
	|			(ВЫБРАТЬ
	|				КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент
	|			ИЗ
	|				КонтрагентыПоМинимальнойСумме КАК КонтрагентыПоМинимальнойСумме)
	|	И (КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ИЛИ КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|				И НЕ КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоМорскомуМесторождению.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОсвобождениюНДС.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционномуВычету.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ГоловнойКонтрагент,
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ПредметСделки,
	|	Строка121СтороныВзаимозависимыПоКодексу,
	|	Строка122СделкаВОбластиВнешнейТорговли,
	|	Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	Строка124СделкаСНезависимымПосредником,
	|	Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	Строка132СделкаСПлательщикомНДПИ,
	|	Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	Строка135СделкаСРезидентомОЭЗ,
	|	Строка136СделкаМорскогоМесторождения,
	|	Строка137СделкаИнвестиционныйПроект,
	|	Строка138СделкаОсвобождениеОтНДС,
	|	Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль,
	|	КодНаименованияСделки,
	|	ТипВзаимозависимости,
	|	ТипПредметаСделки,
	|	НаименованиеПредметаСделки,
	|	ТипСделки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	КлючСделки = Новый Структура("Контрагент, ДоговорКонтрагента, СделкаСовершенаЧерезКомиссионера, Комиссионер,
		|ПредметСделки, Строка121СтороныВзаимозависимыПоКодексу, Строка122СделкаВОбластиВнешнейТорговли,
		|Строка123СделкаСКонтрагентомСЛьготнымНалогообложением, Строка124СделкаСНезависимымПосредником,
		|Строка131СуммаДоходовПоСделкамПревышаетПредел, Строка132СделкаСПлательщикомНДПИ,
		|Строка133СделкаСКонтрагентомНаСпецрежимах, Строка134СделкаСПлательщикомНалогаНаПрибыль,
		|Строка135СделкаСРезидентомОЭЗ, Строка136СделкаМорскогоМесторождения, Строка137СделкаИнвестиционныйПроект,
		|Строка138СделкаОсвобождениеОтНДС, ТипВзаимозависимости, ТипПредметаСделки, НаименованиеПредметаСделки,
		|КодНаименованияСделки, ТипСделки, Валюта");
	
	ВерсияУведомления = Документы.УведомлениеОКонтролируемыхСделках.ВерсияУведомления(Уведомление);
	
	СтруктураКлючевыхПолей = Новый Структура();
	СтруктураКлючевыхПолей.Вставить("РасчетныйДокумент");
	СтрокаСверткиТаблицыСделок = "";
	Для Каждого РеквизитСделки Из Метаданные.Документы.КонтролируемаяСделка.ТабличныеЧасти.Сделки.Реквизиты Цикл
		Если РеквизитСделки.Имя <> "Количество" И РеквизитСделки.Имя <> "Стоимость" Тогда
			СтруктураКлючевыхПолей.Вставить(РеквизитСделки.Имя);
			СтрокаСверткиТаблицыСделок = СтрокаСверткиТаблицыСделок 
				+ ?(СтрокаСверткиТаблицыСделок = "","",", ") + РеквизитСделки.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "ГруппироватьСделкиСОдинаковойЦеной") Тогда
		СтруктураКлючевыхПолей.Удалить("ДатаСовершенияСделки");
		СтруктураКлючевыхПолей.Удалить("РасчетныйДокумент");
		Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
			СтруктураКлючевыхПолей.Удалить("ПроцентнаяСтавка");
		КонецЕсли;
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций;
	
	ТаблицаСделокЛиста1А = Документы.КонтролируемаяСделка.ПустаяСсылка().Сделки.Выгрузить();
	ТаблицаСделокЛиста1А.Колонки.Добавить("СтоимостьДляРасчетаЦены", МетаданныеРегистра.Ресурсы.СуммаНДСВВалютеРасчетов.Тип);
	ТаблицаСделокЛиста1А.Колонки.Добавить("РасчетныйДокумент", МетаданныеРегистра.Измерения.РасчетныйДокумент.Тип);
	ТекущийНомерЛиста1А = 1;
	
	ИсключенияДляЗаполненияЛиста1А = ИсключенияЗаполненияЛиста1А(ВерсияУведомления);
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		ПолеОпределенияСтоимостиДляРасчетаЦены = "Стоимость";
	Иначе
		ПолеОпределенияСтоимостиДляРасчетаЦены = "СтоимостьВВалюте";
	КонецЕсли;
	
	ДокументСделки = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если ДокументСделки = Неопределено ИЛИ
			НЕ КлючСделкиСовпадает(Выборка, КлючСделки) Тогда
			
			ЗаполнитьЗначенияСвойств(КлючСделки, Выборка);
			
			Если ДокументСделки <> Неопределено Тогда
				ЗаполнитьТаблицуСделокЛиста1А(ДокументСделки, ТаблицаСделокЛиста1А, СтрокаСверткиТаблицыСделок, СтруктураКлючевыхПолей);
				ДокументСделки.Записать();
				ТаблицаСделокЛиста1А.Очистить();
				ДокументСделки = Неопределено;
				ТекущийНомерЛиста1А = ТекущийНомерЛиста1А + 1;
			КонецЕсли;
			
			Отбор = Новый Структура("Контрагент, ДоговорКонтрагента, ПредметСделки, Используется",
				КлючСделки.Контрагент, КлючСделки.ДоговорКонтрагента, КлючСделки.ПредметСделки, Ложь);
			ДокументыСделок = ТаблицаЛистов1А.НайтиСтроки(Отбор);
			Если ДокументыСделок.Количество()>0 Тогда
				Для Каждого СтрокаДокументовСделок Из ДокументыСделок Цикл
					Если КлючСделкиСовпадает(СтрокаДокументовСделок, КлючСделки) Тогда
						ДокументСделки = СтрокаДокументовСделок.Сделка.ПолучитьОбъект();
						ДокументСделки.ПометкаУдаления = Ложь;
						СтрокаДокументовСделок.Используется = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ДокументСделки = Неопределено Тогда
				ДокументСделки = Документы.КонтролируемаяСделка.СоздатьДокумент();
				ДокументСделки.Дата = ТекущаяДатаСеанса();
			КонецЕсли;
			
			ДокументСделки.Номер = ТекущийНомерЛиста1А;
			ЗаполнитьЗначенияСвойств(ДокументСделки, Выборка, , ИсключенияДляЗаполненияЛиста1А);
			
			СписокКодовСтороныСделки = КонтролируемыеСделкиПовтИсп.ПолучитьСоответствиеКодовСтороныСделки().Получить(Выборка.КодНаименованияСделки);
			Если СписокКодовСтороныСделки.Количество() = 1 Тогда
				ДокументСделки.КодСтороныСделки = СписокКодовСтороныСделки[0].Значение;
			ИначеЕсли СписокКодовСтороныСделки.Количество() > 1 Тогда
				ДокументСделки.КодСтороныСделки = ?(Выборка.ТипСделки = Перечисления.ТипыКонтролируемыхСделок.ПолученДоход, СписокКодовСтороныСделки[0].Значение, СписокКодовСтороныСделки[1].Значение);
			КонецЕсли;
			ДокументСделки.КомментарийКПункту7 = "";
			ДокументСделки.СуммаДоходов = 0;
			ДокументСделки.СуммаДоходовРегулируемых = 0;
			ДокументСделки.СуммаРасходов = 0;
			ДокументСделки.СуммаРасходовРегулируемых = 0;
			
			ДокументСделки.Сделки.Очистить();
			
		КонецЕсли;
		
		НоваяСделка = ТаблицаСделокЛиста1А.Добавить();
		ИсключенияЗаполненияЛиста1Б = ИсключенияЗаполненияЛиста1Б(ВерсияУведомления, Выборка.ТипПредметаСделки);
		ЗаполнитьЗначенияСвойств(НоваяСделка, Выборка, , ИсключенияЗаполненияЛиста1Б);
		ЗаполнитьДатуСделкиДолговыхОбязательств(НоваяСделка, ВерсияУведомления, Выборка.ТипПредметаСделки, Выборка.ДатаПроцентнойСтавки);
		НоваяСделка.СтоимостьДляРасчетаЦены = Выборка[ПолеОпределенияСтоимостиДляРасчетаЦены];
		ЗаполнитьАдресаСделки(НоваяСделка, Выборка.Грузоотправитель, Выборка.Грузополучатель, ВерсияУведомления);
	КонецЦикла;
	
	Если ДокументСделки <> Неопределено Тогда
		ЗаполнитьТаблицуСделокЛиста1А(ДокументСделки, ТаблицаСделокЛиста1А, СтрокаСверткиТаблицыСделок, СтруктураКлючевыхПолей);
		ДокументСделки.Записать();
		ДокументСделки = Неопределено;
	КонецЕсли;
	
	ОбъектУведомление = Уведомление.ПолучитьОбъект();
	ОбъектУведомление.ДатаЗаполненияУведомления = ТекущаяДатаСеанса();
	ОбъектУведомление.Записать();
	
КонецПроцедуры

Функция ПолучитьВременныеТаблицыДляЗаполненияУведомления(Уведомление) Экспорт
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ОтчетныйГод", ПараметрыУведомления.ОтчетныйГод);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаОбщейСуммыСделок,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокНДПИ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокСпецРежим,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокПрибыль,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокОЭЗ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаДеятельностьМорскогоМесторождения)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаНовоеМорскоеМесторождение,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаУчастникиРегиональногоИнвестиционногоПроекта)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаРегиональныйИнвестиционныйПроект,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсвобождениеНДС)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаОсвобождениеНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаИнвестиционныйВычет)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаИнвестиционныйВычет,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокИностранныхНезависимыхЛиц,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МинимальнаяГраницаДляВключенияСделокВУведомление
	|ИЗ
	|	РегистрСведений.ГраницыКонтролируемостиСделок.СрезПоследних(КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД), ) КАК ГраницыКонтролируемостиСделокСрезПоследних";
	
	ГраницыКонтролируемостиСделок = Новый Структура();
	ГраницыКонтролируемостиСделок.Вставить("ГраницаОбщейСуммыСделок", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокНДПИ", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокСпецРежим", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокПрибыль", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокОЭЗ", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаНовоеМорскоеМесторождение", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаРегиональныйИнвестиционныйПроект", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаОсвобождениеНДС", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаИнвестиционныйВычет", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокИностранныхНезависимыхЛиц", 0);
	ГраницыКонтролируемостиСделок.Вставить("МинимальнаяГраницаДляВключенияСделокВУведомление", 0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ГраницыКонтролируемостиСделок, Выборка);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление);
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Параметры.Вставить("Организация", ПараметрыУведомления.Организация);
	Запрос.Параметры.Вставить("ОтчетныйГод", ПараметрыУведомления.ОтчетныйГод);
	Запрос.Параметры.Вставить("ГраницаОбщейСуммыСделок", ГраницыКонтролируемостиСделок.ГраницаОбщейСуммыСделок);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокНДПИ",  ГраницыКонтролируемостиСделок.ГраницаСуммыСделокНДПИ);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокСпецРежим", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокСпецРежим);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокПрибыль", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокПрибыль);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокОЭЗ", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокОЭЗ);
	Запрос.Параметры.Вставить("ГраницаНовоеМорскоеМесторождение", ГраницыКонтролируемостиСделок.ГраницаНовоеМорскоеМесторождение);
	Запрос.Параметры.Вставить("ГраницаРегиональныйИнвестиционныйПроект", ГраницыКонтролируемостиСделок.ГраницаРегиональныйИнвестиционныйПроект);
	Запрос.Параметры.Вставить("ГраницаОсвобождениеНДС", ГраницыКонтролируемостиСделок.ГраницаОсвобождениеНДС);
	Запрос.Параметры.Вставить("ГраницаИнвестиционныйВычет", ГраницыКонтролируемостиСделок.ГраницаИнвестиционныйВычет);
	Запрос.Параметры.Вставить("ГраницаНовоеМорскоеМесторождение", ГраницыКонтролируемостиСделок.ГраницаНовоеМорскоеМесторождение);
	Запрос.Параметры.Вставить("ГраницаРегиональныйИнвестиционныйПроект", ГраницыКонтролируемостиСделок.ГраницаРегиональныйИнвестиционныйПроект);
	Запрос.Параметры.Вставить("ГраницаОсвобождениеНДС", ГраницыКонтролируемостиСделок.ГраницаОсвобождениеНДС);
	Запрос.Параметры.Вставить("ГраницаИнвестиционныйВычет", ГраницыКонтролируемостиСделок.ГраницаИнвестиционныйВычет);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокИностранныхНезависимыхЛиц", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокИностранныхНезависимыхЛиц);
	Запрос.Параметры.Вставить("МинимальнаяГраницаДляВключенияСделокВУведомление", ГраницыКонтролируемостиСделок.МинимальнаяГраницаДляВключенияСделокВУведомление);
	Запрос.Параметры.Вставить("УчитыватьСпецрежимДляПосредников", ?(ПараметрыУведомления.ОтчетныйГод < Дата(2014,1,1), Ложь, Истина));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ОтчетныйГод КАК Период,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация КАК Организация,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения
	|ПОМЕСТИТЬ УчетнаяПолитика
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ОтчетныйГод, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Период,
	|	УчетнаяПолитикаОрганизаций.Организация,
	|	УчетнаяПолитикаОрганизаций.СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Организация = &Организация
	|	И УчетнаяПолитикаОрганизаций.Период > &ОтчетныйГод
	|	И УчетнаяПолитикаОрганизаций.Период <= КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитика.Период КАК НачалоПериода,
	|	УчетнаяПолитика.Организация КАК Организация,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(УчетнаяПолитика1.Период, КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД))), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				И Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПлательщикНалогаНаПрибыль
	|ПОМЕСТИТЬ УчетнаяПолитикаПоПериодам
	|ИЗ
	|	УчетнаяПолитика КАК УчетнаяПолитика
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитика КАК УчетнаяПолитика1
	|		ПО УчетнаяПолитика.Организация = УчетнаяПолитика1.Организация
	|			И УчетнаяПолитика.Период < УчетнаяПолитика1.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО УчетнаяПолитика.Организация = Организации.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетнаяПолитика.Организация,
	|	УчетнаяПолитика.Период,
	|	УчетнаяПолитика.СистемаНалогообложения,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				И Организации.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НачалоПериода,
	|	ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ОтчетныйГод КАК Период,
	|	НастройкиУчетаНДССрезПоследних.Организация КАК Организация,
	|	НастройкиУчетаНДССрезПоследних.ПрименяетсяОсвобождениеОтУплатыНДС КАК ОсвобожденОтУплатыНДС
	|ПОМЕСТИТЬ НастройкиСистемыНалогообложенияНДС
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ОтчетныйГод, Организация = &Организация) КАК НастройкиУчетаНДССрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НастройкиУчетаНДС.Период,
	|	НастройкиУчетаНДС.Организация,
	|	НастройкиУчетаНДС.ПрименяетсяОсвобождениеОтУплатыНДС
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК НастройкиУчетаНДС
	|ГДЕ
	|	НастройкиУчетаНДС.Организация = &Организация
	|	И НастройкиУчетаНДС.Период > &ОтчетныйГод
	|	И НастройкиУчетаНДС.Период <= КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиСистемыНалогообложенияНДС.Период КАК НачалоПериода,
	|	НастройкиСистемыНалогообложенияНДС.Организация КАК Организация,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(НастройкиСистемыНалогообложенияНДС1.Период, КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД))), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	НастройкиСистемыНалогообложенияНДС.ОсвобожденОтУплатыНДС КАК ОсвобожденОтУплатыНДС
	|ПОМЕСТИТЬ УчетнаяПолитикаНДСПоПериодам
	|ИЗ
	|	НастройкиСистемыНалогообложенияНДС КАК НастройкиСистемыНалогообложенияНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиСистемыНалогообложенияНДС КАК НастройкиСистемыНалогообложенияНДС1
	|		ПО НастройкиСистемыНалогообложенияНДС.Организация = НастройкиСистемыНалогообложенияНДС1.Организация
	|			И НастройкиСистемыНалогообложенияНДС.Период < НастройкиСистемыНалогообложенияНДС1.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиСистемыНалогообложенияНДС.Организация,
	|	НастройкиСистемыНалогообложенияНДС.Период,
	|	НастройкиСистемыНалогообложенияНДС.ОсвобожденОтУплатыНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НачалоПериода,
	|	ОкончаниеПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НастройкиСистемыНалогообложенияНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ УчетнаяПолитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеКонтрагенты.Контрагент КАК Контрагент,
	|	КонтролируемыеКонтрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)) КАК СтранаРегистрации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчастникиКонтролируемыхСделок.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|				ИЛИ ЕСТЬNULL(УчастникиКонтролируемыхСделок.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентЗарегистрированВРФ,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ УчастникиКонтролируемыхСделок
	|ИЗ
	|	КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО (УчастникиКонтролируемыхСделок.Контрагент = КонтролируемыеКонтрагенты.Контрагент)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УведомлениеОКонтролируемыхСделках.Организация КАК Организация,
	|	УведомлениеОКонтролируемыхСделках.Ссылка КАК Уведомление,
	|	КонтролируемыеСделкиОрганизаций.Период КАК ПериодСделки,
	|	УведомлениеОКонтролируемыхСделках.ОтчетныйГод КАК ОтчетныйГод,
	|	КонтролируемыеСделкиОрганизаций.Контрагент КАК Контрагент,
	|	УчастникиКонтролируемыхСделок.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	КонтролируемыеСделкиОрганизаций.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КонтролируемыеСделкиОрганизаций.Комиссионер КАК Комиссионер,
	|	КонтролируемыеСделкиОрганизаций.РасчетныйДокумент КАК РасчетныйДокумент,
	|	КонтролируемыеСделкиОрганизаций.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделкиОрганизаций.СуммаБезНДСВРублях КАК СуммаБезНДСВРублях,
	|	КонтролируемыеСделкиОрганизаций.СуммаБезНДСВВалютеРасчетов КАК СуммаБезНДСВВалютеРасчетов,
	|	УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаПоПериодам.ПлательщикНалогаНаПрибыль <> ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомНалогаНаПрибыль, ЛОЖЬ)
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредметыКонтролируемыхСделок.ЯвляетсяТоваромМировойБиржевойТорговли, ЛОЖЬ)
	|				И НЕ УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	УчастникиКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.ЯвляетсяПлательщикомНДПИ, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомНДПИ, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				И ЕСТЬNULL(ПредметыКонтролируемыхСделок.ОблагаетсяНДПИПоПроцентнойСтавке, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоНДПИ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.ЗарегистрированВОЭЗ, ЛОЖЬ) <> ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЗарегистрированВОЭЗ, ЛОЖЬ)
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемыеСделкиОрганизаций.ОперацияОблагаетсяЕНВД, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомЕНВД, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход)
	|					И ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СделкаОблагаетсяЕНВД, ЛОЖЬ)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВзаимозависимыеЛицаПоПериодам.НевзаимозависимыйПосредник
	|							И НЕ &УчитыватьСпецрежимДляПосредников
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ЯвляетсяПлательщикомЕСХН, ЛОЖЬ)
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВзаимозависимыеЛицаПоПериодам.НевзаимозависимыйПосредник
	|							И НЕ &УчитыватьСпецрежимДляПосредников
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаСПлательщикомЕСХН,
	|	ЕСТЬNULL(ДоговорыУчастниковКонтролируемыхСделок.СделкаОтноситсяКДеятельностиНовогоМорскогоМесторождения, ЛОЖЬ) КАК СделкаМорскогоМесторождения,
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта, ЛОЖЬ))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоИнвестиционнымПроектам,
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(УчетнаяПолитикаНДСПоПериодам.ОсвобожденОтУплатыНДС, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ОсвобожденОтУплатыНДС, ЛОЖЬ))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоОсвобождениюНДС,
	|	ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль, ЛОЖЬ) КАК СделкаКонтролируетсяПоИнвестиционномуВычету,
	|	ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) КАК ТипВзаимозависимости,
	|	КонтролируемыеСделкиОрганизаций.ТипПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.ЕдиницаИзмерения,
	|	КонтролируемыеСделкиОрганизаций.СтранаПроисхожденияПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки,
	|	КонтролируемыеСделкиОрганизаций.Грузоотправитель,
	|	КонтролируемыеСделкиОрганизаций.Грузополучатель,
	|	КонтролируемыеСделкиОрганизаций.НаименованиеПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.Валюта,
	|	КонтролируемыеСделкиОрганизаций.Количество,
	|	КонтролируемыеСделкиОрганизаций.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	КонтролируемыеСделкиОрганизаций.ДатаПроцентнойСтавки КАК ДатаПроцентнойСтавки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаСНезависимымПосредником
	|ПОМЕСТИТЬ КонтролируемыеСделки
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОКонтролируемыхСделках КАК УведомлениеОКонтролируемыхСделках
	|		ПО КонтролируемыеСделкиОрганизаций.Уведомление = УведомлениеОКонтролируемыхСделках.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаПоПериодам КАК УчетнаяПолитикаПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = УчетнаяПолитикаПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Период >= УчетнаяПолитикаПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= УчетнаяПолитикаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетнаяПолитикаНДСПоПериодам КАК УчетнаяПолитикаНДСПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = УчетнаяПолитикаНДСПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Период >= УчетнаяПолитикаНДСПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= УчетнаяПолитикаНДСПоПериодам.ОкончаниеПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО КонтролируемыеСделкиОрганизаций.Контрагент = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = ВзаимозависимыеЛицаПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Контрагент = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|			И КонтролируемыеСделкиОрганизаций.Период >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам КАК СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Период >= СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И КонтролируемыеСделкиОрганизаций.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И КонтролируемыеСделкиОрганизаций.ДоговорКонтрагента = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|		ПО КонтролируемыеСделкиОрганизаций.ПредметСделки = ПредметыКонтролируемыхСделок.ПредметСделки
	|ГДЕ
	|	УведомлениеОКонтролируемыхСделках.Ссылка = &Уведомление
	|	И КонтролируемыеСделкиОрганизаций.Уведомление = &Уведомление
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	ДоговорКонтрагента,
	|	ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыПоМинимальнойСумме
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) > &МинимальнаяГраницаДляВключенияСделокВУведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОбщейСумме
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаОбщейСуммыСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоНДПИ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокНДПИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоСпецРежиму
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|			ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокСпецРежим
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоПрибыли
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокПрибыль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОЭЗ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокОЭЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоМорскомуМесторождению
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаМорскогоМесторождения
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаНовоеМорскоеМесторождение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаРегиональныйИнвестиционныйПроект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОсвобождениюНДС
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаОсвобождениеНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоИнвестиционномуВычету
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаИнвестиционныйВычет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|			ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокИностранныхНезависимыхЛиц";
	
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоКонтролируемымСделкам_2012() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонтролируемаяСделка.Номер КАК НомерЛиста1А,
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке КАК УведомлениеОКонтролируемойСделке,
	|	КонтролируемаяСделка.Ссылка КАК Сделка,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимыПоКодексу)
	|			ТОГДА ""1""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.СамостоятельноеПризнаниеВзаимозависимости)
	|			ТОГДА ""2""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимостьПоРешениюСуда)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка100Взаимозависимость,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка121СтороныВзаимозависимыПоКодексу
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка122СделкаВОбластиВнешнейТорговли
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка123СделкаСКонтрагентомСЛьготнымНалогообложением
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка124СделкаСНезависимымПосредником
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка131СуммаДоходовПоСделкамПревышаетПредел
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка132СделкаСПлательщикомНДПИ
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка133СделкаСКонтрагентомНаСпецрежимах
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка134СделкаСПлательщикомНалогаНаПрибыль
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка135СделкаСРезидентомОЭЗ
	|				ИЛИ КонтролируемаяСделка.Строка138СделкаОсвобождениеОтНДС
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка135СделкаСРезидентомОЭЗ,
	|	КонтролируемаяСделка.КодНаименованияСделки КАК Строка210КодНаименованияСделки,
	|	КонтролируемаяСделка.КодСтороныСделки КАК Строка211КодСтороныСделки,
	|	КонтролируемаяСделка.СпособОпределенияЦеныСделки КАК СпособОпределенияЦеныСделки,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.СпособОпределенияЦеныСделки.ЦенаЯвляетсяРегулируемой
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка220ПризнакОпределенияЦеныСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКПризнакуОпределенияЦеныСделки, """") КАК Строка220_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки, """") = """"
	|			ТОГДА ""0""
	|		ИНАЧЕ КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки
	|	КОНЕЦ КАК Строка230КодОпределенияЦены,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийККодуОпределенияЦеныСделки, """") КАК Строка230_1Комментарий,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодМетодаЦенообразования, """") КАК Строка240КодМетодовЦенообразования,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКМетодуЦенообразования, """") КАК Строка240_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации251, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка251,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации252, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка252,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации253, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка253,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации254, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка254,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации255, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка255,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации256, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка256,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации257, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка257,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации258, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка258,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации259, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка259,
	|	2 КАК Строка260КоличествоУчастниковСделки,
	|	КонтролируемаяСделка.КомментарийКПункту7 КАК Строка260_1Комментарий,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходов КАК ЧИСЛО(15, 0)) КАК Строка300СуммаДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка301СуммаРегулируемыхДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходов КАК ЧИСЛО(15, 0)) КАК Строка310СуммаРасходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка311СуммаРегулируемыхРасходов,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОбособленноеПодразделение
	|			ТОГДА Контрагенты.ГоловнойКонтрагент
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	Контрагенты.ЮрФизЛицо КАК ТипКонтрагента,
	|	КонтролируемаяСделка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КонтролируемаяСделка.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемаяСделка.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемаяСделка.КодТНВЭД КАК КодТНВЭД,
	|	КонтролируемаяСделка.КодОКП КАК КодОКП,
	|	КонтролируемаяСделка.КодОКВЭД КАК КодОКВЭД,
	|	КонтролируемаяСделка.КодОКПД2 КАК КодОКПД2,
	|	КонтролируемаяСделка.КодОКВЭД2 КАК КодОКВЭД2,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|				И КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|		ИНАЧЕ КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки
	|	КОНЕЦ КАК СтранаПроисхожденияПредметаСделки,
	|	ЛОЖЬ КАК СделкаСовершенаЧерезКомиссионера,
	|	""0"" КАК СделкаСовАгент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ПустаяСсылка) КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1А
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтролируемаяСделка.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &УведомлениеОКонтролируемойСделке
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемаяСделкаСделки.Ссылка КАК Сделка,
	|	Листы1А.НомерЛиста1А КАК НомерЛиста1А,
	|	КонтролируемаяСделкаСделки.НомерСтроки КАК НомерСтроки,
	|	Листы1А.ТипПредметаСделки КАК ТипПредметаСделки,
	|	ВЫБОР
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА 1
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|			ТОГДА 2
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|				ИЛИ Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|			ТОГДА 3
	|	КОНЕЦ КАК Строка020ТипПредмета,
	|	Листы1А.НаименованиеПредметаСделки КАК Строка030НаименованиеПредмета,
	|	Листы1А.КодТНВЭД КАК Строка040КодПоТНВЭД,
	|	Листы1А.КодОКП КАК Строка043КодПоОКП,
	|	Листы1А.КодОКВЭД КАК Строка045КодОКВЭД,
	|	Листы1А.КодОКПД2 КАК Строка043КодПоОКПД2,
	|	Листы1А.КодОКВЭД2 КАК Строка045КодОКВЭД2,
	|	Листы1А.Контрагент КАК Контрагент,
	|	Листы1А.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Листы1А.ДоговорКонтрагента.Номер КАК Строка060НомерДоговора,
	|	Листы1А.ДоговорКонтрагента.Дата КАК Строка065ДатаДоговора,
	|	ЕСТЬNULL(Листы1А.СтранаПроисхожденияПредметаСделки.Код, """") КАК Строка070КодСтраныПроисхождения,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаОтправкиТовара.Код, """") КАК Строка080КодСтраныОтправки,
	|	КонтролируемаяСделкаСделки.КодРегионаОтправкиТовара КАК Строка080КодРегионаОтправки,
	|	КонтролируемаяСделкаСделки.ГородОтправкиТовара КАК Строка080ГородОтправки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктОтправкиТовара КАК Строка080НаселенныйПунктОтправки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаСовершенияСделки.Код, """") КАК Строка090КодСтраныСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодРегионаСовершенияСделки КАК Строка090КодРегионаСовершенияСделки,
	|	КонтролируемаяСделкаСделки.ГородСовершенияСделки КАК Строка090ГородСовершенияСделки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктСовершенияСделки КАК Строка090НаселенныйПунктСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодУсловийПоставки КАК Строка100КодУсловийПоставки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.ЕдиницаИзмерения.Код, """") КАК Строка110КодЕдиницыИзмерения,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделкаСделки.Количество > 0
	|				И КонтролируемаяСделкаСделки.Количество < 1
	|			ТОГДА 1
	|		ИНАЧЕ ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Количество КАК ЧИСЛО(15, 0))
	|	КОНЕЦ КАК Строка120Количество,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Цена КАК ЧИСЛО(15, 0)) КАК Строка130Цена,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Стоимость КАК ЧИСЛО(15, 0)) КАК Строка140Стоимость,
	|	КонтролируемаяСделкаСделки.ДатаСовершенияСделки КАК Строка150ДатаСовершения,
	|	Листы1А.ТипКонтрагента КАК ТипКонтрагента,
	|	Листы1А.СделкаСовершенаЧерезКомиссионера КАК СделкаСовершенаЧерезКомиссионера,
	|	Листы1А.Комиссионер КАК Комиссионер,
	|	Листы1А.ТипКомиссионера КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1Б
	|ИЗ
	|	Документ.КонтролируемаяСделка.Сделки КАК КонтролируемаяСделкаСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Листы1А КАК Листы1А
	|		ПО КонтролируемаяСделкаСделки.Ссылка = Листы1А.Сделка
	|ГДЕ
	|	КонтролируемаяСделкаСделки.Ссылка В
	|			(ВЫБРАТЬ
	|				Листы1А.Сделка
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ВЫБОР
	|		КОГДА УчастникиКонтролируемыхСделок.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Строка020ТипОрганизации,
	|	ВЫБОР
	|		КОГДА УчастникиКонтролируемыхСделок.СтранаРегистрации ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ УчастникиКонтролируемыхСделок.СтранаРегистрации.Код
	|	КОНЕЦ КАК Строка030КакКодСтраныРегистрации,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК Строка040Наименование,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.НаименованиеВЛатинскойТранскрипции, """") КАК Строка040НаименованиеЛат,
	|	Контрагенты.ИНН КАК Строка050ИНН,
	|	Контрагенты.КПП КАК Строка060КПП,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.РегистрационныйНомерВСтранеРегистрации, """") КАК Строка070РегНомерВСтрокеРегистрации,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодНалогоплательщикаВСтранеРегистрации, """") КАК Строка080КодНалогВСтранеРегистрации,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Строка090АдресИностраннойОрганизации
	|ПОМЕСТИТЬ Раздел2
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО Контрагенты.Ссылка = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО Контрагенты.Ссылка = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	Контрагенты.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Листы1А.Контрагент
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодВидаДеятельностиФизическогоЛица, """") КАК Строка020КодВидаДеятельности,
	|	Контрагенты.ИНН КАК Строка030ИНН,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаРождения,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.МестоРождения, """") КАК МестоРождения,
	|	ГражданствоФизЛиц.Страна КАК ГражданствоФизЛицСтрана,
	|	КонтактнаяИнформация.Поле1 КАК КонтактнаяИнформацияПоле1,
	|	КонтактнаяИнформация.Поле2 КАК КонтактнаяИнформацияПоле2,
	|	КонтактнаяИнформация.Поле3 КАК КонтактнаяИнформацияПоле3,
	|	КонтактнаяИнформация.Поле4 КАК КонтактнаяИнформацияПоле4,
	|	КонтактнаяИнформация.Поле5 КАК КонтактнаяИнформацияПоле5,
	|	КонтактнаяИнформация.Поле6 КАК КонтактнаяИнформацияПоле6,
	|	КонтактнаяИнформация.Поле7 КАК КонтактнаяИнформацияПоле7,
	|	КонтактнаяИнформация.Поле8 КАК КонтактнаяИнформацияПоле8,
	|	КонтактнаяИнформация.Поле9 КАК КонтактнаяИнформацияПоле9,
	|	КонтактнаяИнформация.Поле10 КАК КонтактнаяИнформацияПоле10,
	|	КонтактнаяИнформация.Представление КАК КонтактнаяИнформацияПредставление,
	|	КонтактнаяИнформацияЗаРФ.Поле1 КАК КонтактнаяИнформацияЗаРФПоле1,
	|	КонтактнаяИнформацияЗаРФ.Представление КАК КонтактнаяИнформацияЗаРФПредставление,
	|	ПаспортныеДанныеФизЛиц.ДокументВид,
	|	ПаспортныеДанныеФизЛиц.ДокументСерия,
	|	ПаспортныеДанныеФизЛиц.ДокументНомер,
	|	ПаспортныеДанныеФизЛиц.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи,
	|	ФИОФизЛиц.Фамилия КАК Фамилия,
	|	ФИОФизЛиц.Имя КАК Имя,
	|	ФИОФизЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ Раздел3
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО Контрагенты.Ссылка = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ГражданствоФизЛиц.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформация.Объект)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияЗаРФ
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформацияЗаРФ.Объект)
	|			И (КонтактнаяИнформацияЗаРФ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияЗаРФ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнострАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ПаспортныеДанныеФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ПаспортныеДанныеФизЛиц.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ФИОФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ФИОФизЛиц.ФизЛицо)
	|ГДЕ
	|	Контрагенты.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Листы1А.Контрагент
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)";
	
	Возврат(ТекстЗапроса);
	
КонецФункции

Функция ПолучитьТекстЗапросаПоКонтролируемымСделкам_2018() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонтролируемаяСделка.Номер КАК НомерЛиста1А,
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке КАК УведомлениеОКонтролируемойСделке,
	|	КонтролируемаяСделка.Ссылка КАК Сделка,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимыПоКодексу)
	|			ТОГДА ""1""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.СамостоятельноеПризнаниеВзаимозависимости)
	|			ТОГДА ""2""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимостьПоРешениюСуда)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка100Взаимозависимость,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка121СтороныВзаимозависимыПоКодексу
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка122СделкаВОбластиВнешнейТорговли
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка123СделкаСКонтрагентомСЛьготнымНалогообложением
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка124СделкаСНезависимымПосредником
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка131СуммаДоходовПоСделкамПревышаетПредел
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка132СделкаСПлательщикомНДПИ
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка133СделкаСКонтрагентомНаСпецрежимах
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка134СделкаСПлательщикомНалогаНаПрибыль
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка135СделкаСРезидентомОЭЗ
	|				ИЛИ КонтролируемаяСделка.Строка138СделкаОсвобождениеОтНДС
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка135СделкаСРезидентомОЭЗ,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка136СделкаМорскогоМесторождения
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка136СделкаМорскогоМесторождения,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка137СделкаИнвестиционныйПроект
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка137СделкаИнвестиционныйПроект,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка138СделкаОсвобождениеОтНДС
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка138СделкаОсвобождениеОтНДС,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка140СделкаНалогНаДополнительныйДоходУглеводородов
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка140СделкаНалогНаДополнительныйДоходУглеводородов,
	|	КонтролируемаяСделка.КодНаименованияСделки КАК Строка210КодНаименованияСделки,
	|	КонтролируемаяСделка.КодСтороныСделки КАК Строка211КодСтороныСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.Валюта.Код, """") КАК КодВалюты,
	|	КонтролируемаяСделка.СпособОпределенияЦеныСделки КАК СпособОпределенияЦеныСделки,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.СпособОпределенияЦеныСделки.ЦенаЯвляетсяРегулируемой
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка220ПризнакОпределенияЦеныСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКПризнакуОпределенияЦеныСделки, """") КАК Строка220_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки, """") = """"
	|			ТОГДА ""0""
	|		ИНАЧЕ КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки
	|	КОНЕЦ КАК Строка230КодОпределенияЦены,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийККодуОпределенияЦеныСделки, """") КАК Строка230_1Комментарий,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодМетодаЦенообразования, """") КАК Строка240КодМетодовЦенообразования,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКМетодуЦенообразования, """") КАК Строка240_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации251, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка251,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации252, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка252,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации253, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка253,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации254, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка254,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации255, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка255,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации256, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка256,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации257, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка257,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации258, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка258,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации259, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка259,
	|	2 КАК Строка260КоличествоУчастниковСделки,
	|	КонтролируемаяСделка.КомментарийКПункту7 КАК Строка260_1Комментарий,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходов КАК ЧИСЛО(15, 0)) КАК Строка300СуммаДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка301СуммаРегулируемыхДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходов КАК ЧИСЛО(15, 0)) КАК Строка310СуммаРасходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка311СуммаРегулируемыхРасходов,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОбособленноеПодразделение
	|			ТОГДА Контрагенты.ГоловнойКонтрагент
	|		ИНАЧЕ Контрагенты.Ссылка
	|	КОНЕЦ КАК Контрагент,
	|	Контрагенты.ЮрФизЛицо КАК ТипКонтрагента,
	|	КонтролируемаяСделка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	КонтролируемаяСделка.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемаяСделка.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемаяСделка.КодТНВЭД КАК КодТНВЭД,
	|	КонтролируемаяСделка.КодОКПД2 КАК КодОКПД2,
	|	КонтролируемаяСделка.КодОКВЭД2 КАК КодОКВЭД2,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|				И КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|		ИНАЧЕ КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки
	|	КОНЕЦ КАК СтранаПроисхожденияПредметаСделки,
	|	КонтролируемаяСделка.СделкаСовершенаЧерезКомиссионера КАК СделкаСовершенаЧерезКомиссионера,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.СделкаСовершенаЧерезКомиссионера
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК СделкаСовАгент,
	|	ВЫБОР
	|		КОГДА Комиссионеры.ОбособленноеПодразделение
	|			ТОГДА Комиссионеры.ГоловнойКонтрагент
	|		ИНАЧЕ Комиссионеры.Ссылка
	|	КОНЕЦ КАК Комиссионер,
	|	Комиссионеры.ЮрФизЛицо КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1А
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтролируемаяСделка.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Комиссионеры
	|		ПО КонтролируемаяСделка.Комиссионер = Комиссионеры.Ссылка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &УведомлениеОКонтролируемойСделке
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемаяСделкаСделки.Ссылка КАК Сделка,
	|	Листы1А.НомерЛиста1А КАК НомерЛиста1А,
	|	КонтролируемаяСделкаСделки.НомерСтроки КАК НомерСтроки,
	|	Листы1А.ТипПредметаСделки КАК ТипПредметаСделки,
	|	ВЫБОР
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА 1
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|			ТОГДА 2
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|				ИЛИ Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|			ТОГДА 3
	|	КОНЕЦ КАК Строка020ТипПредмета,
	|	Листы1А.НаименованиеПредметаСделки КАК Строка030НаименованиеПредмета,
	|	Листы1А.КодТНВЭД КАК Строка040КодПоТНВЭД,
	|	Листы1А.КодОКПД2 КАК Строка043КодПоОКПД2,
	|	Листы1А.КодОКВЭД2 КАК Строка045КодОКВЭД2,
	|	Листы1А.Контрагент КАК Контрагент,
	|	Листы1А.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Листы1А.ДоговорКонтрагента.Номер КАК Строка060НомерДоговора,
	|	Листы1А.ДоговорКонтрагента.Дата КАК Строка065ДатаДоговора,
	|	ЕСТЬNULL(Листы1А.СтранаПроисхожденияПредметаСделки.Код, """") КАК Строка070КодСтраныПроисхождения,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаОтправкиТовара.Код, """") КАК Строка080КодСтраныОтправки,
	|	КонтролируемаяСделкаСделки.КодРегионаОтправкиТовара КАК Строка080КодРегионаОтправки,
	|	КонтролируемаяСделкаСделки.ГородОтправкиТовара КАК Строка080ГородОтправки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктОтправкиТовара КАК Строка080НаселенныйПунктОтправки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаСовершенияСделки.Код, """") КАК Строка090КодСтраныСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодРегионаСовершенияСделки КАК Строка090КодРегионаСовершенияСделки,
	|	КонтролируемаяСделкаСделки.ГородСовершенияСделки КАК Строка090ГородСовершенияСделки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктСовершенияСделки КАК Строка090НаселенныйПунктСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодУсловийПоставки КАК Строка100КодУсловийПоставки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.ЕдиницаИзмерения.Код, """") КАК Строка110КодЕдиницыИзмерения,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Количество КАК ЧИСЛО(15, 5)) КАК Строка120Количество,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|				ТОГДА 0
	|			ИНАЧЕ КонтролируемаяСделкаСделки.Цена
	|		КОНЕЦ КАК ЧИСЛО(18, 4)) КАК Строка130Цена,
	|	Листы1А.КодВалюты КАК Строка140КодВалюты,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|				ТОГДА КонтролируемаяСделкаСделки.ПроцентнаяСтавка
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(7, 4)) КАК Строка150ПроцентнаяСтавка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|				ТОГДА 0
	|			ИНАЧЕ КонтролируемаяСделкаСделки.Стоимость
	|		КОНЕЦ КАК ЧИСЛО(15, 0)) КАК Строка160Стоимость,
	|	КонтролируемаяСделкаСделки.ДатаСовершенияСделки КАК Строка150ДатаСовершения,
	|	Листы1А.ТипКонтрагента КАК ТипКонтрагента,
	|	Листы1А.СделкаСовершенаЧерезКомиссионера КАК СделкаСовершенаЧерезКомиссионера,
	|	Листы1А.Комиссионер КАК Комиссионер,
	|	Листы1А.ТипКомиссионера КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1Б
	|ИЗ
	|	Документ.КонтролируемаяСделка.Сделки КАК КонтролируемаяСделкаСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Листы1А КАК Листы1А
	|		ПО КонтролируемаяСделкаСделки.Ссылка = Листы1А.Сделка
	|ГДЕ
	|	КонтролируемаяСделкаСделки.Ссылка В
	|			(ВЫБРАТЬ
	|				Листы1А.Сделка
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Листы1А.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ КонтрагентыЛистов1А
	|ИЗ
	|	Листы1А КАК Листы1А
	|ГДЕ
	|	Листы1А.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Листы1А.Комиссионер
	|ИЗ
	|	Листы1А КАК Листы1А
	|ГДЕ
	|	Листы1А.Комиссионер <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ВЫБОР
	|		КОГДА УчастникиКонтролируемыхСделок.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Строка020ТипОрганизации,
	|	ВЫБОР
	|		КОГДА УчастникиКонтролируемыхСделок.СтранаРегистрации ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ УчастникиКонтролируемыхСделок.СтранаРегистрации.Код
	|	КОНЕЦ КАК Строка030КакКодСтраныРегистрации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчастникиКонтролируемыхСделок.НаименованиеВРусскойТранскрипции, """") = """"
	|			ТОГДА ВЫРАЗИТЬ(УчастникиКонтролируемыхСделок.Контрагент.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ ЕСТЬNULL(УчастникиКонтролируемыхСделок.НаименованиеВРусскойТранскрипции, """")
	|	КОНЕЦ КАК Строка040Наименование,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.НаименованиеВЛатинскойТранскрипции, """") КАК Строка040НаименованиеЛат,
	|	Контрагенты.ИНН КАК Строка050ИНН,
	|	Контрагенты.КПП КАК Строка060КПП,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.РегистрационныйНомерВСтранеРегистрации, """") КАК Строка070РегНомерВСтрокеРегистрации,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодНалогоплательщикаВСтранеРегистрации, """") КАК Строка080КодНалогВСтранеРегистрации,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Строка090АдресИностраннойОрганизации
	|ПОМЕСТИТЬ Раздел2
	|ИЗ
	|	КонтрагентыЛистов1А КАК КонтрагентыЛистов1А
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтрагентыЛистов1А.Контрагент = Контрагенты.Ссылка
	|			И (Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|		ПО (ГоловныеКонтрагенты.Ссылка = Контрагенты.ГоловнойКонтрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО (ГоловныеКонтрагенты.Ссылка = УчастникиКонтролируемыхСделок.Контрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (ГоловныеКонтрагенты.Ссылка = КонтактнаяИнформация.Объект)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ГражданствоФизЛицСрезПоследних.Страна КАК Страна
	|ПОМЕСТИТЬ ГражданствоФизЛиц
	|ИЗ
	|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|			&ДатаАктуальностиСведений,
	|			ФизЛицо В
	|				(ВЫБРАТЬ
	|					УчастникиСделок.ФизическоеЛицо
	|				ИЗ
	|					РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиСделок)) КАК ГражданствоФизЛицСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ГражданствоФизЛицСрезПоследних.ФизЛицо,
	|	ГражданствоФизЛицСрезПоследних.Страна
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодВидаДеятельностиФизическогоЛица, """") КАК Строка020КодВидаДеятельности,
	|	Контрагенты.ИНН КАК Строка030ИНН,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаРождения,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.МестоРождения, """") КАК МестоРождения,
	|	ГражданствоФизЛиц.Страна КАК ГражданствоФизЛицСтрана,
	|	КонтактнаяИнформация.Поле1 КАК КонтактнаяИнформацияПоле1,
	|	КонтактнаяИнформация.Поле2 КАК КонтактнаяИнформацияПоле2,
	|	КонтактнаяИнформация.Поле3 КАК КонтактнаяИнформацияПоле3,
	|	КонтактнаяИнформация.Поле4 КАК КонтактнаяИнформацияПоле4,
	|	КонтактнаяИнформация.Поле5 КАК КонтактнаяИнформацияПоле5,
	|	КонтактнаяИнформация.Поле6 КАК КонтактнаяИнформацияПоле6,
	|	КонтактнаяИнформация.Поле7 КАК КонтактнаяИнформацияПоле7,
	|	КонтактнаяИнформация.Поле8 КАК КонтактнаяИнформацияПоле8,
	|	КонтактнаяИнформация.Поле9 КАК КонтактнаяИнформацияПоле9,
	|	КонтактнаяИнформация.Поле10 КАК КонтактнаяИнформацияПоле10,
	|	КонтактнаяИнформация.Представление КАК КонтактнаяИнформацияПредставление,
	|	КонтактнаяИнформацияЗаРФ.Поле1 КАК КонтактнаяИнформацияЗаРФПоле1,
	|	КонтактнаяИнформацияЗаРФ.Представление КАК КонтактнаяИнформацияЗаРФПредставление,
	|	ПаспортныеДанныеФизЛиц.ДокументВид,
	|	ПаспортныеДанныеФизЛиц.ДокументСерия,
	|	ПаспортныеДанныеФизЛиц.ДокументНомер,
	|	ПаспортныеДанныеФизЛиц.ДокументКемВыдан,
	|	ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи,
	|	ФИОФизЛиц.Фамилия КАК Фамилия,
	|	ФИОФизЛиц.Имя КАК Имя,
	|	ФИОФизЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ Раздел3
	|ИЗ
	|	КонтрагентыЛистов1А КАК КонтрагентыЛистов1А
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтрагентыЛистов1А.Контрагент = Контрагенты.Ссылка
	|			И (Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО КонтрагентыЛистов1А.Контрагент = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ГражданствоФизЛиц.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформация.Объект)
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияЗаРФ
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформацияЗаРФ.Объект)
	|			И (КонтактнаяИнформацияЗаРФ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияЗаРФ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнострАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ПаспортныеДанныеФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ПаспортныеДанныеФизЛиц.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ФИОФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ФИОФизЛиц.ФизЛицо)";
	
	Возврат(ТекстЗапроса);
	
КонецФункции

Функция ПолучитьТекстНастроекФормированияУведомления(Уведомление) Экспорт
	
	Если ЗначениеЗаполнено(Уведомление) Тогда
		НастройкиФормирования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "ГруппироватьСделкиСОдинаковойЦеной, КодМестаПредставления");
	Иначе
		НастройкиФормирования = Новый Структура("ГруппироватьСделкиСОдинаковойЦеной, КодМестаПредставления", Ложь, "");
	КонецЕсли;
	
	
	Если НастройкиФормирования.ГруппироватьСделкиСОдинаковойЦеной Тогда
		ТекстНастроек = НСтр("ru = 'Формировать один лист 1Б для нескольких сделок;   код места представления %1'");
	Иначе
		ТекстНастроек = НСтр("ru = 'Формировать один лист 1Б для каждой сделки;   код места представления %1'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиФормирования.КодМестаПредставления) Тогда
		ТекстНастроек = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНастроек, НастройкиФормирования.КодМестаПредставления);
	Иначе
		ТекстНастроек = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНастроек, НСтр("ru = 'не заполнен'"));
	КонецЕсли;
	
	Возврат ТекстНастроек;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДГОТОВКИ ДАННЫХ АВТОМАТИЧЕСКОГО ЗАПОЛНЕНИЯ

Процедура ЗаполнитьТаблицуСделокЛиста1А(Лист1А, ТаблицаСделок, СписокПолейСделки, СтруктураКлючевыхПолей)
	
	ТаблицаСделок.Свернуть(СписокПолейСделки + ", РасчетныйДокумент", "Количество, Стоимость, СтоимостьДляРасчетаЦены");
	Если Лист1А.ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство Тогда
		Для Каждого Сделка Из ТаблицаСделок Цикл
			Сделка.Цена = ?(Сделка.Количество = 0, Сделка.СтоимостьДляРасчетаЦены, Окр(Сделка.СтоимостьДляРасчетаЦены/Сделка.Количество, 2));
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаСделок.Сортировать("ДатаСовершенияСделки");
	
	Листы1Б = ТаблицаСделок.СкопироватьКолонки();
	
	СделкаДокумента = Неопределено;
	Для Каждого Сделка Из ТаблицаСделок Цикл
		Если (Сделка.Количество <> 0) ИЛИ (Сделка.Стоимость <> 0) ИЛИ (Сделка.ПроцентнаяСтавка <> 0) Тогда
			
			Если СделкаДокумента = Неопределено 
				ИЛИ Лист1А.ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.Товар
				ИЛИ НЕ СделкиСовпадают(СделкаДокумента, Сделка, СтруктураКлючевыхПолей) Тогда
				СделкаДокумента = Листы1Б.Добавить();
				ЗаполнитьЗначенияСвойств(СделкаДокумента, Сделка, , "Количество, Стоимость");
			КонецЕсли;
			СделкаДокумента.Количество = СделкаДокумента.Количество + Сделка.Количество;
			СделкаДокумента.Стоимость = СделкаДокумента.Стоимость + Сделка.Стоимость;
			СделкаДокумента.ДатаСовершенияСделки = Сделка.ДатаСовершенияСделки;
		КонецЕсли;
	КонецЦикла;
	
	Лист1А.Сделки.Загрузить(Листы1Б);
	
КонецПроцедуры

Функция СделкиСовпадают(Сделка1, Сделка2, СтруктураКлючевыхПолей)
	
	Для Каждого Поле Из СтруктураКлючевыхПолей Цикл
		Если Сделка1[Поле.Ключ] <> Сделка2[Поле.Ключ] Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Функция ИсключенияЗаполненияЛиста1А(ВерсияУведомления)
	
	ИсключенияДляЗаполненияЛиста1А = Новый Массив;
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		// Все показатели Листа 1А и 1Б уведомления о контролируемых сделках выводятся в рублях.
		// Поэтому из сделки валюта не переносится - она устанавливается при записи документа - всегда в валюту регламентированного учета.
		ИсключенияДляЗаполненияЛиста1А.Добавить("Валюта");
	КонецЕсли;
	
	Если ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012() Тогда
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКПД2");
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКВЭД2");
	Иначе
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКП");
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКВЭД");
	КонецЕсли;
	
	Возврат СтрСоединить82(ИсключенияДляЗаполненияЛиста1А, ",");
	
КонецФункции

Функция ИсключенияЗаполненияЛиста1Б(ВерсияУведомления, ТипПредметаСделки)
	
	ИсключенияДляЗаполненияЛиста1Б = Новый Массив;
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018()
		Или ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство Тогда
		ИсключенияДляЗаполненияЛиста1Б.Добавить("ПроцентнаяСтавка");
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ИсключенияДляЗаполненияЛиста1Б, ",");
	
КонецФункции

Функция ПараметрыВерсииУведомления(Версия)
	
	ПараметрыПечати = Новый Структура();
	
	Если Версия < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		
		ПараметрыПечати.Вставить("ДлинаНомераСтраница", 5);
		
		Макеты = Новый Структура;
		Макеты.Вставить("ТитульныйЛист", "Лист1");
		Макеты.Вставить("ТитульныйЛистФизическоеЛицо", "Лист2");
		Макеты.Вставить("Лист1А", "Страница1А");
		Макеты.Вставить("Лист1Б", "Страница1Б");
		Макеты.Вставить("Раздел2", "Раздел2");
		Макеты.Вставить("Раздел3", "Раздел3");
		
		ПараметрыПечати.Вставить("Макеты", Макеты);
		
	Иначе
		
		ПараметрыПечати.Вставить("ДлинаНомераСтраница", 3);
		
		Макеты = Новый Структура;
		Макеты.Вставить("ТитульныйЛист", "Лист1_2018");
		Макеты.Вставить("ТитульныйЛистФизическоеЛицо", "Лист2_2018");
		Макеты.Вставить("Лист1А", "Страница1А_2018");
		Макеты.Вставить("Лист1Б", "Страница1Б_2018");
		Макеты.Вставить("Раздел2", "Раздел2_2018");
		Макеты.Вставить("Раздел3", "Раздел3_2018");
		
		ПараметрыПечати.Вставить("Макеты", Макеты);
		
	КонецЕсли;
	
	Возврат ПараметрыПечати;
	
КонецФункции

Функция СтрСоединить82(Строки, Разделитель) Экспорт
	РезСтрока = "";
	Для каждого ЭлМассива Из Строки Цикл
		РезСтрока = РезСтрока + ЭлМассива + Разделитель;
	КонецЦикла;
	Возврат РезСтрока;
КонецФункции

Функция ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление)
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	ПараметрыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("СписокОфшоров", КонтролируемыеСделки.СписокОфшоров(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("СписокТоваровМировойБиржевойТорговли", КонтролируемыеСделки.СписокТоваровМировойБиржевойТорговли());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Страны.Ссылка КАК Страна
	|ПОМЕСТИТЬ СтраныСЛьготнымНалогообложением
	|ИЗ
	|	Справочник.КлассификаторСтранМира КАК Страны
	|ГДЕ
	|	Страны.Ссылка В(&СписокОфшоров)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Страна
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК ПредметСделки
	|ПОМЕСТИТЬ ТоварыМировойБиржевойТорговли
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокТоваровМировойБиржевойТорговли)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПериода КАК НачалоПериода,
	|	ВзаимозависимыеЛицаСрезПоследних.Организация КАК Организация,
	|	ВзаимозависимыеЛицаСрезПоследних.Контрагент КАК Контрагент,
	|	ВзаимозависимыеЛицаСрезПоследних.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомНалогаНаПрибыль КАК ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомЕСХН КАК ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаСрезПоследних.ЯвляетсяПлательщикомЕНВД КАК ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаСрезПоследних.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ,
	|	ВзаимозависимыеЛицаСрезПоследних.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ВзаимозависимыеЛицаСрезПоследних.ОсвобожденОтУплатыНДС КАК ОсвобожденОтУплатыНДС,
	|	ВзаимозависимыеЛицаСрезПоследних.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль КАК ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль
	|ПОМЕСТИТЬ ВзаимозависимыеЛицаГоловныеКонтрагенты
	|ИЗ
	|	РегистрСведений.ВзаимозависимыеЛица.СрезПоследних(&НачалоПериода, Организация В (&СписокОрганизаций)) КАК ВзаимозависимыеЛицаСрезПоследних
	|ГДЕ
	|	ВзаимозависимыеЛицаСрезПоследних.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛица.Период,
	|	ВзаимозависимыеЛица.Организация,
	|	ВзаимозависимыеЛица.Контрагент,
	|	ВзаимозависимыеЛица.ТипВзаимозависимости,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛица.ЗарегистрированВОЭЗ,
	|	ВзаимозависимыеЛица.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ВзаимозависимыеЛица.ОсвобожденОтУплатыНДС,
	|	ВзаимозависимыеЛица.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль
	|ИЗ
	|	РегистрСведений.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|ГДЕ
	|	ВзаимозависимыеЛица.Период > &НачалоПериода
	|	И ВзаимозависимыеЛица.Период <= &ОкончаниеПериода
	|	И ВзаимозависимыеЛица.Организация В(&СписокОрганизаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.НачалоПериода КАК НачалоПериода,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Организация КАК Организация,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент КАК Контрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент КАК ГоловнойКонтрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНалогаНаПрибыль КАК ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕСХН КАК ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕНВД КАК ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ОсвобожденОтУплатыНДС КАК ОсвобожденОтУплатыНДС,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль КАК ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль
	|ПОМЕСТИТЬ ВзаимозависимыеЛица
	|ИЗ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты КАК ВзаимозависимыеЛицаГоловныеКонтрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.НачалоПериода,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Организация,
	|	Контрагенты.Ссылка,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ТипВзаимозависимости,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ЗарегистрированВОЭЗ,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ОсвобожденОтУплатыНДС,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль
	|ИЗ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты КАК ВзаимозависимыеЛицаГоловныеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент = Контрагенты.ГоловнойКонтрагент
	|			И (Контрагенты.ОбособленноеПодразделение)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаПоПериодамВсе.Организация КАК Организация,
	|	ВзаимозависимыеЛицаПоПериодамВсе.НачалоПериода КАК НачалоПериода,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ВзаимозависимыеЛицаПоПериодамВсе.Контрагент КАК Контрагент,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НевзаимозависимыйПосредник,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомНалогаНаПрибыль КАК ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомЕСХН КАК ЯвляетсяПлательщикомЕСХН,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЯвляетсяПлательщикомЕНВД КАК ЯвляетсяПлательщикомЕНВД,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ОсвобожденОтУплатыНДС КАК ОсвобожденОтУплатыНДС,
	|	ВзаимозависимыеЛицаПоПериодамВсе.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль КАК ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль
	|ПОМЕСТИТЬ ВзаимозависимыеЛицаПоПериодам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаимозависимыеЛица.Организация КАК Организация,
	|		ВзаимозависимыеЛица.НачалоПериода КАК НачалоПериода,
	|		КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(ВзаимозависимыеЛица1.НачалоПериода, &ОкончаниеПериода)), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|		ВзаимозависимыеЛица.Контрагент КАК Контрагент,
	|		ВзаимозависимыеЛица.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|		ВзаимозависимыеЛица.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНалогаНаПрибыль КАК ЯвляетсяПлательщикомНалогаНаПрибыль,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕСХН КАК ЯвляетсяПлательщикомЕСХН,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕНВД КАК ЯвляетсяПлательщикомЕНВД,
	|		ВзаимозависимыеЛица.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ,
	|		ВзаимозависимыеЛица.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|		ВзаимозависимыеЛица.ОсвобожденОтУплатыНДС КАК ОсвобожденОтУплатыНДС,
	|		ВзаимозависимыеЛица.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль КАК ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль
	|	ИЗ
	|		ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛица КАК ВзаимозависимыеЛица1
	|			ПО ВзаимозависимыеЛица.Организация = ВзаимозависимыеЛица1.Организация
	|				И ВзаимозависимыеЛица.Контрагент = ВзаимозависимыеЛица1.Контрагент
	|				И ВзаимозависимыеЛица.НачалоПериода < ВзаимозависимыеЛица1.НачалоПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаимозависимыеЛица.Организация,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|		ВзаимозависимыеЛица.ТипВзаимозависимости,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомНДПИ,
	|		ВзаимозависимыеЛица.ЗарегистрированВОЭЗ,
	|		ВзаимозависимыеЛица.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|		ВзаимозависимыеЛица.ОсвобожденОтУплатыНДС,
	|		ВзаимозависимыеЛица.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕСХН,
	|		ВзаимозависимыеЛица.ЯвляетсяПлательщикомЕНВД,
	|		ВзаимозависимыеЛица.НачалоПериода,
	|		ВзаимозависимыеЛица.Контрагент,
	|		ВзаимозависимыеЛица.ГоловнойКонтрагент,
	|		ВзаимозависимыеЛица.ОсвобожденОтУплатыНДС) КАК ВзаимозависимыеЛицаПоПериодамВсе
	|ГДЕ
	|	ВзаимозависимыеЛицаПоПериодамВсе.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВзаимозависимыеЛицаПоПериодамВсе.Организация,
	|	ВзаимозависимыеЛицаПоПериодамВсе.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&НачалоПериода КАК НачалоПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних.Организация КАК Организация,
	|	СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта
	|ПОМЕСТИТЬ СведенияОбОрганизацииДляКонтролируемыхСделок
	|ИЗ
	|	РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок.СрезПоследних(&НачалоПериода, Организация В (&СписокОрганизаций)) КАК СведенияОбОрганизацииДляКонтролируемыхСделокСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Период,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта
	|ИЗ
	|	РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок КАК СведенияОбОрганизацииДляКонтролируемыхСделок
	|ГДЕ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Период > &НачалоПериода
	|	И СведенияОбОрганизацииДляКонтролируемыхСделок.Период <= &ОкончаниеПериода
	|	И СведенияОбОрганизацииДляКонтролируемыхСделок.Организация В(&СписокОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода КАК НачалоПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация КАК Организация,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(СведенияОбОрганизацииДляКонтролируемыхСделок1.НачалоПериода, &ОкончаниеПериода)), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта
	|ПОМЕСТИТЬ СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам
	|ИЗ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок КАК СведенияОбОрганизацииДляКонтролируемыхСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацииДляКонтролируемыхСделок КАК СведенияОбОрганизацииДляКонтролируемыхСделок1
	|		ПО СведенияОбОрганизацииДляКонтролируемыхСделок.Организация = СведенияОбОрганизацииДляКонтролируемыхСделок1.Организация
	|			И СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода < СведенияОбОрганизацииДляКонтролируемыхСделок1.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(ГоловныеКонтрагенты.Ссылка, Контрагенты.Ссылка) КАК ГоловнойКонтрагент,
	|	ВЫБОР
	|		КОГДА СтраныСЛьготнымНалогообложением.Страна ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ИСТИНА КАК СделкаВОбластиВнешнейТорговли
	|ПОМЕСТИТЬ ИностранныеКонтрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|		ПО Контрагенты.ГоловнойКонтрагент = ГоловныеКонтрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО Контрагенты.Ссылка = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныСЛьготнымНалогообложением КАК СтраныСЛьготнымНалогообложением
	|		ПО (СтраныСЛьготнымНалогообложением.Страна = УчастникиКонтролируемыхСделок.СтранаРегистрации)

	|ГДЕ
	|	УчастникиКонтролируемыхСделок.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка,
	|	ГоловныеКонтрагенты.Ссылка,
	|	ВЫБОР
	|		КОГДА СтраныСЛьготнымНалогообложением.Страна ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|		ПО (ГоловныеКонтрагенты.Ссылка = Контрагенты.ГоловнойКонтрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделокГоловныеКонтрагенты
	|		ПО ГоловныеКонтрагенты.Ссылка = УчастникиКонтролируемыхСделокГоловныеКонтрагенты.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделокКонтрагенты
	|		ПО Контрагенты.Ссылка = УчастникиКонтролируемыхСделокКонтрагенты.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныСЛьготнымНалогообложением КАК СтраныСЛьготнымНалогообложением
	|		ПО (СтраныСЛьготнымНалогообложением.Страна = УчастникиКонтролируемыхСделокГоловныеКонтрагенты.СтранаРегистрации)
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
	|	И УчастникиКонтролируемыхСделокГоловныеКонтрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|	И УчастникиКонтролируемыхСделокКонтрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВзаимозависимыеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВзаимозависимыеЛицаГоловныеКонтрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеКонтрагенты.Контрагент КАК Контрагент,
	|	КонтролируемыеКонтрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент
	|ПОМЕСТИТЬ КонтролируемыеКонтрагенты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаимозависимыеЛицаПоПериодам.Контрагент КАК Контрагент,
	|		ВзаимозависимыеЛицаПоПериодам.ГоловнойКонтрагент КАК ГоловнойКонтрагент
	|	ИЗ
	|		ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ИностранныеКонтрагенты.Контрагент,
	|		ИностранныеКонтрагенты.ГоловнойКонтрагент
	|	ИЗ
	|		ИностранныеКонтрагенты КАК ИностранныеКонтрагенты) КАК КонтролируемыеКонтрагенты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КонтролируемыеКонтрагенты.Контрагент";
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция ПометитьНаУдалениеКонтролируемыеСделкиУведомления(Уведомление)
	
	ТаблицаСделок = Новый ТаблицаЗначений();
	ТаблицаСделок.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.КонтролируемаяСделка"));
	ТаблицаСделок.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	РеквизитыСделки = Метаданные.Документы.КонтролируемаяСделка.Реквизиты;
	Для Каждого Реквизит Из РеквизитыСделки Цикл
		ТаблицаСделок.Колонки.Добавить(Реквизит.Имя, Новый ОписаниеТипов(Реквизит.Тип));
	КонецЦикла;
	
	ДокументыСделок = Документы.КонтролируемаяСделка.Выбрать( , , Новый Структура("УведомлениеОКонтролируемойСделке", Уведомление));
	Пока ДокументыСделок.Следующий() Цикл
		ДокументСделка = ДокументыСделок.ПолучитьОбъект();
		СтрокаСделок = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделок, ДокументСделка);
		СтрокаСделок.Сделка = ДокументСделка.Ссылка;
		ДокументСделка.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	ТаблицаСделок.Индексы.Добавить("Контрагент, ДоговорКонтрагента, ПредметСделки, Используется");
	
	Возврат ТаблицаСделок;
	
КонецФункции

Функция КлючСделкиСовпадает(Сделка, КлючСделки) 
	
	Для Каждого Ключ Из КлючСделки Цикл
		Если Сделка[Ключ.Ключ] <> Ключ.Значение Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьТаблицуСделок()
	
	ОписаниеТиповРасчетныхДокументов = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.РасчетныйДокумент.Тип;
	ОписаниеТиповПредметовСделки = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.ПредметСделки.Тип;
	ОписаниеГрузоотправителя = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Реквизиты.Грузоотправитель.Тип;
	ОписаниеГрузополучателя  = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Реквизиты.Грузополучатель.Тип;
	
	ТаблицаСделок = Новый ТаблицаЗначений();
	ТаблицаСделок.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаСделок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаСделок.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаСделок.Колонки.Добавить("ДоговорКонтрагента", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаСделок.Колонки.Добавить("Комиссионер", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаСделок.Колонки.Добавить("РасчетныйДокумент", ОписаниеТиповРасчетныхДокументов);
	ТаблицаСделок.Колонки.Добавить("ПредметСделки", ОписаниеТиповПредметовСделки);
	ТаблицаСделок.Колонки.Добавить("ТипПредметаСделки", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПредметовКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("НаименованиеПредметаСделки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(512)));
	ТаблицаСделок.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаСделок.Колонки.Добавить("СтранаПроисхожденияПредметаСделки", Новый ОписаниеТипов("СправочникСсылка.КлассификаторСтранМира"));
	ТаблицаСделок.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперацииКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаСделок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаСделок.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаСделок.Колонки.Добавить("ЦенаВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаБезНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаБезНДСВВалютеРасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("СуммаНДСВВалютеРасчетов", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаСделок.Колонки.Добавить("ТипКонтролируемойСделки", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("ТоварМировойБиржевойТорговли", Новый ОписаниеТипов("Булево"));
	ТаблицаСделок.Колонки.Добавить("ОперацияОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	
	ТаблицаСделок.Колонки.Добавить("Грузоотправитель", ОписаниеГрузоотправителя);
	ТаблицаСделок.Колонки.Добавить("Грузополучатель", ОписаниеГрузополучателя);
	
	Возврат ТаблицаСделок;
	
КонецФункции

 Процедура ЗаполнитьАдресаСделки(СтруктураАдресов, Грузоотправитель, Грузополучатель, ВерсияУведомления)
	
	ЗапросКонтактнойИнформации = Новый Запрос();
	ЗапросКонтактнойИнформации.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле1,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле3,
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Поле5,
	|	КонтактнаяИнформация.Поле6,
	|	КонтактнаяИнформация.Поле7,
	|	КонтактнаяИнформация.Поле8,
	|	КонтактнаяИнформация.Поле9,
	|	КонтактнаяИнформация.Поле10,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид В (&Виды)";
	
	
	ВидыКонтактнойИнформации = Новый Массив();
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
	ЗапросКонтактнойИнформации.УстановитьПараметр("Виды", ВидыКонтактнойИнформации);
	
	Если Грузоотправитель <> Неопределено Тогда
		//Получим почтовый адрес грузоотправителя
		ЗапросКонтактнойИнформации.Параметры.Вставить("Объект", Грузоотправитель);
		ВыборкаАдреса = ЗапросКонтактнойИнформации.Выполнить().Выбрать();
		Если ВыборкаАдреса.Следующий() Тогда
			АдресРФ = УправлениеКонтактнойИнформацией.ОпределитьДляОбъектаРоссийскийАдрес(ВыборкаАдреса);
			Если АдресРФ Тогда
				СтруктураАдресов.СтранаОтправкиТовара = Справочники.КлассификаторСтранМира.Россия;
				СтруктураАдресов.КодРегионаОтправкиТовара = РегламентированнаяОтчетность.КодРегионаПоНазванию(ВыборкаАдреса.Поле2);
				СтруктураАдресов.ГородОтправкиТовара  = ВыборкаАдреса.Поле4;
				СтруктураАдресов.НаселенныйПунктОтправкиТовара = ВыборкаАдреса.Поле5;
			Иначе
				СтруктураАдресов.СтранаОтправкиТовара = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СокрЛП(ВыборкаАдреса.Поле1));
				СтруктураАдресов.КодРегионаОтправкиТовара = "";
				СтруктураАдресов.ГородОтправкиТовара  = "";
				СтруктураАдресов.НаселенныйПунктОтправкиТовара = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Грузополучатель <> Неопределено Тогда
		//Получим почтовый адрес грузоотправителя
		ЗапросКонтактнойИнформации.Параметры.Вставить("Объект", Грузополучатель);
		ВыборкаАдреса = ЗапросКонтактнойИнформации.Выполнить().Выбрать();
		Если ВыборкаАдреса.Следующий() Тогда
			АдресРФ = УправлениеКонтактнойИнформацией.ОпределитьДляОбъектаРоссийскийАдрес(ВыборкаАдреса);
			Если АдресРФ Тогда
				СтруктураАдресов.СтранаСовершенияСделки = Справочники.КлассификаторСтранМира.Россия;
				СтруктураАдресов.КодРегионаСовершенияСделки = РегламентированнаяОтчетность.КодРегионаПоНазванию(ВыборкаАдреса.Поле2);
				СтруктураАдресов.ГородСовершенияСделки  = ВыборкаАдреса.Поле4;
				СтруктураАдресов.НаселенныйПунктСовершенияСделки = ВыборкаАдреса.Поле5;
			Иначе
				СтруктураАдресов.СтранаСовершенияСделки = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СокрЛП(ВыборкаАдреса.Поле1));
				СтруктураАдресов.КодРегионаСовершенияСделки = "";
				СтруктураАдресов.ГородСовершенияСделки  = "";
				СтруктураАдресов.НаселенныйПунктСовершенияСделки = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатуСделкиДолговыхОбязательств(Сделка, ВерсияУведомления, ТипПредметаСделки, ДатаПроцентнойСтавки)
	
	Если ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018()
		И ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство Тогда
		Сделка.ДатаСовершенияСделки = ДатаПроцентнойСтавки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемаяСделка, ТаблицаДокумента, КомиссионныеТовары)
	
	НайденныеСтроки = ТаблицаДокумента.НайтиСтроки(Новый Структура("РасчетныйДокумент",КонтролируемаяСделка.РасчетныйДокумент) );
	Если НайденныеСтроки.Количество() > 0 Тогда
	
		ТаблицаСделокДокумента = ПолучитьТаблицуСделок();
		ТаблицаСделокДокумента.Колонки.Добавить("ВключатьСоставСделок", Новый ОписаниеТипов("Булево"));
		
		Для Каждого ВыборкаСтрок Из НайденныеСтроки Цикл
			
			Количество = ВыборкаСтрок.Количество;
			КоличествоВУчете = ВыборкаСтрок.КоличествоВУчете;
			СуммаБезНДС = ВыборкаСтрок.СуммаБезНДС;
			СуммаБезНДСВРублях = ?(КонтролируемаяСделка.РасчетыВВалюте, ВыборкаСтрок.СуммаБезНДСВРублях, ВыборкаСтрок.СуммаБезНДС);
			СуммаНДС = ВыборкаСтрок.СуммаНДС;
			СуммаНДСВРублях = ?(КонтролируемаяСделка.РасчетыВВалюте, ВыборкаСтрок.СуммаНДСВРублях, ВыборкаСтрок.СуммаНДС);
			
			Если КомиссионныеТовары <> Неопределено Тогда
				//получим количество комиссионного товара
				ОтборКомиссионныхТоваров = Новый Структура("Сделка, ПредметСделки, СерияНоменклатуры",
					ВыборкаСтрок.Сделка, ВыборкаСтрок.ПредметСделки, ВыборкаСтрок.СерияНоменклатуры);
				НайденыеТоварыКомитентов = КомиссионныеТовары.НайтиСтроки(ОтборКомиссионныхТоваров);
				
				//Проверяем на существование записи о продаже товаров комитента с ненулевым количеством
				//и знаком остатка, совпадающим со знаком сделки (не подходит случай, когда количество товаров комитента больше нуля, а количество товаров в сделке - больше нуля)
				Если НайденыеТоварыКомитентов.Количество()>0
					И НайденыеТоварыКомитентов[0].Количество <> 0
					И НайденыеТоварыКомитентов[0].Количество * КоличествоВУчете > 0 Тогда
					
					КоличествоКомиссионныхТоваров = ?(НайденыеТоварыКомитентов[0].Количество>0,
							Мин(НайденыеТоварыКомитентов[0].Количество, КоличествоВУчете),
							Макс(НайденыеТоварыКомитентов[0].Количество, КоличествоВУчете));
					
					Сделка = ТаблицаСделокДокумента.Добавить();
					Сделка.Период                     = КонтролируемаяСделка.Период;
					Сделка.Организация                = КонтролируемаяСделка.Организация;
					Сделка.Контрагент                 = КонтролируемаяСделка.Контрагент;
					Сделка.ДоговорКонтрагента         = КонтролируемаяСделка.ДоговорКонтрагента;
					Сделка.Комиссионер                = КонтролируемаяСделка.Комиссионер;
					Сделка.РасчетныйДокумент          = КонтролируемаяСделка.РасчетныйДокумент;
					Сделка.ПредметСделки              = ВыборкаСтрок.ПредметСделки;
					Сделка.ТипПредметаСделки          = ВыборкаСтрок.ТипПредметаСделки;
					Сделка.НаименованиеПредметаСделки = ВыборкаСтрок.НаименованиеПредметаСделки;
					Сделка.СтранаПроисхожденияПредметаСделки = ВыборкаСтрок.СтранаПроисхождения;
					Сделка.ВключатьСоставСделок       = Ложь;
					Сделка.ХозяйственнаяОперация      = ВыборкаСтрок.ХозяйственнаяОперация;
					Сделка.Валюта                     = КонтролируемаяСделка.ВалютаДокумента;
					Сделка.ЕдиницаИзмерения           = ВыборкаСтрок.ЕдиницаИзмеренияПоКлассификатору;
					Сделка.Количество                 = Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * Количество, 2);
					Сделка.СтавкаНДС                  = ВыборкаСтрок.СтавкаНДС;
					Сделка.СуммаБезНДСВВалютеРасчетов = ВыборкаСтрок.СуммаБезНДС;
					Сделка.СуммаНДСВВалютеРасчетов    = ВыборкаСтрок.СуммаНДС;
					Сделка.СуммаБезНДСВРублях         = Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаБезНДСВРублях, 2);
					Сделка.СуммаНДСВРублях            = 0;
					Сделка.СуммаБезНДСВВалютеРасчетов = Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаБезНДС, 2);
					Сделка.СуммаНДСВВалютеРасчетов    = 0;
					Сделка.ТипКонтролируемойСделки    = ВыборкаСтрок.ТипКонтролируемойСделки;
					Если ВыборкаСтрок.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
						Сделка.Грузоотправитель           = КонтролируемаяСделка.Грузоотправитель;
					КонецЕсли;
					Сделка.Грузополучатель            = КонтролируемаяСделка.Грузополучатель;
					Сделка.ТоварМировойБиржевойТорговли = ВыборкаСтрок.ТоварМировойБиржевойТорговли;
					Сделка.ОперацияОблагаетсяЕНВД     = ВыборкаСтрок.ОперацияОблагаетсяЕНВД;
					
					НайденыеТоварыКомитентов[0].Количество = НайденыеТоварыКомитентов[0].Количество - КоличествоКомиссионныхТоваров;
					Количество         = Количество - Сделка.Количество;
					СуммаБезНДС        = СуммаБезНДС - Сделка.СуммаБезНДСВВалютеРасчетов;
					СуммаБезНДСВРублях = СуммаБезНДСВРублях - Сделка.СуммаБезНДСВРублях;
					СуммаНДС           = СуммаНДС - Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаНДС, 2);
					СуммаНДСВРублях    = СуммаНДСВРублях - Окр(КоличествоКомиссионныхТоваров/КоличествоВУчете * СуммаНДСВРублях, 2);
				КонецЕсли;
			КонецЕсли;
			
			Если Количество<>0 ИЛИ СуммаБезНДС<>0 ИЛИ СуммаНДС<>0 ИЛИ СуммаБезНДСВРублях<> 0 ИЛИ СуммаНДСВРублях <> 0 Тогда
				Сделка = ТаблицаСделокДокумента.Добавить();
				Сделка.Период                     = КонтролируемаяСделка.Период;
				Сделка.Организация                = КонтролируемаяСделка.Организация;
				Сделка.Контрагент                 = КонтролируемаяСделка.Контрагент;
				Сделка.ДоговорКонтрагента         = КонтролируемаяСделка.ДоговорКонтрагента;
				Сделка.РасчетныйДокумент          = КонтролируемаяСделка.РасчетныйДокумент;
				Сделка.ПредметСделки              = ВыборкаСтрок.ПредметСделки;
				Сделка.ТипПредметаСделки          = ВыборкаСтрок.ТипПредметаСделки;
				Сделка.НаименованиеПредметаСделки = ВыборкаСтрок.НаименованиеПредметаСделки;
				Сделка.СтранаПроисхожденияПредметаСделки = ВыборкаСтрок.СтранаПроисхождения;
				Сделка.ВключатьСоставСделок       = ВыборкаСтрок.ВключатьСоставСделок;
				Сделка.ХозяйственнаяОперация      = ВыборкаСтрок.ХозяйственнаяОперация;
				Сделка.Валюта                     = КонтролируемаяСделка.ВалютаДокумента;
				Сделка.ЕдиницаИзмерения           = ВыборкаСтрок.ЕдиницаИзмеренияПоКлассификатору;
				Сделка.Количество                 = Количество;
				Сделка.СтавкаНДС                  = ВыборкаСтрок.СтавкаНДС;
				Сделка.СуммаБезНДСВРублях         = СуммаБезНДСВРублях;
				Сделка.СуммаНДСВРублях            = СуммаНДСВРублях;
				Сделка.СуммаБезНДСВВалютеРасчетов = СуммаБезНДС;
				Сделка.СуммаНДСВВалютеРасчетов    = СуммаНДС;
				Сделка.ТипКонтролируемойСделки    = ВыборкаСтрок.ТипКонтролируемойСделки;
				Сделка.ТоварМировойБиржевойТорговли = ВыборкаСтрок.ТоварМировойБиржевойТорговли;
				Сделка.ОперацияОблагаетсяЕНВД     = ВыборкаСтрок.ОперацияОблагаетсяЕНВД;
				
				Если ВыборкаСтрок.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
					Сделка.Грузоотправитель           = КонтролируемаяСделка.Грузоотправитель;
				КонецЕсли;
				Сделка.Грузополучатель            = КонтролируемаяСделка.Грузополучатель;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СделкаДокумента Из ТаблицаСделокДокумента Цикл
			Если (СделкаДокумента.ТоварМировойБиржевойТорговли И КонтролируемаяСделка.ИностранныйКонтрагент)
					ИЛИ КонтролируемаяСделка.ВзаимозависимыеЛица
					ИЛИ КонтролируемаяСделка.ЗарегистрированВСтранеСЛьготнымНалогообложением Тогда
					Если СделкаДокумента.ВключатьСоставСделок
						И (СделкаДокумента.СуммаБезНДСВРублях <> 0
							ИЛИ СделкаДокумента.СуммаНДСВРублях <> 0
							ИЛИ СделкаДокумента.Количество <> 0) Тогда
					Сделка = ТаблицаСделок.Добавить();
					ЗаполнитьЗначенияСвойств(Сделка, СделкаДокумента);
					Сделка.ЦенаВРублях = Сделка.СуммаБезНДСВРублях / Сделка.Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента)
	
	СделкиДокумента.Колонки.Добавить("СуммаБезНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	СделкиДокумента.Колонки.Добавить("СуммаНДСВРублях", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Для Каждого ДокументСделки Из РублевыеСуммыСделок Цикл
		
		ВсегоВРублях = ДокументСделки.ВсегоВРублях;
		СуммаНДСВРублях =ДокументСделки.СуммаНДСВРублях;
		
		СтрокиДокумента = СделкиДокумента.НайтиСтроки(Новый Структура("Сделка",ДокументСделки.Сделка));
		Если СтрокиДокумента.Количество() > 0 Тогда
			
			СуммыВсегоВВалюте = Новый Массив(СтрокиДокумента.Количество());
			СуммыНДСВВалюте   = Новый Массив(СтрокиДокумента.Количество());
			Для К=0 По СтрокиДокумента.Количество()-1 Цикл
				СуммыВсегоВВалюте[К] = СтрокиДокумента[К].СуммаБезНДС + СтрокиДокумента[К].СуммаНДС;
				СуммыНДСВВалюте[К]   = СтрокиДокумента[К].СуммаНДС;
			КонецЦикла;
			
			//Подсчитаем рублевые суммы документа
			РаспределениеСуммВсего = ОбщегоНазначения.РаспределитьПропорционально(ВсегоВРублях, СуммыВсегоВВалюте);
			РаспределениеСуммНДС   = ОбщегоНазначения.РаспределитьПропорционально(СуммаНДСВРублях, СуммыНДСВВалюте);
			
			Если РаспределениеСуммВсего <> Неопределено Тогда
				Для К=0 По СтрокиДокумента.Количество()-1 Цикл
					СуммаНДС = ?(РаспределениеСуммНДС = Неопределено,0, РаспределениеСуммНДС[К]);
					СтрокиДокумента[К].СуммаБезНДСВРублях = РаспределениеСуммВсего[К] - СуммаНДС;
					СтрокиДокумента[К].СуммаНДСВРублях = СуммаНДС;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСделкиРеализацииТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Организация В(&СписокОрганизаций)
	|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Сделка,
	|	РеализацияТоваровУслугТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК ПредметСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров) КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.Количество * РеализацияТоваровУслугТовары.Коэффициент / РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияТоваровУслугТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО РеализацияТоваровУслугТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияТоваровУслугТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг),
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Количество,
	|	РеализацияТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	|	КОНЕЦ,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияТоваровУслугУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияТоваровУслугУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент КАК ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиРеализацииОтгруженныхТоваров(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок);
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияОтгруженныхТоваров.Организация КАК Организация,
	|	РеализацияОтгруженныхТоваров.Дата КАК Период,
	|	РеализацияОтгруженныхТоваров.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументОтгрузки,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК РеализацияОтгруженныхТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияОтгруженныхТоваров.ДокументОтгрузки = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияОтгруженныхТоваров.Контрагент)
	|			И РеализацияОтгруженныхТоваров.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияОтгруженныхТоваров.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияОтгруженныхТоваров.Контрагент)
	|ГДЕ
	|	РеализацияОтгруженныхТоваров.Организация В(&СписокОрганизаций)
	|	И РеализацияОтгруженныхТоваров.Дата >= &НачалоПериода
	|	И РеализацияОтгруженныхТоваров.Дата <= &ОкончаниеПериода
	|	И РеализацияОтгруженныхТоваров.Проведен = ИСТИНА
	|	И РеализацияОтгруженныхТоваров.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И РеализацияОтгруженныхТоваров.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|	ГДЕ
	|		НДСНачисленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК Сделка,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК ПредметСделки,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров) КАК ХозяйственнаяОперация,
	|	РеализацияТоваровУслугТовары.Количество,
	|	РеализацияТоваровУслугТовары.Количество * РеализацияТоваровУслугТовары.Коэффициент / РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	РеализацияТоваровУслугТовары.СтавкаНДС,
	|	РеализацияТоваровУслугТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	РеализацияТоваровУслугТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияТоваровУслугТовары.Ссылка = ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО РеализацияТоваровУслугТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО РеализацияТоваровУслугТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияТоваровУслугТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент КАК ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.ДокументОтгрузки
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияТоваровУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", РегистрыСведений.НастройкиФормированияКонтролируемыхСделок.ПолучитьЕдиницуИзмеренияШтука());
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Дата КАК Период,
	|	ПоступлениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Организация
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|			И ПоступлениеТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Организация В(&СписокОрганизаций)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделокВВалюте.УчетАгентскогоНДС
	|				ТОГДА НДСПредъявленный.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСПредъявленный.Регистратор
	|				И (НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Сделка,
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК ПредметСделки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров) КАК ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	|	ПоступлениеТоваровУслугТовары.Количество * ПоступлениеТоваровУслугТовары.Коэффициент / ПоступлениеТоваровУслугТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС,
	|	ПоступлениеТоваровУслугТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ПоступлениеТоваровУслугТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг),
	|	ПоступлениеТоваровУслугУслуги.Количество,
	|	ПоступлениеТоваровУслугУслуги.Количество,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	|	ПоступлениеТоваровУслугУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОборудование.Ссылка,
	|	ПоступлениеТоваровУслугОборудование.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугОборудование.Номенклатура,
	|	ПоступлениеТоваровУслугОборудование.Номенклатура.НаименованиеПолное,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров),
	|	ПоступлениеТоваровУслугОборудование.Количество,
	|	ПоступлениеТоваровУслугОборудование.Количество * ПоступлениеТоваровУслугОборудование.Коэффициент / ПоступлениеТоваровУслугОборудование.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	ПоступлениеТоваровУслугОборудование.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугОборудование.Сумма - ПоступлениеТоваровУслугОборудование.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугОборудование.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугОборудование.СтавкаНДС,
	|	ПоступлениеТоваровУслугОборудование.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)),
	|	ПоступлениеТоваровУслугОборудование.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Оборудование КАК ПоступлениеТоваровУслугОборудование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугОборудование.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ПоступлениеТоваровУслугОборудование.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ПоступлениеТоваровУслугОборудование.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ПоступлениеТоваровУслугОборудование.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугОбъектыСтроительства.ОбъектСтроительства,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.ОбъектСтроительства.Наименование,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеОбъектовСтроительства),
	|	1,
	|	1,
	|	&ЕдиницаИзмеренияШтука,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугОбъектыСтроительства.Сумма - ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугОбъектыСтроительства.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.СтавкаНДС,
	|	ПоступлениеТоваровУслугОбъектыСтроительства.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ОбъектыСтроительства КАК ПоступлениеТоваровУслугОбъектыСтроительства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеТоваровУслугОбъектыСтроительства.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент КАК ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияДопРасходов(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", РегистрыСведений.НастройкиФормированияКонтролируемыхСделок.ПолучитьЕдиницуИзмеренияШтука());
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеДопРасходов.Организация КАК Организация,
	|	ПоступлениеДопРасходов.Дата КАК Период,
	|	ПоступлениеДопРасходов.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеДопРасходов.Контрагент КАК Контрагент,
	|	ПоступлениеДопРасходов.Организация КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеДопРасходов.ВалютаДокумента КАК ВалютаДокумента,
	|	ПоступлениеДопРасходов.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПоступлениеДопРасходов.Содержание КАК Содержание,
	|	ПоступлениеДопРасходов.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ПоступлениеДопРасходов.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеДопРасходов.Контрагент)
	|			И ПоступлениеДопРасходов.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеДопРасходов.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеДопРасходов.Контрагент)
	|ГДЕ
	|	ПоступлениеДопРасходов.Организация В(&СписокОрганизаций)
	|	И ПоступлениеДопРасходов.Дата >= &НачалоПериода
	|	И ПоступлениеДопРасходов.Дата <= &ОкончаниеПериода
	|	И ПоступлениеДопРасходов.Проведен = ИСТИНА
	|	И ПоступлениеДопРасходов.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И ПоступлениеДопРасходов.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделокВВалюте.УчетАгентскогоНДС
	|				ТОГДА НДСПредъявленный.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСПредъявленный.Регистратор
	|				И (НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент КАК Сделка,
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК ПредметСделки,
	|	ПоступлениеДополнительныхУслуг.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмеренияПоКлассификатору,
	|	СУММА(ПоступлениеДополнительныхУслуг.СуммаБезНДС) КАК СуммаБезНДС,
	|	ПоступлениеДополнительныхУслуг.СтавкаНДС,
	|	СУММА(ПоступлениеДополнительныхУслуг.СуммаНДС) КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеДопРасходов.Ссылка КАК РасчетныйДокумент,
	|		ПоступлениеДопРасходов.Содержание КАК Содержание,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|				ТОГДА ПоступлениеДопРасходов.Сумма - ПоступлениеДопРасходов.СуммаНДС
	|			ИНАЧЕ ПоступлениеДопРасходов.Сумма
	|		КОНЕЦ КАК СуммаБезНДС,
	|		ПоступлениеДопРасходов.СтавкаНДС КАК СтавкаНДС,
	|		ПоступлениеДопРасходов.СуммаНДС КАК СуммаНДС
	|	ИЗ
	|		Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ПоступлениеДопРасходов.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ПоступлениеДопРасходов.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеДопРасходовТовары.Ссылка,
	|		ДокументыКонтролируемыхСделок.Содержание,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|				ТОГДА ПоступлениеДопРасходовТовары.Сумма - ПоступлениеДопРасходовТовары.СуммаНДС
	|			ИНАЧЕ ПоступлениеДопРасходовТовары.Сумма
	|		КОНЕЦ,
	|		ДокументыКонтролируемыхСделок.СтавкаНДС,
	|		ПоступлениеДопРасходовТовары.СуммаНДС
	|	ИЗ
	|		Документ.ПоступлениеДопРасходов.Товары КАК ПоступлениеДопРасходовТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ПоступлениеДопРасходовТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ПоступлениеДопРасходовТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеДопРасходовОборудование.Ссылка,
	|		ДокументыКонтролируемыхСделок.Содержание,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|				ТОГДА ПоступлениеДопРасходовОборудование.Сумма - ПоступлениеДопРасходовОборудование.СуммаНДС
	|			ИНАЧЕ ПоступлениеДопРасходовОборудование.Сумма
	|		КОНЕЦ,
	|		ДокументыКонтролируемыхСделок.СтавкаНДС,
	|		ПоступлениеДопРасходовОборудование.СуммаНДС
	|	ИЗ
	|		Документ.ПоступлениеДопРасходов.Оборудование КАК ПоступлениеДопРасходовОборудование
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ПоступлениеДопРасходовОборудование.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ПоступлениеДопРасходовОборудование.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)) КАК ПоступлениеДополнительныхУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент,
	|	ПоступлениеДополнительныхУслуг.Содержание,
	|	ПоступлениеДополнительныхУслуг.СтавкаНДС,
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеДополнительныхУслуг.РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент КАК ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

КонецПроцедуры

Процедура ДобавитьСделкиРеализацииУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияУслугПоПереработке.Организация КАК Организация,
	|	РеализацияУслугПоПереработке.Дата КАК Период,
	|	РеализацияУслугПоПереработке.Ссылка КАК РасчетныйДокумент,
	|	РеализацияУслугПоПереработке.Контрагент КАК Контрагент,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПоПереработке.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияУслугПоПереработке.Контрагент
	|		ИНАЧЕ РеализацияУслугПоПереработке.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	РеализацияУслугПоПереработке.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияУслугПоПереработке.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияУслугПоПереработке.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияУслугПоПереработке.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияУслугПоПереработке.Контрагент)
	|			И РеализацияУслугПоПереработке.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияУслугПоПереработке.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияУслугПоПереработке.Контрагент)
	|ГДЕ
	|	РеализацияУслугПоПереработке.Организация В(&СписокОрганизаций)
	|	И РеализацияУслугПоПереработке.Дата >= &НачалоПериода
	|	И РеализацияУслугПоПереработке.Дата <= &ОкончаниеПериода
	|	И РеализацияУслугПоПереработке.Проведен = ИСТИНА
	|	И РеализацияУслугПоПереработке.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И РеализацияУслугПоПереработке.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияУслугПоПереработкеПродукция.Ссылка КАК Сделка,
	|	РеализацияУслугПоПереработкеПродукция.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	РеализацияУслугПоПереработкеПродукция.Номенклатура КАК ПредметСделки,
	|	РеализацияУслугПоПереработкеПродукция.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	РеализацияУслугПоПереработкеПродукция.Количество,
	|	РеализацияУслугПоПереработкеПродукция.Количество КАК КоличествоВУчете,
	|	РеализацияУслугПоПереработкеПродукция.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияУслугПоПереработкеПродукция.Сумма - РеализацияУслугПоПереработкеПродукция.СуммаНДС
	|		ИНАЧЕ РеализацияУслугПоПереработкеПродукция.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	РеализацияУслугПоПереработкеПродукция.СтавкаНДС,
	|	РеализацияУслугПоПереработкеПродукция.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.РеализацияУслугПоПереработке.Продукция КАК РеализацияУслугПоПереработкеПродукция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО РеализацияУслугПоПереработкеПродукция.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО РеализацияУслугПоПереработкеПродукция.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	РеализацияУслугПоПереработкеПродукция.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслугПоПереработкеУслуги.Ссылка,
	|	РеализацияУслугПоПереработкеУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура,
	|	РеализацияУслугПоПереработкеУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг),
	|	РеализацияУслугПоПереработкеУслуги.Количество,
	|	РеализацияУслугПоПереработкеУслуги.Количество,
	|	РеализацияУслугПоПереработкеУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	|		ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	|	КОНЕЦ,
	|	РеализацияУслугПоПереработкеУслуги.СтавкаНДС,
	|	РеализацияУслугПоПереработкеУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = РеализацияУслугПоПереработкеУслуги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО (РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет)
	|ГДЕ
	|	РеализацияУслугПоПереработкеУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиАктаОбОказанииУслуг(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Акт.Организация КАК Организация,
	|	Акт.Дата КАК Период,
	|	Акт.Ссылка КАК РасчетныйДокумент,
	|	Акт.Контрагент КАК Контрагент,
	|	Акт.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Акт.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Акт.Контрагент
	|		ИНАЧЕ Акт.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	Акт.ВалютаДокумента КАК ВалютаДокумента,
	|	Акт.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	Акт.КурсВзаиморасчетов,
	|	Акт.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Акт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = Акт.Контрагент)
	|			И Акт.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И Акт.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = Акт.Контрагент)
	|ГДЕ
	|	Акт.Организация В(&СписокОрганизаций)
	|	И Акт.Дата >= &НачалоПериода
	|	И Акт.Дата <= &ОкончаниеПериода
	|	И Акт.Проведен = ИСТИНА
	|	И Акт.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И Акт.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка КАК Сделка,
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	АктОбОказанииПроизводственныхУслугУслуги.Номенклатура КАК ПредметСделки,
	|	АктОбОказанииПроизводственныхУслугУслуги.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	АктОбОказанииПроизводственныхУслугУслуги.Количество,
	|	АктОбОказанииПроизводственныхУслугУслуги.Количество КАК КоличествоВУчете,
	|	АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	|		ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	|	АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО АктОбОказанииПроизводственныхУслугУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	АктОбОказанииПроизводственныхУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", РегистрыСведений.НастройкиФормированияКонтролируемыхСделок.ПолучитьЕдиницуИзмеренияШтука());
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеНМА.Организация КАК Организация,
	|	ПоступлениеНМА.Дата КАК Период,
	|	ПоступлениеНМА.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеНМА.Контрагент КАК Контрагент,
	|	ПоступлениеНМА.Организация КАК Грузополучатель,
	|	ПоступлениеНМА.Контрагент КАК Грузоотправитель,
	|	ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
	|	ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеНМА.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеНМА.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ПоступлениеНМА.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеНМА КАК ПоступлениеНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеНМА.Контрагент)
	|			И ПоступлениеНМА.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеНМА.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеНМА.Контрагент)
	|ГДЕ
	|	ПоступлениеНМА.Организация В(&СписокОрганизаций)
	|	И ПоступлениеНМА.Дата >= &НачалоПериода
	|	И ПоступлениеНМА.Дата <= &ОкончаниеПериода
	|	И ПоступлениеНМА.Проведен = ИСТИНА
	|	И ПоступлениеНМА.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И ПоступлениеНМА.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеНМА.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделокВВалюте.УчетАгентскогоНДС
	|				ТОГДА НДСПредъявленный.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСПредъявленный.Регистратор
	|				И (НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеНМАНематериальныеАктивы.Ссылка КАК Сделка,
	|	ПоступлениеНМАНематериальныеАктивы.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПоступлениеНМАНематериальныеАктивы.НематериальныйАктив КАК ПредметСделки,
	|	ПоступлениеНМАНематериальныеАктивы.НематериальныйАктив.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеНематериальныхАктивов) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеНМАНематериальныеАктивы.Сумма - ПоступлениеНМАНематериальныеАктивы.СуммаНДС
	|		ИНАЧЕ ПоступлениеНМАНематериальныеАктивы.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПоступлениеНМАНематериальныеАктивы.СтавкаНДС,
	|	ПоступлениеНМАНематериальныеАктивы.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПоступлениеНМА.НематериальныеАктивы КАК ПоступлениеНМАНематериальныеАктивы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеНМАНематериальныеАктивы.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеНМАНематериальныеАктивы.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент КАК ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПередачиОС(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", РегистрыСведений.НастройкиФормированияКонтролируемыхСделок.ПолучитьЕдиницуИзмеренияШтука());
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПередачаОС.Организация КАК Организация,
	|	ПередачаОС.Дата КАК Период,
	|	ПередачаОС.Ссылка КАК РасчетныйДокумент,
	|	ПередачаОС.Контрагент КАК Контрагент,
	|	ПередачаОС.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА ПередачаОС.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПередачаОС.Организация
	|		ИНАЧЕ ПередачаОС.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ПередачаОС.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПередачаОС.Контрагент
	|		ИНАЧЕ ПередачаОС.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ПередачаОС.ВалютаДокумента КАК ВалютаДокумента,
	|	ПередачаОС.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПередачаОС.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПередачаОС.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПередачаОС.Контрагент)
	|			И ПередачаОС.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПередачаОС.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПередачаОС.Контрагент)
	|ГДЕ
	|	ПередачаОС.Организация В(&СписокОрганизаций)
	|	И ПередачаОС.Дата >= &НачалоПериода
	|	И ПередачаОС.Дата <= &ОкончаниеПериода
	|	И ПередачаОС.Проведен = ИСТИНА
	|	И ПередачаОС.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И ПередачаОС.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаОСОС.Ссылка КАК Сделка,
	|	ПередачаОСОС.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ПередачаОСОС.ОсновноеСредство КАК ПредметСделки,
	|	ПередачаОСОС.ОсновноеСредство.Наименование КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияОсновныхСредств) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	|		ИНАЧЕ ПередачаОСОС.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПередачаОСОС.СтавкаНДС,
	|	ПередачаОСОС.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПередачаОС.ОС КАК ПередачаОСОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПередачаОСОС.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПередачаОСОС.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент КАК ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПередачиНМА(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", РегистрыСведений.НастройкиФормированияКонтролируемыхСделок.ПолучитьЕдиницуИзмеренияШтука());
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПередачаНМА.Организация КАК Организация,
	|	ПередачаНМА.Дата КАК Период,
	|	ПередачаНМА.Ссылка КАК РасчетныйДокумент,
	|	ПередачаНМА.Контрагент КАК Контрагент,
	|	ПередачаНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПередачаНМА.Организация КАК Грузоотправитель,
	|	ПередачаНМА.Контрагент КАК Грузополучатель,
	|	ПередачаНМА.ВалютаДокумента КАК ВалютаДокумента,
	|	ПередачаНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПередачаНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	|	ПередачаНМА.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаНМА КАК ПередачаНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПередачаНМА.Контрагент)
	|			И ПередачаНМА.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПередачаНМА.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПередачаНМА.Контрагент)
	|ГДЕ
	|	ПередачаНМА.Организация В(&СписокОрганизаций)
	|	И ПередачаНМА.Дата >= &НачалоПериода
	|	И ПередачаНМА.Дата <= &ОкончаниеПериода
	|	И ПередачаНМА.Проведен = ИСТИНА
	|	И ПередачаНМА.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И ПередачаНМА.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаНМА.Ссылка КАК Сделка,
	|	ПередачаНМА.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ПередачаНМА.НематериальныйАктив КАК ПредметСделки,
	|	ПередачаНМА.НематериальныйАктив.Наименование КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияОсновныхСредств) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	|		ИНАЧЕ ПередачаНМА.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПередачаНМА.СтавкаНДС,
	|	ПередачаНМА.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПередачаНМА КАК ПередачаНМА
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПередачаНМА.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПередачаНМА.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.СуммаВключаетНДС,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомитентуОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Организация КАК Организация,
	|	ОтчетКомитентуОПродажах.Дата КАК Период,
	|	ОтчетКомитентуОПродажах.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ОтчетКомитентуОПродажах.Контрагент КАК Грузополучатель,
	|	ОтчетКомитентуОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ОтчетКомитентуОПродажах.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомитентуОПродажах.Контрагент)
	|			И ОтчетКомитентуОПродажах.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомитентуОПродажах.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомитентуОПродажах.Контрагент)
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Организация В(&СписокОрганизаций)
	|	И ОтчетКомитентуОПродажах.Дата >= &НачалоПериода
	|	И ОтчетКомитентуОПродажах.Дата <= &ОкончаниеПериода
	|	И ОтчетКомитентуОПродажах.Проведен = ИСТИНА
	|	И ОтчетКомитентуОПродажах.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.Ссылка КАК Сделка,
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению КАК ПредметСделки,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	ОтчетКомитентуОПродажах.УслугаПоВознаграждению.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.СуммаБезНДС КАК СуммаБезНДС,
	|	ОтчетКомитентуОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ОтчетКомитентуОПродажахТоварыСгрупированный.СуммаНДС КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОтчетКомитентуОПродажахТовары.Ссылка КАК Ссылка,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		СУММА(ОтчетКомитентуОПродажахТовары.СуммаВознаграждения - ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаБезНДС
	|	ИЗ
	|		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ОтчетКомитентуОПродажахТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ОтчетКомитентуОПродажахТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомитентуОПродажахТовары.Ссылка) КАК ОтчетКомитентуОПродажахТоварыСгрупированный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|		ПО (ОтчетКомитентуОПродажах.Ссылка = ОтчетКомитентуОПродажахТоварыСгрупированный.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО (ОтчетКомитентуОПродажах.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет)
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент КАК ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомиссионераОПродажах(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	НастройкиФормированияСписка = РегистрыСведений.НастройкиФормированияКонтролируемыхСделок.ПолучитьНастройкиФормированияКонтролируемыхСделок();
	КомиссионноеВознаграждение = НастройкиФормированияСписка.КомиссионноеВознаграждение;
	
	Если НЕ ЗначениеЗаполнено(КомиссионноеВознаграждение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'В настройках формирования списка сделок не указан предмет сделки для комиссионного вознаграждения.
			|В сделках по отражению комиссионного вознаграждения предмет сделки будет не заполнен.'"));
	КонецЕсли;
	
	СвойстваКомиссионногоВознаграждения = Новый Структура();
	СвойстваКомиссионногоВознаграждения.Вставить("КомиссионноеВознаграждениеНаименование", "Комиссионное вознаграждение");
	СвойстваКомиссионногоВознаграждения.Вставить("КомиссионноеВознаграждениеЕдиницаИзмерения", РегистрыСведений.НастройкиФормированияКонтролируемыхСделок.ПолучитьЕдиницуИзмеренияШтука());
	
	Если ЗначениеЗаполнено(КомиссионноеВознаграждение) Тогда
		Свойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КомиссионноеВознаграждение, "НаименованиеПолное, БазоваяЕдиницаИзмерения");
		СвойстваКомиссионногоВознаграждения.КомиссионноеВознаграждениеНаименование = Свойства.НаименованиеПолное;
		СвойстваКомиссионногоВознаграждения.КомиссионноеВознаграждениеЕдиницаИзмерения = Свойства.БазоваяЕдиницаИзмерения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("КомиссионноеВознаграждение", КомиссионноеВознаграждение);
	Запрос.УстановитьПараметр("КомиссионноеВознаграждениеНаименование", СвойстваКомиссионногоВознаграждения.КомиссионноеВознаграждениеНаименование);
	Запрос.УстановитьПараметр("КомиссионноеВознаграждениеЕдиницаИзмерения", СвойстваКомиссионногоВознаграждения.КомиссионноеВознаграждениеЕдиницаИзмерения);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Организация КАК Организация,
	|	ОтчетКомиссионераОПродажах.Дата КАК Период,
	|	ОтчетКомиссионераОПродажах.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомиссионераОПродажах.Контрагент КАК Контрагент,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ОтчетКомиссионераОПродажах.СчетУчетаРасчетовЗаПосредническиеУслуги КАК СчетУчетаРасчетов,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомиссионераОПродажах.Контрагент)
	|			И ОтчетКомиссионераОПродажах.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомиссионераОПродажах.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомиссионераОПродажах.Контрагент)
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Организация В(&СписокОрганизаций)
	|	И ОтчетКомиссионераОПродажах.Дата >= &НачалоПериода
	|	И ОтчетКомиссионераОПродажах.Дата <= &ОкончаниеПериода
	|	И ОтчетКомиссионераОПродажах.Проведен = ИСТИНА
	|	И ОтчетКомиссионераОПродажах.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделокВВалюте.УчетАгентскогоНДС
	|				ТОГДА НДСПредъявленный.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСПредъявленный.Регистратор
	|				И (НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.Ссылка КАК Сделка,
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	&КомиссионноеВознаграждение КАК ПредметСделки,
	|	&КомиссионноеВознаграждениеНаименование КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	1 КАК Количество,
	|	1 КАК КоличествоВУчете,
	|	&КомиссионноеВознаграждениеЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.СуммаБезНДС КАК СуммаБезНДС,
	|	ОтчетКомиссионераОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ОтчетКомиссионераОПродажахТоварыСгрупированный.СуммаНДС КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОтчетКомиссионераОПродажахТовары.Ссылка КАК Ссылка,
	|		СУММА(ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения) КАК СуммаНДС,
	|		СУММА(ВЫБОР
	|				КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|					ТОГДА ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения - ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения
	|				ИНАЧЕ ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения
	|			КОНЕЦ) КАК СуммаБезНДС
	|	ИЗ
	|		Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|			ПО ОтчетКомиссионераОПродажахТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|	ГДЕ
	|		ОтчетКомиссионераОПродажахТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ОтчетКомиссионераОПродажахТовары.Ссылка) КАК ОтчетКомиссионераОПродажахТоварыСгрупированный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ПО (ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахТоварыСгрупированный.Ссылка)
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";

	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиВозвратаТоваровПоставщику(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВозвратТоваровПоставщику.Ссылка КАК ДокументВозврата,
	|	ПоступлениеТоваровУслуг.Ссылка КАК ДокументПоступления,
	|	ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента,
	|	ВозвратТоваровПоставщику.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыПоступленияИВозврата
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщику.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО ВозвратТоваровПоставщикуТовары.ДокументПоступления = ПоступлениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ВозвратТоваровПоставщику.Организация В(&СписокОрганизаций)
	|	И ВозвратТоваровПоставщику.Дата >= &НачалоПериода
	|	И ВозвратТоваровПоставщику.Проведен = ИСТИНА
	|	И ВозвратТоваровПоставщику.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВозвратТоваровПоставщику.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ВозвратТоваровПоставщикуТовары.ДокументПоступления ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И ВозвратТоваровПоставщикуТовары.ДокументПоступления <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления,
	|	ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыПоступленияИВозврата.ДокументВозврата,
	|	ДокументыПоступленияИВозврата.СуммаВключаетНДС,
	|	ДокументыПоступленияИВозврата.ВалютаДокумента,
	|	ДокументыПоступленияИВозврата.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыВозврата
	|ИЗ
	|	ДокументыПоступленияИВозврата КАК ДокументыПоступленияИВозврата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыПоступленияИВозврата.ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Дата КАК Период,
	|	ПоступлениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Организация
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|			И ПоступлениеТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыПоступленияИВозврата.ДокументПоступления
	|			ИЗ
	|				ДокументыПоступленияИВозврата КАК ДокументыПоступленияИВозврата)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыВозврата.ДокументВозврата КАК РасчетныйДокумент,
	|	ДокументыВозврата.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыВозврата КАК ДокументыВозврата
	|ГДЕ
	|	ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыВозврата.ДокументВозврата";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделокВВалюте.УчетАгентскогоНДС
	|				ТОГДА НДСПредъявленный.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСПредъявленный.Регистратор
	|				И (НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		-НДСНачисленный.НДС,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделокВВалюте.УчетАгентскогоНДС
	|				ТОГДА -НДСНачисленный.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщикуТовары.Ссылка КАК Сделка,
	|	ВозвратТоваровПоставщикуТовары.ДокументПоступления КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура КАК ПредметСделки,
	|	ВозвратТоваровПоставщикуТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ВозвратТоваров) КАК ХозяйственнаяОперация,
	|	-ВозвратТоваровПоставщикуТовары.Количество КАК Количество,
	|	-ВозвратТоваровПоставщикуТовары.Количество * ВозвратТоваровПоставщикуТовары.Коэффициент / ВозвратТоваровПоставщикуТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыВозврата.СуммаВключаетНДС
	|			ТОГДА -(ВозвратТоваровПоставщикуТовары.Сумма - ВозвратТоваровПоставщикуТовары.СуммаНДС)
	|		ИНАЧЕ -ВозвратТоваровПоставщикуТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	|	-ВозвратТоваровПоставщикуТовары.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыВозврата КАК ДокументыВозврата
	|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ДокументыВозврата.ДокументВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ВозвратТоваровПоставщикуТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ВозвратТоваровПоставщикуТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ВозвратТоваровПоставщикуТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыВозврата.ДокументВозврата
	|			ИЗ
	|				ДокументыВозврата КАК ДокументыВозврата)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыПоступленияИВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

КонецПроцедуры

Процедура ДобавитьСделкиВозвратаТоваровОтПокупателя(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВозвратТоваровОтПокупателя.Ссылка КАК ДокументВозврата,
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументРеализации,
	|	ВозвратТоваровОтПокупателя.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВозвратТоваровОтПокупателя.ВалютаДокумента
	|ПОМЕСТИТЬ ДокументыРеализацииИВозврата
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ВозвратТоваровОтПокупателя.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВозвратТоваровОтПокупателяТовары.ДокументПартии = РеализацияТоваровУслуг.Ссылка
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.Организация В(&СписокОрганизаций)
	|	И ВозвратТоваровОтПокупателя.Дата >= &НачалоПериода
	|	И ВозвратТоваровОтПокупателя.Проведен = ИСТИНА
	|	И ВозвратТоваровОтПокупателя.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВозвратТоваровОтПокупателя.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ВозвратТоваровОтПокупателяТовары.ДокументПартии ССЫЛКА Документ.РеализацияТоваровУслуг
	|	И ВозвратТоваровОтПокупателяТовары.ДокументПартии <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|	И РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРеализации,
	|	ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыРеализацииИВозврата.ДокументВозврата,
	|	ДокументыРеализацииИВозврата.СуммаВключаетНДС,
	|	ДокументыРеализацииИВозврата.ВалютаДокумента
	|ПОМЕСТИТЬ ДокументыВозврата
	|ИЗ
	|	ДокументыРеализацииИВозврата КАК ДокументыРеализацииИВозврата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыРеализацииИВозврата.ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыРеализацииИВозврата.ДокументРеализации
	|			ИЗ
	|				ДокументыРеализацииИВозврата КАК ДокументыРеализацииИВозврата)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыВозврата.ДокументВозврата КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыВозврата КАК ДокументыВозврата
	|ГДЕ
	|	ДокументыВозврата.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыВозврата.ДокументВозврата";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		-НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСПредъявленный.Регистратор
	|				И (НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка КАК Сделка,
	|	ВозвратТоваровОтПокупателяТовары.ДокументПартии КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура КАК ПредметСделки,
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ВозвратТоваров) КАК ХозяйственнаяОперация,
	|	-ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
	|	-ВозвратТоваровОтПокупателяТовары.Количество * ВозвратТоваровОтПокупателяТовары.Коэффициент / ВозвратТоваровОтПокупателяТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыВозврата.СуммаВключаетНДС
	|			ТОГДА -(ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС)
	|		ИНАЧЕ -ВозвратТоваровОтПокупателяТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	|	-ВозвратТоваровОтПокупателяТовары.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыВозврата КАК ДокументыВозврата
	|		ПО (ДокументыВозврата.ДокументВозврата = ВозвратТоваровОтПокупателяТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ВозвратТоваровОтПокупателяТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО ВозвратТоваровОтПокупателяТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыВозврата.ДокументВозврата
	|			ИЗ
	|				ДокументыВозврата КАК ДокументыВозврата)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыВозврата.ДокументВозврата
	|			ИЗ
	|				ДокументыВозврата КАК ДокументыВозврата)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыРеализацииИВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиКорректировкиРеализации(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК ДокументКорректировки,
	|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаРеализации.ВалютаДокумента,
	|	КорректировкаРеализации.ДокументРеализации
	|ПОМЕСТИТЬ ДокументыКорректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Организация В(&СписокОрганизаций)
	|	И КорректировкаРеализации.Дата >= &НачалоПериода
	|	И КорректировкаРеализации.Проведен = ИСТИНА
	|	И КорректировкаРеализации.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И КорректировкаРеализации.КорректироватьБУиНУ = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКорректировки.ДокументКорректировки,
	|	ДокументыКорректировки.СуммаВключаетНДС,
	|	ДокументыКорректировки.ДокументРеализации
	|ИЗ
	|	ДокументыКорректировки КАК ДокументыКорректировки";
	
	ТаблицаКорректировок = Новый ТаблицаЗначений();
	ТаблицаКорректировок.Колонки.Добавить("ДокументКорректировки", Новый ОписаниеТипов("ДокументСсылка.КорректировкаРеализации"));
	ТаблицаКорректировок.Колонки.Добавить("СуммаВключаетНДС", Новый ОписаниеТипов("Булево"));
	ТаблицаКорректировок.Колонки.Добавить("ДокументРеализации", Метаданные.Документы.КорректировкаРеализации.Реквизиты.ИсправляемыйДокументРеализации.Тип);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКорректировок = ТаблицаКорректировок.Добавить();
		СтрокаКорректировок.ДокументКорректировки = Выборка.ДокументКорректировки;
		СтрокаКорректировок.СуммаВключаетНДС = Выборка.СуммаВключаетНДС;
		СтрокаКорректировок.ДокументРеализации = УчетНДС.ПолучитьИсправляемыйДокументРеализации(Выборка.ДокументРеализации, Истина);
	КонецЦикла;

	Запрос.Параметры.Вставить("ДокументыКорректировкиИРеализации", ТаблицаКорректировок);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКорректировкиИРеализации.ДокументКорректировки КАК ДокументКорректировки,
	|	ДокументыКорректировкиИРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации КАК ДокументРеализации
	|ПОМЕСТИТЬ ДокументыКорректировкиИРеализации
	|ИЗ
	|	&ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРеализации,
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировкиИРеализации.ДокументРеализации
	|			ИЗ
	|				ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И РеализацияТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности)
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Акт.Организация,
	|	Акт.Ссылка,
	|	Акт.Дата,
	|	Акт.Контрагент,
	|	ВЫБОР
	|		КОГДА Акт.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Акт.Контрагент
	|		ИНАЧЕ Акт.Грузополучатель
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	Акт.ДоговорКонтрагента,
	|	Акт.ВалютаДокумента,
	|	Акт.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ),
	|	Акт.ДоговорКонтрагента.ВидДоговора,
	|	Акт.ДоговорКонтрагента.ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК Акт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = Акт.Контрагент)
	|			И Акт.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И Акт.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = Акт.Контрагент)
	|ГДЕ
	|	Акт.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировкиИРеализации.ДокументРеализации
	|			ИЗ
	|				ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации)
	|	И Акт.Организация В(&СписокОрганизаций)
	|	И Акт.Дата >= &НачалоПериода
	|	И Акт.Дата <= &ОкончаниеПериода
	|	И Акт.Проведен = ИСТИНА
	|	И Акт.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И Акт.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКорректировки.ДокументКорректировки КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКорректировки КАК ДокументыКорректировки
	|ГДЕ
	|	ДокументыКорректировки.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКорректировки.ДокументКорректировки";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоРеализацииОрганизации.Регистратор,
	|		РасчетыПоРеализацииОрганизации.СуммаНДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетыПоРеализацииОрганизации КАК РасчетыПоРеализацииОрганизации
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыПоРеализацииОрганизации.Регистратор) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка КАК Сделка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	КорректировкаРеализацииТовары.Номенклатура КАК ПредметСделки,
	|	КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка) КАК ХозяйственнаяОперация,
	|	-КорректировкаРеализацииТовары.КоличествоДоИзменения КАК Количество,
	|	-КорректировкаРеализацииТовары.КоличествоДоИзменения * КорректировкаРеализацииТовары.Коэффициент / КорректировкаРеализацииТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаРеализацииТовары.СуммаДоИзменения
	|	КОНЕЦ КАК СуммаБезНДС,
	|	КорректировкаРеализацииТовары.СтавкаНДСДоИзменения КАК СтавкаНДС,
	|	-КорректировкаРеализацииТовары.СуммаНДСДоИзменения КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаРеализацииТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаРеализацииТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаРеализацииТовары.Количество,
	|	КорректировкаРеализацииТовары.Количество * КорректировкаРеализацииТовары.Коэффициент / КорректировкаРеализацииТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииТовары.Сумма
	|	КОНЕЦ,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)),
	|	КорректировкаРеализацииТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаРеализацииТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаРеализацииТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииТовары.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииУслуги.Ссылка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	КорректировкаРеализацииУслуги.Номенклатура,
	|	КорректировкаРеализацииУслуги.СодержаниеДоИзменения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	-КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|	-КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаРеализацииУслуги.СуммаДоИзменения
	|	КОНЕЦ,
	|	КорректировкаРеализацииУслуги.СтавкаНДСДоИзменения,
	|	-КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииУслуги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииУслуги.Ссылка,
	|	ДокументыКорректировкиИРеализации.ДокументРеализации,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	КорректировкаРеализацииУслуги.Номенклатура,
	|	КорректировкаРеализацииУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаРеализацииУслуги.Количество,
	|	КорректировкаРеализацииУслуги.Количество,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИРеализации.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма
	|	КОНЕЦ,
	|	КорректировкаРеализацииУслуги.СтавкаНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СчетаУчетаПоДеятельностиЕНВД.Счет ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ПО (ДокументыКорректировкиИРеализации.ДокументКорректировки = КорректировкаРеализацииУслуги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаУчетаПоДеятельностиЕНВД КАК СчетаУчетаПоДеятельностиЕНВД
	|		ПО КорректировкаРеализацииУслуги.СчетДоходовБУ = СчетаУчетаПоДеятельностиЕНВД.Счет
	|ГДЕ
	|	КорректировкаРеализацииУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировкиИРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

	
КонецПроцедуры

Процедура ДобавитьСделкиКорректировкиПоступления(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка КАК ДокументКорректировки,
	|	КорректировкаПоступления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаПоступления.ВалютаДокумента КАК ВалютаДокумента,
	|	КорректировкаПоступления.ДокументПоступления КАК ДокументПоступления,
	|	КорректировкаПоступления.ДоговорКонтрагента.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКорректировки
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.Организация В(&СписокОрганизаций)
	|	И КорректировкаПоступления.Дата >= &НачалоПериода
	|	И КорректировкаПоступления.Проведен = ИСТИНА
	|	И КорректировкаПоступления.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И КорректировкаПоступления.КорректироватьБУиНУ = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКорректировки.ДокументКорректировки,
	|	ДокументыКорректировки.СуммаВключаетНДС,
	|	ДокументыКорректировки.ДокументПоступления
	|ИЗ
	|	ДокументыКорректировки КАК ДокументыКорректировки";
	
	ТаблицаКорректировок = Новый ТаблицаЗначений();
	ТаблицаКорректировок.Колонки.Добавить("ДокументКорректировки", Новый ОписаниеТипов("ДокументСсылка.КорректировкаПоступления"));
	ТаблицаКорректировок.Колонки.Добавить("СуммаВключаетНДС", Новый ОписаниеТипов("Булево"));
	ТаблицаКорректировок.Колонки.Добавить("ДокументПоступления", Метаданные.Документы.КорректировкаПоступления.Реквизиты.ИсправляемыйДокументПоступления.Тип);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаКорректировок = ТаблицаКорректировок.Добавить();
		СтрокаКорректировок.ДокументКорректировки = Выборка.ДокументКорректировки;
		СтрокаКорректировок.СуммаВключаетНДС = Выборка.СуммаВключаетНДС;
		СтрокаКорректировок.ДокументПоступления = УчетНДС.ПолучитьИсправляемыйДокументПоступления(Выборка.ДокументПоступления, Истина);
	КонецЦикла;

	Запрос.Параметры.Вставить("ДокументыКорректировкиИПоступления", ТаблицаКорректировок);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКорректировкиИПоступления.ДокументКорректировки КАК ДокументКорректировки,
	|	ДокументыКорректировкиИПоступления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления КАК ДокументПоступления
	|ПОМЕСТИТЬ ДокументыКорректировкиИПоступления
	|ИЗ
	|	&ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПоступления,
	|	ДокументКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Дата КАК Период,
	|	ПоступлениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Организация
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ПоступлениеТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	|	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|			И ПоступлениеТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслуг.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировкиИПоступления.ДокументПоступления
	|			ИЗ
	|				ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления)
	|	И ПоступлениеТоваровУслуг.Организация В(&СписокОрганизаций)
	|	И ПоступлениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКорректировки.ДокументКорректировки КАК РасчетныйДокумент,
	|	ДокументыКорректировки.УчетАгентскогоНДС КАК УчетАгентскогоНДС
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКорректировки КАК ДокументыКорректировки
	|ГДЕ
	|	ДокументыКорректировки.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКорректировки.ДокументКорректировки";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоПриобретениюОрганизации.Регистратор,
	|		РасчетыПоПриобретениюОрганизации.СуммаНДС,
	|		ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделокВВалюте.УчетАгентскогоНДС
	|				ТОГДА РасчетыПоПриобретениюОрганизации.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасчетыПоПриобретениюОрганизации КАК РасчетыПоПриобретениюОрганизации
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыПоПриобретениюОрганизации.Регистратор) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаПоступленияТовары.Ссылка КАК Сделка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	КорректировкаПоступленияТовары.Номенклатура КАК ПредметСделки,
	|	КорректировкаПоступленияТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка) КАК ХозяйственнаяОперация,
	|	-КорректировкаПоступленияТовары.КоличествоДоИзменения КАК Количество,
	|	-КорректировкаПоступленияТовары.КоличествоДоИзменения * КорректировкаПоступленияТовары.Коэффициент / КорректировкаПоступленияТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	КорректировкаПоступленияТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаПоступленияТовары.СуммаДоИзменения - КорректировкаПоступленияТовары.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаПоступленияТовары.СуммаДоИзменения
	|	КОНЕЦ КАК СуммаБезНДС,
	|	КорректировкаПоступленияТовары.СтавкаНДСДоИзменения КАК СтавкаНДС,
	|	-КорректировкаПоступленияТовары.СуммаНДСДоИзменения КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	КорректировкаПоступленияТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаПоступленияТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаПоступленияТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	КорректировкаПоступленияТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияТовары.Ссылка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	КорректировкаПоступленияТовары.Номенклатура,
	|	КорректировкаПоступленияТовары.Номенклатура.НаименованиеПолное,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаПоступленияТовары.Количество,
	|	КорректировкаПоступленияТовары.Количество * КорректировкаПоступленияТовары.Коэффициент / КорректировкаПоступленияТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	КорректировкаПоступленияТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА КорректировкаПоступленияТовары.Сумма - КорректировкаПоступленияТовары.СуммаНДС
	|		ИНАЧЕ КорректировкаПоступленияТовары.Сумма
	|	КОНЕЦ,
	|	КорректировкаПоступленияТовары.СтавкаНДС,
	|	КорректировкаПоступленияТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)),
	|	КорректировкаПоступленияТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО КорректировкаПоступленияТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КорректировкаПоступленияТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	КорректировкаПоступленияТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияУслуги.Ссылка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	КорректировкаПоступленияУслуги.Номенклатура,
	|	КорректировкаПоступленияУслуги.СодержаниеДоИзменения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	-КорректировкаПоступленияУслуги.КоличествоДоИзменения,
	|	-КорректировкаПоступленияУслуги.КоличествоДоИзменения,
	|	КорректировкаПоступленияУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА -(КорректировкаПоступленияУслуги.СуммаДоИзменения - КорректировкаПоступленияУслуги.СуммаНДСДоИзменения)
	|		ИНАЧЕ -КорректировкаПоступленияУслуги.СуммаДоИзменения
	|	КОНЕЦ,
	|	КорректировкаПоступленияУслуги.СтавкаНДСДоИзменения,
	|	-КорректировкаПоступленияУслуги.СуммаНДСДоИзменения,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияУслуги.Ссылка)
	|ГДЕ
	|	КорректировкаПоступленияУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступленияУслуги.Ссылка,
	|	ДокументыКорректировкиИПоступления.ДокументПоступления,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	КорректировкаПоступленияУслуги.Номенклатура,
	|	КорректировкаПоступленияУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка),
	|	КорректировкаПоступленияУслуги.Количество,
	|	КорректировкаПоступленияУслуги.Количество,
	|	КорректировкаПоступленияУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКорректировкиИПоступления.СуммаВключаетНДС
	|			ТОГДА КорректировкаПоступленияУслуги.Сумма - КорректировкаПоступленияУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаПоступленияУслуги.Сумма
	|	КОНЕЦ,
	|	КорректировкаПоступленияУслуги.СтавкаНДС,
	|	КорректировкаПоступленияУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКорректировкиИПоступления КАК ДокументыКорректировкиИПоступления
	|		ПО (ДокументыКорректировкиИПоступления.ДокументКорректировки = КорректировкаПоступленияУслуги.Ссылка)
	|ГДЕ
	|	КорректировкаПоступленияУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКорректировки.ДокументКорректировки
	|			ИЗ
	|				ДокументыКорректировки КАК ДокументыКорректировки)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировкиИПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомиссионераОПродажахЗависимымЛицам(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(ПараметрыУведомления.Организация);
	Организации.Добавить(ПараметрыУведомления.Организация);
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("Организация", ПараметрыУведомления.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Организация КАК Организация,
	|	ОтчетКомиссионераОПродажах.Дата КАК Период,
	|	ОтчетКомиссионераОПродажах.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомиссионераОПродажах.Контрагент КАК Комиссионер,
	|	ОтчетКомиссионераОПродажахПокупатели.Покупатель КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорКонтрагента,
	|	ОтчетКомиссионераОПродажах.Контрагент КАК Грузоотправитель,
	|	НЕОПРЕДЕЛЕНО КАК Грузополучатель,
	|	ОтчетКомиссионераОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ОтчетКомиссионераОПродажах.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО ОтчетКомиссионераОПродажах.Ссылка = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомиссионераОПродажахПокупатели.Покупатель)
	|			И ОтчетКомиссионераОПродажах.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомиссионераОПродажах.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|ГДЕ
	|	ОтчетКомиссионераОПродажах.Организация В(&СписокОрганизаций)
	|	И ОтчетКомиссионераОПродажах.Дата >= &НачалоПериода
	|	И ОтчетКомиссионераОПродажах.Дата <= &ОкончаниеПериода
	|	И ОтчетКомиссионераОПродажах.Проведен = ИСТИНА
	|	И ОтчетКомиссионераОПродажах.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|ГДЕ
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент";
	
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоРеализацииВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = РасчетыДокумента.Регистратор
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСНачисленный.Регистратор,
	|		НДСНачисленный.НДС,
	|		0
	|	ИЗ
	|		ДокументыКонтролируемыхСделокВВалюте КАК ДокументыКонтролируемыхСделокВВалюте
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|			ПО ДокументыКонтролируемыхСделокВВалюте.РасчетныйДокумент = НДСНачисленный.Регистратор
	|				И (НДСНачисленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахТовары.Ссылка КАК Сделка,
	|	ОтчетКомиссионераОПродажахТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ОтчетКомиссионераОПродажахТовары.Номенклатура КАК ПредметСделки,
	|	ОтчетКомиссионераОПродажахТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.РасчетныйДокумент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров) КАК ХозяйственнаяОперация,
	|	ОтчетКомиссионераОПродажахТовары.Количество КАК Количество,
	|	ОтчетКомиссионераОПродажахТовары.Количество * ОтчетКомиссионераОПродажахТовары.Коэффициент / ОтчетКомиссионераОПродажахТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОПродажахТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА ОтчетКомиссионераОПродажахТовары.Сумма - ОтчетКомиссионераОПродажахТовары.СуммаНДС
	|		ИНАЧЕ ОтчетКомиссионераОПродажахТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ОтчетКомиссионераОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомиссионераОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОПродажах.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО (ОтчетКомиссионераОПродажахПокупатели.КлючСтроки = ОтчетКомиссионераОПродажахТовары.КлючСтроки)
	|			И (ОтчетКомиссионераОПродажахПокупатели.Ссылка = ОтчетКомиссионераОПродажахТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ОтчетКомиссионераОПродажахТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			И (ДокументыКонтролируемыхСделок.Контрагент = ОтчетКомиссионераОПродажахПокупатели.Покупатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ОтчетКомиссионераОПродажахТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ОтчетКомиссионераОПродажахТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ОтчетКомиссионераОПродажахТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Комиссионер КАК Комиссионер,
	|	ДокументыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица,
	|	ЛОЖЬ КАК ИностранныйКонтрагент,
	|	ЛОЖЬ КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель КАК Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель КАК Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗапросКомиссионныхТоваров = Новый Запрос();
	ЗапросКомиссионныхТоваров.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросКомиссионныхТоваров.Текст =
	"ВЫБРАТЬ
	|	РеализованныеТовары.Регистратор КАК Сделка,
	|	РеализованныеТовары.Номенклатура КАК ПредметСделки,
	|	РеализованныеТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(РеализованныеТовары.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
	|ГДЕ
	|	РеализованныеТовары.Регистратор В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|	И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.СерияНоменклатуры,
	|	РеализованныеТовары.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделка,
	|	ПредметСделки,
	|	СерияНоменклатуры";
	
	КомиссионныеТовары = ЗапросКомиссионныхТоваров.Выполнить().Выгрузить();
	КомиссионныеТовары.Индексы.Добавить("Сделка, ПредметСделки, СерияНоменклатуры");
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, КомиссионныеТовары);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокВВалюте";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВЕРСИЯ УВЕДОМЛЕНИЯ

Функция ВерсияУведомления(Уведомление) Экспорт
	
	ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012();
	
	Если ЗначениеЗаполнено(Уведомление) Тогда
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "ВерсияУведомления");
		
	КонецЕсли;
	
	Возврат ВерсияУведомления;
	
КонецФункции

Функция ВерсияУведомленияПоОтчетномуГоду(ОтчетныйГод) Экспорт
	
	Если ОтчетныйГод >= Дата(2018, 1, 1) Тогда
		Возврат КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018();
	ИначеЕсли ОтчетныйГод >= Дата(2017, 1, 1) Тогда
		Возврат КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2017();
	Иначе
		Возврат КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012();
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ДЛЯ РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТИ

Функция ПолучитьСведенияОбУведомлении(Уведомление) Экспорт
	
	Реквизиты = Новый Структура();
	Реквизиты.Вставить("Уведомление", "Ссылка");
	Реквизиты.Вставить("Организация", "Организация");
	Реквизиты.Вставить("НаименованиеОрганизации", "Организация.НаименованиеПолное");
	Реквизиты.Вставить("ИНН", "Организация.ИНН");
	Реквизиты.Вставить("КПП", "Организация.КПП");
	Реквизиты.Вставить("ОтчетныйГод", "ОтчетныйГод");
	Реквизиты.Вставить("ВерсияУведомления", "ВерсияУведомления");
	Реквизиты.Вставить("ЮрФизЛицо", "Организация.ЮрФизЛицо");
	Реквизиты.Вставить("НомерКорректировки", "НомерКорректировки");
	Реквизиты.Вставить("ИндивидуальныйПредприниматель", "Организация.ИндивидуальныйПредприниматель");
	Реквизиты.Вставить("ВерсияУведомления", "ВерсияУведомления");
	
	Сведения = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, Реквизиты);
	
	Если Сведения.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		И ЗначениеЗаполнено(Сведения.ИндивидуальныйПредприниматель) Тогда
		
		ДатаСведений = ТекущаяДатаСеанса();
		
		Сведения.Вставить("ИндивидуальныйПредпринимательФИО", РегламентированнаяОтчетность.ПолучитьФИОФизЛица(Сведения.ИндивидуальныйПредприниматель, ДатаСведений));
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сведения.ВерсияУведомления) Тогда
		Сведения.ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012();
	КонецЕсли;
	
	Сведения.Вставить("ПараметрыВерсии", ПараметрыВерсииУведомления(Сведения.ВерсияУведомления));
	
	Возврат Сведения;
	
	Возврат ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, Реквизиты);
	
КонецФункции

Функция ПолучитьОсновныеСведенияУведомленияДляВыгрузки(Уведомление) Экспорт
	
	ОсновныеСведения = Новый Структура;
	
	РеквизитыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление,
		"Организация, НомерКорректировки, ВерсияУведомления, КодМестаПредставления,
		|ОтчетныйГод, КодФормыРеорганизации, ИННРеорганизованнойОрганизации, КППРеорганизованнойОрганизации");
	
	ВерсияУведомления = РеквизитыУведомления.ВерсияУведомления;
	Организация  = РеквизитыУведомления.Организация;
	ДатаСведений = ТекущаяДатаСеанса();
	
	ОсновныеСведения.Вставить("ВерсияУведомления", ВерсияУведомления);
	ОсновныеСведения.Вставить("Организация", Организация);
	ОсновныеСведения.Вставить("ДатаДок", ДатаСведений);
	ОсновныеСведения.Вставить("ПоМесту", РеквизитыУведомления.КодМестаПредставления);
	ОсновныеСведения.Вставить("НомКорр", Формат(РеквизитыУведомления.НомерКорректировки, "ЧН=; ЧГ=0"));
	
	ВерсПрог = Лев("1С:ПРЕДПРИЯТИЕ " + РегламентированнаяОтчетность.ИДКонфигурации() + " " + СокрЛП(Метаданные.Версия), 40);
	ОсновныеСведения.Вставить("ВерсПрог", ВерсПрог);
	
	Если РеквизитыУведомления.КодФормыРеорганизации <> "" Тогда
		ОсновныеСведения.Вставить("ФормРеорг",  РеквизитыУведомления.КодФормыРеорганизации);
		ОсновныеСведения.Вставить("ИННЮЛРеорг", РеквизитыУведомления.ИННРеорганизованнойОрганизации);
		ОсновныеСведения.Вставить("КППЮЛРеорг", РеквизитыУведомления.КППРеорганизованнойОрганизации);
	КонецЕсли;
	
	ОтчетГод = Формат(РеквизитыУведомления.ОтчетныйГод, "ДФ=yyyy");
	ОсновныеСведения.Вставить("ОтчетГод", ОтчетГод);
	ОсновныеСведения.Вставить("ОтчетныйГод", РеквизитыУведомления.ОтчетныйГод);
	
	ПараметрыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
		"ИНН, КПП, НаименованиеПолное, КодИМНС, ЮрФизЛицо, ИндивидуальныйПредприниматель, КодОКВЭД, КодОКВЭД2, КодПоОКАТО, КодПоОКТМО");
	
	РегистрацияВИФНС = ПолучитьРегистрациюВИФНСПоОрганизации(Организация);
	ПараметрыОрганизации.Вставить("РегистрацияВИФНС", РегистрацияВИФНС);
	
	ОрганизацияФизЛицо = ПараметрыОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
	
	Если ОрганизацияФизЛицо Тогда
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица;
		Данные = Новый Структура("Объект, Тип, Вид", ПараметрыОрганизации.ИндивидуальныйПредприниматель, Перечисления.ТипыКонтактнойИнформации.Телефон, ВидКонтактнойИнформации);
		ТелефонОрганизации = РегистрыСведений.КонтактнаяИнформация.Получить(Данные).Представление;
	Иначе
		ЭлементТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
		Данные = Новый Структура("Объект, Тип, Вид", Организация, Перечисления.ТипыКонтактнойИнформации.Телефон, ЭлементТелефон);
		ТелефонОрганизации = РегистрыСведений.КонтактнаяИнформация.Получить(Данные).Представление;
	КонецЕсли;
	
	ТелефонОрганизации = СтрЗаменить(ТелефонОрганизации, " ", "");
	
	ОКАТО = "";
	ОКТМО = "";
	
	Если ЗначениеЗаполнено(ПараметрыОрганизации.РегистрацияВИФНС) Тогда
		ОКАТО = ПараметрыОрганизации.КодПоОКАТО;
		ОКТМО = СокрЛП(ПараметрыОрганизации.КодПоОКТМО);
	КонецЕсли;
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		Если СтрДлина(ОКТМО) > 0 Тогда
			Пока СтрДлина(ОКТМО)< 11 Цикл
				ОКТМО = ОКТМО + "0";
			КонецЦикла;
		КонецЕсли;
		Если РеквизитыУведомления.ОтчетныйГод < Дата(2012,12,31) Тогда
			ОсновныеСведения.Вставить("ОКАТО", ОКАТО);
		Иначе
			ОсновныеСведения.Вставить("ОКАТО", ОКТМО);
		КонецЕсли;
		ОсновныеСведения.Вставить("ОКВЭД", ПараметрыОрганизации.КодОКВЭД);
	Иначе
		ОсновныеСведения.Вставить("ОКТМО", ОКТМО);
	КонецЕсли;
	
	Если ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012() Тогда
		ОсновныеСведения.Вставить("ОКВЭД", ПараметрыОрганизации.КодОКВЭД);
	Иначе
		ОсновныеСведения.Вставить("ОКВЭД", ПараметрыОрганизации.КодОКВЭД2);
	КонецЕсли;
	ОсновныеСведения.Вставить("Тлф",   ТелефонОрганизации);
	ОсновныеСведения.Вставить("ЭлПочта", "");
	
	ОсновныеСведения.Вставить("НаименованиеОрганизации", ПараметрыОрганизации.НаименованиеПолное);
	
	Если ОрганизацияФизЛицо Тогда
		ИНН = ПараметрыОрганизации.ИНН;
		ЕстьИНН = ЗначениеЗаполнено(ИНН);
		
		ОсновныеСведения.Вставить("ЭтоПБОЮЛ", Истина);
		ОсновныеСведения.Вставить("ИндивидуальныйПредприниматель", ПараметрыОрганизации.ИндивидуальныйПредприниматель);
		ОсновныеСведения.Вставить("ЕстьИННФЛ", ЕстьИНН);
		ОсновныеСведения.Вставить("ИННФЛ", ИНН);
		
		ФизЛицо = ПараметрыОрганизации.ИндивидуальныйПредприниматель;
		
		ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаСведений, Новый Структура("ФизЛицо", ФизЛицо));
		Если ДанныеФЛ.Количество() > 0 Тогда
			ДанныеФизЛица = ДанныеФЛ[0];
			ОсновныеСведения.Вставить("НПФЛФамилия",  ДанныеФизЛица.Фамилия);
			ОсновныеСведения.Вставить("НПФЛИмя",      ДанныеФизЛица.Имя);
			ОсновныеСведения.Вставить("НПФЛОтчество", ДанныеФизЛица.Отчество);
			ОсновныеСведения.Вставить("НаименованиеДляЛиста1", ДанныеФизЛица.Фамилия + " " + ДанныеФизЛица.Имя + " " + ДанныеФизЛица.Отчество);
		Иначе
			ОсновныеСведения.Вставить("НПФЛФамилия",  "");
			ОсновныеСведения.Вставить("НПФЛИмя",      "");
			ОсновныеСведения.Вставить("НПФЛОтчество", "");
			ОсновныеСведения.Вставить("НаименованиеДляЛиста1", "");
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.Параметры.Вставить("ФизЛицо", ФизЛицо);
		Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГражданствоФизЛицСрезПоследних.Страна,
		|	ГражданствоФизЛицСрезПоследних.ФизЛицо
		|ПОМЕСТИТЬ ГражданствоФизЛица
		|ИЗ
		|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаСведений, ФизЛицо = &ФизЛицо) КАК ГражданствоФизЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних.Статус,
		|	СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних.ФизЛицо
		|ПОМЕСТИТЬ СтатусФизЛицКакНалогоплательщиковНДФЛ
		|ИЗ
		|	РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ.СрезПоследних(&ДатаСведений, ФизЛицо = &ФизЛицо) КАК СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|ПОМЕСТИТЬ ПаспортныеДанныеФизЛиц
		|ИЗ
		|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаСведений, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизическиеЛица.ДатаРождения,
		|	ФизическиеЛица.МестоРождения,
		|	ЕСТЬNULL(ГражданствоФизЛица.Страна, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК Страна,
		|	ЕСТЬNULL(СтатусФизЛицКакНалогоплательщиковНДФЛ.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) КАК СтатусНалогоплательщикаПоНДФЛ,
		|	ЕСТЬNULL(ПаспортныеДанныеФизЛиц.ДокументВид, ЗНАЧЕНИЕ(Справочник.ДокументыУдостоверяющиеЛичность.ПустаяСсылка)) КАК ДокументВид,
		|	ЕСТЬNULL(ПаспортныеДанныеФизЛиц.ДокументСерия, """") КАК ДокументСерия,
		|	ЕСТЬNULL(ПаспортныеДанныеФизЛиц.ДокументНомер, """") КАК ДокументНомер,
		|	ЕСТЬNULL(ПаспортныеДанныеФизЛиц.ДокументДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДокументДатаВыдачи,
		|	ЕСТЬNULL(ПаспортныеДанныеФизЛиц.ДокументКемВыдан, """") КАК ДокументКемВыдан,
		|	ЕСТЬNULL(ПаспортныеДанныеФизЛиц.ДокументКодПодразделения, """") КАК ДокументКодПодразделения,
		|	ЕСТЬNULL(ПаспортныеДанныеФизЛиц.ДатаРегистрацииПоМестуЖительства, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистрацииПоМестуЖительства,
		|	АдресПоПрописке.Поле1 КАК АдресПоПропискеПоле1,
		|	АдресПоПрописке.Поле2 КАК АдресПоПропискеПоле2,
		|	АдресПоПрописке.Поле3 КАК АдресПоПропискеПоле3,
		|	АдресПоПрописке.Поле4 КАК АдресПоПропискеПоле4,
		|	АдресПоПрописке.Поле5 КАК АдресПоПропискеПоле5,
		|	АдресПоПрописке.Поле6 КАК АдресПоПропискеПоле6,
		|	АдресПоПрописке.Поле7 КАК АдресПоПропискеПоле7,
		|	АдресПоПрописке.Поле8 КАК АдресПоПропискеПоле8,
		|	АдресПоПрописке.Поле9 КАК АдресПоПропискеПоле9,
		|	АдресПоПрописке.Поле10 КАК АдресПоПропискеПоле10,
		|	АдресПоПрописке.Представление КАК АдресПоПрописке,
		|	АдресЗаПределамиРФ.Поле1 КАК АдресЗаПределамиРФСтрана,
		|	АдресЗаПределамиРФ.Представление КАК АдресЗаПределамиРФ
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресПоПрописке
		|		ПО ФизическиеЛица.Ссылка = АдресПоПрописке.Объект
		|			И (АдресПоПрописке.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (АдресПоПрописке.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресЗаПределамиРФ
		|		ПО ФизическиеЛица.Ссылка = АдресЗаПределамиРФ.Объект
		|			И (АдресЗаПределамиРФ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
		|			И (АдресЗаПределамиРФ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнострАдресФизЛица))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ГражданствоФизЛица КАК ГражданствоФизЛица
		|		ПО ФизическиеЛица.Ссылка = ГражданствоФизЛица.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛицКакНалогоплательщиковНДФЛ
		|		ПО ФизическиеЛица.Ссылка = СтатусФизЛицКакНалогоплательщиковНДФЛ.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПаспортныеДанныеФизЛиц КАК ПаспортныеДанныеФизЛиц
		|		ПО ФизическиеЛица.Ссылка = ПаспортныеДанныеФизЛиц.ФизЛицо
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &ФизЛицо";
		ДанныеФизЛица = Запрос.Выполнить().Выбрать();
		Если ДанныеФизЛица.Следующий() Тогда
		
			ОсновныеСведения.Вставить("НПФЛДатаРожд",  ДанныеФизЛица.ДатаРождения);
			МестоРожденияСтруктура = РегламентированнаяОтчетность.РазложитьМестоРождения(ДанныеФизЛица.МестоРождения);
			
			МестоРождения = СокрЛП(МестоРожденияСтруктура.НаселенныйПункт);
			МестоРождения = МестоРождения + ?(МестоРождения = "", "", ", ") + СокрЛП(МестоРожденияСтруктура.Район);
			МестоРождения = МестоРождения + ?(МестоРождения = "", "", ", ") + СокрЛП(МестоРожденияСтруктура.Область);
			МестоРождения = МестоРождения + ?(МестоРождения = "", "", ", ") + СокрЛП(МестоРожденияСтруктура.Страна);
			
			ОсновныеСведения.Вставить("НПФЛМестоРожд", МестоРождения);
			
			Если ДанныеФизЛица.Страна = Справочники.КлассификаторСтранМира.Россия Тогда
				ОсновныеСведения.Вставить("НПФЛНалГражд", "1");
				ОсновныеСведения.Вставить("НПФЛОКСМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.КлассификаторСтранМира.Россия, "Код"));
			ИначеЕсли ЗначениеЗаполнено(ДанныеФизЛица.Страна) Тогда
				ОсновныеСведения.Вставить("НПФЛНалГражд", "2");
				ОсновныеСведения.Вставить("НПФЛОКСМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФизЛица.Страна, "Код"));
			Иначе
				ОсновныеСведения.Вставить("НПФЛНалГражд", "3");
				ОсновныеСведения.Вставить("НПФЛОКСМ", "");
			КонецЕсли;
			
			Если ДанныеФизЛица.СтатусНалогоплательщикаПоНДФЛ = Перечисления.СтатусыНалогоплательщиковПоНДФЛ.Резидент Тогда
				ОсновныеСведения.Вставить("НПФЛСтатусНП", "1");
			Иначе
				ОсновныеСведения.Вставить("НПФЛСтатусНП", "2");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФизЛица.ДокументВид) Тогда
				ОсновныеСведения.Вставить("НПФЛКодВидДок", КонтролируемыеСделкиПовтИсп.ПолучитьКодВидаДокументаПоВидуДокумента(ДанныеФизЛица.ДокументВид));
				ОсновныеСведения.Вставить("НПФЛСерНомДок", Строка(ДанныеФизЛица.ДокументСерия)+" "+Строка(ДанныеФизЛица.ДокументНомер));
				ОсновныеСведения.Вставить("НПФЛДатаДок",   ДанныеФизЛица.ДокументДатаВыдачи);
				ОсновныеСведения.Вставить("НПФЛВыдДок",    ДанныеФизЛица.ДокументКемВыдан);
			Иначе
				ОсновныеСведения.Вставить("НПФЛКодВидДок", "");
				ОсновныеСведения.Вставить("НПФЛСерНомДок", "");
				ОсновныеСведения.Вставить("НПФЛДатаДок",   "");
				ОсновныеСведения.Вставить("НПФЛВыдДок",    "");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФизЛица.АдресПоПрописке) Тогда
				
				Если ДанныеФизЛица.Страна = Справочники.КлассификаторСтранМира.Россия Тогда
					ОсновныеСведения.Вставить("НПФЛПрАдр", "1");
				Иначе
					ОсновныеСведения.Вставить("НПФЛПрАдр", "2");
				КонецЕсли;
				
				Если СокрЛП(ДанныеФизЛица.АдресПоПропискеПоле2) <> "" Тогда
					ОсновныеСведения.Вставить("НПФЛКодРегион", РегламентированнаяОтчетность.КодРегионаПоНазванию(ДанныеФизЛица.АдресПоПропискеПоле2));
				Иначе
					ОсновныеСведения.Вставить("НПФЛКодРегион", "");
				КонецЕсли;
				
				ОсновныеСведения.Вставить("НПФЛИндекс", ДанныеФизЛица.АдресПоПропискеПоле1);
				ОсновныеСведения.Вставить("НПФЛРайон",  ДанныеФизЛица.АдресПоПропискеПоле3);
				ОсновныеСведения.Вставить("НПФЛГород",  ДанныеФизЛица.АдресПоПропискеПоле4);
				ОсновныеСведения.Вставить("НПФЛНаселПункт", ДанныеФизЛица.АдресПоПропискеПоле5);
				ОсновныеСведения.Вставить("НПФЛУлица",   ДанныеФизЛица.АдресПоПропискеПоле6);
				ОсновныеСведения.Вставить("НПФЛДом",     ДанныеФизЛица.АдресПоПропискеПоле7);
				ОсновныеСведения.Вставить("НПФЛКорпус",  ДанныеФизЛица.АдресПоПропискеПоле8);
				ОсновныеСведения.Вставить("НПФЛКварт",   ДанныеФизЛица.АдресПоПропискеПоле9);
			Иначе
				ОсновныеСведения.Вставить("НПФЛПрАдр", "1");
				ОсновныеСведения.Вставить("НПФЛКодРегион", "");
				ОсновныеСведения.Вставить("НПФЛИндекс", "");
				ОсновныеСведения.Вставить("НПФЛРайон",  "");
				ОсновныеСведения.Вставить("НПФЛГород",  "");
				ОсновныеСведения.Вставить("НПФЛНаселПункт", "");
				ОсновныеСведения.Вставить("НПФЛУлица",   "");
				ОсновныеСведения.Вставить("НПФЛДом",     "");
				ОсновныеСведения.Вставить("НПФЛКорпус",  "");
				ОсновныеСведения.Вставить("НПФЛКварт",   "");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФизЛица.АдресЗаПределамиРФ) Тогда
				НаименованиеСтраны = ДанныеФизЛица.АдресЗаПределамиРФСтрана;
				Если ЗначениеЗаполнено(НаименованиеСтраны) Тогда
					НайденнаяСтрана = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(НаименованиеСтраны);
					Если ЗначениеЗаполнено(НайденнаяСтрана) И НайденнаяСтрана <> Справочники.КлассификаторСтранМира.Россия Тогда
						ОсновныеСведения.Вставить("АдрИнКодСтраны", НайденнаяСтрана.Код);
						ОсновныеСведения.Вставить("АдрИнТекст", ДанныеФизЛица.АдресЗаПределамиРФ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		ОсновныеСведения.Вставить("ЭтоПБОЮЛ", Ложь);
		ОсновныеСведения.Вставить("НаимОрг", ПараметрыОрганизации.НаименованиеПолное);
		ОсновныеСведения.Вставить("НаименованиеДляЛиста1", ПараметрыОрганизации.НаименованиеПолное);
		ОсновныеСведения.Вставить("ИННЮЛ",   ПараметрыОрганизации.ИНН);
		ОсновныеСведения.Вставить("КППЮЛ",   ПараметрыОрганизации.КПП);
	КонецЕсли;
	
	ОсновныеСведения.Вставить("КодНО", ПараметрыОрганизации.КодИМНС);
	
	КПП = ?(ОсновныеСведения.Свойство("КППЮЛ"), ОсновныеСведения.КППЮЛ, "");
	
	ДобавитьСведенияОПодписанте(ОсновныеСведения, ДатаСведений);
	
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	
	Возврат ОсновныеСведения;
	
КонецФункции

Процедура ДобавитьСведенияОПодписанте(ОсновныеСведения, ДатаСведений)
	
	ТипПодписанта = "1";
	Подписант = "";
	НаименованиеОрганизацииПредставителя = "";
	ДокументПредставителя = "";
	
	КодНО = ОсновныеСведения.КодНО;
	КПП   = ?(ОсновныеСведения.Свойство("КППЮЛ"), ОсновныеСведения.КППЮЛ, "");
	
	СведенияОПредставителе = ПолучитьПоКодамСведенияОПредставителе(ОсновныеСведения.Организация, КодНО, КПП);
	
	ОсновныеСведения.Вставить("РегистрацияВИФНС", СведенияОПредставителе.РегистрацияВИФНС);
	
	ТипПодписанта = СведенияОПредставителе.ТипПодписанта;
	ОсновныеСведения.Вставить("ПрПодп", ТипПодписанта);
	
	Если ТипПодписанта = "1" Тогда
		// Представителя нет.
		Если РегламентированнаяОтчетность.ЭтоПБОЮЛ(ОсновныеСведения.Организация) Тогда
			// ФИО подписанта не заполняется.
		Иначе
			ФИОПодписанта = СведенияОРуководителе(ОсновныеСведения.Организация, ДатаСведений);
			ОсновныеСведения.Вставить("ПодпФамилия",  ФИОПодписанта.Фамилия);
			ОсновныеСведения.Вставить("ПодпИмя",      ФИОПодписанта.Имя);
			ОсновныеСведения.Вставить("ПодпОтчество", ФИОПодписанта.Отчество);
		КонецЕсли;
	Иначе
		// Есть представитель.
		Если ТипЗнч(СведенияОПредставителе.ПредставительСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			ФИОПодписанта = РазделенныеФИО(СведенияОПредставителе.ФИОПредставителя);
			
			ОсновныеСведения.Вставить("НаимОргПодп", СведенияОПредставителе.НаименованиеОрганизацииПредставителя);
		Иначе
			ФИОПодписанта = РегламентированнаяОтчетность.ПолучитьФИОФизЛица(СведенияОПредставителе.ПредставительСсылка, ДатаСведений);
		КонецЕсли;
		
		ОсновныеСведения.Вставить("ПодпФамилия",  ФИОПодписанта.Фамилия);
		ОсновныеСведения.Вставить("ПодпИмя",      ФИОПодписанта.Имя);
		ОсновныеСведения.Вставить("ПодпОтчество", ФИОПодписанта.Отчество);
		
		ОсновныеСведения.Вставить("НаимДокПодп", СведенияОПредставителе.ДокументПредставителя);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторФайлаЭлектронногоПредставления(СведенияОтправки) Экспорт
	
	Префикс = "UT_UVKNRSD";
	Если СведенияОтправки.ЭтоПБОЮЛ Тогда
		ИдентификаторОтправителя = СокрЛП(СведенияОтправки.ИННФЛ);
		Если НЕ ЗначениеЗаполнено(ИдентификаторОтправителя) Тогда
			ИдентификаторОтправителя = "000000000000";
		КонецЕсли;
	Иначе
		ИдентификаторОтправителя = СокрЛП(СведенияОтправки.ИННЮЛ) + СокрЛП(СведенияОтправки.КППЮЛ);
	КонецЕсли;
	ИдентификаторПолучателя = СведенияОтправки.КодНО + "_" + СведенияОтправки.КодНО;
	ДатаФормированияФайла = Формат(СведенияОтправки.ДатаДок, "ДФ=yyyyMMdd");
	ИдентификационныйНомер = Строка(Новый УникальныйИдентификатор);
	
	ИдентификаторФайла = Префикс
	                   + "_" + ИдентификаторПолучателя
	                   + "_" + ИдентификаторОтправителя
	                   + "_" + ДатаФормированияФайла
	                   + "_" + ИдентификационныйНомер;
	
	Возврат ИдентификаторФайла;
	
КонецФункции

Функция ПолучитьПоКодамСведенияОПредставителе(Организация, КодНО, КПП = Неопределено)
	
	ТипПодписанта = "1";
	флПредставительЮрЛицо = Истина;
	НаименованиеОрганизацииПредставителя = "";
	ФИОПредставителя = "";
	ПредставительСсылка = Неопределено;
	ДокументПредставителя = "";
	
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	РегистрацияВИФНС.Представитель,
	               |	РегистрацияВИФНС.УполномоченноеЛицоПредставителя,
	               |	РегистрацияВИФНС.ДокументПредставителя,
	               |	РегистрацияВИФНС.Владелец.ЮрФизЛицо КАК ЮрФизЛицо,
	               |	РегистрацияВИФНС.Ссылка КАК РегистрацияВИФНС
	               |ИЗ
	               |	Справочник.РегистрацияВИФНС КАК РегистрацияВИФНС
	               |ГДЕ
	               |	РегистрацияВИФНС.Владелец = &Организация
	               |	И РегистрацияВИФНС.Код = &КодНО
	               |	И РегистрацияВИФНС.ПометкаУдаления = &ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);			   
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КодНО", КодНО);
	
	Если КПП <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + " И РегистрацияВИФНС.КПП = &КПП";
		Запрос.УстановитьПараметр("КПП", КПП);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Представитель) Тогда
		РегистрацияВИФНС = Выборка.РегистрацияВИФНС;
		ТипПодписанта = "2";
		ПредставительСсылка = Выборка.Представитель;
		ДокументПредставителя = Выборка.ДокументПредставителя;
		
		Если Выборка.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			флПредставительЮрЛицо = Истина;
			НаименованиеОрганизацииПредставителя = СокрЛП(ПредставительСсылка);
			ФИОПредставителя = СокрЛП(Выборка.УполномоченноеЛицоПредставителя);
		Иначе
			флПредставительЮрЛицо = Ложь;
			ФИОПредставителя = СокрЛП(ПредставительСсылка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("РегистрацияВИФНС, ТипПодписанта, флПредставительЮрЛицо, НаименованиеОрганизацииПредставителя, ФИОПредставителя, ПредставительСсылка, ДокументПредставителя", 
							РегистрацияВИФНС, ТипПодписанта, флПредставительЮрЛицо, НаименованиеОрганизацииПредставителя, ФИОПредставителя, ПредставительСсылка, ДокументПредставителя);
							 
КонецФункции //ПолучитьПоКодамСведенияОПредставителе

Функция ПолучитьРегистрациюВИФНСПоОрганизации(Организация)
	
	НалоговыйОрган = Справочники.РегистрацияВИФНС.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Организация) Тогда
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияВИФНС.Ссылка
		|ИЗ
		|	Справочник.РегистрацияВИФНС КАК РегистрацияВИФНС
		|ГДЕ
		|	РегистрацияВИФНС.ПометкаУдаления = ЛОЖЬ
		|	И РегистрацияВИФНС.Владелец = &Организация
		|	И РегистрацияВИФНС.Код = РегистрацияВИФНС.Владелец.КодИМНС";
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НалоговыйОрган = Выборка.Ссылка;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НалоговыйОрган;
	
КонецФункции

Функция СведенияОРуководителе(Организация, ДатаСведений)
	
	Результат = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	
	Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Руководитель = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(ДатаСведений, Данные);
	
	Если Руководитель <> Неопределено И Руководитель.Количество() > 0 Тогда
		ФЛ = Руководитель[0].ФизическоеЛицо;
		Если ЗначениеЗаполнено(ФЛ) Тогда
			ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаСведений, Новый Структура("ФизЛицо",ФЛ));
			Если ДанныеФЛ.Количество() > 0 Тогда
				Результат.Фамилия  = СокрЛП(ДанныеФЛ[0].Фамилия);
				Результат.Имя      = СокрЛП(ДанныеФЛ[0].Имя);
				Результат.Отчество = СокрЛП(ДанныеФЛ[0].Отчество);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазделенныеФИО(Знач ФИОСтр)
	
	ФИОСтр = СокрЛП(ФИОСтр);
	ФИО = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	
	ПервыйПробел = Найти(ФИОСтр, " ");
	Если ПервыйПробел = 0 Тогда
		ФИО.Фамилия = ФИОСтр;
		Возврат ФИО;
	КонецЕсли;
	ФИО.Фамилия = СокрЛП(Лев(ФИОСтр, ПервыйПробел - 1));
	ФИОСтр = СокрЛП(Сред(ФИОСтр, ПервыйПробел + 1));
	
	ВторойПробел = Найти(ФИОСтр, " ");
	Если ВторойПробел = 0 Тогда
		ФИО.Имя = ФИОСтр;
		Возврат ФИО;
	КонецЕсли;
	ФИО.Имя = СокрЛП(Лев(ФИОСтр, ВторойПробел - 1));
	
	ФИО.Отчество = СокрЛП(Сред(ФиоСтр, ВторойПробел + 1));
	
	Возврат ФИО;
	
КонецФункции

Функция СведенияОГражданстве2018(СтранаГражданства) Экспорт
	
	СведенияОГражданстве = Новый Структура();
	СведенияОГражданстве.Вставить("Гражд", "3"); // Без гражданства
	СведенияОГражданстве.Вставить("ОКСМ", "");
	
	Если ЗначениеЗаполнено(СтранаГражданства) Тогда
		СведенияОГражданстве.Гражд = ?(СтранаГражданства = Справочники.КлассификаторСтранМира.Россия, "1", "2");
		СведенияОГражданстве.ОКСМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтранаГражданства, "Код");
	КонецЕсли;
	
	Возврат СведенияОГражданстве;
	
КонецФункции

Процедура ДополнитьРегистрыНастроекДляУведомления(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеСделкиОрганизаций.Контрагент
	|ПОМЕСТИТЬ СписокКонтрагентов
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокКонтрагентов.Контрагент,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	КонтактнаяИнформация.Поле1,
	|	КонтактнаяИнформация.Поле2,
	|	КонтактнаяИнформация.Поле3,
	|	КонтактнаяИнформация.Поле4,
	|	КонтактнаяИнформация.Поле5,
	|	КонтактнаяИнформация.Поле6,
	|	КонтактнаяИнформация.Поле7,
	|	КонтактнаяИнформация.Поле8,
	|	КонтактнаяИнформация.Поле9,
	|	КонтактнаяИнформация.Поле10
	|ИЗ
	|	СписокКонтрагентов КАК СписокКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО СписокКонтрагентов.Контрагент = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО СписокКонтрагентов.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	УчастникиКонтролируемыхСделок.Контрагент ЕСТЬ NULL ";
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписейУчастники = РегистрыСведений.УчастникиКонтролируемыхСделок.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписейУчастники.Добавить();
		Запись.Контрагент = Выборка.Контрагент;
		
		АдресРФ = УправлениеКонтактнойИнформацией.ОпределитьДляОбъектаРоссийскийАдрес(Выборка);
		Если АдресРФ Тогда
			Запись.СтранаРегистрации = Справочники.КлассификаторСтранМира.Россия;
		Иначе
			Запись.СтранаРегистрации = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СокрЛП(Выборка.Поле1));
		КонецЕсли;
	КонецЦикла;
	Если НаборЗаписейУчастники.Количество()>0 Тогда
		НаборЗаписейУчастники.Записать(Ложь);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеСделкиОрганизаций.ПредметСделки
	|ПОМЕСТИТЬ СписокПредметов
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПредметов.ПредметСделки,
	|	СписокПредметов.ПредметСделки.ОКП.Код КАК КодПоОКП
	|ИЗ
	|	СписокПредметов КАК СписокПредметов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыКонтролируемыхСделок КАК ПредметыКонтролируемыхСделок
	|		ПО (ПредметыКонтролируемыхСделок.ПредметСделки = СписокПредметов.ПредметСделки)
	|ГДЕ
	|	ПредметыКонтролируемыхСделок.ПредметСделки ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписейПредметы = РегистрыСведений.ПредметыКонтролируемыхСделок.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ПредметСделки) Тогда
			Запись = НаборЗаписейПредметы.Добавить();
			Запись.ПредметСделки = Выборка.ПредметСделки;
			Запись.КодПоОКП = Выборка.КодПоОКП;
		КонецЕсли;
	КонецЦикла;
	Если НаборЗаписейПредметы.Количество()>0 Тогда
		НаборЗаписейПредметы.Записать(Ложь);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеСделкиОрганизаций.Организация КАК Организация,
	|	КонтролируемыеСделкиОрганизаций.Контрагент,
	|	КонтролируемыеСделкиОрганизаций.ДоговорКонтрагента,
	|	КонтролируемыеСделкиОрганизаций.Регистратор.ОтчетныйГод КАК ОтчетныйГод
	|ПОМЕСТИТЬ СписокПредметов
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПредметов.Организация,
	|	СписокПредметов.Контрагент,
	|	СписокПредметов.ДоговорКонтрагента,
	|	СписокПредметов.ОтчетныйГод
	|ИЗ
	|	СписокПредметов КАК СписокПредметов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок КАК ДоговорыУчастниковКонтролируемыхСделок
	|		ПО СписокПредметов.Организация = ДоговорыУчастниковКонтролируемыхСделок.Организация
	|			И СписокПредметов.Контрагент = ДоговорыУчастниковКонтролируемыхСделок.Контрагент
	|			И СписокПредметов.ДоговорКонтрагента = ДоговорыУчастниковКонтролируемыхСделок.ДоговорКонтрагента
	|ГДЕ
	|	ДоговорыУчастниковКонтролируемыхСделок.Организация ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НаборЗаписейДоговоры = РегистрыСведений.ДоговорыУчастниковКонтролируемыхСделок.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписейДоговоры.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
	КонецЦикла;
	
	Если НаборЗаписейДоговоры.Количество()>0 Тогда
		НаборЗаписейДоговоры.Записать(Ложь);
	КонецЕсли;


КонецПроцедуры

Процедура ДобавитьСделкиПолученияУслугПоПереработке(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПолучениеУслугПоПереработке.Организация,
	|	ПолучениеУслугПоПереработке.Дата КАК Период,
	|	ПолучениеУслугПоПереработке.Ссылка КАК РасчетныйДокумент,
	|	ПолучениеУслугПоПереработке.Контрагент,
	|	ПолучениеУслугПоПереработке.Организация КАК Грузополучатель,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ПолучениеУслугПоПереработке.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПолучениеУслугПоПереработке.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ПолучениеУслугПоПереработке.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПолучениеУслугПоПереработке.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПолучениеУслугПоПереработке КАК ПолучениеУслугПоПереработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПолучениеУслугПоПереработке.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПолучениеУслугПоПереработке.Контрагент)
	|			И ПолучениеУслугПоПереработке.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПолучениеУслугПоПереработке.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПолучениеУслугПоПереработке.Контрагент)
	|ГДЕ
	|	ПолучениеУслугПоПереработке.Организация В(&СписокОрганизаций)
	|	И ПолучениеУслугПоПереработке.Дата >= &НачалоПериода
	|	И ПолучениеУслугПоПереработке.Дата <= &ОкончаниеПериода
	|	И ПолучениеУслугПоПереработке.Проведен = ИСТИНА
	|	И ПолучениеУслугПоПереработке.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПолучениеУслугПоПереработке.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Если Метаданные.Документы.ПолучениеУслугПоПереработке.ТабличныеЧасти.Товары.Реквизиты.Найти("Сумма") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ПолучениеУслугПоПереработкеТовары.Ссылка КАК Сделка,
		|	ПолучениеУслугПоПереработкеТовары.Ссылка КАК РасчетныйДокумент,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
		|	ПолучениеУслугПоПереработкеТовары.Номенклатура КАК ПредметСделки,
		|	ПолучениеУслугПоПереработкеТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
		|	ИСТИНА КАК ВключатьСоставСделок,
		|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
		|	ПолучениеУслугПоПереработкеТовары.Количество,
		|	ПолучениеУслугПоПереработкеТовары.Количество КАК КоличествоВУчете,
		|	ПолучениеУслугПоПереработкеТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
		|	ВЫБОР
		|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
		|			ТОГДА ПолучениеУслугПоПереработкеТовары.Сумма - ПолучениеУслугПоПереработкеТовары.СуммаНДС
		|		ИНАЧЕ ПолучениеУслугПоПереработкеТовары.Сумма
		|	КОНЕЦ КАК СуммаБезНДС,
		|	ПолучениеУслугПоПереработкеТовары.СтавкаНДС,
		|	ПолучениеУслугПоПереработкеТовары.СуммаНДС,
		|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
		|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
		|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
		|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
		|ИЗ
		|	Документ.ПолучениеУслугПоПереработке.Товары КАК ПолучениеУслугПоПереработкеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
		|		ПО ПолучениеУслугПоПереработкеТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
		|ГДЕ
		|	ПолучениеУслугПоПереработкеТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
		|			ИЗ
		|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ
	|	ПолучениеУслугПоПереработкеУслуги.Ссылка КАК Сделка,
	|	ПолучениеУслугПоПереработкеУслуги.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПолучениеУслугПоПереработкеУслуги.Номенклатура КАК ПредметСделки,
	|	ПолучениеУслугПоПереработкеУслуги.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	ПолучениеУслугПоПереработкеУслуги.Количество,
	|	ПолучениеУслугПоПереработкеУслуги.Количество КАК КоличествоВУчете,
	|	ПолучениеУслугПоПереработкеУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПолучениеУслугПоПереработкеУслуги.Сумма - ПолучениеУслугПоПереработкеУслуги.СуммаНДС
	|		ИНАЧЕ ПолучениеУслугПоПереработкеУслуги.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПолучениеУслугПоПереработкеУслуги.СтавкаНДС,
	|	ПолучениеУслугПоПереработкеУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПолучениеУслугПоПереработке.Услуги КАК ПолучениеУслугПоПереработкеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПолучениеУслугПоПереработкеУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПолучениеУслугПоПереработкеУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияТоваровУслугВНТТ(Уведомление, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	ПараметрыУведомления = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугВНТТ.Организация КАК Организация,
	|	ПоступлениеТоваровУслугВНТТ.Дата КАК Период,
	|	ПоступлениеТоваровУслугВНТТ.Ссылка КАК РасчетныйДокумент,
	|	ПоступлениеТоваровУслугВНТТ.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровУслугВНТТ.Организация КАК Грузополучатель,
	|	ПоступлениеТоваровУслугВНТТ.Контрагент КАК Грузоотправитель,
	|	ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ПоступлениеТоваровУслугВНТТ.ВалютаДокумента,
	|	ПоступлениеТоваровУслугВНТТ.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПоступлениеТоваровУслугВНТТ КАК ПоступлениеТоваровУслугВНТТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = ПоступлениеТоваровУслугВНТТ.Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПоступлениеТоваровУслугВНТТ.Контрагент)
	|			И ПоступлениеТоваровУслугВНТТ.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПоступлениеТоваровУслугВНТТ.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПоступлениеТоваровУслугВНТТ.Контрагент)
	|ГДЕ
	|	ПоступлениеТоваровУслугВНТТ.Организация В(&СписокОрганизаций)
	|	И ПоступлениеТоваровУслугВНТТ.Дата >= &НачалоПериода
	|	И ПоступлениеТоваровУслугВНТТ.Дата <= &ОкончаниеПериода
	|	И ПоступлениеТоваровУслугВНТТ.Проведен = ИСТИНА
	|	И ПоступлениеТоваровУслугВНТТ.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПоступлениеТоваровУслугВНТТ.ОтражатьВБухгалтерскомУчете = ИСТИНА
	|	И ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатыКонтролируемыхСделок.Сделка КАК Сделка,
	|	СУММА(ОплатыКонтролируемыхСделок.СуммаНДСВРублях) КАК СуммаНДСВРублях,
	|	СУММА(ОплатыКонтролируемыхСделок.ВсегоВРублях) КАК ВсегоВРублях
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыДокумента.Регистратор КАК Сделка,
	|		0 КАК СуммаНДСВРублях,
	|		РасчетыДокумента.СуммаРег КАК ВсегоВРублях
	|	ИЗ
	|		РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации КАК РасчетыДокумента
	|	ГДЕ
	|		РасчетыДокумента.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НДСПредъявленный.Регистратор,
	|		НДСПредъявленный.НДС,
	|		0
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|	ГДЕ
	|		НДСПредъявленный.Регистратор В
	|				(ВЫБРАТЬ
	|					ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|				ИЗ
	|					ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|				ГДЕ
	|					ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета)
	|		И НДСПредъявленный.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ОплатыКонтролируемыхСделок
	|
	|СГРУППИРОВАТЬ ПО
	|	ОплатыКонтролируемыхСделок.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугВНТТТовары.Ссылка КАК Сделка,
	|	ПоступлениеТоваровУслугВНТТТовары.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ПоступлениеТоваровУслугВНТТТовары.Номенклатура КАК ПредметСделки,
	|	ПоступлениеТоваровУслугВНТТТовары.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров) КАК ХозяйственнаяОперация,
	|	ПоступлениеТоваровУслугВНТТТовары.Количество КАК Количество,
	|	ПоступлениеТоваровУслугВНТТТовары.Количество * ПоступлениеТоваровУслугВНТТТовары.Коэффициент / ПоступлениеТоваровУслугВНТТТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоличествоВУчете,
	|	ПоступлениеТоваровУслугВНТТТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугВНТТТовары.Сумма - ПоступлениеТоваровУслугВНТТТовары.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугВНТТТовары.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ПоступлениеТоваровУслугВНТТТовары.СтавкаНДС,
	|	ПоступлениеТоваровУслугВНТТТовары.СуммаНДС,
	|	ЕСТЬNULL(СерииНоменклатуры.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)) КАК СтранаПроисхождения,
	|	ПоступлениеТоваровУслугВНТТТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.ПоступлениеТоваровУслугВНТТ.Товары КАК ПоступлениеТоваровУслугВНТТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугВНТТТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО ПоступлениеТоваровУслугВНТТТовары.СерияНоменклатуры = СерииНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ПоступлениеТоваровУслугВНТТТовары.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ПоступлениеТоваровУслугВНТТТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугВНТТУслуги.Ссылка,
	|	ПоступлениеТоваровУслугВНТТУслуги.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	ПоступлениеТоваровУслугВНТТУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугВНТТУслуги.Содержание,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг),
	|	ПоступлениеТоваровУслугВНТТУслуги.Количество,
	|	ПоступлениеТоваровУслугВНТТУслуги.Количество,
	|	ПоступлениеТоваровУслугВНТТУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугВНТТУслуги.Сумма - ПоступлениеТоваровУслугВНТТУслуги.СуммаНДС
	|		ИНАЧЕ ПоступлениеТоваровУслугВНТТУслуги.Сумма
	|	КОНЕЦ,
	|	ПоступлениеТоваровУслугВНТТУслуги.СтавкаНДС,
	|	ПоступлениеТоваровУслугВНТТУслуги.СуммаНДС,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугВНТТУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПоступлениеТоваровУслугВНТТУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	ПоступлениеТоваровУслугВНТТУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			ИЗ
	|				ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок)";
	
	Результаты = Запрос.ВыполнитьПакет();
	РублевыеСуммыСделок = Результаты[0].Выгрузить();
	СделкиДокумента = Результаты[1].Выгрузить();
	
	СделкиДокумента.Индексы.Добавить("Сделка");
	СделкиДокумента.Индексы.Добавить("РасчетныйДокумент");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.ДоговорКонтрагента,
	|	ДокументыКонтролируемыхСделок.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ВалютаДокумента <> &ВалютаРегламентированногоУчета
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РасчетыВВалюте
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ПО (КонтролируемыеКонтрагенты.Контрагент = ДокументыКонтролируемыхСделок.Контрагент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасчетныйДокумент";
	
	
	КонтролируемыеСделкиВыборка = Запрос.Выполнить().Выбрать();
	
	ЗаполнитьРублевыеСуммыСделок(РублевыеСуммыСделок, СделкиДокумента);
	
	Пока КонтролируемыеСделкиВыборка.Следующий() Цикл
		
		ОбработатьКонтролируемуюСделку(ТаблицаСделок, КонтролируемыеСделкиВыборка, СделкиДокумента, Неопределено);
		
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕРКИ ЗАПОЛНЕНИЯ ДАННЫХ УВЕДОМЛЕНИЯ

Функция ПроверитьЗаполнениеУведомления(Уведомление, УникальныйИдентификатор = Неопределено) Экспорт
	
	ОсновныеСведения = ПолучитьОсновныеСведенияУведомленияДляВыгрузки(Уведомление);
	ОсновныеСведения.Вставить("УведомлениеОКонтролируемыхСделках", Уведомление);
	
	ЛистыУведомления = КонтролируемыеСделки.ПолучитьЛистыУведомления(Уведомление);
	
	ИнформацияОбОшибках = ВыводСообщенийОбОшибках.НовыйДетальнаяИнформацияОбОшибках();
	
	Ошибки = Новый СписокЗначений;
	
	ПроверитьТитульныйЛист(ОсновныеСведения, Ошибки);
	ПроверитьТитульныйЛистФизЛицо(ОсновныеСведения, Ошибки);
	ПроверитьЛисты1А(ЛистыУведомления, Ошибки);
	ПроверитьЛисты1Б(ЛистыУведомления, Ошибки);
	ПроверитьЛистыРаздела2(ЛистыУведомления, Ошибки);
	ПроверитьЛистыРаздела3(ЛистыУведомления, Ошибки);
	
	СформироватьИнформациюОбОшибках(ИнформацияОбОшибках, Ошибки);
	
	ДанныеДляВывода = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Уведомление, "Организация");
	ХранилищеЗначения = ВыводСообщенийОбОшибках.ОписаниеОшибок(ИнформацияОбОшибках, ПолучитьМакет("МакетВыводаОшибок"), ДанныеДляВывода);
	
	Если УникальныйИдентификатор = Неопределено Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(ХранилищеЗначения, Новый УникальныйИдентификатор);
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(ХранилищеЗначения, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Новый Структура("АдресХранилища", АдресХранилища);
	
КонецФункции

Процедура ПроверитьТитульныйЛист(ОсновныеСведения, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	// Код налогового органа
	Если Не ЗначениеЗаполнено(ОсновныеСведения.КодНО) Или СтрДлина(ОсновныеСведения.КодНО) <> 4 Тогда
		ДобавитьОшибку("1010", ОсновныеСведения.Организация, ТекущиеОшибки);		
	КонецЕсли;
	
	// Код по месту учета
	Если Не ЗначениеЗаполнено(ОсновныеСведения.ПоМесту) Тогда
		ДобавитьОшибку("1020", ДанныеВыводаОшибкиУведомление(ОсновныеСведения.УведомлениеОКонтролируемыхСделках),ТекущиеОшибки);
	КонецЕсли;
	
	Если ОсновныеСведения.ОтчетныйГод < Дата(2012,12,31) Тогда
		// Код ОКАТО
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ОКАТО) Или СтрДлина(ОсновныеСведения.ОКАТО) <> 11 Тогда
			ДобавитьОшибку("1030", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
	Иначе
		// Код ОКТМО
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ОКАТО) Тогда
			ДобавитьОшибку("1031", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	// Наименование организации
	Если Не ЗначениеЗаполнено(ОсновныеСведения.НаименованиеОрганизации) Тогда
		ДобавитьОшибку("1050", ОсновныеСведения.Организация, ТекущиеОшибки);
	КонецЕсли;
	
	Если Не ОсновныеСведения.ЭтоПБОЮЛ Тогда
		
		// ИНН, КПП юр. лица
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННЮЛ) Или СтрДлина(ОсновныеСведения.ИННЮЛ) <> 10
			Или Не ЗначениеЗаполнено(ОсновныеСведения.КППЮЛ) Или СтрДлина(ОсновныеСведения.КППЮЛ) <> 9 Тогда
			ДобавитьОшибку("1040", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
		
		// ИНН/КПП реорганизованной организации
		Если ОсновныеСведения.Свойство("ФормРеорг") И ЗначениеЗаполнено(ОсновныеСведения.ФормРеорг) Тогда 
			Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННЮЛРеорг) Или Не ЗначениеЗаполнено(ОсновныеСведения.КППЮЛРеорг) Тогда
				ДобавитьОшибку("1060", ДанныеВыводаОшибкиУведомление(ОсновныеСведения.УведомлениеОКонтролируемыхСделках), ТекущиеОшибки);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	// Код ОКВЭД
	СтрокаПоиска = "/" + ОсновныеСведения.ПоМесту + "/";
	Если Найти("/120/213/214/215/", СтрокаПоиска) > 0 Тогда
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ОКВЭД) Тогда
			ДобавитьОшибку("1070", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	// Титульный лист ФИО подписанта
	ФамилияПодписанта = Неопределено; ИмяПодписанта = Неопределено;
	
	ОсновныеСведения.Свойство("ПодпФамилия", ФамилияПодписанта);
	ОсновныеСведения.Свойство("ПодпИмя", ИмяПодписанта); 
	
	ФИОПодписантаЗаполнено = ЗначениеЗаполнено(ФамилияПодписанта) И ЗначениеЗаполнено(ИмяПодписанта);
	
	Если Не ФИОПодписантаЗаполнено Тогда
		Если ОсновныеСведения.ПрПодп = "1" Тогда // Если представителя нет
			Если Не ОсновныеСведения.ЭтоПБОЮЛ  Тогда
				ДобавитьОшибку("1080", ОсновныеСведения.Организация, ТекущиеОшибки);
			КонецЕсли;
		Иначе // есть представитель
			ДобавитьОшибку("1090", ОсновныеСведения.РегистрацияВИФНС, ТекущиеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	// Наименование документа представителя
	Если ОсновныеСведения.ПрПодп <> "1" И Не ЗначениеЗаполнено(ОсновныеСведения.НаимДокПодп) Тогда
		ДобавитьОшибку("1100", ОсновныеСведения.РегистрацияВИФНС, ТекущиеОшибки);
	КонецЕсли;
	
	Ошибки.Добавить(ТекущиеОшибки, "Титульный лист");
		
КонецПроцедуры

Процедура ПроверитьТитульныйЛистФизЛицо(ОсновныеСведения, Ошибки)
	
	Если Не ОсновныеСведения.ЭтоПБОЮЛ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	// Фамилия, Имя
	Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛФамилия) Или Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛИмя) Тогда
		ДобавитьОшибку("2010", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
	КонецЕсли;
	
	// ИНН физ. лица
	СтрокаПоиска = "/" + ОсновныеСведения.ПоМесту + "/";
	Если Найти("/120/125/126/", СтрокаПоиска) > 0 Тогда
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННФЛ) Или СтрДлина(ОсновныеСведения.ИННФЛ) <> 12 Тогда
			ДобавитьОшибку("2020", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННФЛ) Тогда
		
		// Дата рождения
		Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛДатаРожд) Тогда
			ДобавитьОшибку("2030", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		// Место рождения
		Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛМестоРожд) Тогда
			ДобавитьОшибку("2040", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		// Сведения о гражданстве
		ОшибкаЗаполнения = Не (ОсновныеСведения.НПФЛНалГражд = "1" Или (ОсновныеСведения.НПФЛНалГражд = "2" И ЗначениеЗаполнено(ОсновныеСведения.НПФЛОКСМ)));
		Если ОшибкаЗаполнения Тогда
			ДобавитьОшибку("2050", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		Если ОсновныеСведения.НПФЛНалГражд = "1" Тогда
			
			// Адрес места жительства/прибывания
			АдресЗаполнен = ОсновныеСведения.Свойство("НПФЛКодРегион") И ЗначениеЗаполнено(ОсновныеСведения.НПФЛКодРегион);
			Если Не АдресЗаполнен Тогда
				ДобавитьОшибку("2060", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
			КонецЕсли;
			
		Иначе
			
			// Адрес за пределами РФ
			АдресЗаполнен = ОсновныеСведения.Свойство("АдрИнКодСтраны") И ЗначениеЗаполнено(ОсновныеСведения.АдрИнКодСтраны)
				И ЗначениеЗаполнено(ОсновныеСведения.АдрИнТекст);
				
			Если Не АдресЗаполнен Тогда
				ДобавитьОшибку("2070", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		// Статус налогоплательщика
		Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛСтатусНП) Тогда
			ДобавитьОшибку("2080", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		// Документ удостоверяющий личность
		// Код вида документа, серия, номер, дата выдачи, кем выдан
		ДанныеДокументаЗаполнены = ОсновныеСведения.Свойство("НПФЛКодВидДок") И ЗначениеЗаполнено(ОсновныеСведения.НПФЛКодВидДок) 
			И ЗначениеЗаполнено(ОсновныеСведения.НПФЛСерНомДок)	И ЗначениеЗаполнено(ОсновныеСведения.НПФЛДатаДок) 
			И ЗначениеЗаполнено(ОсновныеСведения.НПФЛВыдДок);
		
		Если Не ДанныеДокументаЗаполнены Тогда
			ДобавитьОшибку("2090", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
			
	КонецЕсли;
	
	Ошибки.Добавить(ТекущиеОшибки, "Титульный лист (сведения о физ. лице)");
		
КонецПроцедуры

Процедура ПроверитьЛисты1А(ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ЛистыРаздела1А Цикл
		
		// Код наименования сделки
		Если Не ЗначениеЗаполнено(Лист.Строка210КодНаименованияСделки) Тогда
			ДобавитьОшибку("3010", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Код стороны сделки
		Если Не ЗначениеЗаполнено(Лист.Строка211КодСтороныСделки) Тогда
			ДобавитьОшибку("3020", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Соответствие кодов
		Если ЗначениеЗаполнено(Лист.Строка210КодНаименованияСделки) И ЗначениеЗаполнено(Лист.Строка211КодСтороныСделки) Тогда
			
			СоответствиеКодов = КонтролируемыеСделкиПовтИсп.ПолучитьСоответствиеКодовСтороныСделки();
			
			КодыСторонСделки = СоответствиеКодов.Получить(Лист.Строка210КодНаименованияСделки);
			
			Если КодыСторонСделки = Неопределено Тогда
				ДобавитьОшибку("3030", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);	
			ИначеЕсли КодыСторонСделки.НайтиПоЗначению(Лист.Строка211КодСтороныСделки) = Неопределено Тогда
				ДобавитьОшибку("3040", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		// Комментарий по признаку определения цены сделки
		Если Лист.Строка220ПризнакОпределенияЦеныСделки = "1"
			И Не ЗначениеЗаполнено(Лист.Строка220_1Комментарий) Тогда
			ДобавитьОшибку("3050", Лист.СпособОпределенияЦеныСделки, ТекущиеОшибки);
		КонецЕсли;
		
		// наличие листов раздела 1Б
		Если Лист.Количество1Б = 0 Тогда
			ДобавитьОшибку("3060", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;

		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, "Лист 1А");
	
КонецПроцедуры

Процедура ПроверитьЛисты1Б(ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ЛистыРаздела1Б Цикл
		
		Если ЗначениеЗаполнено(Лист.Строка020ТипПредмета) Тогда
			
			Если Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
				
				// Код ОКВЭД
				Если ЗначениеЗаполнено(Лист.Строка045КодОКВЭД) Тогда
					ДобавитьОшибку("4030", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
				КонецЕсли;
				
			ИначеЕсли Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.РаботаУслуга
				Или Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав Тогда
				
				// Код ТНВЭД
				Если ЗначениеЗаполнено(Лист.Строка040КодПоТНВЭД) Тогда
					ДобавитьОшибку("4040", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
				КонецЕсли;
				
				// Код ОКП
				Если ЗначениеЗаполнено(Лист.Строка043КодПоОКП) Тогда
					ДобавитьОшибку("4050", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			// Тип предмета сделки
			ДобавитьОшибку("4010", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Наименование предмета сделки
		Если Не ЗначениеЗаполнено(Лист.Строка030НаименованиеПредмета) Тогда
			ДобавитьОшибку("4020", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Лист.ДоговорКонтрагента) Тогда
			// Договор контрагента
			ДобавитьОшибку("4060", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
			
		ИначеЕсли Не ЗначениеЗаполнено(Лист.Строка060НомерДоговора) Или Не ЗначениеЗаполнено(Лист.Строка065ДатаДоговора) Тогда
			// Номер, дата договора
			ДобавитьОшибку("4070", Лист.ДоговорКонтрагента, ТекущиеОшибки);
			
		КонецЕсли;
		
		Если Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
			
			// Код страны происхождения
			Если Не ЗначениеЗаполнено(Лист.Строка070КодСтраныПроисхождения) Тогда
				ДобавитьОшибку("4080", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
			КонецЕсли;
			
		ИначеЕсли Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.РаботаУслуга
			Или Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав Тогда
			
			// Код условий поставки
			Если ЗначениеЗаполнено(Лист.Строка100КодУсловийПоставки) Тогда
				ДобавитьОшибку("4100", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		// Код региона совершения сделки
		Если Лист.Строка090КодСтраныСовершенияСделки = "643" 
			И НЕ ЗначениеЗаполнено(Лист.Строка090КодРегионаСовершенияСделки) Тогда
			ДобавитьОшибку("4090", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Код единицы измерения
		Если Не ЗначениеЗаполнено(Лист.Строка110КодЕдиницыИзмерения) Тогда
			ДобавитьОшибку("4110", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		Если СтрДлина(СокрЛП((Лист.Строка110КодЕдиницыИзмерения)))>3 Тогда
			ДобавитьОшибку("4111", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Количество
		Если Лист.Строка120Количество < 1 Тогда
			ДобавитьОшибку("4120", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, "Лист 1Б");
	
КонецПроцедуры

Процедура ПроверитьЛистыРаздела2(ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ДанныеРаздела2 Цикл
		
		// Наименование контрагента
		Если Не ЗначениеЗаполнено(Лист.Строка040Наименование) Тогда
			ДобавитьОшибку("5010", Лист.Контрагент, ТекущиеОшибки);
		КонецЕсли;

		Если ЗначениеЗаполнено(Лист.Строка030КакКодСтраныРегистрации) Тогда 
			
			Если Лист.Строка020ТипОрганизации = 1 Тогда
				
				// ИНН/КПП
				Если Не ЗначениеЗаполнено(Лист.Строка050ИНН) Или СтрДлина(Лист.Строка050ИНН) <> 10
					Или Не ЗначениеЗаполнено(Лист.Строка060КПП) Или СтрДлина(Лист.Строка060КПП) <> 9 Тогда
					ДобавитьОшибку("5030", Лист.Контрагент, ТекущиеОшибки);
				КонецЕсли;
				
			Иначе
				
				// Должен быть заполнен один из:
				//   Регистрационный номер в стране регистрации (инкорпорации)
				// 	 Код налогоплательщика в стране регистрации (инкорпорациии)
				
				ОшибкаЗаполнения = Не (ЗначениеЗаполнено(Лист.Строка070РегНомерВСтрокеРегистрации) И ЗначениеЗаполнено(Лист.Строка080КодНалогВСтранеРегистрации));
				Если ОшибкаЗаполнения Тогда
					ДобавитьОшибку("5040", ДанныеВыводаОшибкиСведенияОРегистрации(Лист.Контрагент), ТекущиеОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			// Страна регистрации
			ДобавитьОшибку("5020", ДанныеВыводаОшибкиСведенияОРегистрации(Лист.Контрагент), ТекущиеОшибки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, "Раздел 2");
	
КонецПроцедуры

Процедура ПроверитьЛистыРаздела3(ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ДанныеРаздела3 Цикл
		
		//
		Если Не ЗначениеЗаполнено(Лист.ФизическоеЛицо) Тогда
			ДобавитьОшибку("6010", ДанныеВыводаОшибкиСведенияОРегистрации(Лист.Контрагент), ТекущиеОшибки);
		КонецЕсли;
		
		// Код вида деятельности
		Если Не ЗначениеЗаполнено(Лист.Строка020КодВидаДеятельности) Тогда
			ДобавитьОшибку("6030", ДанныеВыводаОшибкиСведенияОРегистрации(Лист.Контрагент), ТекущиеОшибки);
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(Лист.ФизическоеЛицо) Тогда
			Продолжить;
		КонецЕсли;
		
		// Фамилия, имя физ. лица
		Если Не ЗначениеЗаполнено(Лист.Фамилия) Или Не ЗначениеЗаполнено(Лист.Имя) Тогда
			ДобавитьОшибку("6020", Лист.ФизическоеЛицо, ТекущиеОшибки);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Лист.Строка030ИНН) Тогда
			
			// Дата рождения
			Если Не ЗначениеЗаполнено(Лист.ДатаРождения) Тогда
				ДобавитьОшибку("6050", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
			
			// Место рождения
			МестоРождения = Лист.ФизическоеЛицо.МестоРождения;
			Если Не ЗначениеЗаполнено(МестоРождения) Тогда
				ДобавитьОшибку("6060", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
			
			// Сведения о гражданстве
			Если Не ЗначениеЗаполнено(Лист.ГражданствоФизЛицСтрана)
				И ЗначениеЗаполнено(Лист.ГражданствоФизЛицСтрана) Тогда
				ДобавитьОшибку("6070", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
			
			Если Лист.ГражданствоФизЛицСтрана = Справочники.КлассификаторСтранМира.Россия ИЛИ Не ЗначениеЗаполнено(Лист.ГражданствоФизЛицСтрана) Тогда
				
				// ИНН физ. лица.
				ДобавитьОшибку("6040", Лист.Контрагент, ТекущиеОшибки);
				
				АдресЗаполнен = ЗначениеЗаполнено(РегламентированнаяОтчетность.КодРегионаПоНазванию(Лист.КонтактнаяИнформацияПоле2));
				Если Не АдресЗаполнен Тогда
					ДобавитьОшибку("6080", Лист.ФизическоеЛицо, ТекущиеОшибки);	
				КонецЕсли;
				
			Иначе
				
				// Адрес за пределами РФ
				НаименованиеСтраны = Лист.КонтактнаяИнформацияЗаРФПоле1;
				НайденнаяСтрана = Неопределено;
				Если ЗначениеЗаполнено(НаименованиеСтраны) Тогда
					НайденнаяСтрана = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(НаименованиеСтраны);
				КонецЕсли;
				
				АдресЗаполнен = НайденнаяСтрана <> Неопределено И ЗначениеЗаполнено(Лист.КонтактнаяИнформацияЗаРФПредставление); 
				Если Не АдресЗаполнен Тогда
					ДобавитьОшибку("6090", Лист.ФизическоеЛицо, ТекущиеОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
			// Документ удостоверяющий личность
			// Код вида документа, серия, номер, дата выдачи, кем выдан
			КодВидаДокумента = КонтролируемыеСделкиПовтИсп.ПолучитьКодВидаДокументаПоВидуДокумента(Лист.ДокументВид);
			
			ДанныеДокументаЗаполнены = ЗначениеЗаполнено(КодВидаДокумента) И ЗначениеЗаполнено(Лист.ДокументСерия) И ЗначениеЗаполнено(Лист.ДокументНомер)
				И ЗначениеЗаполнено(Лист.ДокументДатаВыдачи) И ЗначениеЗаполнено(Лист.ДокументКемВыдан);
				
			Если Не ДанныеДокументаЗаполнены Тогда
				ДобавитьОшибку("6100", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, "Раздел 3");
	
КонецПроцедуры

Процедура СформироватьИнформациюОбОшибках(ИнформацияОбОшибках, Ошибки)
	
	ПредставлениеОшибок = ПолучитьОписаниеОшибок();
	
	Для Каждого Ошибка Из Ошибки Цикл
		
		РазделОтчета  = Ошибка.Представление;
		ТаблицаОшибок = Ошибка.Значение;
		
		ОписаниеОшибки = ВыводСообщенийОбОшибках.ДобавитьОписаниеОшибки(ИнформацияОбОшибках);
		
		СекцияРазделОтчета = ВыводСообщенийОбОшибках.ДобавитьСекцию(ОписаниеОшибки, "Раздел", РазделОтчета);
		
		Если ТаблицаОшибок.Количество() > 0 Тогда
			
			ТаблицаОшибок.Сортировать("Код");
			
			Для Каждого ДанныеОшибки Из ТаблицаОшибок Цикл
				
				ОписаниеОшибки = ПредставлениеОшибок.Найти(ДанныеОшибки.Код, "Код");
				
				Если ОписаниеОшибки = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СекцияОшибка = ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияРазделОтчета, "Раздел", ОписаниеОшибки.Текст);
				
				Если ЗначениеЗаполнено(ОписаниеОшибки.Описание) Тогда
					ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "Текст", ОписаниеОшибки.Описание);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОписаниеОшибки.Рекомендации) Тогда
					ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "Текст", ОписаниеОшибки.Рекомендации);
				КонецЕсли;
				
				Для Каждого ЭлементКоллекции Из ДанныеОшибки.Объекты Цикл
					Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Структура") Тогда
						ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "СсылкаПроизвольная", ЭлементКоллекции.Значение);
					Иначе
						ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "Ссылка", ЭлементКоллекции.Значение);
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияРазделОтчета, "Текст", "Ошибок не обнаружено.");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОшибку(КодОшибки, Объект, ТаблицаОшибок)
	
	ДанныеОшибки = ТаблицаОшибок.Найти(КодОшибки, "Код");
	
	Если ДанныеОшибки = Неопределено Тогда
		ДанныеОшибки = ТаблицаОшибок.Добавить();
		ДанныеОшибки.Код 	 = КодОшибки;
		ДанныеОшибки.Объекты = Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		ДанныеОшибки.Объекты.Вставить(Объект.Ключ, Объект);	
	Иначе
		ДанныеОшибки.Объекты.Вставить(Объект, Объект);	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОписаниеОшибок()
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("Код", ОписаниеТиповСтрока);
	Таблица.Колонки.Добавить("Текст", ОписаниеТиповСтрока);
	Таблица.Колонки.Добавить("Описание", ОписаниеТиповСтрока);
	Таблица.Колонки.Добавить("Рекомендации", ОписаниеТиповСтрока);
	
	Макет = ПолучитьМакет("ОписаниеОшибок");
	ОписаниеОшибок = Макет.ПолучитьОбласть("ОписаниеОшибок");
	
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		Код = ОписаниеОшибок.Область(НомерСтроки, 1).Текст;
		
		Если Не ЗначениеЗаполнено(Код) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Код = Код;
		НоваяСтрока.Текст = ОписаниеОшибок.Область(НомерСтроки, 2).Текст;
		НоваяСтрока.Описание = ОписаниеОшибок.Область(НомерСтроки, 3).Текст;
		НоваяСтрока.Рекомендации = ОписаниеОшибок.Область(НомерСтроки, 4).Текст;
		
	КонецЦикла;
	
	Таблица.Индексы.Добавить("Код");
	
	Возврат Таблица;
	
КонецФункции

Функция ОписаниеТаблицыОшибок()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Код");
	Таблица.Колонки.Добавить("Объекты");
	
	Возврат Таблица;
	
КонецФункции

Функция ДанныеВыводаОшибкиСведенияОРегистрации(Контрагент)
	
	Расшифровка = ВыводСообщенийОбОшибках.НовыйОписаниеРасшифровки("ФормаЗаписиУчастникиКонтролируемыхСделок");
	Расшифровка.Вставить("Контрагент", Контрагент);
	
	ДанныеВывода = Новый Структура;
	ДанныеВывода.Вставить("Ключ",   Контрагент);
	ДанныеВывода.Вставить("Ссылка", Расшифровка);
	ДанныеВывода.Вставить("Представление", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сведения о регистрации %1'"),
		Контрагент));
	
	Возврат ДанныеВывода;

КонецФункции

Функция ДанныеВыводаОшибкиСведенияОПредметеСделки(ДанныеЛиста)
	
	КлючОбъекта = ПолучитьНавигационнуюСсылку(ДанныеЛиста.Сделка, "Сделки.НомерСтроки", ДанныеЛиста.НомерСтроки - 1);
	
	Расшифровка = ВыводСообщенийОбОшибках.НовыйОписаниеРасшифровки("ФормаДокументаСтрокаТабличнойЧасти");
	Расшифровка.Вставить("Объект", "Документ.КонтролируемаяСделка");
	Расшифровка.Вставить("Документ", ДанныеЛиста.Сделка);
	Расшифровка.Вставить("ИмяТабличнойЧасти", "Сделки");
	Расшифровка.Вставить("НомерСтроки", ДанныеЛиста.НомерСтроки);
	
	ДанныеВывода = Новый Структура;
	
	ДанныеВывода.Вставить("Ключ", 	КлючОбъекта);
	ДанныеВывода.Вставить("Ссылка", Расшифровка);
	ДанныеВывода.Вставить("Представление", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Лист 1А № %1, листы 1Б, строка %2'"),
		ДанныеЛиста.НомерЛиста1А,
		ДанныеЛиста.НомерСтроки));
	
	Возврат ДанныеВывода;

КонецФункции

Функция ДанныеВыводаОшибкиСделка(ДанныеЛиста)
	
	Расшифровка = ВыводСообщенийОбОшибках.НовыйОписаниеРасшифровки("Ссылка");
	Расшифровка.Вставить("Ссылка", ДанныеЛиста.Сделка);
	
	ДанныеВывода = Новый Структура;
	ДанныеВывода.Вставить("Ключ",   ДанныеЛиста.Сделка);
	ДанныеВывода.Вставить("Ссылка", Расшифровка);
	ДанныеВывода.Вставить("Представление", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Лист 1А № %1'"),
		ДанныеЛиста.НомерЛиста1А));
	
	Возврат ДанныеВывода
	
КонецФункции

Функция ДанныеВыводаОшибкиУведомление(Уведомление)
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "Дата, НомерКорректировки");
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Уведомление о контролируемых сделках за %1 г.'"),
		Формат(Данные.Дата, "ДФ=yyyy"));
	
	Если Данные.НомерКорректировки > 0 Тогда
		
		Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = ', корректировка %1'"),
		Формат(Данные.НомерКорректировки, "ЧГ="));
		
	КонецЕсли;

	Расшифровка = ВыводСообщенийОбОшибках.НовыйОписаниеРасшифровки("Ссылка");
	Расшифровка.Вставить("Ссылка", Уведомление);
	
	ДанныеВывода = Новый Структура;
	ДанныеВывода.Вставить("Ключ",   Уведомление);
	ДанныеВывода.Вставить("Ссылка", Расшифровка);
	ДанныеВывода.Вставить("Представление", Представление);
	
	Возврат ДанныеВывода
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОБНОВЛЕНИЯ

Процедура УстановитьВерсиюУведомленияОКонтролируемыхСделках() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УведомлениеОКонтролируемыхСделках.Ссылка КАК Уведомление,
	|	УведомлениеОКонтролируемыхСделках.ОтчетныйГод
	|ИЗ
	|	Документ.УведомлениеОКонтролируемыхСделках КАК УведомлениеОКонтролируемыхСделках
	|ГДЕ
	|	УведомлениеОКонтролируемыхСделках.ВерсияУведомления = 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектУведомление = Выборка.Уведомление.ПолучитьОбъект();
		ОбъектУведомление.ВерсияУведомления = Документы.УведомлениеОКонтролируемыхСделках.ВерсияУведомленияПоОтчетномуГоду(Выборка.ОтчетныйГод);
		ОбъектУведомление.Записать();
	КонецЦикла;
	
КонецПроцедуры