Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения(ОтражатьВНалоговомУчетеУСН=Ложь) Экспорт

	мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");

	Если ОтражатьВНалоговомУчетеУСН Тогда
		Для Каждого ТекущаяСтрока Из мТаблицаДвижений Цикл
			ТекущаяСтрока.СчетУчетаНУ = ТекущаяСтрока.СчетУчетаБУ;
			ТекущаяСтрока.КорСчетНУ = ТекущаяСтрока.КорСчетБУ;
		КонецЦикла;
	КонецЕсли;	
	
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);

КонецПроцедуры // ВыполнитьДвижения()
