//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УточнитьСтратегиюОтраженияВУчете() Экспорт

	СтратегияОтраженияВУчете = ?(СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.РаспределятьПоБазовымНачислениям,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления,?(СпособОтраженияВБухучете.Пустая(), Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоВидуРасчета));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидПремии = Перечисления.ВидыПремии.НеПремия И ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = Перечисления.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоТрудовомуЗаконодательству Тогда
		ЧислоМесяцев = 0
	КонецЕсли;
	
	УточнитьСтратегиюОтраженияВУчете();
	
	Если НЕ ЗначениеЗаполнено(ПериодичностьНачисления) Тогда
		ПериодичностьНачисления = Перечисления.ПериодичностьНачисления.НеОпределена;
	КонецЕсли;
		
	ДополнительныеНачисленияОрганизацийПереопределяемый.ПередЗаписьюДополнительно(ЭтотОбъект);

	Если ЕжегодныйОтпускДляРезервов и ВидПособияСоциальногоСтрахования <> Перечисления.ВидыПособийСоциальногоСтрахования.ПустаяСсылка() Тогда
		ЕжегодныйОтпускДляРезервов = Ложь;
	КонецЕсли;
	
КонецПроцедуры
