// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

Перем мВыбраннаяФорма Экспорт;

Перем мСкопированаФорма Экспорт;

Перем мВерсияФормы Экспорт;

Перем мСохраненныйДок Экспорт;

Перем мСчетчикСтраниц Экспорт;
Перем мАвтоВыборКодов Экспорт;

Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;
Перем мПериодичность Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Перем мЗаписьЗапрещена Экспорт;

Перем мИнтервалАвтосохранения Экспорт;

Перем мРезультатПоиска Экспорт;// таблица с результатами поиска
Перем мСчетчикиСтраницПриПоиске Экспорт;// таблица со счетчиками номеров листов при поиске
Перем мТаблицаФормОтчета Экспорт;
Перем мЗаписываетсяНовыйДокумент Экспорт;
Перем мВариант Экспорт;

Перем мФормыИФорматы Экспорт;
Перем мВерсияОтчета Экспорт;

Перем мПечатьБезШтрихкодаРазрешена Экспорт;
Перем мПроверятьСоотношенияПриПечатиИВыгрузки Экспорт; // Флаг для запуска КС

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция НоваяСтруктураРезультатаКС() Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", 0);
	СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", 0);
	СтруктураРезультата.Вставить("СтруктураОшибок", Неопределено);
	
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура ЗарегистрироватьФормулуДляРасшифровки(ОбработкаКС, ОписаниеКС) Экспорт
	
	ОбработкаКС.мСчетчикФормулДляРасшифровок = ОбработкаКС.мСчетчикФормулДляРасшифровок + 1;
	ОбработкаКС.ЗарегистрироватьФормулуДляРасшифровки(ОписаниеКС);
	
КонецПроцедуры

Процедура ЗарегистрироватьПоказательДляРасшифровки(ОбработкаКС, СсылкаНаДокумент, Показатель, Раздел, НомерСтраницы = "") Экспорт
	
	Если Показатель.Свойство("НомерСтроки") Тогда
		ИмяПоказателя = ПодставитьПараметрыВСтроку(Показатель.Имя, Показатель.НомерСтроки);
	Иначе
		ИмяПоказателя = Показатель.Имя;
	КонецЕсли;
	
	ОбработкаКС.ЗарегистрироватьПоказательДляРасшифровки(
		ИмяПоказателя,
		ПодставитьПараметрыВСтроку(Показатель.Представление, ?(ЗначениеЗаполнено(НомерСтраницы), " листа №" + НомерСтраницы, "")),
		Показатель.ЗначениеСтр,
		"",
		СсылкаНаДокумент,
		Раздел,
		Неопределено,
		НомерСтраницы);
	
КонецПроцедуры

Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	
	Возврат СтрокаПодстановки;
	
КонецФункции

Функция СтрокаЧГ0(ИсходноеЧисло) Экспорт // враппер
	
	Возврат РегламентированнаяОтчетность.СтрокаЧГ0(ИсходноеЧисло);
	
КонецФункции

Процедура Инкр(ИнкрементируемоеЗначение) Экспорт
	
	ИнкрементируемоеЗначение = ИнкрементируемоеЗначение + 1;
	
КонецПроцедуры

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

мФормыИФорматы = РегламентированнаяОтчетность.НовоеДеревоФормИФорматов();

ФормаОтчета2006Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2006-04-13', "65н", "ФормаОтчета2006Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2006Кв1, "3.00003");

ФормаОтчета2007Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2006-12-19', "180н", "ФормаОтчета2007Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2007Кв1, "4.01");

ФормаОтчета2012Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2012-02-20', "ММВ-7-11/99@", "ФормаОтчета2012Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2012Кв1, "5.01");

ФормаОтчета2012Кв4 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2012-02-20', "ММВ-7-11/99@", "ФормаОтчета2012Кв4");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2012Кв4, "5.01");

ФормаОтчета2013Кв4 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2013-11-14', "ММВ-7-3/501@", "ФормаОтчета2013Кв4");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2013Кв4, "5.02");

ФормаОтчета2014Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2014-04-25', "ММВ-7-11/254@", "ФормаОтчета2014Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2014Кв1, "5.03");

ФормаОтчета2016Кв1 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2016-12-05', "ММВ-7-21/668@", "ФормаОтчета2016Кв1");
ОпределитьФорматВДеревеФормИФорматов(ФормаОтчета2016Кв1, "5.04");

Форма20190101 = ОпределитьФормуВДеревеФормИФорматов(мФормыИФорматы, "1152004", '2018-11-26', "ММВ-7-21/664@", "ФормаОтчета2019Кв1");
ОпределитьФорматВДеревеФормИФорматов(Форма20190101, "5.05");

мСтруктураВариантыЗаполнения = Новый Структура;
мТаблицаСоставПоказателей = РегламентированнаяОтчетность.СозданиеТаблицыСоставаПоказателей();
мТаблицаФормОтчета = РегламентированнаяОтчетность.СозданиеТаблицыФормОтчета();

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2006Кв1";
НоваяФорма.ОписаниеОтчета     = "Приказ Минфина РФ от 13.04.2006  № 65н";
НоваяФорма.ДатаНачалоДействия = '2006-01-01';
НоваяФорма.ДатаКонецДействия  = '2006-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2007Кв1";
НоваяФорма.ОписаниеОтчета     = "Приказ Минфина РФ от 13.04.2006  № 65н (в редакции приказа Минфина РФ от 19.12.2006 № 180н)";
НоваяФорма.ДатаНачалоДействия = '2007-01-01';
НоваяФорма.ДатаКонецДействия  = '2011-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 20.02.2012 № ММВ-7-11/99@";
НоваяФорма.ДатаНачалоДействия = '2012-01-01';
НоваяФорма.ДатаКонецДействия  = '2012-01-01';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 20.02.2012 № ММВ-7-11/99@";
НоваяФорма.ДатаНачалоДействия = '2012-01-01';
НоваяФорма.ДатаКонецДействия  = '2012-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв4";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 20.02.2012 № ММВ-7-11/99@ (в ред. приказа ФНС России от 14 ноября 2013 г. № ММВ-7-3/501@)";
НоваяФорма.ДатаНачалоДействия = '2013-01-01';
НоваяФорма.ДатаКонецДействия  = '2013-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 20.02.2012 № ММВ-7-11/99@ (в ред. приказа ФНС России от 25.04.2014 № ММВ-7-11/254@)";
НоваяФорма.ДатаНачалоДействия = '2014-01-01';
НоваяФорма.ДатаКонецДействия  = '2016-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение №1 к приказу ФНС России от 05.12.2016 № ММВ-7-21/668@";
НоваяФорма.ДатаНачалоДействия = '2016-01-01';
НоваяФорма.ДатаКонецДействия  = '2018-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2019Кв1";
НоваяФорма.ОписаниеОтчета     = "Приложение № 1 к приказу ФНС России от 05.12.2016 № ММВ-7-21/668@ (в ред. приказа ФНС России от 26.11.2018 № ММВ-7-21/664@).";
НоваяФорма.ДатаНачалоДействия = '2019-01-01';
НоваяФорма.ДатаКонецДействия  = '2019-12-31';
