
// Обработчик события ПередЗаписью набора записей регистра сведений
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Запись.ВидНадбавки.ТребуетВводаТарифногоРазряда Тогда			
			ОбщегоНазначенияЗК.СообщитьОбОшибке("Нельзя выбирать вид надбавки требующий ввода тарифного разряда!", Отказ, ОбщегоНазначенияЗК.ПреобразоватьСтрокуИнтерфейса("Запись набора записей регистра сведений ""Надбавки по штатному расписанию организаций: ") );			
		КонецЕсли;
	КонецЦикла;
	
	НадбавкиПоШтатномуРасписаниюОрганизацийПереопределяемый.ВыполнитьДействияПередЗаписью(Замещение, Отказ, Количество(), ЭтотОбъект.Отбор);
	
КонецПроцедуры

// Обработчик события ПриЗаписи набора записей регистра сведений
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	НадбавкиПоШтатномуРасписаниюОрганизацийПереопределяемый.ВыполнитьДействияПриЗаписи(ОбменДанными, ЭтотОбъект.Отбор);
	
КонецПроцедуры